
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklós Koren
               Central European University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/create/analysis_sample.do 

. clear all

. 
. * find root folder
. here
/Users/koren/Tresorit/Mac2Mac/projects/expat/

. local here = r(here)

. 
. cap log close

. log using "`here'/output/analysis_sample", text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/analysis_samp
> le.log
  log type:  text
 opened on:  24 Jan 2024, 17:21:11

. 
. use "`here'/temp/balance-small-clean.dta"

. drop foreign

. 
. *Check holes in the time series
. sort frame_id_numeric year

. gen x_before = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1
> ]
(39,130 missing values generated)

. gen hole10_before = (x_before > 10 & x_before != .)

. gen hole2_before = (x_before > 2 & x_before != .)

. gen hole1_before = (x_before > 1 & x_before != .)

. 
. foreach var of varlist hole* {
  2.         tab `var'
  3. }

hole10_befo |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    392,554       99.99       99.99
          1 |         32        0.01      100.00
------------+-----------------------------------
      Total |    392,586      100.00

hole2_befor |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    391,459       99.71       99.71
          1 |      1,127        0.29      100.00
------------+-----------------------------------
      Total |    392,586      100.00

hole1_befor |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    388,936       99.07       99.07
          1 |      3,650        0.93      100.00
------------+-----------------------------------
      Total |    392,586      100.00

. 
. drop x_before hole*

. 
. *Merge with 
. merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(match) noge
> n

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           342,420  
    -----------------------------------------

. 
. sort frame_id_numeric year

. gen x_after = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(35,590 missing values generated)

. gen hole10_after_m = (x_after > 10 & x_after != .)

. gen hole2_after_m = (x_after > 2 & x_after != .)

. gen hole1_after_m = (x_after > 1 & x_after != .)

. 
. foreach var of varlist hole* {
  2.         tab `var'
  3. }

hole10_afte |
        r_m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    342,393       99.99       99.99
          1 |         27        0.01      100.00
------------+-----------------------------------
      Total |    342,420      100.00

hole2_after |
         _m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    341,462       99.72       99.72
          1 |        958        0.28      100.00
------------+-----------------------------------
      Total |    342,420      100.00

hole1_after |
         _m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    339,396       99.12       99.12
          1 |      3,024        0.88      100.00
------------+-----------------------------------
      Total |    342,420      100.00

. 
. drop x_after hole*

. 
. preserve

. use "`here'/temp/balance-small-clean.dta", clear

.         drop foreign

.         merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(1 3
> )

    Result                      Number of obs
    -----------------------------------------
    Not matched                        50,166
        from master                    50,166  (_merge==1)
        from using                          0  (_merge==2)

    Matched                           342,420  (_merge==3)
    -----------------------------------------

.         sort frame_id_numeric year

.         gen x_after = year - year[_n-1] if frame_id_numeric == frame_id_numer
> ic[_n-1]
(39,130 missing values generated)

.         gen hole10_after_mm = (x_after > 10 & x_after != .)

.         gen hole2_after_mm = (x_after > 2 & x_after != .)

.         gen hole1_after_mm = (x_after > 1 & x_after != .)

. 
.         foreach var of varlist hole* {
  2.                 tab `var'
  3.         }

hole10_afte |
       r_mm |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    392,554       99.99       99.99
          1 |         32        0.01      100.00
------------+-----------------------------------
      Total |    392,586      100.00

hole2_after |
        _mm |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    391,459       99.71       99.71
          1 |      1,127        0.29      100.00
------------+-----------------------------------
      Total |    392,586      100.00

hole1_after |
        _mm |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    388,936       99.07       99.07
          1 |      3,650        0.93      100.00
------------+-----------------------------------
      Total |    392,586      100.00

.         drop x_after hole*

. restore

. 
. preserve

.         use "`here'/temp/balance-small-clean.dta", clear

.         merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(2 3
> )

    Result                      Number of obs
    -----------------------------------------
    Not matched                         1,643
        from master                         0  (_merge==1)
        from using                      1,643  (_merge==2)

    Matched                           342,420  (_merge==3)
    -----------------------------------------

.         sort frame_id_numeric year

.         gen x_after = year - year[_n-1] if frame_id_numeric == frame_id_numer
> ic[_n-1]
(35,590 missing values generated)

.         gen hole10_after_um = (x_after > 10 & x_after != .)

.         gen hole2_after_um = (x_after > 2 & x_after != .)

.         gen hole1_after_um = (x_after > 1 & x_after != .)

. 
.         foreach var of varlist hole* {
  2.                 tab `var'
  3.         }

hole10_afte |
       r_um |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    344,036       99.99       99.99
          1 |         27        0.01      100.00
------------+-----------------------------------
      Total |    344,063      100.00

hole2_after |
        _um |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    343,105       99.72       99.72
          1 |        958        0.28      100.00
------------+-----------------------------------
      Total |    344,063      100.00

hole1_after |
        _um |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    342,682       99.60       99.60
          1 |      1,381        0.40      100.00
------------+-----------------------------------
      Total |    344,063      100.00

.         drop x_after hole*

. restore

. 
. rename foreign_ceo foreign

. rename ever_foreign_ceo ever_foreign

. 
. 
. * many foreign changes deleted
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric (year): egen owner_spell_total = total(foreign != foreig
> n[_n-1])

. 
. drop if owner_spell_total > 3 
(3,810 observations deleted)

. scalar dropped_too_many_foreign_change = r(N_drop)

. display dropped_too_many_foreign_change
3810

. 
. * divestment
. bys frame_id_numeric (year): gen divest = sum(cond(owner_spell != owner_spell
> [_n-1] & foreign == 0 & _n != 1, 1, 0))

. replace divest = 1 if divest > 0
(0 real changes made)

. 
. * only D, D-F F owner spells
. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (fore
> ign == 0))

. *keep if start_as_domestic
. keep if owner_spell <= 2
(3,946 observations deleted)

. drop if divest==1
(1,612 observations deleted)

. 
. *Greenfield variable
. tempvar x

. egen `x'=min(foreign), by(frame_id_numeric)

. gen greenfield=(`x'==1)

. 
. 
. * check foreign and expat numbers
. egen firm_tag = tag(frame_id_numeric)

. 
. count if ever_foreign
  40,393

. count if ever_foreign & firm_tag
  3,463

. count if ever_expat_ceo & firm_tag
  2,224

. 
. count if has_expat_ceo == 1
  17,427

. count if has_expat_ceo == 1 & foreign == 0 // FIXME - should be 0
  0

. count if ever_expat_ceo == 1 & ever_foreign == 0
  0

. 
. egen industry_year = group(teaor08_1d year)

. 
. *for descriptives (number of firms and firm-years in final data)
. codebook frame_id_numeric

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [10000049,74849574]           Units: 1
         Unique values: 35,403                    Missing .: 0/333,052

                  Mean: 1.4e+07
             Std. dev.: 6.5e+06

           Percentiles:     10%       25%       50%       75%       90%
                        1.0e+07   1.0e+07   1.1e+07   1.3e+07   2.4e+07

. count if firm_tag
  35,403

. count
  333,052

. 
. drop first_year_foreign time_foreign 

. 
. bys frame_id_numeric: egen first_year_foreign_new = min(cond(foreign == 1, ye
> ar,.))
(292,659 missing values generated)

. generate time_foreign_new = year - first_year_foreign_new
(292,659 missing values generated)

. gen foreign0_new = (time_foreign_new == 0)

. count if foreign0_new == 1
  3,463

. drop *new

. 
. count
  333,052

. count if ever_foreign
  40,393

. count if ever_foreign & firm_tag
  3,463

. count if ever_expat_ceo & firm_tag
  2,224

. count if has_expat_ceo
  17,427

. 
. drop ever_expat* ever_foreign_hire
variable ever_foreign_hire not found
r(111);

end of do-file
r(111);
