
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklós Koren
               Central European University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/create/analysis_sample.do 

. clear all

. 
. * find root folder
. here
/Users/koren/Tresorit/Mac2Mac/projects/expat/

. local here = r(here)

. 
. cap log close

. log using "`here'/output/analysis_sample", text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/analysis_samp
> le.log
  log type:  text
 opened on:  22 May 2024, 12:26:14

. 
. use "`here'/temp/balance-small-clean.dta"

. drop foreign

. 
. merge 1:1 frame_id_numeric year using "`here'/temp/firm_events.dta", keep(mat
> ch) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           729,862  
    -----------------------------------------

. 
. * many foreign changes deleted
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric (year): egen owner_spell_total = total(foreign != foreig
> n[_n-1])

. tabulate owner_spell_total

owner_spell |
     _total |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    642,248       88.00       88.00
          2 |     54,289        7.44       95.43
          3 |     23,322        3.20       98.63
          4 |      5,964        0.82       99.45
          5 |      2,798        0.38       99.83
          6 |        724        0.10       99.93
          7 |        377        0.05       99.98
          8 |         87        0.01       99.99
          9 |         53        0.01      100.00
------------+-----------------------------------
      Total |    729,862      100.00

. 
. drop if owner_spell_total > 3 
(10,003 observations deleted)

. 
. * divestment
. bys frame_id_numeric (year): gen divest = sum(owner_spell != owner_spell[_n-1
> ] & foreign == 0 & _n != 1)

. replace divest = 1 if divest > 0
(0 real changes made)

. 
. * only D, D-F F owner spells
. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (fore
> ign == 0))

. tabulate start_as_domestic

start_as_do |
     mestic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     92,914       12.91       12.91
          1 |    626,945       87.09      100.00
------------+-----------------------------------
      Total |    719,859      100.00

. keep if start_as_domestic
(92,914 observations deleted)

. keep if owner_spell <= 2
(7,215 observations deleted)

. drop if divest == 1
(0 observations deleted)

. 
. drop owner_spell_total divest start_as_domestic

. 
. * check foreign and expat numbers
. egen firm_tag = tag(frame_id_numeric)

. 
. count if ever_foreign
  39,285

. count if ever_foreign & firm_tag
  3,007

. count if ever_expat & firm_tag
  1,025

. 
. count if has_expat_ceo == 1
  7,035

. count if has_expat_ceo == 1 & foreign == 0 
  17

. count if ever_expat == 1 & ever_foreign == 0
  0

. 
. egen industry_year = group(teaor08_1d year)

. 
. *for descriptives (number of firms and firm-years in final data)
. codebook frame_id_numeric

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [10000049,74867439]           Units: 1
         Unique values: 50,691                    Missing .: 0/619,730

                  Mean: 1.4e+07
             Std. dev.: 6.9e+06

           Percentiles:     10%       25%       50%       75%       90%
                        1.0e+07   1.1e+07   1.1e+07   1.4e+07   2.4e+07

. count if firm_tag
  50,691

. count
  619,730

. 
. count if ever_foreign
  39,285

. count if ever_foreign & firm_tag
  3,007

. count if ever_expat & firm_tag
  1,025

. count if has_expat_ceo
  7,035

. 
. drop ever_expat ever_foreign

. egen ever_foreign = max(foreign), by(frame_id_numeric)

. * did new foreign owner hire any ceos?
. egen ever_foreign_hire = max((hire_ceo == 1) & (foreign == 1) * (owner_spell 
> == 2)), by(frame_id_numeric)

. generate foreign_hire = ever_foreign_hire & foreign

. 
. * check the patterns of expat - local transitions. 
. local ceo has_expat_ceo

. bys frame_id_numeric (year): generate ceo_foreign_spell = sum(`ceo' != `ceo'[
> _n-1])

. 
. * drop after first expat leaves
. drop if ceo_foreign_spell > 2
(2,724 observations deleted)

. drop if ceo_foreign_spell == 2 & has_expat_ceo == 0
(0 observations deleted)

. 
. keep if ever_foreign == 1
(580,445 observations deleted)

. 
. generate foreign_only = foreign & !foreign_hire

. generate local_ceo = foreign_hire & !has_expat_ceo

. egen ever_local_ceo = max(local_ceo), by(frame_id_numeric)

. 
. * drop if local hires are much later replaced by expats
. drop if ever_local_ceo & has_expat_ceo
(1,730 observations deleted)

. * sometimes we refer to the short name
. clonevar ever_local = ever_local_ceo

. 
. tabulate foreign_only foreign_hire

foreign_on |     foreign_hire
        ly |         0          1 |     Total
-----------+----------------------+----------
         0 |    18,222     14,754 |    32,976 
         1 |     1,855          0 |     1,855 
-----------+----------------------+----------
     Total |    20,077     14,754 |    34,831 

. tabulate local_ceo has_expat_ceo

           |     has_expat_ceo
 local_ceo |         0          1 |     Total
-----------+----------------------+----------
         0 |    20,028      4,605 |    24,633 
         1 |    10,198          0 |    10,198 
-----------+----------------------+----------
     Total |    30,226      4,605 |    34,831 

. 
. keep if ever_foreign_hire
(6,084 observations deleted)

. * no variation in these, drop
. drop ever_foreign ever_foreign_hire

. 
. egen first_year_foreign = min(cond(foreign==1, year, .)), by(frame_id_numeric
> ) 
(2 missing values generated)

. generate time_foreign = year - first_year_foreign
(2 missing values generated)

. 
. egen ever_expat = max(has_expat_ceo), by(frame_id_numeric)

. 
. * limit sample to event window
. keep if inrange(time_foreign, -6, 4)
(11,319 observations deleted)

. 
. egen exporter_pre = max(exporter & inrange(time_foreign, -3, -1)), by(frame_i
> d_numeric)

. * different ways of measuring export orientation
. clonevar export_entry = exporter

. replace export_entry = . if exporter_pre == 1
(8,829 real changes made, 8,829 to missing)

. 
. *Create teaor in year -1, drop agriculture
. 
. egen teaor08_1d_num = group(teaor08_1d)

. tempvar last_year_before 

. egen `last_year_before' = max(cond(time_foreign < 0, year,.)), by(frame_id_nu
> meric)
(20 missing values generated)

. drop if missing(`last_year_before')
(20 observations deleted)

. 
. egen teaor08_2d_pre = max(cond(year==`last_year_before', teaor08_2d, .)), by(
> frame_id_numeric)

. egen teaor08_1d_pre = max(cond(year==`last_year_before', teaor08_1d_num, .)),
>  by(frame_id_numeric)

. assert !missing(teaor08_2d_pre)

. drop `last_year_before'

. 
. * compute TFP
. 
. local agriculture 1 3

. local industry 5 39

. local services 40 75

. 
. keep if inrange(teaor08_2d_pre, 1, 75)
(1,415 observations deleted)

. * drop finance
. drop if inrange(teaor08_2d_pre, 64, 66)
(383 observations deleted)

. 
. * tradable as defined by OECD https://doi.org/10.1787/888933707836
. generate byte tradable_sector = 0

. replace tradable_sector = 1 if inrange(teaor08_2d_pre, 1, 39)
(6,416 real changes made)

. replace tradable_sector = 1 if inrange(teaor08_2d_pre, 58, 63)
(1,043 real changes made)

. 
. generate TFP = .
(15,610 missing values generated)

. tempvar TFP

. foreach sector in agriculture industry services {
  2.     local from : word 1 of ``sector''
  3.     local to : word 2 of ``sector''
  4.     quietly regress lnQ lnK lnL lnM i.teaor08_2d##year if inrange(teaor08_
> 2d_pre, `from', `to')
  5.     predict `TFP' if e(sample), resid
  6.     replace TFP = `TFP' if inrange(teaor08_2d_pre, `from', `to')
  7.     drop `TFP'
  8. }
(14,966 missing values generated)
(644 real changes made)
(9,838 missing values generated)
(5,772 real changes made)
(6,416 missing values generated)
(9,194 real changes made)

. 
. tabulate foreignness has_expat_ceo

                      |     has_expat_ceo
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |    13,345          0 |    13,345 
Hungarian name, neigh |         0         55 |        55 
Foreign name, Hungari |         0        140 |       140 
Hungarian name, other |         0         11 |        11 
Foreign name, non-Wes |         0        289 |       289 
Foreign name, Western |         0      1,770 |     1,770 
----------------------+----------------------+----------
                Total |    13,345      2,265 |    15,610 

. tabulate time_foreign foreignness if inrange(time_foreign, -2, 2) & ever_expa
> t 

time_forei |                   (max) foreignness
        gn | Hungarian  Hungarian  Foreign n  Hungarian  Foreign n |     Total
-----------+-------------------------------------------------------+----------
        -2 |       357          0          1          0          0 |       359 
        -1 |       603          0          1          0          0 |       613 
         0 |         0         20         38          3         93 |       637 
         1 |         0         15         33          2         63 |       522 
         2 |         0         11         26          2         51 |       432 
-----------+-------------------------------------------------------+----------
     Total |       960         46         99          7        207 |     2,563 


           |   (max)
           | foreignnes
time_forei |     s
        gn | Foreign n |     Total
-----------+-----------+----------
        -2 |         1 |       359 
        -1 |         9 |       613 
         0 |       483 |       637 
         1 |       409 |       522 
         2 |       342 |       432 
-----------+-----------+----------
     Total |     1,244 |     2,563 

. 
. * keep only western foreigners and locals with Hungarian names
. egen always0 = min(foreignness == 0), by(frame_id_numeric )

. egen ever5 = max(foreignness == 5), by(frame_id_numeric )

. tab always0 ever5 

           |         ever5
   always0 |         0          1 |     Total
-----------+----------------------+----------
         0 |       884      3,333 |     4,217 
         1 |    11,393          0 |    11,393 
-----------+----------------------+----------
     Total |    12,277      3,333 |    15,610 

. keep if always0 | ever5 
(884 observations deleted)

. drop always0 ever5

. 
. tabulate time_foreign has_expat_ceo 

time_forei |     has_expat_ceo
        gn |         0          1 |     Total
-----------+----------------------+----------
        -6 |       777          0 |       777 
        -5 |       887          0 |       887 
        -4 |     1,043          0 |     1,043 
        -3 |     1,232          0 |     1,232 
        -2 |     1,481          1 |     1,482 
        -1 |     1,986          9 |     1,995 
         0 |     1,578        492 |     2,070 
         1 |     1,347        419 |     1,766 
         2 |     1,033        356 |     1,389 
         3 |       836        300 |     1,136 
         4 |       689        260 |       949 
-----------+----------------------+----------
     Total |    12,889      1,837 |    14,726 

. xtset frame_id_numeric year

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1984 to 2019, but with gaps
         Delta: 1 unit

. 
. compress
  variable firmage was int now byte
  variable minyear was float now int
  variable maxyear was float now int
  variable exporter_5 was float now byte
  variable age was float now byte
  variable owner_spell was float now byte
  variable industry_year was float now int
  variable foreign_hire was float now byte
  variable ceo_foreign_spell was float now byte
  variable foreign_only was float now byte
  variable local_ceo was float now byte
  variable ever_local_ceo was float now byte
  variable ever_local was float now byte
  variable first_year_foreign was float now int
  variable time_foreign was float now byte
  variable ever_expat was float now byte
  variable exporter_pre was float now byte
  variable teaor08_1d_num was float now byte
  variable teaor08_2d_pre was float now byte
  variable teaor08_1d_pre was float now byte
  variable eszk was double now long
  variable hlk was double now long
  variable rlk was double now long
  variable export was double now long
  variable egyebbev was double now long
  variable aktivalt was double now long
  variable ranyag was double now long
  variable ranyag01 was double now long
  variable ranyag02 was double now long
  variable ranyag03 was double now long
  variable ranyag04 was double now long
  variable ranyagesz was double now long
  variable wbill was double now long
  variable egyebraf was double now long
  variable ereduzem was double now long
  variable pretax was double now long
  variable jetok was double now long
  variable jetok06 was double now long
  variable immat was double now long
  variable satok was double now long
  variable tax was double now long
  variable final_netgep was double now long
  variable tanass_18 was double now long
  (2,149,996 bytes saved)

. save "`here'/temp/analysis_sample.dta", replace
file /Users/koren/Tresorit/Mac2Mac/projects/expat//temp/analysis_sample.dta
    saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/analysis_samp
> le.log
  log type:  text
 closed on:  22 May 2024, 12:26:45
-------------------------------------------------------------------------------

. 
end of do-file
