
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/create/analysis_sample.do 

. clear all

. 
. * find root folder
. here
/Users/koren/Tresorit/Mac/projects/expat/

. local here = r(here)

. 
. cap log close

. log using "`here'/output/analysis_sample", text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/analysis_sample.l
> og
  log type:  text
 opened on:   6 May 2024, 17:07:33

. 
. use "`here'/temp/balance-small-clean.dta"

. drop foreign

. 
. merge 1:1 frame_id_numeric year using "`here'/temp/firm_events.dta", keep(mat
> ch) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           615,652  
    -----------------------------------------

. 
. * many foreign changes deleted
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric (year): egen owner_spell_total = total(foreign != foreig
> n[_n-1])

. tabulate owner_spell_total

owner_spell |
     _total |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    545,829       88.66       88.66
          2 |     45,464        7.38       96.04
          3 |     16,499        2.68       98.72
          4 |      4,926        0.80       99.52
          5 |      1,817        0.30       99.82
          6 |        786        0.13       99.95
          7 |        226        0.04       99.98
          8 |         55        0.01       99.99
          9 |         50        0.01      100.00
------------+-----------------------------------
      Total |    615,652      100.00

. 
. drop if owner_spell_total > 3 
(7,860 observations deleted)

. 
. * divestment
. bys frame_id_numeric (year): gen divest = sum(owner_spell != owner_spell[_n-1
> ] & foreign == 0 & _n != 1)

. replace divest = 1 if divest > 0
(0 real changes made)

. 
. * only D, D-F F owner spells
. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (fore
> ign == 0))

. tabulate start_as_domestic

start_as_do |
     mestic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     85,046       13.99       13.99
          1 |    522,746       86.01      100.00
------------+-----------------------------------
      Total |    607,792      100.00

. keep if start_as_domestic
(85,046 observations deleted)

. keep if owner_spell <= 2
(4,018 observations deleted)

. drop if divest == 1
(0 observations deleted)

. 
. drop owner_spell_total divest start_as_domestic

. 
. * check foreign and expat numbers
. egen firm_tag = tag(frame_id_numeric)

. 
. count if ever_foreign
  29,175

. count if ever_foreign & firm_tag
  2,087

. count if ever_expat & firm_tag
  790

. 
. count if has_expat_ceo == 1
  5,564

. count if has_expat_ceo == 1 & foreign == 0 
  15

. count if ever_expat == 1 & ever_foreign == 0
  0

. 
. egen industry_year = group(teaor08_1d year)

. 
. *for descriptives (number of firms and firm-years in final data)
. codebook frame_id_numeric

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [10000049,74849574]           Units: 1
         Unique values: 41,486                    Missing .: 0/518,728

                  Mean: 1.4e+07
             Std. dev.: 7.0e+06

           Percentiles:     10%       25%       50%       75%       90%
                        1.0e+07   1.1e+07   1.1e+07   1.3e+07   2.3e+07

. count if firm_tag
  41,486

. count
  518,728

. 
. count if ever_foreign
  29,175

. count if ever_foreign & firm_tag
  2,087

. count if ever_expat & firm_tag
  790

. count if has_expat_ceo
  5,564

. 
. drop ever_expat ever_foreign

. egen ever_foreign = max(foreign), by(frame_id_numeric)

. * did new foreign owner hire any ceos?
. egen ever_foreign_hire = max((hire_ceo == 1) & (foreign == 1) * (owner_spell 
> == 2)), by(frame_id_numeric)

. generate foreign_hire = ever_foreign_hire & foreign

. 
. * check the patterns of expat - local transitions. 
. local ceo has_expat_ceo

. bys frame_id_numeric (year): generate ceo_foreign_spell = sum(`ceo' != `ceo'[
> _n-1])

. 
. * drop after first expat leaves
. drop if ceo_foreign_spell > 2
(1,961 observations deleted)

. drop if ceo_foreign_spell == 2 & has_expat_ceo == 0
(0 observations deleted)

. 
. keep if ever_foreign == 1
(489,553 observations deleted)

. 
. generate foreign_only = foreign & !foreign_hire

. generate local_ceo = foreign_hire & !has_expat_ceo

. egen ever_local_ceo = max(local_ceo), by(frame_id_numeric)

. 
. * drop if local hires are much later replaced by expats
. drop if ever_local_ceo & has_expat_ceo
(1,021 observations deleted)

. * sometimes we refer to the short name
. clonevar ever_local = ever_local_ceo

. 
. tabulate foreign_only foreign_hire

foreign_on |     foreign_hire
        ly |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,274     10,819 |    25,093 
         1 |     1,100          0 |     1,100 
-----------+----------------------+----------
     Total |    15,374     10,819 |    26,193 

. tabulate local_ceo has_expat_ceo

           |     has_expat_ceo
 local_ceo |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,343      4,024 |    19,367 
         1 |     6,826          0 |     6,826 
-----------+----------------------+----------
     Total |    22,169      4,024 |    26,193 

. 
. keep if ever_foreign_hire
(3,683 observations deleted)

. * no variation in these, drop
. drop ever_foreign ever_foreign_hire

. 
. egen first_year_foreign = min(cond(foreign==1, year, .)), by(frame_id_numeric
> ) 
(2 missing values generated)

. generate time_foreign = year - first_year_foreign
(2 missing values generated)

. 
. egen ever_expat = max(has_expat_ceo), by(frame_id_numeric)

. 
. * limit sample to event window
. keep if inrange(time_foreign, -6, 4)
(9,126 observations deleted)

. 
. egen exporter_pre = max(exporter & inrange(time_foreign, -3, -1)), by(frame_i
> d_numeric)

. * different ways of measuring export orientation
. clonevar export_entry = exporter

. replace export_entry = . if exporter_pre == 1
(7,375 real changes made, 7,375 to missing)

. 
. *Create teaor in year -1, drop agriculture
. 
. egen teaor08_1d_num = group(teaor08_1d)

. tempvar last_year_before 

. egen `last_year_before' = max(cond(time_foreign < 0, year,.)), by(frame_id_nu
> meric)
(26 missing values generated)

. drop if missing(`last_year_before')
(26 observations deleted)

. 
. egen teaor08_2d_pre = max(cond(year==`last_year_before', teaor08_2d, .)), by(
> frame_id_numeric)

. egen teaor08_1d_pre = max(cond(year==`last_year_before', teaor08_1d_num, .)),
>  by(frame_id_numeric)

. assert !missing(teaor08_2d_pre)

. drop `last_year_before'

. 
. * compute TFP
. 
. local agriculture 1 3

. local industry 5 39

. local services 40 75

. 
. generate TFP = .
(13,358 missing values generated)

. tempvar TFP

. foreach sector in agriculture industry services {
  2.     local from : word 1 of ``sector''
  3.     local to : word 2 of ``sector''
  4.     quietly regress lnQ lnK lnL lnM i.teaor08_2d##year if inrange(industry
> _mode, `from', `to')
  5.     predict `TFP' if e(sample), resid
  6.     replace TFP = `TFP' if inrange(industry_mode, `from', `to')
  7.     drop `TFP'
  8. }
(12,582 missing values generated)
(776 real changes made)
(8,216 missing values generated)
(5,142 real changes made)
(5,918 missing values generated)
(7,440 real changes made)

. 
. tabulate foreignness has_expat_ceo

                      |     has_expat_ceo
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |    11,247          0 |    11,247 
Hungarian name, neigh |         0         54 |        54 
Foreign name, Hungari |         0        257 |       257 
Hungarian name, other |         0          6 |         6 
Foreign name, non-Wes |         0        289 |       289 
Foreign name, Western |         0      1,505 |     1,505 
----------------------+----------------------+----------
                Total |    11,247      2,111 |    13,358 

. tabulate time_foreign foreignness if inrange(time_foreign, -2, 2) & ever_expa
> t 

time_forei |                   (max) foreignness
        gn | Hungarian  Hungarian  Foreign n  Hungarian  Foreign n |     Total
-----------+-------------------------------------------------------+----------
        -2 |       345          0          1          0          0 |       346 
        -1 |       561          0          2          0          0 |       570 
         0 |         0         21         75          2         95 |       595 
         1 |         0         15         60          1         61 |       473 
         2 |         0         10         47          1         54 |       399 
-----------+-------------------------------------------------------+----------
     Total |       906         46        185          4        210 |     2,383 


           |   (max)
           | foreignnes
time_forei |     s
        gn | Foreign n |     Total
-----------+-----------+----------
        -2 |         0 |       346 
        -1 |         7 |       570 
         0 |       402 |       595 
         1 |       336 |       473 
         2 |       287 |       399 
-----------+-----------+----------
     Total |     1,032 |     2,383 

. 
. * keep only western foreigners and locals with Hungarian names
. egen always0 = min(foreignness == 0), by(frame_id_numeric )

. egen ever5 = max(foreignness == 5), by(frame_id_numeric )

. tab always0 ever5 

           |         ever5
   always0 |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,101      2,881 |     3,982 
         1 |     9,376          0 |     9,376 
-----------+----------------------+----------
     Total |    10,477      2,881 |    13,358 

. keep if always0 | ever5 
(1,101 observations deleted)

. drop always0 ever5

. 
. tabulate time_foreign has_expat_ceo 

time_forei |     has_expat_ceo
        gn |         0          1 |     Total
-----------+----------------------+----------
        -6 |       739          0 |       739 
        -5 |       853          0 |       853 
        -4 |     1,002          0 |     1,002 
        -3 |     1,159          0 |     1,159 
        -2 |     1,227          0 |     1,227 
        -1 |     1,508          7 |     1,515 
         0 |     1,171        420 |     1,591 
         1 |     1,014        351 |     1,365 
         2 |       820        304 |     1,124 
         3 |       647        271 |       918 
         4 |       531        233 |       764 
-----------+----------------------+----------
     Total |    10,671      1,586 |    12,257 

. 
. compress
  variable year was float now int
  variable minyear was float now int
  variable maxyear was float now int
  variable exporter_5 was float now byte
  variable age was float now byte
  variable owner_spell was float now byte
  variable industry_year was float now int
  variable foreign_hire was float now byte
  variable ceo_foreign_spell was float now byte
  variable foreign_only was float now byte
  variable local_ceo was float now byte
  variable ever_local_ceo was float now byte
  variable ever_local was float now byte
  variable first_year_foreign was float now int
  variable time_foreign was float now byte
  variable ever_expat was float now byte
  variable exporter_pre was float now byte
  variable teaor08_1d_num was float now byte
  variable teaor08_2d_pre was float now byte
  variable teaor08_1d_pre was float now byte
  variable originalid was double now long
  variable sales was double now long
  variable tanass was double now long
  variable jetok was double now long
  variable export was double now long
  variable ranyag was double now long
  variable immat was double now long
  variable final_netgep was double now long
  variable tanass_18 was double now long
  (1,115,387 bytes saved)

. save "`here'/temp/analysis_sample.dta", replace
file /Users/koren/Tresorit/Mac/projects/expat//temp/analysis_sample.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/analysis_sample.l
> og
  log type:  text
 closed on:   6 May 2024, 17:07:59
-------------------------------------------------------------------------------

. 
end of do-file
