
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/create/analysis_sample.do 

. clear all

. 
. * find root folder
. here
/Users/koren/Tresorit/Mac/projects/expat/

. local here = r(here)

. 
. cap log close

. log using "`here'/output/analysis_sample", text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/analysis_sample.l
> og
  log type:  text
 opened on:  26 Jan 2024, 18:23:11

. 
. use "`here'/temp/balance-small-clean.dta"

. drop foreign

. 
. merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(match) noge
> n

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           343,019  
    -----------------------------------------

. 
. * many foreign changes deleted
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric (year): egen owner_spell_total = total(foreign != foreig
> n[_n-1])

. tabulate owner_spell_total

owner_spell |
     _total |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    306,295       89.29       89.29
          2 |     21,648        6.31       95.60
          3 |     11,164        3.25       98.86
          4 |      2,280        0.66       99.52
          5 |      1,253        0.37       99.89
          6 |        222        0.06       99.95
          7 |        131        0.04       99.99
          8 |         26        0.01      100.00
------------+-----------------------------------
      Total |    343,019      100.00

. 
. drop if owner_spell_total > 3 
(3,912 observations deleted)

. 
. * divestment
. bys frame_id_numeric (year): gen divest = sum(owner_spell != owner_spell[_n-1
> ] & foreign == 0 & _n != 1)

. replace divest = 1 if divest > 0
(0 real changes made)

. 
. * only D, D-F F owner spells
. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (fore
> ign == 0))

. tabulate start_as_domestic

start_as_do |
     mestic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,835        5.26        5.26
          1 |    321,272       94.74      100.00
------------+-----------------------------------
      Total |    339,107      100.00

. keep if start_as_domestic
(17,835 observations deleted)

. keep if owner_spell <= 2
(3,729 observations deleted)

. drop if divest == 1
(0 observations deleted)

. 
. drop owner_spell_total divest start_as_domestic

. 
. * check foreign and expat numbers
. egen firm_tag = tag(frame_id_numeric)

. 
. count if ever_foreign
  24,884

. count if ever_foreign & firm_tag
  1,756

. count if ever_expat & firm_tag
  716

. 
. count if has_expat_ceo == 1
  5,428

. count if has_expat_ceo == 1 & foreign == 0 
  0

. count if ever_expat == 1 & ever_foreign == 0
  0

. 
. egen industry_year = group(teaor08_1d year)

. 
. *for descriptives (number of firms and firm-years in final data)
. codebook frame_id_numeric

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [10000049,74849574]           Units: 1
         Unique values: 33,696                    Missing .: 0/317,543

                  Mean: 1.4e+07
             Std. dev.: 6.5e+06

           Percentiles:     10%       25%       50%       75%       90%
                        1.0e+07   1.0e+07   1.1e+07   1.3e+07   2.4e+07

. count if firm_tag
  33,696

. count
  317,543

. 
. drop first_year_foreign time_foreign 

. 
. count
  317,543

. count if ever_foreign
  24,884

. count if ever_foreign & firm_tag
  1,756

. count if ever_expat & firm_tag
  716

. count if has_expat_ceo
  5,428

. 
. drop ever_expat ever_foreign

. egen ever_foreign = max(foreign), by(frame_id_numeric)

. * did new foreign owner hire any ceos?
. egen ever_foreign_hire = max((hire_ceo == 1) & (foreign == 1) * (owner_spell 
> == 2)), by(frame_id_numeric)

. generate foreign_hire = ever_foreign_hire & foreign

. 
. * check the patterns of expat - local transitions. 
. local ceo has_expat_ceo

. bys frame_id_numeric (year): generate ceo_foreign_spell = sum(`ceo' != `ceo'[
> _n-1])

. 
. * drop after first expat leaves
. drop if ceo_foreign_spell > 2
(2,072 observations deleted)

. drop if ceo_foreign_spell == 2 & has_expat_ceo == 0
(0 observations deleted)

. 
. keep if ever_foreign == 1
(292,659 observations deleted)

. 
. generate foreign_only = foreign & !foreign_hire

. generate local_ceo = foreign_hire & !has_expat_ceo

. egen ever_local_ceo = max(local_ceo), by(frame_id_numeric)

. 
. * drop if local hires are much later replaced by expats
. drop if ever_local_ceo & has_expat_ceo
(1,347 observations deleted)

. 
. tabulate foreign_only foreign_hire

foreign_on |     foreign_hire
        ly |         0          1 |     Total
-----------+----------------------+----------
         0 |    10,748      8,637 |    19,385 
         1 |     2,080          0 |     2,080 
-----------+----------------------+----------
     Total |    12,828      8,637 |    21,465 

. tabulate local_ceo has_expat_ceo

           |     has_expat_ceo
 local_ceo |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,828      3,508 |    16,336 
         1 |     5,129          0 |     5,129 
-----------+----------------------+----------
     Total |    17,957      3,508 |    21,465 

. 
. keep if ever_foreign_hire
(5,486 observations deleted)

. * no variation in these, drop
. drop ever_foreign ever_foreign_hire

. 
. egen first_year_foreign = min(cond(foreign==1, year, .)), by(frame_id_numeric
> ) 

. generate time_foreign = year - first_year_foreign

. 
. egen ever_expat = max(has_expat_ceo), by(frame_id_numeric)

. 
. * limit sample to event window
. keep if inrange(time_foreign, -10, 5)
(4,926 observations deleted)

. 
. egen exporter_pre = max(exporter & (time_foreign < 0)), by(frame_id_numeric)

. 
. compress
  variable year was float now int
  variable minyear was float now int
  variable maxyear was float now int
  variable exporter_5 was float now byte
  variable age was float now byte
  variable owner_spell was float now byte
  variable industry_year was float now int
  variable foreign_hire was float now byte
  variable ceo_foreign_spell was float now byte
  variable foreign_only was float now byte
  variable local_ceo was float now byte
  variable ever_local_ceo was float now byte
  variable first_year_foreign was float now int
  variable time_foreign was float now byte
  variable ever_expat was float now byte
  variable exporter_pre was float now byte
  variable originalid was double now long
  variable sales was double now long
  variable tanass was double now long
  variable jetok was double now long
  variable export was double now long
  variable ranyag was double now long
  variable immat was double now long
  variable final_netgep was double now long
  variable tanass_18 was double now long
  (873,187 bytes saved)

. save "`here'/temp/analysis_sample.dta", replace
file /Users/koren/Tresorit/Mac/projects/expat//temp/analysis_sample.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/analysis_sample.l
> og
  log type:  text
 closed on:  26 Jan 2024, 18:23:12
-------------------------------------------------------------------------------

. 
end of do-file
