
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklós Koren
               Central European University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/create/analysis_sample.do 

. clear all

. 
. * find root folder
. here
/Users/koren/Tresorit/Mac2Mac/projects/expat/

. local here = r(here)

. 
. cap log close

. log using "`here'/output/analysis_sample", text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/analysis_samp
> le.log
  log type:  text
 opened on:  19 Mar 2024, 16:18:10

. 
. use "`here'/temp/balance-small-clean.dta"

. drop foreign

. 
. merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(match) noge
> n

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           283,210  
    -----------------------------------------

. 
. * many foreign changes deleted
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric (year): egen owner_spell_total = total(foreign != foreig
> n[_n-1])

. tabulate owner_spell_total

owner_spell |
     _total |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    253,534       89.52       89.52
          2 |     17,391        6.14       95.66
          3 |      8,833        3.12       98.78
          4 |      2,142        0.76       99.54
          5 |        957        0.34       99.88
          6 |        235        0.08       99.96
          7 |         77        0.03       99.99
          8 |         41        0.01      100.00
------------+-----------------------------------
      Total |    283,210      100.00

. 
. drop if owner_spell_total > 3 
(3,452 observations deleted)

. 
. * divestment
. bys frame_id_numeric (year): gen divest = sum(owner_spell != owner_spell[_n-1
> ] & foreign == 0 & _n != 1)

. replace divest = 1 if divest > 0
(0 real changes made)

. 
. * only D, D-F F owner spells
. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (fore
> ign == 0))

. tabulate start_as_domestic

start_as_do |
     mestic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,338        7.27        7.27
          1 |    259,420       92.73      100.00
------------+-----------------------------------
      Total |    279,758      100.00

. keep if start_as_domestic
(20,338 observations deleted)

. keep if owner_spell <= 2
(2,925 observations deleted)

. drop if divest == 1
(0 observations deleted)

. 
. drop owner_spell_total divest start_as_domestic

. 
. * check foreign and expat numbers
. egen firm_tag = tag(frame_id_numeric)

. 
. count if ever_foreign
  18,641

. count if ever_foreign & firm_tag
  1,348

. count if ever_expat & firm_tag
  586

. 
. count if has_expat_ceo == 1
  4,240

. count if has_expat_ceo == 1 & foreign == 0 
  0

. count if ever_expat == 1 & ever_foreign == 0
  0

. 
. egen industry_year = group(teaor08_1d year)

. 
. *for descriptives (number of firms and firm-years in final data)
. codebook frame_id_numeric

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [10000063,74849574]           Units: 1
         Unique values: 27,768                    Missing .: 0/256,495

                  Mean: 1.4e+07
             Std. dev.: 6.8e+06

           Percentiles:     10%       25%       50%       75%       90%
                        1.0e+07   1.0e+07   1.1e+07   1.3e+07   2.5e+07

. count if firm_tag
  27,768

. count
  256,495

. 
. drop first_year_foreign time_foreign 

. 
. count
  256,495

. count if ever_foreign
  18,641

. count if ever_foreign & firm_tag
  1,348

. count if ever_expat & firm_tag
  586

. count if has_expat_ceo
  4,240

. 
. drop ever_expat ever_foreign

. egen ever_foreign = max(foreign), by(frame_id_numeric)

. * did new foreign owner hire any ceos?
. egen ever_foreign_hire = max((hire_ceo == 1) & (foreign == 1) * (owner_spell 
> == 2)), by(frame_id_numeric)

. generate foreign_hire = ever_foreign_hire & foreign

. 
. * check the patterns of expat - local transitions. 
. local ceo has_expat_ceo

. bys frame_id_numeric (year): generate ceo_foreign_spell = sum(`ceo' != `ceo'[
> _n-1])

. 
. * drop after first expat leaves
. drop if ceo_foreign_spell > 2
(1,498 observations deleted)

. drop if ceo_foreign_spell == 2 & has_expat_ceo == 0
(0 observations deleted)

. 
. keep if ever_foreign == 1
(237,854 observations deleted)

. 
. generate foreign_only = foreign & !foreign_hire

. generate local_ceo = foreign_hire & !has_expat_ceo

. egen ever_local_ceo = max(local_ceo), by(frame_id_numeric)

. 
. * drop if local hires are much later replaced by expats
. drop if ever_local_ceo & has_expat_ceo
(978 observations deleted)

. 
. tabulate foreign_only foreign_hire

foreign_on |     foreign_hire
        ly |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,175      6,368 |    14,543 
         1 |     1,622          0 |     1,622 
-----------+----------------------+----------
     Total |     9,797      6,368 |    16,165 

. tabulate local_ceo has_expat_ceo

           |     has_expat_ceo
 local_ceo |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,797      2,842 |    12,639 
         1 |     3,526          0 |     3,526 
-----------+----------------------+----------
     Total |    13,323      2,842 |    16,165 

. 
. keep if ever_foreign_hire
(4,240 observations deleted)

. * no variation in these, drop
. drop ever_foreign ever_foreign_hire

. 
. egen first_year_foreign = min(cond(foreign==1, year, .)), by(frame_id_numeric
> ) 

. generate time_foreign = year - first_year_foreign

. 
. egen ever_expat = max(has_expat_ceo), by(frame_id_numeric)

. 
. * limit sample to event window
. keep if inrange(time_foreign, -7, 5)
(4,392 observations deleted)

. 
. egen exporter_pre = max(exporter & inrange(time_foreign, -3, -1)), by(frame_i
> d_numeric)

. * different ways of measuring export orientation
. clonevar export_entry = exporter

. replace export_entry = . if exporter_pre == 1
(4,214 real changes made, 4,214 to missing)

. 
. *Create teaor in year -1, drop agriculture
. 
. egen teaor08_1d_num = group(teaor08_1d)

. tempvar last_year_before 

. egen `last_year_before' = max(cond(time_foreign < 0, year,.)), by(frame_id_nu
> meric)
(10 missing values generated)

. drop if missing(`last_year_before')
(10 observations deleted)

. 
. egen teaor08_2d_pre = max(cond(year==`last_year_before', teaor08_2d, .)), by(
> frame_id_numeric)

. egen teaor08_1d_pre = max(cond(year==`last_year_before', teaor08_1d_num, .)),
>  by(frame_id_numeric)

. assert !missing(teaor08_2d_pre)

. drop `last_year_before'

. 
. * drop agriculture and mining firms
. drop if teaor08_2d_pre < 5 
(390 observations deleted)

. generate industrial_pre = (teaor08_2d_pre < 40)

. 
. * compute TFP
. 
. quietly regress lnQ lnK lnL lnM i.teaor08_2d##year if industrial_firm==1

. predict TFP if e(sample), resid
(3,947 missing values generated)

. 
. quietly regress lnQ lnK lnL lnM i.teaor08_2d##year if industrial_firm==0

. predict TFP_temp if e(sample), resid
(3,186 missing values generated)

. 
. replace TFP = TFP_temp if missing(TFP)
(3,947 real changes made)

. drop TFP_temp

. 
. compress
  variable year was float now int
  variable minyear was float now int
  variable maxyear was float now int
  variable exporter_5 was float now byte
  variable age was float now byte
  variable owner_spell was float now byte
  variable industry_year was float now int
  variable foreign_hire was float now byte
  variable ceo_foreign_spell was float now byte
  variable foreign_only was float now byte
  variable local_ceo was float now byte
  variable ever_local_ceo was float now byte
  variable first_year_foreign was float now int
  variable time_foreign was float now byte
  variable ever_expat was float now byte
  variable exporter_pre was float now byte
  variable teaor08_1d_num was float now byte
  variable teaor08_2d_pre was float now byte
  variable teaor08_1d_pre was float now byte
  variable industrial_pre was float now byte
  variable originalid was double now long
  variable sales was double now long
  variable tanass was double now long
  variable jetok was double now long
  variable export was double now long
  variable ranyag was double now long
  variable immat was double now long
  variable final_netgep was double now long
  variable tanass_18 was double now long
  (649,103 bytes saved)

. save "`here'/temp/analysis_sample.dta", replace
file /Users/koren/Tresorit/Mac2Mac/projects/expat//temp/analysis_sample.dta
    saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/analysis_samp
> le.log
  log type:  text
 closed on:  19 Mar 2024, 16:18:19
-------------------------------------------------------------------------------

. 
end of do-file
