
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklós Koren
               Central European University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/create/balance.do 

. clear all

. set more off

. 
. * find root folder
. here
/Users/koren/Tresorit/Mac2Mac/projects/expat/

. local here = r(here)

. 
. cap log close

. log using "`here'/output/balance", text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/balance.log
  log type:  text
 opened on:  24 Jan 2024, 16:52:42

. 
. use "`here'/input/merleg-expat/balance-small.dta" 

. 
. * keep only numeric part of frame_id
. keep if substr(frame_id, 1, 2) == "ft"
(214,062 observations deleted)

. generate long frame_id_numeric = real(substr(frame_id, 3, 8))

. codebook frame_id*

-------------------------------------------------------------------------------
frame_id               Frame_id identify one firm. Only_originalid if not valid
-------------------------------------------------------------------------------

                  Type: String (str15), but longest is str10

         Unique values: 918,978                   Missing "": 0/8,122,237

              Examples: "ft11653592"
                        "ft13650485"
                        "ft21145467"
                        "ft24151038"

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [10000049,77902216]           Units: 1
         Unique values: 918,978                   Missing .: 0/8,122,237

                  Mean: 1.8e+07
             Std. dev.: 6.6e+06

           Percentiles:     10%       25%       50%       75%       90%
                        1.1e+07   1.2e+07   2.0e+07   2.3e+07   2.7e+07

. drop frame_id

. xtset frame_id_numeric year

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. 
. do "`here'/code/create/emp_clean"

. cap drop emp_cl

. clonevar emp_cl=emp
(831,002 missing values generated)

. 
. xtset frame_id_numeric year

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. 
. replace emp_cl=l.emp_cl if 8*emp_cl<l.emp_cl & 8*emp_cl<f.emp_cl & f.emp_cl!=
> . & l.emp_cl!=. & l.emp_cl>0 & emp_cl>0 & f.emp_cl>0 & 1.1*f.emp_cl>l.emp_cl 
> & f.emp_cl>50 & l.emp_cl>50 /*29*/
(1 real change made)

. replace emp_cl=l.emp_cl if emp_cl>8*l.emp_cl & emp_cl>8*f.emp_cl & f.emp_cl!=
> . & l.emp_cl!=. & emp_cl!=. & l.emp_cl>0 & f.emp_cl>0 & 1.1*l.emp_cl>f.emp_cl
>  & f.emp_cl>50 & l.emp_cl>50 /*20*/
(3 real changes made)

. 
. replace emp_cl=. if 8*emp_cl<l.emp_cl & 8*emp_cl<f.emp_cl & f.emp_cl!=. & l.e
> mp_cl!=. & l.emp_cl>0 & emp_cl>0 & f.emp_cl>0 /*& 1.1*f.emp_cl<l.emp_cl 73*/
(1 real change made, 1 to missing)

. replace emp_cl=. if emp_cl>8*l.emp_cl & emp_cl>8*f.emp_cl & f.emp_cl!=. & l.e
> mp_cl!=. & emp_cl!=. & l.emp_cl>0 & f.emp_cl>0 /*& 1.1*l.emp_cl<f.emp_cl 114*
> /
(3 real changes made, 3 to missing)

. 
. 
. * if emp<6
. replace emp_cl=0 if emp_cl>6 & l.emp_cl==0 & f.emp_cl==0 & emp_cl!=. /*418*/
(0 real changes made)

. replace emp_cl=l.emp_cl if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. 
> & f.emp_cl!=. & l.emp_cl+5>f.emp_cl /*1630*/
(0 real changes made)

. replace emp_cl=l.emp_cl if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. 
> & f.emp_cl!=. & l.emp_cl<f.emp_cl+5 /*532*/
(0 real changes made)

. 
. replace emp_cl=. if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. & f.emp
> _cl!=. & l.emp_cl+5<f.emp_cl /*0*/
(0 real changes made)

. replace emp_cl=. if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. & f.emp
> _cl!=. & l.emp_cl>f.emp_cl+5 /*0*/
(0 real changes made)

. 
. ***** Last year
. bysort frame_id_numeric: egen lastyear=max(year)

. foreach i of numlist 1980/2018 {
  2. 
.     local j=`i'+1
  3. 
.     gen j1=emp_cl if year == `i'
  4.     gen j2=emp_cl if year == `j'
  5.    
.     bysort frame_id_numeric: egen v=mean(j1)
  6.     bysort frame_id_numeric: egen w=mean(j2)
  7.    
.     sort frame_id_numeric year
  8.    
.     replace emp_cl=. if 8*v<w & v>0 & w!=. & lastyear==`j' & year==`j'
  9.     replace emp_cl=. if 8*w<v & w>0 & v!=. & lastyear==`j' & year==`j'
 10.    
.     replace emp_cl=. if v>5 & w==0 & v!=. & lastyear==`j' & year==`j'
 11.     replace emp_cl=. if w>5 & v==0 & w!=. & lastyear==`j' & year==`j'
 12.    
.     drop j1 j2 v w      
 13. }
(8,119,007 missing values generated)
(8,118,973 missing values generated)
(8,043,649 missing values generated)
(8,042,916 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,973 missing values generated)
(8,118,968 missing values generated)
(8,042,916 missing values generated)
(8,042,872 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,968 missing values generated)
(8,118,952 missing values generated)
(8,042,872 missing values generated)
(8,042,676 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,952 missing values generated)
(8,118,935 missing values generated)
(8,042,676 missing values generated)
(8,042,455 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,935 missing values generated)
(8,118,396 missing values generated)
(8,042,455 missing values generated)
(8,035,110 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,396 missing values generated)
(8,118,023 missing values generated)
(8,035,110 missing values generated)
(8,031,369 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,023 missing values generated)
(8,117,556 missing values generated)
(8,031,369 missing values generated)
(8,027,046 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,117,556 missing values generated)
(8,117,199 missing values generated)
(8,027,046 missing values generated)
(8,023,304 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,117,199 missing values generated)
(8,114,932 missing values generated)
(8,023,304 missing values generated)
(7,991,929 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,114,932 missing values generated)
(8,099,603 missing values generated)
(7,991,929 missing values generated)
(7,781,163 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,099,603 missing values generated)
(8,083,067 missing values generated)
(7,781,163 missing values generated)
(7,533,878 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,083,067 missing values generated)
(8,030,023 missing values generated)
(7,533,878 missing values generated)
(6,818,421 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,030,023 missing values generated)
(8,006,112 missing values generated)
(6,818,421 missing values generated)
(6,432,340 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,006,112 missing values generated)
(7,976,485 missing values generated)
(6,432,340 missing values generated)
(5,983,120 missing values generated)
(0 real changes made)
(0 real changes made)
(2 real changes made, 2 to missing)
(0 real changes made)
(7,976,487 missing values generated)
(7,959,384 missing values generated)
(5,983,128 missing values generated)
(5,659,002 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,959,384 missing values generated)
(7,934,466 missing values generated)
(5,659,002 missing values generated)
(5,241,341 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,934,466 missing values generated)
(7,914,304 missing values generated)
(5,241,341 missing values generated)
(4,882,443 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,914,305 missing values generated)
(7,889,092 missing values generated)
(4,882,448 missing values generated)
(4,504,892 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(4 real changes made, 4 to missing)
(7,889,098 missing values generated)
(7,880,300 missing values generated)
(4,504,923 missing values generated)
(4,319,657 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,880,301 missing values generated)
(7,858,664 missing values generated)
(4,319,665 missing values generated)
(4,006,429 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,858,664 missing values generated)
(7,838,120 missing values generated)
(4,006,429 missing values generated)
(3,733,130 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,838,120 missing values generated)
(7,838,103 missing values generated)
(3,733,130 missing values generated)
(3,655,597 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(7,838,106 missing values generated)
(7,833,013 missing values generated)
(3,655,615 missing values generated)
(3,554,256 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,833,014 missing values generated)
(7,819,534 missing values generated)
(3,554,259 missing values generated)
(3,371,669 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,819,536 missing values generated)
(7,868,099 missing values generated)
(3,371,680 missing values generated)
(4,020,193 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,868,100 missing values generated)
(7,856,206 missing values generated)
(4,020,200 missing values generated)
(3,853,389 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,856,206 missing values generated)
(7,845,401 missing values generated)
(3,853,389 missing values generated)
(3,742,290 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,845,403 missing values generated)
(7,802,241 missing values generated)
(3,742,303 missing values generated)
(3,258,442 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,802,242 missing values generated)
(7,799,936 missing values generated)
(3,258,445 missing values generated)
(3,272,886 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,799,936 missing values generated)
(7,788,455 missing values generated)
(3,272,886 missing values generated)
(3,185,303 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,788,455 missing values generated)
(7,788,116 missing values generated)
(3,185,303 missing values generated)
(3,270,591 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,788,117 missing values generated)
(7,792,943 missing values generated)
(3,270,595 missing values generated)
(3,406,140 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,792,945 missing values generated)
(7,796,323 missing values generated)
(3,406,152 missing values generated)
(3,522,940 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,796,323 missing values generated)
(7,798,550 missing values generated)
(3,522,940 missing values generated)
(3,598,562 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,798,550 missing values generated)
(7,899,704 missing values generated)
(3,598,562 missing values generated)
(5,006,992 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(2 real changes made, 2 to missing)
(7,899,707 missing values generated)
(7,756,790 missing values generated)
(5,007,006 missing values generated)
(3,149,539 missing values generated)
(0 real changes made)
(2 real changes made, 2 to missing)
(0 real changes made)
(0 real changes made)
(7,756,792 missing values generated)
(7,764,331 missing values generated)
(3,149,562 missing values generated)
(3,303,951 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,764,332 missing values generated)
(7,777,706 missing values generated)
(3,303,959 missing values generated)
(3,566,063 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,777,706 missing values generated)
(8,122,237 missing values generated)
(3,566,063 missing values generated)
(8,122,237 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. ***** First year 
. bysort frame_id_numeric: egen firstyear=min(year)

. foreach i of numlist 1981/2019 {
  2. 
.     local j=`i'-1
  3. 
.     gen j1=emp if year == `i'
  4.     gen j2=emp if year == `j'
  5.    
.     bysort frame_id_numeric: egen v=mean(j1)
  6.     bysort frame_id_numeric: egen w=mean(j2)
  7.    
.     sort frame_id_numeric year
  8.    
.     replace emp_cl=. if 8*v<w & v>0 & w!=. & firstyear==`j' & year==`j'
  9.     replace emp_cl=. if 8*w<v & w>0 & v!=. & firstyear==`j' & year==`j'
 10.    
.     replace emp_cl=. if v>5 & w==0 & v!=. & firstyear==`j' & year==`j'
 11.     replace emp_cl=. if w>5 & v==0 & w!=. & firstyear==`j' & year==`j'
 12.    
.     drop j1 j2 v w
 13. }
(8,118,973 missing values generated)
(8,119,007 missing values generated)
(8,042,916 missing values generated)
(8,043,649 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,968 missing values generated)
(8,118,973 missing values generated)
(8,042,872 missing values generated)
(8,042,916 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,952 missing values generated)
(8,118,968 missing values generated)
(8,042,676 missing values generated)
(8,042,872 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,935 missing values generated)
(8,118,952 missing values generated)
(8,042,455 missing values generated)
(8,042,676 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,396 missing values generated)
(8,118,935 missing values generated)
(8,035,110 missing values generated)
(8,042,455 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,023 missing values generated)
(8,118,396 missing values generated)
(8,031,369 missing values generated)
(8,035,110 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,117,556 missing values generated)
(8,118,023 missing values generated)
(8,027,046 missing values generated)
(8,031,369 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,117,199 missing values generated)
(8,117,556 missing values generated)
(8,023,304 missing values generated)
(8,027,046 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,114,932 missing values generated)
(8,117,199 missing values generated)
(7,991,929 missing values generated)
(8,023,304 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,099,600 missing values generated)
(8,114,932 missing values generated)
(7,781,104 missing values generated)
(7,991,929 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,083,067 missing values generated)
(8,099,600 missing values generated)
(7,533,878 missing values generated)
(7,781,104 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,030,023 missing values generated)
(8,083,067 missing values generated)
(6,818,421 missing values generated)
(7,533,878 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made, 2 to missing)
(8,006,112 missing values generated)
(8,030,023 missing values generated)
(6,432,340 missing values generated)
(6,818,421 missing values generated)
(2 real changes made, 2 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,976,485 missing values generated)
(8,006,112 missing values generated)
(5,983,120 missing values generated)
(6,432,340 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,959,384 missing values generated)
(7,976,485 missing values generated)
(5,659,002 missing values generated)
(5,983,120 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,934,466 missing values generated)
(7,959,384 missing values generated)
(5,241,341 missing values generated)
(5,659,002 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,914,304 missing values generated)
(7,934,466 missing values generated)
(4,882,443 missing values generated)
(5,241,341 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,889,092 missing values generated)
(7,914,304 missing values generated)
(4,504,892 missing values generated)
(4,882,443 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,880,300 missing values generated)
(7,889,092 missing values generated)
(4,319,657 missing values generated)
(4,504,892 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,858,664 missing values generated)
(7,880,300 missing values generated)
(4,006,429 missing values generated)
(4,319,657 missing values generated)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,838,120 missing values generated)
(7,858,664 missing values generated)
(3,733,130 missing values generated)
(4,006,429 missing values generated)
(0 real changes made)
(0 real changes made)
(2 real changes made, 2 to missing)
(5 real changes made, 5 to missing)
(7,838,103 missing values generated)
(7,838,120 missing values generated)
(3,655,597 missing values generated)
(3,733,130 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(2 real changes made, 2 to missing)
(7,833,013 missing values generated)
(7,838,103 missing values generated)
(3,554,256 missing values generated)
(3,655,597 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,819,534 missing values generated)
(7,833,013 missing values generated)
(3,371,669 missing values generated)
(3,554,256 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(7,868,099 missing values generated)
(7,819,534 missing values generated)
(4,020,193 missing values generated)
(3,371,669 missing values generated)
(0 real changes made)
(0 real changes made)
(4 real changes made, 4 to missing)
(0 real changes made)
(7,856,206 missing values generated)
(7,868,099 missing values generated)
(3,853,389 missing values generated)
(4,020,193 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,845,401 missing values generated)
(7,856,206 missing values generated)
(3,742,290 missing values generated)
(3,853,389 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,802,240 missing values generated)
(7,845,401 missing values generated)
(3,258,431 missing values generated)
(3,742,290 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(7,799,936 missing values generated)
(7,802,240 missing values generated)
(3,272,886 missing values generated)
(3,258,431 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(7,788,455 missing values generated)
(7,799,936 missing values generated)
(3,185,303 missing values generated)
(3,272,886 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(7,788,116 missing values generated)
(7,788,455 missing values generated)
(3,270,591 missing values generated)
(3,185,303 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,792,943 missing values generated)
(7,788,116 missing values generated)
(3,406,140 missing values generated)
(3,270,591 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,796,323 missing values generated)
(7,792,943 missing values generated)
(3,522,940 missing values generated)
(3,406,140 missing values generated)
(0 real changes made)
(0 real changes made)
(3 real changes made, 3 to missing)
(0 real changes made)
(7,798,550 missing values generated)
(7,796,323 missing values generated)
(3,598,562 missing values generated)
(3,522,940 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,899,704 missing values generated)
(7,798,550 missing values generated)
(5,006,992 missing values generated)
(3,598,562 missing values generated)
(0 real changes made)
(2 real changes made, 2 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,756,790 missing values generated)
(7,899,704 missing values generated)
(3,149,539 missing values generated)
(5,006,992 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,764,331 missing values generated)
(7,756,790 missing values generated)
(3,303,951 missing values generated)
(3,149,539 missing values generated)
(1 real change made, 1 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(0 real changes made)
(7,777,706 missing values generated)
(7,764,331 missing values generated)
(3,566,063 missing values generated)
(3,303,951 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,122,237 missing values generated)
(7,777,706 missing values generated)
(8,122,237 missing values generated)
(3,566,063 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. drop firstyear lastyear

. 
end of do-file

. count
  8,122,237

. count if emp == emp_cl & emp != .
  7,291,148

. count if emp != emp_cl & emp != . & emp_cl != .
  4

. count if emp != emp_cl & emp != .
  87

. count if emp != emp_cl & emp_cl != .
  4

. gen emp_add = emp_cl + 1
(831,085 missing values generated)

. corr emp emp_cl emp_add
(obs=7,291,152)

             |      emp   emp_cl  emp_add
-------------+---------------------------
         emp |   1.0000
      emp_cl |   0.9995   1.0000
     emp_add |   0.9995   1.0000   1.0000


. 
. * use fo2 instead of fo3
. merge 1:1 originalid year using "`here'/input/balance-sheet-80-19-plus-vars/b
> alance-80-19-plus-vars.dta", keep(1 3) nogen
(variable originalid was long, now double to accommodate using data's values)
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           211
        from master                       211  
        from using                          0  

    Matched                         8,122,026  
    -----------------------------------------

. tab fo2 fo3, missing

   Foreign |
     owned |
     dummy |
share>=50% |  Foreign owned dummy
 1=foreign | with ultimate owners
     0=not |     from Complex
   foreign |         0          1 |     Total
-----------+----------------------+----------
         0 | 7,433,718     66,089 | 7,499,807 
         1 |       562    621,657 |   622,219 
         . |       155         56 |       211 
-----------+----------------------+----------
     Total | 7,434,435    687,802 | 8,122,237 

. 
. * foreign fill 
. rename fo3 foreign

. tab year foreign, missing

           |  Foreign owned dummy
           | with ultimate owners
      Year |     from Complex
 1980-2018 |         0          1 |     Total
-----------+----------------------+----------
      1980 |     3,231          0 |     3,231 
      1981 |     3,265          0 |     3,265 
      1982 |     3,269          0 |     3,269 
      1983 |     3,288          0 |     3,288 
      1984 |     3,303          0 |     3,303 
      1985 |     3,868          0 |     3,868 
      1986 |     4,244          0 |     4,244 
      1987 |     4,763          0 |     4,763 
      1988 |     5,494          0 |     5,494 
      1989 |    11,073          0 |    11,073 
      1990 |    21,514      2,354 |    23,868 
      1991 |    35,927      4,839 |    40,766 
      1992 |    84,610     10,318 |    94,928 
      1993 |   103,640     14,084 |   117,724 
      1994 |   128,805     18,257 |   147,062 
      1995 |   144,116     19,988 |   164,104 
      1996 |   168,004     21,150 |   189,154 
      1997 |   186,989     22,013 |   209,002 
      1998 |   210,235     23,668 |   233,903 
      1999 |   219,742     23,449 |   243,191 
      2000 |   239,734     24,714 |   264,448 
      2001 |   259,405     25,564 |   284,969 
      2002 |   258,525     26,413 |   284,938 
      2003 |   263,358     26,791 |   290,149 
      2004 |   276,196     27,376 |   303,572 
      2005 |   283,497     27,030 |   310,527 
      2006 |   290,856     27,044 |   317,900 
      2007 |   299,289     28,865 |   328,154 
      2008 |   313,628     31,062 |   344,690 
      2009 |   320,715     31,382 |   352,097 
      2010 |   333,496     31,378 |   364,874 
      2011 |   350,073     31,681 |   381,754 
      2012 |   346,205     29,921 |   376,126 
      2013 |   382,724     29,816 |   412,540 
      2014 |   373,712     28,203 |   401,915 
      2015 |   379,617     27,721 |   407,338 
      2016 |   378,513     26,460 |   404,973 
      2017 |   372,898     24,996 |   397,894 
      2018 |   362,614     21,265 |   383,879 
-----------+----------------------+----------
     Total | 7,434,435    687,802 | 8,122,237 

. inspect foreign

foreign:  Foreign owned dummy with ultim        Number of observations
-------------------------------------------------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero        7,434,435     7,434,435             -
|  #                         Positive      687,802       687,802             -
|  #                                   -----------   -----------   -----------
|  #                         Total       8,122,237     8,122,237             -
|  #   .                     Missing             -
+----------------------                -----------
0                     1                  8,122,237
   (2 unique values)

. *inspect jetok_18 if missing(foreign)
. recode foreign (.=0)
(0 changes made to foreign)

. 
. * interpolate small holes
. tab foreign

    Foreign |
owned dummy |
       with |
   ultimate |
owners from |
    Complex |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  7,434,435       91.53       91.53
          1 |    687,802        8.47      100.00
------------+-----------------------------------
      Total |  8,122,237      100.00

. tempvar before

. bys foreign: egen `before' = count(1)

. sort frame_id_numeric year

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & f2
> .foreign == 1
(800 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & f2
> .foreign == 0
(770 real changes made)

. bys frame_id_numeric (year): egen minyear = min(year)

. bys frame_id_numeric (year): egen maxyear = max(year)

. replace foreign = 1 if l.foreign == 1 & f.foreign == 1 & f2.foreign == 1 & ye
> ar == (minyear + 1)
(164 real changes made)

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & ye
> ar == (minyear + 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & f.foreign == 0 & f2.foreign == 0 & ye
> ar == (maxyear - 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & ye
> ar == (maxyear - 1)
(558 real changes made)

. tempvar after

. bys foreign: egen `after' = count(1)

. scalar foreign_interpolate = `before'-`after'

. display foreign_interpolate
-364

. 
. * foreign change
. preserve

. use "`here'/input/ceo-panel/ceo-panel.dta", clear

. * expat is changed if job_begin < 1990 in firm_panel.do, not here
. bys frame_id_numeric: egen first_year_expat = min(cond(expat == 1, year,.))
(13,123,639 missing values generated)

. duplicates drop frame_id_numeric, force

Duplicates in terms of frame_id_numeric

(14,268,202 observations deleted)

. tempfile expat

. save `expat'
file /var/folders/5z/21k9mmsd55d1w5_jl5n192sh0000gn/T//St18907.000002 saved
    as .dta format

. restore

. 
. merge m:1 frame_id_numeric using `expat', keepusing(first_year_expat) keep(1 
> 3) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                        21,031
        from master                    21,031  
        from using                          0  

    Matched                         8,101,206  
    -----------------------------------------

. 
. bys frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.
> ))
(7,066,682 missing values generated)

.         
. generate manager_after_owner = first_year_expat - first_year_foreign
(7,400,193 missing values generated)

. generate event_time = year - first_year_expat
(7,129,948 missing values generated)

. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(2,167 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(2,550 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(33,294 real changes made)

. 
. drop manager_after_owner event_time first_year_expat

. 
. generate time_foreign = year - first_year_foreign
(7,066,682 missing values generated)

. 
. *ez szerintem nem kell
. forval i = 0/3 {
  2.         gen foreign`i' = (time_foreign == `i')
  3. }

. forval i = 1/3 {
  2.         gen foreign_`i' = (time_foreign == -`i')
  3. }

. gen count = 1

. 
. * drop greenfield
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (fore
> ign == 0))

. keep if start_as_domestic
(538,239 observations deleted)

. drop owner_spell start_as_domestic

. 
. * limit sample before large merge - sampling based on firm-level variables, f
> irm-year done later
. * average employment and financial firms deleted
. * break the tie when mode is not unique
. 
. bys frame_id_numeric: egen avg_emp = mean(emp)
(91,245 missing values generated)

. bys frame_id_numeric: egen industry_mode = mode(teaor08_2d), minmode
warning: For at least one group, teaor08_2d contains all missing values.
         Generating missing values for the modes in these groups. Use option
         missing to treat missing values as a category.
(1,189 missing values generated)

. local sample ((avg_emp >= 20) & (industry_mode != 64 & industry_mode != 65 & 
> industry_mode != 66))

. drop if !`sample'
(7,103,695 observations deleted)

. scalar dropped_size_or_finance = r(N_drop)

. display dropped_size_or_finance
7103695

. 
. * proxy firm founding date with first balance sheet filed
. tempvar foundyear

. bys frame_id_numeric: egen `foundyear' = min(year)

. replace foundyear = `foundyear' if missing(foundyear)
(0 real changes made)

. drop `foundyear'

. 
. * deflate nominal values - FIXME: add ppi before 1992
. foreach x in sales export tanass jetok ranyag ranyag8091 immat {
  2.         cap drop `x'_18
  3.         gen double `x'_18 = `x' / ppi18
  4.         replace `x'_18 = `x' if year < 1992 // FIXME: till ppi before 1992
>  is not filled up - just to not delete those rows because of missing ln depen
> dent variables
  5. }
(30,509 missing values generated)
(56,597 real changes made)
(208,788 missing values generated)
(32,095 real changes made)
(38,268 missing values generated)
(54,493 real changes made)
(30,286 missing values generated)
(55,421 real changes made)
(64,216 missing values generated)
(0 real changes made)
(24,745 missing values generated)
(56,753 real changes made)
(167,508 missing values generated)
(0 real changes made)

. 
. * change emp
. *sort frame_id_numeric year
. 
. *clonevar emp_clean = emp
. *replace emp_clean = . if (emp[_n-1] > 5 | emp[_n +1] > 5) & emp == 0
. *corr emp emp_clean
. 
. *gen emp_add = emp_clean + 1
. 
. * creating dependent variables
. gen lnL = ln(emp_add)
(99,632 missing values generated)

. *gen lnL_add = ln(emp_add)
. gen lnM = ln(ranyag_18)
(80,022 missing values generated)

. replace lnM = ln(ranyag8091_18) if year <= 1991
(56,607 real changes made)

. gen lnQ = ln(sales_18)
(53,643 missing values generated)

. gen lnQL = lnQ-lnL
(106,821 missing values generated)

. gen lnMQ = lnM - lnQ
(57,846 missing values generated)

. gen byte exporter = export_18 > 0 & export_18 != .

. gen export_share = export_18 / sales
(192,228 missing values generated)

. gen exporter_5 = (export_share > .05 & export_share != .)

. replace exporter_5 = . if export_share == .
(192,228 real changes made, 192,228 to missing)

. 
. * extrapolate capital stock
. inspect tanass_18

tanass_18:                                      Number of observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            4             1             3
|  #                         Zero           68,119        68,119             -
|  #                         Positive      397,763        75,276       322,487
|  #                                   -----------   -----------   -----------
|  #                         Total         465,886       143,396       322,490
|  #   .   .   .   .         Missing        14,417
+----------------------                -----------
-800.3072      6.09e+09                    480,303
(More than 99 unique values)

. tempvar gap 

. generate `gap' = missing(tanass_18) | (tanass_18 <= 0)

. bysort frame_id_numeric (year): generate spell = sum(`gap' != `gap'[_n-1])

. 
. egen gap_length = count(1), by(frame_id_numeric spell)

. egen max_spell = max(spell), by(frame_id_numeric)

. * if gap_length <= 2, interpolate tanass with geometric average
. bysort frame_id_numeric (year): replace tanass_18 = sqrt(tanass_18[_n-1] * ta
> nass_18[_n+1]) if gap_length==1 & `gap'==1
(22375 real changes made, 21033 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1]^0.67 * ta
> nass_18[_n+2]^0.33 if gap_length==2 & `gap'==1 & `gap'[_n-1]==0
(808 real changes made, 608 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-2]^0.33 * ta
> nass_18[_n+1]^0.67 if gap_length==2 & `gap'==1 & `gap'[_n+1]==0
(1601 real changes made, 1401 to missing)

. * at either end, extrapolate for 1 year
. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n+1] if spell=
> =1 & `gap'==1 & `gap'[_n+1]==0
(9756 real changes made)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1] if spell=
> =max_spell & `gap'==1 & `gap'[_n-1]==0
(3854 real changes made)

. 
. drop spell gap_length max_spell

. replace tanass_18 = round(tanass_18)
(334,939 real changes made)

. inspect tanass_18

tanass_18:                                      Number of observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            2             2             -
|  #                         Zero           42,764        42,764             -
|  #                         Positive      413,115       413,105            10
|  #                                   -----------   -----------   -----------
|  #                         Total         455,881       455,871            10
|  #   .   .   .   .         Missing        24,422
+----------------------                -----------
-60            6.09e+09                    480,303
(More than 99 unique values)

. 
. gen lnK = ln(tanass_18)
(67,188 missing values generated)

. gen lnKL = lnK - lnL
(108,477 missing values generated)

. generate RperK = immat / (immat + tanass)
(227,643 missing values generated)

. replace RperK = 0 if RperK < 0 | missing(immat)
(166,623 real changes made)

. label variable RperK "Share of immaterial assets [0,1]"

. 
. * firm-year deletions
. count if missing(lnK, lnQ, lnL, lnM, foreign) & year > 1991
  111,871

. count if missing(lnK, lnQ, lnL, lnM, foreign)
  115,962

. *drop if missing(lnK, lnQ, lnL, lnM, foreign) // ASK: whether year condition 
> needed
. *count
. 
. foreach var in lnK lnQ lnL lnM {
  2.         drop if missing(`var')
  3. }
(67,188 observations deleted)
(17,412 observations deleted)
(28,547 observations deleted)
(2,815 observations deleted)

. 
. *drop if missing(foreign)
. *tabstat foreign foreign_0 foreign_1 count, stat(sum) save
. *mat total = (total \ r(StatTotal))
. 
. *drop hole* x
. count
  364,341

. 
. * TFP (Cobb-Douglas)
. * FIXME: Replace CD with something fancy
. recode industry_mode (6 75 7 66 84 19 51 = .)
(514 changes made to industry_mode)

. 
. levelsof industry_mode, local(levels)
1 2 3 5 8 9 10 11 12 13 14 15 16 17 18 20 21 22 23 24 25 26 27 28 29 30 31 32 3
> 3 35 36 37 38 39 41 42 43 45 46 47 49 50 52 53 55 56 68 69 70 71 72 73 74 77 
> 78 79 80 81 82 85 86 87 88 90 91 92 93 94 95 96

.         foreach l of local levels {
  2.         disp `l'
  3.         qui reghdfe lnQ lnL lnK lnM if industry_mode == `l', a(frame_id_nu
> meric year foundyear) resid
  4.         predict tfp_cd_`l', res
  5.         }
1
command reghdfe is unrecognized
r(199);

end of do-file
r(199);
