
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklós Koren
               Central European University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/create/balance.do 

. clear all

. set more off

. 
. * find root folder
. here
/Users/koren/Tresorit/Mac2Mac/projects/expat/

. local here = r(here)

. 
. cap log close

. log using "`here'/output/balance", text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/balance.log
  log type:  text
 opened on:  19 Mar 2024, 18:44:48

. 
. use "`here'/input/merleg-expat/balance-small.dta" 

. 
. * keep only numeric part of frame_id
. keep if substr(frame_id, 1, 2) == "ft"
(214,062 observations deleted)

. generate long frame_id_numeric = real(substr(frame_id, 3, 8))

. codebook frame_id*

-------------------------------------------------------------------------------
frame_id               Frame_id identify one firm. Only_originalid if not valid
-------------------------------------------------------------------------------

                  Type: String (str15), but longest is str10

         Unique values: 918,978                   Missing "": 0/8,122,237

              Examples: "ft11653592"
                        "ft13650485"
                        "ft21145467"
                        "ft24151038"

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [10000049,77902216]           Units: 1
         Unique values: 918,978                   Missing .: 0/8,122,237

                  Mean: 1.8e+07
             Std. dev.: 6.6e+06

           Percentiles:     10%       25%       50%       75%       90%
                        1.1e+07   1.2e+07   2.0e+07   2.3e+07   2.7e+07

. drop frame_id

. xtset frame_id_numeric year

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. 
. * use fo2 instead of fo3
. merge 1:1 originalid year using "`here'/input/balance-sheet-80-19-plus-vars/b
> alance-80-19-plus-vars.dta", keep(1 3) nogen
(variable originalid was long, now double to accommodate using data's values)
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           211
        from master                       211  
        from using                          0  

    Matched                         8,122,026  
    -----------------------------------------

. tab fo2 fo3, missing

   Foreign |
     owned |
     dummy |
share>=50% |  Foreign owned dummy
 1=foreign | with ultimate owners
     0=not |     from Complex
   foreign |         0          1 |     Total
-----------+----------------------+----------
         0 | 7,433,718     66,089 | 7,499,807 
         1 |       562    621,657 |   622,219 
         . |       155         56 |       211 
-----------+----------------------+----------
     Total | 7,434,435    687,802 | 8,122,237 

. 
. * foreign fill 
. rename fo3 foreign

. tab year foreign, missing

           |  Foreign owned dummy
           | with ultimate owners
      Year |     from Complex
 1980-2018 |         0          1 |     Total
-----------+----------------------+----------
      1980 |     3,231          0 |     3,231 
      1981 |     3,265          0 |     3,265 
      1982 |     3,269          0 |     3,269 
      1983 |     3,288          0 |     3,288 
      1984 |     3,303          0 |     3,303 
      1985 |     3,868          0 |     3,868 
      1986 |     4,244          0 |     4,244 
      1987 |     4,763          0 |     4,763 
      1988 |     5,494          0 |     5,494 
      1989 |    11,073          0 |    11,073 
      1990 |    21,514      2,354 |    23,868 
      1991 |    35,927      4,839 |    40,766 
      1992 |    84,610     10,318 |    94,928 
      1993 |   103,640     14,084 |   117,724 
      1994 |   128,805     18,257 |   147,062 
      1995 |   144,116     19,988 |   164,104 
      1996 |   168,004     21,150 |   189,154 
      1997 |   186,989     22,013 |   209,002 
      1998 |   210,235     23,668 |   233,903 
      1999 |   219,742     23,449 |   243,191 
      2000 |   239,734     24,714 |   264,448 
      2001 |   259,405     25,564 |   284,969 
      2002 |   258,525     26,413 |   284,938 
      2003 |   263,358     26,791 |   290,149 
      2004 |   276,196     27,376 |   303,572 
      2005 |   283,497     27,030 |   310,527 
      2006 |   290,856     27,044 |   317,900 
      2007 |   299,289     28,865 |   328,154 
      2008 |   313,628     31,062 |   344,690 
      2009 |   320,715     31,382 |   352,097 
      2010 |   333,496     31,378 |   364,874 
      2011 |   350,073     31,681 |   381,754 
      2012 |   346,205     29,921 |   376,126 
      2013 |   382,724     29,816 |   412,540 
      2014 |   373,712     28,203 |   401,915 
      2015 |   379,617     27,721 |   407,338 
      2016 |   378,513     26,460 |   404,973 
      2017 |   372,898     24,996 |   397,894 
      2018 |   362,614     21,265 |   383,879 
-----------+----------------------+----------
     Total | 7,434,435    687,802 | 8,122,237 

. inspect foreign

foreign:  Foreign owned dummy with ultim        Number of observations
-------------------------------------------------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero        7,434,435     7,434,435             -
|  #                         Positive      687,802       687,802             -
|  #                                   -----------   -----------   -----------
|  #                         Total       8,122,237     8,122,237             -
|  #   .                     Missing             -
+----------------------                -----------
0                     1                  8,122,237
   (2 unique values)

. *inspect jetok_18 if missing(foreign)
. recode foreign (.=0)
(0 changes made to foreign)

. 
. * interpolate small holes
. tab foreign

    Foreign |
owned dummy |
       with |
   ultimate |
owners from |
    Complex |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  7,434,435       91.53       91.53
          1 |    687,802        8.47      100.00
------------+-----------------------------------
      Total |  8,122,237      100.00

. tempvar before

. bys foreign: egen `before' = count(1)

. sort frame_id_numeric year

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & f2
> .foreign == 1
(800 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & f2
> .foreign == 0
(770 real changes made)

. bys frame_id_numeric (year): egen minyear = min(year)

. bys frame_id_numeric (year): egen maxyear = max(year)

. replace foreign = 1 if l.foreign == 1 & f.foreign == 1 & f2.foreign == 1 & ye
> ar == (minyear + 1)
(164 real changes made)

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & ye
> ar == (minyear + 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & f.foreign == 0 & f2.foreign == 0 & ye
> ar == (maxyear - 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & ye
> ar == (maxyear - 1)
(558 real changes made)

. tempvar after

. bys foreign: egen `after' = count(1)

. scalar foreign_interpolate = `before'-`after'

. display foreign_interpolate
-364

. 
. * foreign change
. preserve

. use "`here'/temp/ceo-panel.dta", clear

. * expat is changed if job_begin < 1990 in firm_panel.do, not here
. bys frame_id_numeric: egen first_year_expat = min(cond(expat == 1, year,.))
(11,384,383 missing values generated)

. duplicates drop frame_id_numeric, force

Duplicates in terms of frame_id_numeric

(13,977,508 observations deleted)

. tempfile expat

. save `expat'
file /var/folders/5z/21k9mmsd55d1w5_jl5n192sh0000gn/T//St36654.000002 saved
    as .dta format

. restore

. 
. merge m:1 frame_id_numeric using `expat', keepusing(first_year_expat) keep(1 
> 3) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                        20,118
        from master                    20,118  
        from using                          0  

    Matched                         8,102,119  
    -----------------------------------------

. 
. bys frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.
> ))
(7,066,682 missing values generated)

.         
. generate manager_after_owner = first_year_expat - first_year_foreign
(7,410,332 missing values generated)

. generate event_time = year - first_year_expat
(6,366,692 missing values generated)

. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(2,476 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(2,835 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(31,823 real changes made)

. 
. drop manager_after_owner event_time first_year_expat

. 
. generate time_foreign = year - first_year_foreign
(7,066,682 missing values generated)

. 
. * drop greenfield
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (fore
> ign == 0))

. keep if start_as_domestic
(544,379 observations deleted)

. drop owner_spell start_as_domestic

. 
. * limit sample before large merge - sampling based on firm-level variables, f
> irm-year done later
. * average employment and financial firms deleted
. * break the tie when mode is not unique
. 
. bys frame_id_numeric: egen avg_emp = mean(emp)
(90,627 missing values generated)

. bys frame_id_numeric: egen industry_mode = mode(teaor08_2d), minmode
warning: For at least one group, teaor08_2d contains all missing values.
         Generating missing values for the modes in these groups. Use option
         missing to treat missing values as a category.
(1,184 missing values generated)

. 
. 
. * drop agriculture and mining firms
. drop if industry_mode < 5 
(286,877 observations deleted)

. generate industrial = (industry_mode < 40)

. local sample ((avg_emp >= 20) & (industry_mode != 64 & industry_mode != 65 & 
> industry_mode != 66))

. drop if !`sample'
(6,870,012 observations deleted)

. 
. tempvar ever_foreign

. egen `ever_foreign' = max(foreign), by(frame_id_numeric)

. drop if `ever_foreign' == 0
(357,745 observations deleted)

. drop `ever_foreign'

. 
. * proxy firm founding date with first balance sheet filed
. tempvar foundyear

. bys frame_id_numeric: egen `foundyear' = min(year)

. replace foundyear = `foundyear' if missing(foundyear)
(0 real changes made)

. drop `foundyear'

. 
. * deflate nominal values - FIXME: add ppi before 1992
. foreach x in sales export tanass jetok ranyag ranyag8091 immat {
  2.         cap drop `x'_18
  3.         gen double `x'_18 = `x' / ppi18
  4.         replace `x'_18 = `x' if year < 1992 // FIXME: till ppi before 1992
>  is not filled up - just to not delete those rows because of missing ln depen
> dent variables
  5. }
(1,786 missing values generated)
(3,575 real changes made)
(14,693 missing values generated)
(2,292 real changes made)
(2,405 missing values generated)
(3,476 real changes made)
(1,329 missing values generated)
(3,648 real changes made)
(4,170 missing values generated)
(0 real changes made)
(1,074 missing values generated)
(3,609 real changes made)
(16,646 missing values generated)
(0 real changes made)

. 
. * minimal employment cleaning
. replace emp = 1 if emp <= 0 | missing(emp)
(8,159 real changes made)

. mvencode export_18, mv(0) override
   export_18: 13619 missing values recoded

. 
. * creating dependent variables
. gen lnL = ln(emp)

. gen lnM = ln(ranyag_18)
(5,385 missing values generated)

. replace lnM = ln(ranyag8091_18) if year <= 1991
(3,590 real changes made)

. gen lnQ = ln(sales_18)
(4,900 missing values generated)

. gen lnQL = lnQ - lnL
(4,900 missing values generated)

. gen lnMQ = lnM - lnQ
(5,206 missing values generated)

. generate lnEx = ln(export_18)
(28,849 missing values generated)

. generate lnQd = ln(sales_18 - export_18)
(5,907 missing values generated)

. 
. gen byte exporter = export_18 > 0 & export_18 != .

. gen export_share = export_18 / sales_18
(4,900 missing values generated)

. gen exporter_5 = (export_share > .05 & export_share != .)

. replace exporter_5 = . if export_share == .
(4,900 real changes made, 4,900 to missing)

. 
. * extrapolate capital stock
. inspect tanass_18

tanass_18:                                      Number of observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero            4,570         4,570             -
|  #                         Positive       57,323         5,534        51,789
|  #                                   -----------   -----------   -----------
|  #                         Total          61,893        10,104        51,789
|  #   .   .   .   .         Missing         1,331
+----------------------                -----------
0              5.50e+09                     63,224
(More than 99 unique values)

. tempvar gap 

. generate `gap' = missing(tanass_18) | (tanass_18 <= 0)

. bysort frame_id_numeric (year): generate spell = sum(`gap' != `gap'[_n-1])

. 
. egen gap_length = count(1), by(frame_id_numeric spell)

. egen max_spell = max(spell), by(frame_id_numeric)

. * if gap_length <= 2, interpolate tanass with geometric average
. bysort frame_id_numeric (year): replace tanass_18 = sqrt(tanass_18[_n-1] * ta
> nass_18[_n+1]) if gap_length==1 & `gap'==1
(1020 real changes made, 822 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1]^0.67 * ta
> nass_18[_n+2]^0.33 if gap_length==2 & `gap'==1 & `gap'[_n-1]==0
(112 real changes made, 80 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-2]^0.33 * ta
> nass_18[_n+1]^0.67 if gap_length==2 & `gap'==1 & `gap'[_n+1]==0
(145 real changes made, 113 to missing)

. * at either end, extrapolate for 1 year
. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n+1] if spell=
> =1 & `gap'==1 & `gap'[_n+1]==0
(1079 real changes made)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1] if spell=
> =max_spell & `gap'==1 & `gap'[_n-1]==0
(429 real changes made)

. 
. drop spell gap_length max_spell

. replace tanass_18 = round(tanass_18)
(53,391 real changes made)

. inspect tanass_18

tanass_18:                                      Number of observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero            3,258         3,258             -
|  #                         Positive       59,093        59,087             6
|  #                                   -----------   -----------   -----------
|  #                         Total          62,351        62,345             6
|  #   .   .   .   .         Missing           873
+----------------------                -----------
0              5.50e+09                     63,224
(More than 99 unique values)

. 
. gen lnK = ln(tanass_18)
(4,131 missing values generated)

. gen lnKL = lnK - lnL
(4,131 missing values generated)

. generate RperK = immat / (immat + tanass)
(20,554 missing values generated)

. replace RperK = 0 if RperK < 0 | missing(immat)
(16,646 real changes made)

. label variable RperK "Share of immaterial assets [0,1]"

. 
. * firm-year deletions
. count if missing(lnK, lnQ, lnL, lnM, foreign) & year > 1991
  6,522

. count if missing(lnK, lnQ, lnL, lnM, foreign)
  6,704

. 
. foreach var in lnK lnQ lnL lnM {
  2.         drop if missing(`var')
  3. }
(4,131 observations deleted)
(2,306 observations deleted)
(0 observations deleted)
(267 observations deleted)

. 
. count
  56,520

. 
. * industry dummy and age
. gen byte industrial_firm = inlist(teaor08_1d, "B", "C", "D", "E")

. gen age = year - foundyear

. 
. * missing export means 0 export
. mvencode export exporter exporter_5, mv(0) override
      export: 9063 missing values recoded

. generate domestic_sales = sales - export

. replace domestic_sales = 0 if domestic_sales < 0 | missing(domestic_sales)
(2 real changes made)

. 
. count
  56,520

. 
. cap drop __*

. save "`here'/temp/balance-small-clean.dta", replace
file
    /Users/koren/Tresorit/Mac2Mac/projects/expat//temp/balance-small-clean.dt
    > a saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/balance.log
  log type:  text
 closed on:  19 Mar 2024, 18:46:05
-------------------------------------------------------------------------------

. 
end of do-file
