
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklós Koren
               Central European University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/create/ceo_panel.do 

. here
/Users/koren/Tresorit/Mac2Mac/projects/expat/

. local here = r(here)

. use "`here'/input/ceo-panel/ceo-panel.dta", clear 

. rename person_id manager_id

. replace expat = (foreign_name == 1)
(380,374 real changes made)

. 
. compress
  (0 bytes saved)

. save "`here'/temp/ceo-panel.dta", replace
file /Users/koren/Tresorit/Mac2Mac/projects/expat//temp/ceo-panel.dta saved

. 
end of do-file
