
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/create/ceo_panel.do 

. here
/Users/koren/Tresorit/Mac/projects/expat/

. local here = r(here)

. use "`here'/input/ceo-panel/ceo-panel.dta", clear 

. rename person_id manager_id

. 
. local western AT DE BE CA CH DE DK ES FR GB IT NL NO SE US IE US

. generate byte western = 0

. foreach country in `western' {
  2.     replace western = 1 if (country_code == "`country'")
  3. }
(118,837 real changes made)
(127,445 real changes made)
(11,626 real changes made)
(7,096 real changes made)
(21,920 real changes made)
(0 real changes made)
(2,736 real changes made)
(10,639 real changes made)
(16,989 real changes made)
(28,688 real changes made)
(47,664 real changes made)
(25,152 real changes made)
(1,529 real changes made)
(7,730 real changes made)
(25,821 real changes made)
(12,500 real changes made)
(0 real changes made)

. egen byte ever_western = max(western), by(manager_id)

. replace ever_western = 0 if !first_address_foreign
(43,791 real changes made)

. 
. replace expat = (ever_western == 1)
(530,243 real changes made)

. 
. compress
  (0 bytes saved)

. save "`here'/temp/ceo-panel.dta", replace
file /Users/koren/Tresorit/Mac/projects/expat//temp/ceo-panel.dta saved

. 
end of do-file
