
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do create_firm_panel 

. *Betöltés
. set more off

. clear all

. capture log close

. log using output/firm_panel, text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/projects/expat/output/firm_panel.log
  log type:  text
 opened on:   9 Jul 2020, 14:45:56

. 
. use "temp/balance-small.dta"

. *Tempvars were created for some reason when I was closing the previous file
. *drop __* - deleted in select_sample
. collapse (min) firm_birth = year (max) firm_death = year, by(frame_id)

. tempfile sample

. save `sample', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St23680.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St23680.000001 saved

. 
. use "input/ceo-panel/ceo-panel.dta", clear

. rename person_id manager_id

. 
. * only keep sample firms
. merge m:1 frame_id using `sample', keep(match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            18,157  
    -----------------------------------------

. drop if year>firm_death
(919 observations deleted)

. 
. * balance panel
. egen company_manager = group(frame_id manager_id)

. xtset company_manager year
       panel variable:  company_manager (unbalanced)
        time variable:  year, 1988 to 2018, but with gaps
                delta:  1 unit

. by company_manager: generate gap = year - year[_n-1] - 1
(5,852 missing values generated)

. replace gap = 0 if missing(gap)
(5,852 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,133       99.39       99.39
          1 |         29        0.17       99.56
          2 |         19        0.11       99.67
          3 |         18        0.10       99.77
          4 |         10        0.06       99.83
          5 |          8        0.05       99.88
          6 |          4        0.02       99.90
          7 |          5        0.03       99.93
          8 |          1        0.01       99.94
          9 |          1        0.01       99.94
         10 |          1        0.01       99.95
         11 |          2        0.01       99.96
         12 |          1        0.01       99.97
         13 |          2        0.01       99.98
         14 |          1        0.01       99.98
         17 |          1        0.01       99.99
         18 |          1        0.01       99.99
         24 |          1        0.01      100.00
------------+-----------------------------------
      Total |     17,238      100.00

. 
. * fill in gap if only 1-year long
. expand 1+(gap==1), generate(filled_in)
(29 observations created)

. replace year = year - 1 if filled_in
(29 real changes made)

. xtset company_manager year
       panel variable:  company_manager (unbalanced)
        time variable:  year, 1988 to 2018, but with gaps
                delta:  1 unit

. xtdescribe

company_manager:  1, 2, ..., 5852                            n =       5852
    year:  1988, 1989, ..., 2018                             T =         31
           Delta(year) = 1 unit
           Span(year)  = 31 periods
           (company_manager*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                         1       1       1         1         3      13      31

     Freq.  Percent    Cum. |  Pattern
 ---------------------------+---------------------------------
     3255     55.62   55.62 |  1..............................
      159      2.72   58.34 |  ..............................1
      142      2.43   60.77 |  .............................11
       87      1.49   62.25 |  ............................111
       43      0.73   62.99 |  ...........................1111
       31      0.53   63.52 |  ....1..........................
       30      0.51   64.03 |  .....1.........................
       29      0.50   64.52 |  ...11..........................
       28      0.48   65.00 |  ......1........................
     2048     35.00  100.00 | (other patterns)
 ---------------------------+---------------------------------
     5852    100.00         |  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX

. 
. * create contiguous spells
. gen change = ceo != L.ceo 

. bysort company_manager (year): gen job_spell = sum(change)

. 
. * count number of CEOs
. preserve

.         collapse (count) N_ceos = expat, by(frame_id year)

.         save temp/N_ceos, replace
file temp/N_ceos.dta saved

. restore

. 
. collapse (min) job_begin = year (max) job_end = year (firstnm) expat manager_
> category firm_birth, by(frame_id manager_id job_spell)

. 
. * if first managers arrive in year 1, extrapolate to year 0
. egen first_cohort = min(job_begin), by(frame_id)

. replace job_begin = job_begin - 1 if (first_cohort == firm_birth + 1) & (job_
> begin == first_cohort)
(551 real changes made)

. 
. gen byte spell = 1

. bysort frame_id (job_begin manager_id): replace spell =  cond(job_begin > job
> _begin[_n-1], spell[_n-1]+1, spell[_n-1]) if _n>1
(1,239 real changes made)

. 
. egen max_expat = max(expat), by(frame_id spell)

. tempvar lag_expat

. gen `lag_expat' = .
(5,928 missing values generated)

. bysort frame_id (job_begin manager_id): replace `lag_expat' = max_expat[_n-1]
>  if _n>1 & job_begin > job_begin[_n-1]
(1044 real changes made)

. egen lag_expat = mean(`lag_expat'), by(frame_id spell)
(4689 missing values generated)

. assert lag_expat==0 | lag_expat==1 | (missing(lag_expat) & spell==1)

. 
. compress
  variable job_spell was float now byte
  variable first_cohort was float now int
  variable max_expat was float now byte
  variable __000000 was float now byte
  variable lag_expat was float now byte
  (82,992 bytes saved)

. save_all_to_json

. save "temp/firm_ceo_panel.dta", replace
file temp/firm_ceo_panel.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/projects/expat/output/firm_panel.log
  log type:  text
 closed on:   9 Jul 2020, 14:45:57
-------------------------------------------------------------------------------

. 
end of do-file
