
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do create_firm_panel 

. *Betöltés
. set more off

. clear all

. capture log close

. log using output/firm_panel, text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Google Drive/Research/expat/output/firm_panel.log
  log type:  text
 opened on:  29 Apr 2020, 13:59:36

. 
. use "temp/balance-small.dta"

. *Tempvars were created for some reason when I was closing the previous file
. *drop __* - deleted in select_sample
. collapse (max) firm_death=year, by(frame_id)

. tempfile sample

. save `sample', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St75665.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St75665.000001 saved

. 
. use "input/ceo-panel/ceo-panel.dta", clear

. rename person_id manager_id

. 
. * only keep sample firms
. merge m:1 frame_id using `sample', keep(match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           552,291  
    -----------------------------------------

. drop if year>firm_death
(66,589 observations deleted)

. 
. * balance panel
. egen company_manager = group(frame_id manager_id)

. xtset company_manager year
       panel variable:  company_manager (unbalanced)
        time variable:  year, 1988 to 2017, but with gaps
                delta:  1 unit

. by company_manager: generate gap = year - year[_n-1] - 1
(86,456 missing values generated)

. replace gap = 0 if missing(gap)
(86,456 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    481,799       99.20       99.20
          1 |      1,540        0.32       99.51
          2 |        681        0.14       99.65
          3 |        453        0.09       99.75
          4 |        321        0.07       99.81
          5 |        266        0.05       99.87
          6 |        157        0.03       99.90
          7 |        109        0.02       99.92
          8 |         85        0.02       99.94
          9 |         77        0.02       99.96
         10 |         46        0.01       99.97
         11 |         40        0.01       99.97
         12 |         30        0.01       99.98
         13 |         27        0.01       99.99
         14 |         20        0.00       99.99
         15 |         16        0.00       99.99
         16 |         12        0.00      100.00
         17 |         11        0.00      100.00
         18 |          3        0.00      100.00
         19 |          5        0.00      100.00
         20 |          1        0.00      100.00
         21 |          1        0.00      100.00
         23 |          1        0.00      100.00
         24 |          1        0.00      100.00
------------+-----------------------------------
      Total |    485,702      100.00

. 
. * fill in gap if only 1-year long
. expand 1+(gap==1), generate(filled_in)
(1,540 observations created)

. replace year = year - 1 if filled_in
(1,540 real changes made)

. xtset company_manager year
       panel variable:  company_manager (unbalanced)
        time variable:  year, 1988 to 2017, but with gaps
                delta:  1 unit

. xtdescribe

company_manager:  1, 2, ..., 86456                           n =      86456
    year:  1988, 1989, ..., 2017                             T =         30
           Delta(year) = 1 unit
           Span(year)  = 30 periods
           (company_manager*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                         1       1       2         3         7      19      30

     Freq.  Percent    Cum. |  Pattern
 ---------------------------+--------------------------------
     5980      6.92    6.92 |  .............................1
     4442      5.14   12.05 |  ............................11
     1851      2.14   14.20 |  ...........................111
     1052      1.22   15.41 |  ............................1.
     1026      1.19   16.60 |  .........................11111
      911      1.05   17.65 |  ..........................1111
      884      1.02   18.68 |  ....................1111111111
      844      0.98   19.65 |  ........................111111
      741      0.86   20.51 |  .......................1111111
    68725     79.49  100.00 | (other patterns)
 ---------------------------+--------------------------------
    86456    100.00         |  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXX

. 
. * create contiguous spells
. gen change = ceo != L.ceo 

. bysort company_manager (year): gen job_spell = sum(change)

. 
. * count number of CEOs
. preserve

.         collapse (count) N_ceos = expat, by(frame_id year)

.         save temp/N_ceos, replace
file temp/N_ceos.dta saved

. restore

. 
. collapse (min) job_begin = year (max) job_end = year (firstnm) expat manager_
> category, by(frame_id manager_id job_spell)

. 
. gen byte spell = 1

. bysort frame_id (job_begin manager_id): replace spell =  cond(job_begin > job
> _begin[_n-1], spell[_n-1]+1, spell[_n-1]) if _n>1
(43,266 real changes made)

. 
. egen max_expat = max(expat), by(frame_id spell)

. tempvar lag_expat

. gen `lag_expat' = .
(88,819 missing values generated)

. bysort frame_id (job_begin manager_id): replace `lag_expat' = max_expat[_n-1]
>  if _n>1 & job_begin > job_begin[_n-1]
(36186 real changes made)

. egen lag_expat = mean(`lag_expat'), by(frame_id spell)
(45553 missing values generated)

. assert lag_expat==0 | lag_expat==1 | (missing(lag_expat) & spell==1)

. 
. compress
  variable job_spell was float now byte
  variable max_expat was float now byte
  variable __000000 was float now byte
  variable lag_expat was float now byte
  (1,065,828 bytes saved)

. save_all_to_json

. save "temp/firm_ceo_panel.dta", replace
file temp/firm_ceo_panel.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Google Drive/Research/expat/output/firm_panel.log
  log type:  text
 closed on:  29 Apr 2020, 14:00:00
-------------------------------------------------------------------------------

. 
end of do-file
