
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklós Koren
               Central European University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate/figures.do 

. use "temp/analysis_sample.dta", clear

. which xt2treatments
/Users/koren/Library/Application Support/Stata/ado/plus/x/xt2treatments.ado
*! version 0.8.4 21may2024

. which e2frame
/Users/koren/Library/Application Support/Stata/ado/plus/e/e2frame.ado
*! version 0.1.0 21may2024

. which reghdfe
/Users/koren/Library/Application Support/Stata/ado/plus/r/reghdfe.ado
*! version 6.12.5 27Dec2023

. which estout
/Users/koren/Library/Application Support/Stata/ado/plus/e/estout.ado
*! version 3.31  26apr2022  Ben Jann

. 
. global varlist_rhs "lnK lnL TFP lnQ export_share"

. local graph_command graph twoway (rarea lower upper xvar, fcolor(gray%5) lcol
> or(gray%10)) (connected coef xvar, lcolor(cranberry)), graphregion(color(whit
> e)) xlabel(-4(1)4) legend(off) xline(-0.5) xscale(range (-4 4)) xtitle("Event
>  time") yline(0)

. local xt2treatments_options treatment(has_expat_ceo) control(local_ceo) pre(4
> ) post(4) baseline(-1) weighting(optimal)

. local esttab_options b(3) se style(tex) replace nolegend label nonote

. 
. *Figures, full sample
. 
. eststo clear

. foreach Y in $varlist_rhs {
  2.         eststo: xt2treatments `Y', `xt2treatments_options'
  3.         e2frame, generate(expat_fig)
  4.         frame expat_fig: `graph_command'
  5.         graph export "output/twfe/expat_`Y'.pdf", replace
  6. }

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1              Number of obs = 12,714

------------------------------------------------------------------------------
         lnK |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |    .044801   .1000351     0.45   0.654    -.1512643    .2408662
          -3 |   .0052371   .0900906     0.06   0.954    -.1713372    .1818114
          -2 |  -.0465764   .0641666    -0.73   0.468    -.1723406    .0791879
          -1 |          0  (omitted)
           0 |    .138374   .0605946     2.28   0.022     .0196108    .2571373
           1 |   .2490007   .0811347     3.07   0.002     .0899797    .4080217
           2 |   .3091954   .0994805     3.11   0.002     .1142172    .5041737
           3 |   .3515145   .1209924     2.91   0.004     .1143738    .5886552
           4 |   .5352206   .1363862     3.92   0.000     .2679086    .8025325
------------------------------------------------------------------------------
(est1 stored)
file output/twfe/expat_lnK.pdf saved as PDF format

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1              Number of obs = 12,714

------------------------------------------------------------------------------
         lnL |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0620184   .0724782    -0.86   0.392    -.2040732    .0800364
          -3 |  -.0488707   .0601497    -0.81   0.417    -.1667619    .0690205
          -2 |  -.0559101   .0472413    -1.18   0.237    -.1485014    .0366812
          -1 |          0  (omitted)
           0 |   .2513296   .0616611     4.08   0.000      .130476    .3721832
           1 |   .1980488   .0825629     2.40   0.016     .0362285     .359869
           2 |   .3776374   .0904548     4.17   0.000     .2003493    .5549255
           3 |   .3931449   .1066283     3.69   0.000     .1841574    .6021325
           4 |   .4100341   .1247543     3.29   0.001     .1655201    .6545481
------------------------------------------------------------------------------
(est2 stored)
file output/twfe/expat_lnL.pdf saved as PDF format

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1              Number of obs = 12,714

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0204891   .0361542     0.57   0.571    -.0503719    .0913501
          -3 |   .0270085   .0331343     0.82   0.415    -.0379335    .0919506
          -2 |   .0125353   .0299004     0.42   0.675    -.0460684     .071139
          -1 |          0  (omitted)
           0 |   .0803492   .0365553     2.20   0.028     .0087022    .1519962
           1 |   .1179397   .0455789     2.59   0.010     .0286068    .2072727
           2 |   .1348668   .0485972     2.78   0.006      .039618    .2301157
           3 |   .1923311    .052465     3.67   0.000     .0895015    .2951606
           4 |    .168226   .0667825     2.52   0.012     .0373347    .2991173
------------------------------------------------------------------------------
(est3 stored)
file output/twfe/expat_TFP.pdf saved as PDF format

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1              Number of obs = 12,714

------------------------------------------------------------------------------
         lnQ |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0083372   .0900362     0.09   0.926    -.1681305    .1848049
          -3 |   .0721027   .0779885     0.92   0.355    -.0807521    .2249574
          -2 |   .0252097   .0517392     0.49   0.626    -.0761973    .1266168
          -1 |          0  (omitted)
           0 |    .412708   .0720068     5.73   0.000     .2715773    .5538388
           1 |   .5491588   .0932415     5.89   0.000     .3664088    .7319087
           2 |    .742237   .1127195     6.58   0.000     .5213108    .9631631
           3 |   .8936958   .1267529     7.05   0.000     .6452646    1.142127
           4 |   .8756383    .152775     5.73   0.000     .5762047    1.175072
------------------------------------------------------------------------------
(est4 stored)
file output/twfe/expat_lnQ.pdf saved as PDF format

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1              Number of obs = 12,714

------------------------------------------------------------------------------
export_share |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0385748   .0179584    -2.15   0.032    -.0737727   -.0033769
          -3 |  -.0179039   .0156607    -1.14   0.253    -.0485982    .0127905
          -2 |  -.0099967   .0199459    -0.50   0.616      -.04909    .0290965
          -1 |          0  (omitted)
           0 |   .0225963   .0162315     1.39   0.164    -.0092169    .0544095
           1 |   .0265443   .0205608     1.29   0.197    -.0137542    .0668428
           2 |   .0259403   .0249376     1.04   0.298    -.0229365     .074817
           3 |   .0333787   .0475114     0.70   0.482    -.0597419    .1264993
           4 |   .0862224   .0327952     2.63   0.009      .021945    .1504997
------------------------------------------------------------------------------
(est5 stored)
file output/twfe/expat_export_share.pdf saved as PDF format

. 
. esttab using "output/table/dynamics_coeff.tex", `esttab_options'
(output written to output/table/dynamics_coeff.tex)

. 
. *Figures, tradable/nontradable
. 
. forvalues s = 0/1 {
  2.         eststo clear
  3.         foreach Y in $varlist_rhs {
  4.                 eststo: xt2treatments `Y' if tradable_sector==`s', `xt2tre
> atments_options'
  5.                 e2frame, generate(expat_fig)
  6.                 frame expat_fig: `graph_command'
  7.                 graph export "output/twfe/expat_tradable`s'_`Y'.pdf", repl
> ace
  8.         }
  9. }

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1               Number of obs = 5,417

------------------------------------------------------------------------------
         lnK |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0650451   .1395558     0.47   0.641    -.2084791    .3385694
          -3 |  -.0476466   .1474973    -0.32   0.747    -.3367361    .2414428
          -2 |   .0181458   .1179079     0.15   0.878    -.2129494    .2492411
          -1 |          0  (omitted)
           0 |   .1302682   .0940755     1.38   0.166    -.0541164    .3146528
           1 |   .2789822   .1477518     1.89   0.059     -.010606    .5685704
           2 |   .2643054   .1728961     1.53   0.126    -.0745648    .6031755
           3 |   .2990938   .2101913     1.42   0.155    -.1128735    .7110612
           4 |   .4915959   .2349535     2.09   0.036     .0310954    .9520963
------------------------------------------------------------------------------
(est1 stored)
file output/twfe/expat_tradable0_lnK.pdf saved as PDF format

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1               Number of obs = 5,417

------------------------------------------------------------------------------
         lnL |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0052806   .0949202     0.06   0.956    -.1807595    .1913207
          -3 |  -.0790876    .076644    -1.03   0.302    -.2293071    .0711318
          -2 |   -.078641   .0603924    -1.30   0.193    -.1970079    .0397259
          -1 |          0  (omitted)
           0 |   .1911622   .1060753     1.80   0.072    -.0167416     .399066
           1 |   .2888896   .1478284     1.95   0.051    -.0008488    .5786279
           2 |   .5611465   .1447628     3.88   0.000     .2774166    .8448764
           3 |   .5993523   .1599468     3.75   0.000     .2858623    .9128423
           4 |   .7131761   .1821489     3.92   0.000     .3561709    1.070181
------------------------------------------------------------------------------
(est2 stored)
file output/twfe/expat_tradable0_lnL.pdf saved as PDF format

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1               Number of obs = 5,417

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0662215    .058919     1.12   0.261    -.0492577    .1817006
          -3 |   .0543196   .0616335     0.88   0.378    -.0664799    .1751191
          -2 |   .0596412   .0507546     1.18   0.240    -.0398359    .1591183
          -1 |          0  (omitted)
           0 |   .1985216   .0703287     2.82   0.005     .0606798    .3363634
           1 |   .2537151    .092264     2.75   0.006      .072881    .4345493
           2 |    .277657   .0903721     3.07   0.002     .1005309    .4547831
           3 |   .2664307   .0962001     2.77   0.006     .0778819    .4549795
           4 |   .2479544   .1367855     1.81   0.070    -.0201403    .5160491
------------------------------------------------------------------------------
(est3 stored)
file output/twfe/expat_tradable0_TFP.pdf saved as PDF format

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1               Number of obs = 5,417

------------------------------------------------------------------------------
         lnQ |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .1452909   .1262696     1.15   0.250    -.1021929    .3927747
          -3 |   .0718106   .1591678     0.45   0.652    -.2401525    .3837737
          -2 |   .0589251   .0741168     0.80   0.427    -.0863412    .2041913
          -1 |          0  (omitted)
           0 |   .4561481    .116969     3.90   0.000      .226893    .6854031
           1 |   .6260359   .1542942     4.06   0.000     .3236248    .9284469
           2 |   .9072648   .1919732     4.73   0.000     .5310042    1.283525
           3 |   .9362515   .2211485     4.23   0.000     .5028084    1.369695
           4 |   .9173935   .2841147     3.23   0.001     .3605389    1.474248
------------------------------------------------------------------------------
(est4 stored)
file output/twfe/expat_tradable0_lnQ.pdf saved as PDF format

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1               Number of obs = 5,417

------------------------------------------------------------------------------
export_share |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0174104   .0174195    -1.00   0.318    -.0515521    .0167313
          -3 |    .010804   .0136783     0.79   0.430    -.0160049     .037613
          -2 |  -.0006593   .0075405    -0.09   0.930    -.0154385    .0141198
          -1 |          0  (omitted)
           0 |  -.0287954   .0158337    -1.82   0.069    -.0598288    .0022381
           1 |   -.033664   .0229442    -1.47   0.142    -.0786339    .0113059
           2 |  -.0221141   .0288645    -0.77   0.444    -.0786875    .0344592
           3 |  -.0019806   .0349209    -0.06   0.955    -.0704242     .066463
           4 |   .0078307   .0351329     0.22   0.824    -.0610284    .0766899
------------------------------------------------------------------------------
(est5 stored)
file output/twfe/expat_tradable0_export_share.pdf saved as PDF format

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1               Number of obs = 7,297

------------------------------------------------------------------------------
         lnK |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0518629   .1403817    -0.37   0.712    -.3270059    .2232802
          -3 |  -.0142621    .111979    -0.13   0.899     -.233737    .2052127
          -2 |  -.0613399   .0774442    -0.79   0.428    -.2131277     .090448
          -1 |          0  (omitted)
           0 |    .125102   .0788785     1.59   0.113    -.0294971    .2797011
           1 |   .2004714   .0972223     2.06   0.039     .0099192    .3910236
           2 |   .3026865    .119825     2.53   0.012     .0678337    .5375392
           3 |   .3507705   .1443237     2.43   0.015     .0679012    .6336398
           4 |   .5240501   .1605955     3.26   0.001     .2092888    .8388114
------------------------------------------------------------------------------
(est1 stored)
file output/twfe/expat_tradable1_lnK.pdf saved as PDF format

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1               Number of obs = 7,297

------------------------------------------------------------------------------
         lnL |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0816876   .0962149    -0.85   0.396    -.2702653    .1068901
          -3 |  -.0317017    .081203    -0.39   0.696    -.1908566    .1274532
          -2 |  -.0446562   .0602171    -0.74   0.458    -.1626795    .0733671
          -1 |          0  (omitted)
           0 |   .2601568   .0780822     3.33   0.001     .1071184    .4131952
           1 |    .151206   .0992982     1.52   0.128     -.043415     .345827
           2 |   .2884723   .1117389     2.58   0.010     .0694681    .5074765
           3 |   .2987101   .1337747     2.23   0.026     .0365166    .5609037
           4 |   .2877648   .1569621     1.83   0.067    -.0198753    .5954048
------------------------------------------------------------------------------
(est2 stored)
file output/twfe/expat_tradable1_lnL.pdf saved as PDF format

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1               Number of obs = 7,297

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0070081   .0430195    -0.16   0.871    -.0913248    .0773086
          -3 |     .02331   .0401438     0.58   0.561    -.0553705    .1019905
          -2 |   .0137281   .0368766     0.37   0.710    -.0585487     .086005
          -1 |          0  (omitted)
           0 |   .0255777    .041358     0.62   0.536    -.0554825    .1066378
           1 |   .0595912   .0475775     1.25   0.210    -.0336591    .1528414
           2 |   .0836095   .0521016     1.60   0.109    -.0185077    .1857266
           3 |   .1633437   .0559545     2.92   0.004     .0536749    .2730125
           4 |   .1237524    .061427     2.01   0.044     .0033576    .2441473
------------------------------------------------------------------------------
(est3 stored)
file output/twfe/expat_tradable1_TFP.pdf saved as PDF format

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1               Number of obs = 7,297

------------------------------------------------------------------------------
         lnQ |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0750541    .109393    -0.69   0.493    -.2894605    .1393523
          -3 |   .0828149   .0841764     0.98   0.325    -.0821678    .2477976
          -2 |   .0395658   .0667023     0.59   0.553    -.0911683    .1702999
          -1 |          0  (omitted)
           0 |   .3612752   .0876934     4.12   0.000     .1893993    .5331511
           1 |   .4926036   .1113871     4.42   0.000     .2742889    .7109183
           2 |   .6374397   .1330373     4.79   0.000     .3766913    .8981881
           3 |   .8214004    .147377     5.57   0.000     .5325467    1.110254
           4 |    .838576    .169059     4.96   0.000     .5072265    1.169925
------------------------------------------------------------------------------
(est4 stored)
file output/twfe/expat_tradable1_lnQ.pdf saved as PDF format

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1               Number of obs = 7,297

------------------------------------------------------------------------------
export_share |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0493489   .0258504    -1.91   0.056    -.1000149     .001317
          -3 |  -.0349054   .0227441    -1.53   0.125    -.0794831    .0096723
          -2 |  -.0110359   .0314248    -0.35   0.725    -.0726273    .0505555
          -1 |          0  (omitted)
           0 |   .0454885   .0267404     1.70   0.089    -.0069218    .0978987
           1 |   .0520975   .0318116     1.64   0.101    -.0102521    .1144471
           2 |   .0459241   .0378152     1.21   0.225    -.0281923    .1200405
           3 |   .0423575   .0720713     0.59   0.557    -.0988997    .1836147
           4 |   .1185751   .0494413     2.40   0.016      .021672    .2154782
------------------------------------------------------------------------------
(est5 stored)
file output/twfe/expat_tradable1_export_share.pdf saved as PDF format

. 
. *Figures, export, export entry lnQd
. 
. xt2treatments exporter, `xt2treatments_options'

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1              Number of obs = 12,714

------------------------------------------------------------------------------
    exporter |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0428284   .0338879    -1.26   0.206    -.1092474    .0235906
          -3 |  -.0506561   .0314578    -1.61   0.107    -.1123123        .011
          -2 |  -.0390021   .0255151    -1.53   0.126    -.0890108    .0110065
          -1 |          0  (omitted)
           0 |   .0208763   .0208868     1.00   0.318     -.020061    .0618135
           1 |   .0372795   .0264771     1.41   0.159    -.0146146    .0891737
           2 |   .0541258   .0310806     1.74   0.082    -.0067911    .1150428
           3 |   .0790712   .0331478     2.39   0.017     .0141027    .1440397
           4 |   .0699326   .0372101     1.88   0.060    -.0029979     .142863
------------------------------------------------------------------------------

. e2frame, generate(expat_fig)

. frame expat_fig: `graph_command'

. graph export "output/twfe/expat_exporter.pdf", replace
file output/twfe/expat_exporter.pdf saved as PDF format

. 
. xt2treatments exporter if exporter_pre==0, `xt2treatments_options'

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1               Number of obs = 5,824

------------------------------------------------------------------------------
    exporter |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0032067   .0309436    -0.10   0.917    -.0638551    .0574416
          -3 |   3.45e-18   7.49e-19     4.61   0.000     1.98e-18    4.92e-18
          -2 |   6.06e-18   2.02e-18     3.00   0.003     2.10e-18    1.00e-17
          -1 |          0  (omitted)
           0 |   .1090288   .0319912     3.41   0.001     .0463271    .1717304
           1 |   .1980593   .0394886     5.02   0.000     .1206631    .2754555
           2 |   .2484401    .042384     5.86   0.000      .165369    .3315113
           3 |   .2414153   .0455728     5.30   0.000     .1520943    .3307363
           4 |   .2176558    .050985     4.27   0.000      .117727    .3175846
------------------------------------------------------------------------------

. e2frame, generate(expat_fig)

. frame expat_fig: `graph_command'

. graph export "output/twfe/expat_export_entry.pdf", replace
file output/twfe/expat_export_entry.pdf saved as PDF format

. 
. xt2treatments lnQd if lnQd_exist_post==1, `xt2treatments_options'

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1              Number of obs = 12,466

------------------------------------------------------------------------------
        lnQd |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .2281362     .12066     1.89   0.059    -.0083531    .4646255
          -3 |    .181703    .098061     1.85   0.064    -.0104931    .3738991
          -2 |   .1099496   .0668142     1.65   0.100    -.0210038     .240903
          -1 |          0  (omitted)
           0 |   .3634247   .0856761     4.24   0.000     .1955025    .5313468
           1 |   .4024716   .1090685     3.69   0.000     .1887014    .6162419
           2 |   .6212978   .1264236     4.91   0.000     .3735121    .8690835
           3 |   .6562438   .1535249     4.27   0.000     .3553405    .9571471
           4 |   .5160777   .1809437     2.85   0.004     .1614345    .8707209
------------------------------------------------------------------------------

. e2frame, generate(expat_fig)

. frame expat_fig: `graph_command'

. graph export "output/twfe/expat_lnQd.pdf", replace
file output/twfe/expat_lnQd.pdf saved as PDF format

. 
. forvalues i = 0/1 {
  2.         xt2treatments exporter if tradable_sector==`i', `xt2treatments_opt
> ions'
  3.         e2frame, generate(expat_fig)
  4.         frame expat_fig: `graph_command'
  5.         graph export "output/twfe/expat_tradable`i'_exporter.pdf", replace
  6. 
.         xt2treatments exporter if exporter_pre==0 & tradable_sector==`i', `xt
> 2treatments_options'
  7.         e2frame, generate(expat_fig)
  8.         frame expat_fig: `graph_command'
  9.         graph export "output/twfe/expat_tradable`i'_export_entry.pdf", rep
> lace
 10. 
.         xt2treatments lnQd if lnQd_exist_post==1 & tradable_sector==`i', `xt2
> treatments_options'
 11.         e2frame, generate(expat_fig)
 12.         frame expat_fig: `graph_command'
 13.         graph export "output/twfe/expat_tradable`i'_lnQd.pdf", replace
 14. }

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1               Number of obs = 5,417

------------------------------------------------------------------------------
    exporter |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0250955   .0427883    -0.59   0.558    -.1089589     .058768
          -3 |  -.1094169   .0529285    -2.07   0.039    -.2131549   -.0056789
          -2 |  -.0364793   .0379626    -0.96   0.337    -.1108847    .0379261
          -1 |          0  (omitted)
           0 |  -.0415897   .0379216    -1.10   0.273    -.1159146    .0327353
           1 |   .0013723   .0470519     0.03   0.977    -.0908478    .0935924
           2 |   .0713398   .0580866     1.23   0.219    -.0425079    .1851874
           3 |   .0639072   .0683231     0.94   0.350    -.0700036     .197818
           4 |   .0335631   .0680767     0.49   0.622    -.0998648     .166991
------------------------------------------------------------------------------
file output/twfe/expat_tradable0_exporter.pdf saved as PDF format

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1               Number of obs = 3,135

------------------------------------------------------------------------------
    exporter |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0146584   .0230347    -0.64   0.525    -.0598055    .0304887
          -3 |   1.35e-17   6.10e-18     2.21   0.027     1.51e-18    2.54e-17
          -2 |   4.51e-18   3.70e-18     1.22   0.223    -2.74e-18    1.18e-17
          -1 |          0  (omitted)
           0 |   .0659469   .0409721     1.61   0.107     -.014357    .1462507
           1 |   .1779969   .0551351     3.23   0.001      .069934    .2860598
           2 |   .3269764   .0556036     5.88   0.000     .2179954    .4359574
           3 |   .3692142    .054204     6.81   0.000     .2629763    .4754521
           4 |   .2709877   .0600315     4.51   0.000     .1533281    .3886472
------------------------------------------------------------------------------
file output/twfe/expat_tradable0_export_entry.pdf saved as PDF format

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1               Number of obs = 5,371

------------------------------------------------------------------------------
        lnQd |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .1564949   .1452885     1.08   0.281    -.1282653    .4412551
          -3 |   .0257832   .1572633     0.16   0.870    -.2824473    .3340136
          -2 |   .0493869   .0766676     0.64   0.519    -.1008788    .1996525
          -1 |          0  (omitted)
           0 |   .4602809   .1497869     3.07   0.002      .166704    .7538577
           1 |   .6121327   .1801013     3.40   0.001     .2591406    .9651247
           2 |   .8042058   .2187178     3.68   0.000     .3755269    1.232885
           3 |   .7096152   .2841373     2.50   0.013     .1527163    1.266514
           4 |   .5640163   .3336054     1.69   0.091    -.0898383    1.217871
------------------------------------------------------------------------------
file output/twfe/expat_tradable0_lnQd.pdf saved as PDF format

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1               Number of obs = 7,297

------------------------------------------------------------------------------
    exporter |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0463342   .0433546    -1.07   0.285    -.1313077    .0386393
          -3 |  -.0155586   .0381841    -0.41   0.684    -.0903981    .0592809
          -2 |  -.0349485   .0318016    -1.10   0.272    -.0972784    .0273814
          -1 |          0  (omitted)
           0 |   .0484353    .026038     1.86   0.063    -.0025983    .0994689
           1 |   .0578648   .0321018     1.80   0.071    -.0050536    .1207832
           2 |   .0436123    .037549     1.16   0.245    -.0299824     .117207
           3 |   .0796001   .0386471     2.06   0.039     .0038532     .155347
           4 |   .0948767   .0439058     2.16   0.031      .008823    .1809304
------------------------------------------------------------------------------
file output/twfe/expat_tradable1_exporter.pdf saved as PDF format

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1               Number of obs = 2,679

------------------------------------------------------------------------------
    exporter |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |    .013128   .0474991     0.28   0.782    -.0799686    .1062245
          -3 |   1.09e-17   6.27e-18     1.74   0.081    -1.36e-18    2.32e-17
          -2 |   3.26e-18   8.81e-19     3.70   0.000     1.53e-18    4.98e-18
          -1 |          0  (omitted)
           0 |   .1155666   .0465772     2.48   0.013     .0242769    .2068563
           1 |   .1859366    .049229     3.78   0.000     .0894496    .2824237
           2 |   .1875716   .0573881     3.27   0.001      .075093    .3000502
           3 |   .1324603   .0580496     2.28   0.022      .018685    .2462355
           4 |   .1626653   .0627763     2.59   0.010     .0396259    .2857047
------------------------------------------------------------------------------
file output/twfe/expat_tradable1_export_entry.pdf saved as PDF format

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1               Number of obs = 7,095

------------------------------------------------------------------------------
        lnQd |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .2409057   .1560031     1.54   0.123    -.0648547     .546666
          -3 |   .2676657    .117646     2.28   0.023     .0370839    .4982476
          -2 |   .1803152    .090901     1.98   0.047     .0021527    .3584778
          -1 |          0  (omitted)
           0 |   .3167213   .1057098     3.00   0.003     .1095339    .5239086
           1 |   .3211386   .1329183     2.42   0.016     .0606236    .5816536
           2 |   .5446515   .1506853     3.61   0.000     .2493136    .8399893
           3 |   .6268941   .1740794     3.60   0.000     .2857048    .9680834
           4 |   .5062333    .204338     2.48   0.013     .1057382    .9067285
------------------------------------------------------------------------------
file output/twfe/expat_tradable1_lnQd.pdf saved as PDF format

. 
end of do-file
