
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/create/firm_panel.do 

. *Betöltés
. set more off

. clear all

. capture log close

. 
. * find root folder
. here
/Users/koren/Tresorit/Mac/projects/expat/

. local here = r(here)

. 
. log using "`here'/output/firm_panel", text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/firm_panel.log
  log type:  text
 opened on:  21 Mar 2024, 16:18:14

. 
. * keep only sample from balance-small
. use "`here'/temp/balance-small-clean.dta"

. by frame_id_numeric: egen firm_birth = min(year)

. by frame_id_numeric: egen firm_death = max(year)

. keep frame_id year firm_birth firm_death foreign

. tempfile sample

. save `sample', replace
(file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St56317.000001 not
    found)
file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St56317.000001 saved
    as .dta format

. 
. use "`here'/temp/ceo-panel.dta", clear 

. 
. * only keep sample firms
. merge m:1 frame_id_numeric year using `sample', keep(match) nogen
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           523,664  
    -----------------------------------------

. count if first_year_of_firm == firm_birth
  303,753

. 
. *for descriptives (number of ceo-s and nceo-s in original data, number of ceo
>  and nceo job-spells in original data)
. count
  523,664

. egen company_manager_id = group(frame_id_numeric manager_id)

. codebook manager_id

-------------------------------------------------------------------------------
manager_id                                                    group(manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [2,1607091]                   Units: 1
         Unique values: 85,185                    Missing .: 0/523,664

                  Mean: 844071
             Std. dev.: 421869

           Percentiles:    10%       25%       50%       75%       90%
                        221200    583169    834510   1.2e+06   1.4e+06

. codebook company_manager_id

-------------------------------------------------------------------------------
company_manager_id                           group(frame_id_numeric manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [1,97522]                     Units: 1
         Unique values: 97,522                    Missing .: 0/523,664

                  Mean: 43370.4
             Std. dev.: 26392.3

           Percentiles:     10%       25%       50%       75%       90%
                           7995     21073   42363.5     63591     80107

. 
. * balance panel
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. by company_manager_id: generate gap = year - year[_n-1] - 1
(97,522 missing values generated)

. replace gap = 0 if missing(gap)
(97,522 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    516,986       98.72       98.72
          1 |      3,478        0.66       99.39
          2 |      1,024        0.20       99.58
          3 |        647        0.12       99.71
          4 |        394        0.08       99.78
          5 |        318        0.06       99.84
          6 |        212        0.04       99.88
          7 |        144        0.03       99.91
          8 |        117        0.02       99.93
          9 |        102        0.02       99.95
         10 |         55        0.01       99.96
         11 |         40        0.01       99.97
         12 |         31        0.01       99.98
         13 |         26        0.00       99.98
         14 |         19        0.00       99.99
         15 |         18        0.00       99.99
         16 |         14        0.00       99.99
         17 |          9        0.00       99.99
         18 |          5        0.00      100.00
         19 |          5        0.00      100.00
         20 |          7        0.00      100.00
         21 |          6        0.00      100.00
         22 |          2        0.00      100.00
         23 |          2        0.00      100.00
         25 |          3        0.00      100.00
------------+-----------------------------------
      Total |    523,664      100.00

. 
. * fill in holes of 1 year, but not longer
. expand 1 + (gap == 1), generate(filled_in)
(3,478 observations created)

. replace year = year - 1 if filled_in
(3,478 real changes made)

. 
. * create contiguous spells
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. gen change = ceo != L.ceo

. bysort company_manager_id (year): gen job_spell = sum(change)

. 
. * create job begin and end for each manager spell
. bys frame_id_numeric manager_id job_spell: egen job_begin = min(year)

. bys frame_id_numeric manager_id job_spell: egen job_end = max(year)

. keep frame_id_numeric manager_id job_spell year job_begin job_end expat firm_
> birth foreign

. 
. * if first managers arrive in year 1, extrapolate to year 0 - DROP SPELL
. bys frame_id_numeric: egen first_cohort = min(job_begin)

. replace job_begin = job_begin - 1 if (first_cohort == firm_birth + 1) & (job_
> begin == first_cohort)
(61,475 real changes made)

. 
. * NOTE: no collapse and expand --> there might be holes
. sort frame_id_numeric manager_id year

. count if frame_id_numeric == frame_id_numeric[_n-1] & manager_id == manager_i
> d[_n-1] & year != (year[_n-1] + 1)
  3,200

. 
. * expat before 1990 are mostly error, convert them to locals
. replace expat = 0 if job_begin < 1990
(741 real changes made)

. 
. ***********************
. * time invariant vars and drop entire series of firms from sample *
. ***********************
. by frame_id_numeric: egen first_year_expat = min(cond(expat == 1, job_begin,.
> ))
(396,894 missing values generated)

. by frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.)
> )
(366,062 missing values generated)

. 
. * which of the two happened first?
. generate manager_after_owner = first_year_expat - first_year_foreign
(409,241 missing values generated)

. tabulate manager_after_owner

manager_aft |
   er_owner |      Freq.     Percent        Cum.
------------+-----------------------------------
        -25 |         61        0.05        0.05
        -22 |         45        0.04        0.09
        -18 |         41        0.03        0.12
        -16 |         33        0.03        0.15
        -15 |         81        0.07        0.22
        -13 |        202        0.17        0.39
        -12 |         84        0.07        0.46
        -11 |         47        0.04        0.50
        -10 |        110        0.09        0.60
         -9 |        212        0.18        0.78
         -8 |        510        0.43        1.21
         -7 |        277        0.23        1.44
         -6 |        622        0.53        1.97
         -5 |        272        0.23        2.20
         -4 |        373        0.32        2.52
         -3 |        973        0.83        3.34
         -2 |      1,274        1.08        4.42
         -1 |     16,199       13.74       18.16
          0 |     61,587       52.24       70.40
          1 |      9,442        8.01       78.41
          2 |      3,558        3.02       81.43
          3 |      3,120        2.65       84.07
          4 |      2,707        2.30       86.37
          5 |      1,996        1.69       88.06
          6 |      2,168        1.84       89.90
          7 |      1,465        1.24       91.14
          8 |      1,301        1.10       92.25
          9 |      1,457        1.24       93.48
         10 |      1,260        1.07       94.55
         11 |        896        0.76       95.31
         12 |        973        0.83       96.14
         13 |        529        0.45       96.59
         14 |        714        0.61       97.19
         15 |        472        0.40       97.59
         16 |        384        0.33       97.92
         17 |        584        0.50       98.41
         18 |        510        0.43       98.84
         19 |        367        0.31       99.16
         20 |         28        0.02       99.18
         21 |        219        0.19       99.37
         22 |        116        0.10       99.46
         23 |         94        0.08       99.54
         24 |        199        0.17       99.71
         25 |         37        0.03       99.74
         26 |        233        0.20       99.94
         27 |         28        0.02       99.97
         28 |         41        0.03      100.00
------------+-----------------------------------
      Total |    117,901      100.00

. * event time relative to that
. generate event_time = year - first_year_expat
(396,894 missing values generated)

. 
. * if foreign manager arrives up to X years before or Y years later than forei
> gn owner, use foreign manager as arrival date. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(180 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(184 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(421 real changes made)

. 
. * drop firms where expat arrives earlier than X years before owner
. drop if manager_after_owner < -2
(3,943 observations deleted)

. 
. * ever expat and foreign created after foreign changes (drops were firm level
>  before so should not mess with ever variables)
. foreach X of var expat foreign {
  2.         by frame_id_numeric: egen ever_`X' = max(`X'==1)
  3. }

. 
. * drop if there was an expat but was never foreign - these are likely error
. drop if ever_expat == 1 & ever_foreign == 0
(12,350 observations deleted)

. 
. * drop too many CEO-s
. egen fp_tag = tag(frame_id_numeric manager_id) 

. by frame_id_numeric: egen n_ceo_ever = sum(fp_tag)

. drop if n_ceo > 15
(18,287 observations deleted)

. drop fp_tag n_ceo_ever

.         
. * hired or fired ceo since last observed year of firm
. tempvar previous_year

. generate previous_year = .
(492,562 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `previous_year' = max(cond(year 
> < `t', year, .))
  3.         quietly replace previous_year = `previous_year' if year == `t'
  4.         drop `previous_year'
  5. }

. 
. tempvar next_year

. generate next_year = .
(492,562 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `next_year' = min(cond(year > `t
> ', year, .))
  3.         quietly replace next_year = `next_year' if year == `t'
  4.         drop `next_year'
  5. }

. 
. generate byte hire = (job_begin <= year) & (job_begin > previous_year) & !mis
> sing(previous_year)

. generate byte fire = (job_end >= year) & (job_end < next_year) & !missing(nex
> t_year)

. tabulate hire fire 

           |         fire
      hire |         0          1 |     Total
-----------+----------------------+----------
         0 |   412,839     35,917 |   448,756 
         1 |    37,618      6,188 |    43,806 
-----------+----------------------+----------
     Total |   450,457     42,105 |   492,562 

. 
. * number of expats and locals
. bys frame_id_numeric year: egen n_expat_ceo = total(cond(expat, 1, 0))

. bys frame_id_numeric year: egen n_local_ceo = total(cond(!expat, 1, 0))

. 
. * create firm-year data
. collapse (firstnm) n_expat_ceo n_local_ceo foreign ever_expat ever_foreign (c
> ount) n_ceo = expat (max) hire_ceo = hire fire_ceo = fire, by(frame_id_numeri
> c year)

. 
. * if there is a change in the ceo team, hiring, increement the spell counter
. bys frame_id_numeric (year): gen ceo_spell = sum(hire_ceo) + 1 // so that ind
> ex start from 1

. 
. tabulate n_expat_ceo n_local_ceo

 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         0          1          2          3          4 |     Total
-----------+-------------------------------------------------------+----------
         0 |         0    218,441     62,952     16,208      3,053 |   302,951 
         1 |    14,639      9,632      1,685        318         71 |    26,374 
         2 |     6,158      2,545        425         96         19 |     9,247 
         3 |     1,701        495        128         33         16 |     2,373 
         4 |       435         97         13          1          0 |       548 
         5 |        94         39          0          1          0 |       134 
         6 |        51          6          1          0          0 |        58 
         7 |         5          0          0          0          0 |         5 
-----------+-------------------------------------------------------+----------
     Total |    23,083    231,255     65,204     16,657      3,159 |   341,690 


 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         5          6          7          8          9 |     Total
-----------+-------------------------------------------------------+----------
         0 |     1,544        373        247         53         65 |   302,951 
         1 |        16          8          2          2          1 |    26,374 
         2 |         3          1          0          0          0 |     9,247 
         3 |         0          0          0          0          0 |     2,373 
         4 |         2          0          0          0          0 |       548 
         5 |         0          0          0          0          0 |       134 
         6 |         0          0          0          0          0 |        58 
         7 |         0          0          0          0          0 |         5 
-----------+-------------------------------------------------------+----------
     Total |     1,565        382        249         55         66 |   341,690 


 (firstnm) |
n_expat_ce |      (firstnm) n_local_ceo
         o |        10         11         12 |     Total
-----------+---------------------------------+----------
         0 |         3          8          4 |   302,951 
         1 |         0          0          0 |    26,374 
         2 |         0          0          0 |     9,247 
         3 |         0          0          0 |     2,373 
         4 |         0          0          0 |       548 
         5 |         0          0          0 |       134 
         6 |         0          0          0 |        58 
         7 |         0          0          0 |         5 
-----------+---------------------------------+----------
     Total |         3          8          4 |   341,690 

. * create dummies from numbers
. foreach var in expat local {
  2.         gen has_`var'_ceo = (n_`var'_ceo > 0) & !missing(n_`var'_ceo)
  3. }

.         
. count
  341,690

. compress
  variable year was float now int
  variable n_expat_ceo was float now byte
  variable n_local_ceo was float now byte
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable n_ceo was long now byte
  variable ceo_spell was float now byte
  variable has_expat_ceo was float now byte
  variable has_local_ceo was float now byte
  (8,883,940 bytes saved)

. save "`here'/temp/firm_events.dta", replace
file /Users/koren/Tresorit/Mac/projects/expat//temp/firm_events.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/firm_panel.log
  log type:  text
 closed on:  21 Mar 2024, 16:18:42
-------------------------------------------------------------------------------

. 
end of do-file
