
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklós Koren
               Central European University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/create/firm_panel.do 

. *Betöltés
. set more off

. clear all

. capture log close

. 
. * find root folder
. here
/Users/koren/Tresorit/Mac2Mac/projects/expat/

. local here = r(here)

. 
. log using "`here'/output/firm_panel", text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/firm_panel.lo
> g
  log type:  text
 opened on:  19 Mar 2024, 19:38:50

. 
. * keep only sample from balance-small
. use "`here'/temp/balance-small-clean.dta"

. by frame_id_numeric: egen firm_birth = min(year)

. by frame_id_numeric: egen firm_death = max(year)

. keep frame_id year firm_birth firm_death foreign

. tempfile sample

. save `sample', replace
(file /var/folders/5z/21k9mmsd55d1w5_jl5n192sh0000gn/T//St53397.000001 not
    found)
file /var/folders/5z/21k9mmsd55d1w5_jl5n192sh0000gn/T//St53397.000001 saved
    as .dta format

. 
. use "`here'/temp/ceo-panel.dta", clear 

. 
. * only keep sample firms
. merge m:1 frame_id_numeric year using `sample', keep(match) nogen
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           523,671  
    -----------------------------------------

. count if first_year_of_firm == firm_birth
  303,753

. 
. *for descriptives (number of ceo-s and nceo-s in original data, number of ceo
>  and nceo job-spells in original data)
. count
  523,671

. egen company_manager_id = group(frame_id_numeric manager_id)

. codebook manager_id

-------------------------------------------------------------------------------
manager_id                                                    group(manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [3,1544329]                   Units: 1
         Unique values: 84,081                    Missing .: 0/523,671

                  Mean: 787838
             Std. dev.: 411054

           Percentiles:    10%       25%       50%       75%       90%
                        186171    520405    771748   1.1e+06   1.4e+06

. codebook company_manager_id

-------------------------------------------------------------------------------
company_manager_id                           group(frame_id_numeric manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [1,97524]                     Units: 1
         Unique values: 97,524                    Missing .: 0/523,671

                  Mean: 43371.6
             Std. dev.: 26392.9

           Percentiles:     10%       25%       50%       75%       90%
                           7995     21074     42365     63593     80108

. 
. * balance panel
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. by company_manager_id: generate gap = year - year[_n-1] - 1
(97,524 missing values generated)

. replace gap = 0 if missing(gap)
(97,524 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    516,993       98.72       98.72
          1 |      3,479        0.66       99.39
          2 |      1,023        0.20       99.58
          3 |        647        0.12       99.71
          4 |        394        0.08       99.78
          5 |        318        0.06       99.84
          6 |        212        0.04       99.88
          7 |        144        0.03       99.91
          8 |        117        0.02       99.93
          9 |        102        0.02       99.95
         10 |         55        0.01       99.96
         11 |         40        0.01       99.97
         12 |         31        0.01       99.98
         13 |         26        0.00       99.98
         14 |         19        0.00       99.99
         15 |         18        0.00       99.99
         16 |         14        0.00       99.99
         17 |          9        0.00       99.99
         18 |          5        0.00      100.00
         19 |          5        0.00      100.00
         20 |          7        0.00      100.00
         21 |          6        0.00      100.00
         22 |          2        0.00      100.00
         23 |          2        0.00      100.00
         25 |          3        0.00      100.00
------------+-----------------------------------
      Total |    523,671      100.00

. 
. * fill in holes of 1 year, but not longer
. expand 1 + (gap == 1), generate(filled_in)
(3,479 observations created)

. replace year = year - 1 if filled_in
(3,479 real changes made)

. 
. * create contiguous spells
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. gen change = ceo != L.ceo

. bysort company_manager_id (year): gen job_spell = sum(change)

. 
. * create job begin and end for each manager spell
. bys frame_id_numeric manager_id job_spell: egen job_begin = min(year)

. bys frame_id_numeric manager_id job_spell: egen job_end = max(year)

. keep frame_id_numeric manager_id job_spell year job_begin job_end expat firm_
> birth foreign

. 
. * if first managers arrive in year 1, extrapolate to year 0 - DROP SPELL
. bys frame_id_numeric: egen first_cohort = min(job_begin)

. replace job_begin = job_begin - 1 if (first_cohort == firm_birth + 1) & (job_
> begin == first_cohort)
(61,477 real changes made)

. 
. * NOTE: no collapse and expand --> there might be holes
. sort frame_id_numeric manager_id year

. count if frame_id_numeric == frame_id_numeric[_n-1] & manager_id == manager_i
> d[_n-1] & year != (year[_n-1] + 1)
  3,199

. 
. * expat before 1990 are mostly error, convert them to locals
. replace expat = 0 if job_begin < 1990
(11,613 real changes made)

. 
. ***********************
. * time invariant vars and drop entire series of firms from sample *
. ***********************
. by frame_id_numeric: egen first_year_expat = min(cond(expat == 1, job_begin,.
> ))
(306,922 missing values generated)

. by frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.)
> )
(366,062 missing values generated)

. 
. * which of the two happened first?
. generate manager_after_owner = first_year_expat - first_year_foreign
(393,470 missing values generated)

. tabulate manager_after_owner

manager_aft |
   er_owner |      Freq.     Percent        Cum.
------------+-----------------------------------
        -27 |        122        0.09        0.09
        -26 |        110        0.08        0.17
        -25 |         99        0.07        0.25
        -23 |        109        0.08        0.33
        -22 |        200        0.15        0.48
        -21 |         78        0.06        0.54
        -20 |        106        0.08        0.62
        -19 |        552        0.41        1.03
        -18 |        209        0.16        1.19
        -17 |        276        0.21        1.39
        -16 |        596        0.45        1.84
        -15 |        610        0.46        2.29
        -14 |        292        0.22        2.51
        -13 |        779        0.58        3.10
        -12 |        301        0.23        3.32
        -11 |        653        0.49        3.81
        -10 |        601        0.45        4.26
         -9 |        608        0.45        4.71
         -8 |        565        0.42        5.14
         -7 |        780        0.58        5.72
         -6 |      1,050        0.79        6.51
         -5 |      1,142        0.85        7.36
         -4 |      1,823        1.36        8.72
         -3 |      2,129        1.59       10.32
         -2 |      2,987        2.23       12.55
         -1 |     20,522       15.35       27.90
          0 |     68,703       51.39       79.30
          1 |      7,967        5.96       85.26
          2 |      2,941        2.20       87.46
          3 |      2,277        1.70       89.16
          4 |      1,926        1.44       90.60
          5 |      1,613        1.21       91.81
          6 |      1,566        1.17       92.98
          7 |        852        0.64       93.61
          8 |      1,303        0.97       94.59
          9 |      1,107        0.83       95.42
         10 |      1,039        0.78       96.19
         11 |        775        0.58       96.77
         12 |        624        0.47       97.24
         13 |        618        0.46       97.70
         14 |        443        0.33       98.03
         15 |        211        0.16       98.19
         16 |        385        0.29       98.48
         17 |        525        0.39       98.87
         18 |        418        0.31       99.19
         19 |        263        0.20       99.38
         21 |         95        0.07       99.45
         22 |         95        0.07       99.52
         23 |        128        0.10       99.62
         24 |        140        0.10       99.73
         25 |         65        0.05       99.77
         26 |        233        0.17       99.95
         27 |         28        0.02       99.97
         28 |         41        0.03      100.00
------------+-----------------------------------
      Total |    133,680      100.00

. * event time relative to that
. generate event_time = year - first_year_expat
(306,922 missing values generated)

. 
. * if foreign manager arrives up to X years before or Y years later than forei
> gn owner, use foreign manager as arrival date. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(347 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(322 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(353 real changes made)

. 
. * drop firms where expat arrives earlier than X years before owner
. drop if manager_after_owner < -2
(13,790 observations deleted)

. 
. * ever expat and foreign created after foreign changes (drops were firm level
>  before so should not mess with ever variables)
. foreach X of var expat foreign {
  2.         by frame_id_numeric: egen ever_`X' = max(`X'==1)
  3. }

. 
. * drop if there was an expat but was never foreign - these are likely error
. drop if ever_expat == 1 & ever_foreign == 0
(86,556 observations deleted)

. 
. * drop too many CEO-s
. egen fp_tag = tag(frame_id_numeric manager_id) 

. by frame_id_numeric: egen n_ceo_ever = sum(fp_tag)

. drop if n_ceo > 15
(14,904 observations deleted)

. drop fp_tag n_ceo_ever

.         
. * hired or fired ceo since last observed year of firm
. tempvar previous_year

. generate previous_year = .
(411,900 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `previous_year' = max(cond(year 
> < `t', year, .))
  3.         quietly replace previous_year = `previous_year' if year == `t'
  4.         drop `previous_year'
  5. }

. 
. tempvar next_year

. generate next_year = .
(411,900 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `next_year' = min(cond(year > `t
> ', year, .))
  3.         quietly replace next_year = `next_year' if year == `t'
  4.         drop `next_year'
  5. }

. 
. generate byte hire = (job_begin <= year) & (job_begin > previous_year) & !mis
> sing(previous_year)

. generate byte fire = (job_end >= year) & (job_end < next_year) & !missing(nex
> t_year)

. tabulate hire fire 

           |         fire
      hire |         0          1 |     Total
-----------+----------------------+----------
         0 |   349,445     27,952 |   377,397 
         1 |    29,783      4,720 |    34,503 
-----------+----------------------+----------
     Total |   379,228     32,672 |   411,900 

. 
. * number of expats and locals
. bys frame_id_numeric year: egen n_expat_ceo = total(cond(expat, 1, 0))

. bys frame_id_numeric year: egen n_local_ceo = total(cond(!expat, 1, 0))

. 
. * create firm-year data
. collapse (firstnm) n_expat_ceo n_local_ceo foreign ever_expat ever_foreign (c
> ount) n_ceo = expat (max) hire_ceo = hire fire_ceo = fire, by(frame_id_numeri
> c year)

. 
. * if there is a change in the ceo team, hiring or firing, increement the spel
> l counter
. bys frame_id_numeric (year): gen ceo_spell = sum(hire_ceo | fire_ceo) + 1 // 
> so that index start from 1

. 
. tabulate n_expat_ceo n_local_ceo

 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         0          1          2          3          4 |     Total
-----------+-------------------------------------------------------+----------
         0 |         0    179,502     49,970     11,238      1,894 |   244,215 
         1 |    17,602      9,542      1,496        282         55 |    28,992 
         2 |     7,674      2,555        388         71         25 |    10,720 
         3 |     2,226        530        106         20         15 |     2,898 
         4 |       586        134         23          6          1 |       751 
         5 |       150         39          2          1          0 |       193 
         6 |        72          7          1          0          0 |        80 
         7 |         5          0          0          0          0 |         5 
         9 |         2          0          0          0          0 |         2 
-----------+-------------------------------------------------------+----------
     Total |    28,317    192,309     51,986     11,618      1,990 |   287,856 


 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         5          6          7          8          9 |     Total
-----------+-------------------------------------------------------+----------
         0 |     1,099        241        177         22         58 |   244,215 
         1 |         8          3          1          3          0 |    28,992 
         2 |         4          3          0          0          0 |    10,720 
         3 |         1          0          0          0          0 |     2,898 
         4 |         0          1          0          0          0 |       751 
         5 |         0          1          0          0          0 |       193 
         6 |         0          0          0          0          0 |        80 
         7 |         0          0          0          0          0 |         5 
         9 |         0          0          0          0          0 |         2 
-----------+-------------------------------------------------------+----------
     Total |     1,112        249        178         25         58 |   287,856 


 (firstnm) |
n_expat_ce |      (firstnm) n_local_ceo
         o |        10         11         12 |     Total
-----------+---------------------------------+----------
         0 |         3          7          4 |   244,215 
         1 |         0          0          0 |    28,992 
         2 |         0          0          0 |    10,720 
         3 |         0          0          0 |     2,898 
         4 |         0          0          0 |       751 
         5 |         0          0          0 |       193 
         6 |         0          0          0 |        80 
         7 |         0          0          0 |         5 
         9 |         0          0          0 |         2 
-----------+---------------------------------+----------
     Total |         3          7          4 |   287,856 

. * create dummies from numbers
. foreach var in expat local {
  2.         gen has_`var'_ceo = (n_`var'_ceo > 0) & !missing(n_`var'_ceo)
  3. }

.         
. count
  287,856

. compress
  variable year was float now int
  variable n_expat_ceo was float now byte
  variable n_local_ceo was float now byte
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable n_ceo was long now byte
  variable ceo_spell was float now byte
  variable has_expat_ceo was float now byte
  variable has_local_ceo was float now byte
  (7,484,256 bytes saved)

. save "`here'/temp/firm_events.dta", replace
file /Users/koren/Tresorit/Mac2Mac/projects/expat//temp/firm_events.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/firm_panel.lo
> g
  log type:  text
 closed on:  19 Mar 2024, 19:39:15
-------------------------------------------------------------------------------

. 
end of do-file
