
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklós Koren
               Central European University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/create/firm_panel.do 

. *Betöltés
. set more off

. clear all

. capture log close

. 
. * find root folder
. here
/Users/koren/Tresorit/Mac2Mac/projects/expat/

. local here = r(here)

. 
. log using "`here'/output/firm_panel", text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/firm_panel.lo
> g
  log type:  text
 opened on:  19 Mar 2024, 18:34:02

. 
. * keep only sample from balance-small
. use "`here'/temp/balance-small-clean.dta"

. by frame_id_numeric: egen firm_birth = min(year)

. by frame_id_numeric: egen firm_death = max(year)

. keep frame_id year firm_birth firm_death foreign

. tempfile sample

. save `sample', replace
(file /var/folders/5z/21k9mmsd55d1w5_jl5n192sh0000gn/T//St33369.000001 not
    found)
file /var/folders/5z/21k9mmsd55d1w5_jl5n192sh0000gn/T//St33369.000001 saved
    as .dta format

. 
. use "`here'/temp/ceo-panel.dta", clear 

. 
. * only keep sample firms
. merge m:1 frame_id_numeric year using `sample', keep(match) nogen
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            89,946  
    -----------------------------------------

. count if first_year_of_firm == firm_birth
  43,259

. 
. *for descriptives (number of ceo-s and nceo-s in original data, number of ceo
>  and nceo job-spells in original data)
. count
  89,946

. egen company_manager_id = group(frame_id_numeric manager_id)

. codebook manager_id

-------------------------------------------------------------------------------
manager_id                                                    group(manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [143,1543909]                 Units: 1
         Unique values: 17,131                    Missing .: 0/89,946

                  Mean: 649178
             Std. dev.: 445004

           Percentiles:    10%       25%       50%       75%       90%
                         75114    255174    621613   1.0e+06   1.3e+06

. codebook company_manager_id

-------------------------------------------------------------------------------
company_manager_id                           group(frame_id_numeric manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [1,18642]                     Units: 1
         Unique values: 18,642                    Missing .: 0/89,946

                  Mean: 8767.54
             Std. dev.: 5154.15

           Percentiles:     10%       25%       50%       75%       90%
                           1829      4288    8709.5     13030     15974

. 
. * balance panel
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. by company_manager_id: generate gap = year - year[_n-1] - 1
(18,642 missing values generated)

. replace gap = 0 if missing(gap)
(18,642 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     88,590       98.49       98.49
          1 |        668        0.74       99.24
          2 |        247        0.27       99.51
          3 |        133        0.15       99.66
          4 |         72        0.08       99.74
          5 |         62        0.07       99.81
          6 |         41        0.05       99.85
          7 |         32        0.04       99.89
          8 |         20        0.02       99.91
          9 |         28        0.03       99.94
         10 |         10        0.01       99.95
         11 |         12        0.01       99.97
         12 |          5        0.01       99.97
         13 |          2        0.00       99.97
         14 |          7        0.01       99.98
         15 |          2        0.00       99.98
         16 |          3        0.00       99.99
         17 |          3        0.00       99.99
         18 |          1        0.00       99.99
         19 |          1        0.00       99.99
         20 |          3        0.00      100.00
         21 |          3        0.00      100.00
         23 |          1        0.00      100.00
------------+-----------------------------------
      Total |     89,946      100.00

. 
. * fill in holes of 1 year, but not longer
. expand 1 + (gap == 1), generate(filled_in)
(668 observations created)

. replace year = year - 1 if filled_in
(668 real changes made)

. 
. * create contiguous spells
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. gen change = ceo != L.ceo

. bysort company_manager_id (year): gen job_spell = sum(change)

. 
. * create job begin and end for each manager spell
. bys frame_id_numeric manager_id job_spell: egen job_begin = min(year)

. bys frame_id_numeric manager_id job_spell: egen job_end = max(year)

. keep frame_id_numeric manager_id job_spell year job_begin job_end expat firm_
> birth foreign

. 
. * if first managers arrive in year 1, extrapolate to year 0 - DROP SPELL
. bys frame_id_numeric: egen first_cohort = min(job_begin)

. replace job_begin = job_begin - 1 if (first_cohort == firm_birth + 1) & (job_
> begin == first_cohort)
(11,450 real changes made)

. 
. * NOTE: no collapse and expand --> there might be holes
. sort frame_id_numeric manager_id year

. count if frame_id_numeric == frame_id_numeric[_n-1] & manager_id == manager_i
> d[_n-1] & year != (year[_n-1] + 1)
  688

. 
. * expat before 1990 are mostly error, convert them to locals
. replace expat = 0 if job_begin < 1990
(1,080 real changes made)

. 
. ***********************
. * time invariant vars and drop entire series of firms from sample *
. ***********************
. by frame_id_numeric: egen first_year_expat = min(cond(expat == 1, job_begin,.
> ))
(18,106 missing values generated)

. by frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.)
> )
(917 missing values generated)

. 
. * which of the two happened first?
. generate manager_after_owner = first_year_expat - first_year_foreign
(18,465 missing values generated)

. tabulate manager_after_owner

manager_aft |
   er_owner |      Freq.     Percent        Cum.
------------+-----------------------------------
        -27 |        122        0.17        0.17
        -26 |        110        0.15        0.32
        -25 |         99        0.14        0.46
        -23 |        109        0.15        0.61
        -22 |        200        0.28        0.89
        -21 |         78        0.11        1.00
        -20 |        106        0.15        1.14
        -19 |        552        0.77        1.91
        -18 |        209        0.29        2.20
        -17 |        276        0.38        2.58
        -16 |        596        0.83        3.41
        -15 |        610        0.85        4.25
        -14 |        292        0.40        4.66
        -13 |        779        1.08        5.74
        -12 |        301        0.42        6.15
        -11 |        653        0.91        7.06
        -10 |        601        0.83        7.89
         -9 |        608        0.84        8.73
         -8 |        565        0.78        9.52
         -7 |        780        1.08       10.60
         -6 |      1,050        1.46       12.05
         -5 |      1,142        1.58       13.64
         -4 |      1,823        2.53       16.16
         -3 |      1,689        2.34       18.50
         -2 |        342        0.47       18.98
         -1 |     17,392       24.11       43.08
          0 |     30,305       42.00       85.09
          1 |        817        1.13       86.22
          2 |      1,391        1.93       88.15
          3 |      1,205        1.67       89.82
          4 |        853        1.18       91.00
          5 |        944        1.31       92.31
          6 |        701        0.97       93.28
          7 |        359        0.50       93.78
          8 |        716        0.99       94.77
          9 |        737        1.02       95.79
         10 |        554        0.77       96.56
         11 |        342        0.47       97.03
         12 |        460        0.64       97.67
         13 |        253        0.35       98.02
         14 |        232        0.32       98.34
         16 |        197        0.27       98.62
         17 |        481        0.67       99.28
         18 |        227        0.31       99.60
         19 |         74        0.10       99.70
         23 |         34        0.05       99.75
         24 |         76        0.11       99.85
         26 |         66        0.09       99.94
         28 |         41        0.06      100.00
------------+-----------------------------------
      Total |     72,149      100.00

. * event time relative to that
. generate event_time = year - first_year_expat
(18,106 missing values generated)

. 
. * if foreign manager arrives up to X years before or Y years later than forei
> gn owner, use foreign manager as arrival date. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(55 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(37 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(28 real changes made)

. 
. * drop firms where expat arrives earlier than X years before owner
. drop if manager_after_owner < -2
(13,350 observations deleted)

. 
. * ever expat and foreign created after foreign changes (drops were firm level
>  before so should not mess with ever variables)
. foreach X of var expat foreign {
  2.         by frame_id_numeric: egen ever_`X' = max(`X'==1)
  3. }

. 
. * drop if there was an expat but was never foreign - these are likely error
. drop if ever_expat == 1 & ever_foreign == 0
(359 observations deleted)

. 
. * drop too many CEO-s
. egen fp_tag = tag(frame_id_numeric manager_id) 

. by frame_id_numeric: egen n_ceo_ever = sum(fp_tag)

. drop if n_ceo > 15
(7,380 observations deleted)

. drop fp_tag n_ceo_ever

.         
. * hired or fired ceo since last observed year of firm
. tempvar previous_year

. generate previous_year = .
(69,525 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `previous_year' = max(cond(year 
> < `t', year, .))
  3.         quietly replace previous_year = `previous_year' if year == `t'
  4.         drop `previous_year'
  5. }

. 
. tempvar next_year

. generate next_year = .
(69,525 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `next_year' = min(cond(year > `t
> ', year, .))
  3.         quietly replace next_year = `next_year' if year == `t'
  4.         drop `next_year'
  5. }

. 
. generate byte hire = (job_begin <= year) & (job_begin > previous_year) & !mis
> sing(previous_year)

. generate byte fire = (job_end >= year) & (job_end < next_year) & !missing(nex
> t_year)

. tabulate hire fire 

           |         fire
      hire |         0          1 |     Total
-----------+----------------------+----------
         0 |    52,811      7,465 |    60,276 
         1 |     7,722      1,527 |     9,249 
-----------+----------------------+----------
     Total |    60,533      8,992 |    69,525 

. 
. * number of expats and locals
. bys frame_id_numeric year: egen n_expat_ceo = total(cond(expat, 1, 0))

. bys frame_id_numeric year: egen n_local_ceo = total(cond(!expat, 1, 0))

. 
. * create firm-year data
. collapse (firstnm) n_expat_ceo n_local_ceo foreign ever_expat ever_foreign (c
> ount) n_ceo = expat (max) hire_ceo = hire fire_ceo = fire, by(frame_id_numeri
> c year)

. 
. * if there is a change in the ceo team, hiring or firing, increement the spel
> l counter
. bys frame_id_numeric (year): gen ceo_spell = sum(hire_ceo | fire_ceo) + 1 // 
> so that index start from 1

. 
. tabulate n_expat_ceo n_local_ceo

 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         0          1          2          3          4 |     Total
-----------+-------------------------------------------------------+----------
         0 |         0     18,841      4,063      1,108        181 |    24,265 
         1 |     8,186      4,362        779        195         39 |    13,568 
         2 |     3,357      1,211        200         41         16 |     4,830 
         3 |       969        226         59         10         10 |     1,275 
         4 |       237         47          8          6          0 |       298 
         5 |        73         22          1          0          0 |        97 
         6 |        47          4          0          0          0 |        51 
         7 |         4          0          0          0          0 |         4 
-----------+-------------------------------------------------------+----------
     Total |    12,873     24,713      5,110      1,360        246 |    44,388 


 (firstnm) |
n_expat_ce |            (firstnm) n_local_ceo
         o |         5          6          7          8 |     Total
-----------+--------------------------------------------+----------
         0 |        47         22          3          0 |    24,265 
         1 |         6          0          0          1 |    13,568 
         2 |         3          2          0          0 |     4,830 
         3 |         1          0          0          0 |     1,275 
         4 |         0          0          0          0 |       298 
         5 |         0          1          0          0 |        97 
         6 |         0          0          0          0 |        51 
         7 |         0          0          0          0 |         4 
-----------+--------------------------------------------+----------
     Total |        57         25          3          1 |    44,388 

. * create dummies from numbers
. foreach var in expat local {
  2.         gen has_`var'_ceo = (n_`var'_ceo > 0) & !missing(n_`var'_ceo)
  3. }

.         
. count
  44,388

. compress
  variable year was float now int
  variable n_expat_ceo was float now byte
  variable n_local_ceo was float now byte
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable n_ceo was long now byte
  variable ceo_spell was float now byte
  variable has_expat_ceo was float now byte
  variable has_local_ceo was float now byte
  (1,154,088 bytes saved)

. save "`here'/temp/firm_events.dta", replace
file /Users/koren/Tresorit/Mac2Mac/projects/expat//temp/firm_events.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/firm_panel.lo
> g
  log type:  text
 closed on:  19 Mar 2024, 18:34:08
-------------------------------------------------------------------------------

. 
end of do-file
