
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklós Koren
               Central European University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/create/firm_panel.do 

. *Betöltés
. set more off

. clear all

. capture log close

. 
. * find root folder
. here
/Users/koren/Tresorit/Mac2Mac/projects/expat/

. local here = r(here)

. 
. log using "`here'/output/firm_panel", text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/firm_panel.lo
> g
  log type:  text
 opened on:  19 Mar 2024, 16:17:44

. 
. * keep only sample from balance-small
. use "`here'/temp/balance-small-clean.dta"

. by frame_id_numeric: egen firm_birth = min(year)

. by frame_id_numeric: egen firm_death = max(year)

. keep frame_id year firm_birth firm_death foreign

. tempfile sample

. save `sample', replace
(file /var/folders/5z/21k9mmsd55d1w5_jl5n192sh0000gn/T//St95233.000001 not
    found)
file /var/folders/5z/21k9mmsd55d1w5_jl5n192sh0000gn/T//St95233.000001 saved
    as .dta format

. 
. use "`here'/input/ceo-panel/ceo-panel.dta", clear 

. rename person_id manager_id

. replace expat = (foreign_name == 1) | (foreign_address == 1)
(0 real changes made)

. 
. * only keep sample firms
. merge m:1 frame_id_numeric year using `sample', keep(match) nogen
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           520,107  
    -----------------------------------------

. count if first_year_of_firm == firm_birth
  306,752

. 
. *for descriptives (number of ceo-s and nceo-s in original data, number of ceo
>  and nceo job-spells in original data)
. count
  520,107

. egen company_manager_id = group(frame_id_numeric manager_id)

. codebook manager_id

-------------------------------------------------------------------------------
manager_id                                                    group(manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [69,1544329]                  Units: 1
         Unique values: 79,846                    Missing .: 0/520,107

                  Mean: 826311
             Std. dev.: 394479

           Percentiles:    10%       25%       50%       75%       90%
                        279814    560365    806794   1.2e+06   1.4e+06

. codebook company_manager_id

-------------------------------------------------------------------------------
company_manager_id                           group(frame_id_numeric manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [1,91896]                     Units: 1
         Unique values: 91,896                    Missing .: 0/520,107

                  Mean:   40517
             Std. dev.: 24975.3

           Percentiles:     10%       25%       50%       75%       90%
                           6888     19319     39737     59628     75107

. 
. * balance panel
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. by company_manager_id: generate gap = year - year[_n-1] - 1
(91,896 missing values generated)

. replace gap = 0 if missing(gap)
(91,896 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    513,651       98.76       98.76
          1 |      3,274        0.63       99.39
          2 |      1,034        0.20       99.59
          3 |        632        0.12       99.71
          4 |        389        0.07       99.78
          5 |        323        0.06       99.85
          6 |        209        0.04       99.89
          7 |        141        0.03       99.91
          8 |        109        0.02       99.93
          9 |        106        0.02       99.95
         10 |         51        0.01       99.96
         11 |         35        0.01       99.97
         12 |         31        0.01       99.98
         13 |         28        0.01       99.98
         14 |         21        0.00       99.99
         15 |         19        0.00       99.99
         16 |         14        0.00       99.99
         17 |          9        0.00       99.99
         18 |          6        0.00      100.00
         19 |          5        0.00      100.00
         20 |          5        0.00      100.00
         21 |          7        0.00      100.00
         22 |          2        0.00      100.00
         23 |          2        0.00      100.00
         24 |          1        0.00      100.00
         25 |          3        0.00      100.00
------------+-----------------------------------
      Total |    520,107      100.00

. 
. * fill in holes of 1 year, but not longer
. expand 1 + (gap == 1), generate(filled_in)
(3,274 observations created)

. replace year = year - 1 if filled_in
(3,274 real changes made)

. 
. * create contiguous spells
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. gen change = ceo != L.ceo

. bysort company_manager_id (year): gen job_spell = sum(change)

. 
. * create job begin and end for each manager spell
. bys frame_id_numeric manager_id job_spell: egen job_begin = min(year)

. bys frame_id_numeric manager_id job_spell: egen job_end = max(year)

. keep frame_id_numeric manager_id job_spell year job_begin job_end expat firm_
> birth foreign

. 
. * if first managers arrive in year 1, extrapolate to year 0 - DROP SPELL
. bys frame_id_numeric: egen first_cohort = min(job_begin)

. replace job_begin = job_begin - 1 if (first_cohort == firm_birth + 1) & (job_
> begin == first_cohort)
(62,444 real changes made)

. 
. * NOTE: no collapse and expand --> there might be holes
. sort frame_id_numeric manager_id year

. count if frame_id_numeric == frame_id_numeric[_n-1] & manager_id == manager_i
> d[_n-1] & year != (year[_n-1] + 1)
  3,182

. 
. * expat before 1990 are mostly error, convert them to locals
. replace expat = 0 if job_begin < 1990
(16,066 real changes made)

. 
. ***********************
. * time invariant vars and drop entire series of firms from sample *
. ***********************
. by frame_id_numeric: egen first_year_expat = min(cond(expat == 1, job_begin,.
> ))
(348,199 missing values generated)

. by frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.)
> )
(429,612 missing values generated)

. 
. * which of the two happened first?
. generate manager_after_owner = first_year_expat - first_year_foreign
(447,942 missing values generated)

. tabulate manager_after_owner

manager_aft |
   er_owner |      Freq.     Percent        Cum.
------------+-----------------------------------
        -27 |        122        0.16        0.16
        -26 |        110        0.15        0.31
        -25 |         99        0.13        0.44
        -23 |        109        0.14        0.58
        -22 |        200        0.27        0.85
        -21 |         78        0.10        0.95
        -20 |        106        0.14        1.09
        -19 |        581        0.77        1.86
        -18 |        209        0.28        2.14
        -17 |        276        0.37        2.51
        -16 |        680        0.90        3.41
        -15 |        610        0.81        4.22
        -14 |        356        0.47        4.69
        -13 |        889        1.18        5.87
        -12 |        301        0.40        6.26
        -11 |        653        0.87        7.13
        -10 |        672        0.89        8.02
         -9 |        693        0.92        8.94
         -8 |        623        0.83        9.77
         -7 |        897        1.19       10.95
         -6 |      1,114        1.48       12.43
         -5 |      1,211        1.61       14.04
         -4 |      1,869        2.48       16.51
         -3 |      2,034        2.70       19.21
         -2 |        342        0.45       19.66
         -1 |     17,940       23.78       43.44
          0 |     31,707       42.03       85.47
          1 |        817        1.08       86.56
          2 |      1,438        1.91       88.46
          3 |      1,205        1.60       90.06
          4 |        853        1.13       91.19
          5 |        974        1.29       92.48
          6 |        822        1.09       93.57
          7 |        359        0.48       94.05
          8 |        716        0.95       95.00
          9 |        737        0.98       95.97
         10 |        554        0.73       96.71
         11 |        342        0.45       97.16
         12 |        460        0.61       97.77
         13 |        253        0.34       98.11
         14 |        232        0.31       98.41
         16 |        197        0.26       98.68
         17 |        481        0.64       99.31
         18 |        227        0.30       99.61
         19 |         74        0.10       99.71
         23 |         34        0.05       99.76
         24 |         76        0.10       99.86
         26 |         66        0.09       99.95
         28 |         41        0.05      100.00
------------+-----------------------------------
      Total |     75,439      100.00

. * event time relative to that
. generate event_time = year - first_year_expat
(348,199 missing values generated)

. 
. * if foreign manager arrives up to X years before or Y years later than forei
> gn owner, use foreign manager as arrival date. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(55 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(48 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(28 real changes made)

. 
. * drop firms where expat arrives earlier than X years before owner
. drop if manager_after_owner < -2
(14,492 observations deleted)

. 
. * ever expat and foreign created after foreign changes (drops were firm level
>  before so should not mess with ever variables)
. foreach X of var expat foreign {
  2.         by frame_id_numeric: egen ever_`X' = max(`X'==1)
  3. }

. 
. * drop if there was an expat but was never foreign - these are likely error
. drop if ever_expat == 1 & ever_foreign == 0
(99,743 observations deleted)

. 
. * drop too many CEO-s
. egen fp_tag = tag(frame_id_numeric manager_id) 

. by frame_id_numeric: egen n_ceo_ever = sum(fp_tag)

. drop if n_ceo > 15
(9,984 observations deleted)

. drop fp_tag n_ceo_ever

.         
. * hired or fired ceo since last observed year of firm
. tempvar previous_year

. generate previous_year = .
(399,162 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `previous_year' = max(cond(year 
> < `t', year, .))
  3.         quietly replace previous_year = `previous_year' if year == `t'
  4.         drop `previous_year'
  5. }

. 
. tempvar next_year

. generate next_year = .
(399,162 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `next_year' = min(cond(year > `t
> ', year, .))
  3.         quietly replace next_year = `next_year' if year == `t'
  4.         drop `next_year'
  5. }

. 
. generate byte hire = (job_begin <= year) & (job_begin > previous_year) & !mis
> sing(previous_year)

. generate byte fire = (job_end >= year) & (job_end < next_year) & !missing(nex
> t_year)

. tabulate hire fire 

           |         fire
      hire |         0          1 |     Total
-----------+----------------------+----------
         0 |   344,528     24,151 |   368,679 
         1 |    26,667      3,816 |    30,483 
-----------+----------------------+----------
     Total |   371,195     27,967 |   399,162 

. 
. * number of expats and locals
. bys frame_id_numeric year: egen n_expat_ceo = total(cond(expat, 1, 0))

. bys frame_id_numeric year: egen n_local_ceo = total(cond(!expat, 1, 0))

. 
. * create firm-year data
. collapse (firstnm) n_expat_ceo n_local_ceo foreign ever_expat ever_foreign (c
> ount) n_ceo = expat (max) hire_ceo = hire fire_ceo = fire, by(frame_id_numeri
> c year)

. 
. * if there is a change in the ceo team, hiring or firing, increement the spel
> l counter
. bys frame_id_numeric (year): gen ceo_spell = sum(hire_ceo | fire_ceo) + 1 // 
> so that index start from 1

. 
. tabulate n_expat_ceo n_local_ceo

 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         0          1          2          3          4 |     Total
-----------+-------------------------------------------------------+----------
         0 |         0    195,680     50,347     12,458      2,175 |   263,688 
         1 |     8,460      4,525        813        196         39 |    14,040 
         2 |     3,470      1,263        204         47         16 |     5,005 
         3 |       992        246         59         11         10 |     1,319 
         4 |       239         50          8          6          0 |       303 
         5 |        73         22          1          0          0 |        97 
         6 |        47          4          0          0          0 |        51 
         7 |         4          0          0          0          0 |         4 
-----------+-------------------------------------------------------+----------
     Total |    13,285    201,790     51,432     12,718      2,240 |   284,507 


 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         5          6          7          8          9 |     Total
-----------+-------------------------------------------------------+----------
         0 |     1,986        380        445         71        107 |   263,688 
         1 |         6          0          0          1          0 |    14,040 
         2 |         3          2          0          0          0 |     5,005 
         3 |         1          0          0          0          0 |     1,319 
         4 |         0          0          0          0          0 |       303 
         5 |         0          1          0          0          0 |        97 
         6 |         0          0          0          0          0 |        51 
         7 |         0          0          0          0          0 |         4 
-----------+-------------------------------------------------------+----------
     Total |     1,996        383        445         72        107 |   284,507 


 (firstnm) |
n_expat_ce |      (firstnm) n_local_ceo
         o |        10         11         12 |     Total
-----------+---------------------------------+----------
         0 |         9         26          4 |   263,688 
         1 |         0          0          0 |    14,040 
         2 |         0          0          0 |     5,005 
         3 |         0          0          0 |     1,319 
         4 |         0          0          0 |       303 
         5 |         0          0          0 |        97 
         6 |         0          0          0 |        51 
         7 |         0          0          0 |         4 
-----------+---------------------------------+----------
     Total |         9         26          4 |   284,507 

. * create dummies from numbers
. foreach var in expat local {
  2.         gen has_`var'_ceo = (n_`var'_ceo > 0) & !missing(n_`var'_ceo)
  3. }

.         
. count
  284,507

. compress
  variable year was float now int
  variable n_expat_ceo was float now byte
  variable n_local_ceo was float now byte
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable n_ceo was long now byte
  variable ceo_spell was float now byte
  variable has_expat_ceo was float now byte
  variable has_local_ceo was float now byte
  (7,397,182 bytes saved)

. save "`here'/temp/firm_events.dta", replace
file /Users/koren/Tresorit/Mac2Mac/projects/expat//temp/firm_events.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/firm_panel.lo
> g
  log type:  text
 closed on:  19 Mar 2024, 16:18:09
-------------------------------------------------------------------------------

. 
end of do-file
