
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/create/firm_panel.do 

. *Betöltés
. set more off

. clear all

. capture log close

. 
. * find root folder
. here
/Users/koren/Tresorit/Mac/projects/expat/

. local here = r(here)

. 
. log using "`here'/output/firm_panel", text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/firm_panel.log
  log type:  text
 opened on:  24 Jan 2024, 18:17:09

. 
. * keep only sample from balance-small - NOTE: had to restructure as we have t
> o keep foreign which is different in years - so no collapse this time
. use "`here'/temp/balance-small-clean.dta"

. by frame_id_numeric: egen firm_birth = min(year)

. by frame_id_numeric: egen firm_death = max(year)

. keep frame_id year firm_birth firm_death foreign

. tempfile sample

. save `sample', replace
(file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St44321.000001 not
    found)
file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St44321.000001 saved
    as .dta format

. 
. 
. use "`here'/input/ceo-panel/ceo-panel.dta", clear 

. rename person_id manager_id

. 
. *for descriptives (number of ceo-s and nceo-s in original data, number of ceo
>  and nceo job-spells in original data)
. count
  15,390,598

. egen company_manager_id = group(frame_id_numeric manager_id)

. codebook manager_id

-------------------------------------------------------------------------------
manager_id                                       group(manager_id manager_type)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [2,1522645]                   Units: 1
         Unique values: 1,401,271                 Missing .: 0/15,390,598

                  Mean: 825103
             Std. dev.: 387359

           Percentiles:    10%       25%       50%       75%       90%
                        284414    548711    816617   1.1e+06   1.4e+06

. codebook company_manager_id

-------------------------------------------------------------------------------
company_manager_id                           group(frame_id_numeric manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [1,2185311]                   Units: 1
         Unique values: 2,185,311                 Missing .: 0/15,390,598

                  Mean: 1.1e+06
             Std. dev.:  663672

           Percentiles:     10%       25%       50%       75%       90%
                         194578    499718   1.1e+06   1.7e+06   2.1e+06

. drop company_manager_id

. 
. * only keep sample firms
. merge m:1 frame_id_numeric year using `sample', keep(match) nogen
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           527,554  
    -----------------------------------------

. count if first_year_of_firm == firm_birth
  302,527

. 
. * balance panel
. egen company_manager_id = group(frame_id manager_id)

. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. by company_manager_id: generate gap = year - year[_n-1] - 1
(92,284 missing values generated)

. replace gap = 0 if missing(gap)
(92,284 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    521,059       98.77       98.77
          1 |      3,298        0.63       99.39
          2 |      1,033        0.20       99.59
          3 |        642        0.12       99.71
          4 |        391        0.07       99.79
          5 |        329        0.06       99.85
          6 |        207        0.04       99.89
          7 |        138        0.03       99.91
          8 |        110        0.02       99.93
          9 |        109        0.02       99.95
         10 |         56        0.01       99.97
         11 |         35        0.01       99.97
         12 |         30        0.01       99.98
         13 |         28        0.01       99.98
         14 |         21        0.00       99.99
         15 |         19        0.00       99.99
         16 |         11        0.00       99.99
         17 |         10        0.00       99.99
         18 |          6        0.00      100.00
         19 |          5        0.00      100.00
         20 |          7        0.00      100.00
         21 |          4        0.00      100.00
         22 |          2        0.00      100.00
         23 |          1        0.00      100.00
         24 |          1        0.00      100.00
         25 |          2        0.00      100.00
------------+-----------------------------------
      Total |    527,554      100.00

. 
. expand 1 + (gap == 1), generate(filled_in)
(3,298 observations created)

. replace year = year - 1 if filled_in
(3,298 real changes made)

. 
. * create contiguous spells
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. gen change = ceo != L.ceo // intuition: should be ok in both files (possible 
> FIXME)

. bysort company_manager_id (year): gen job_spell = sum(change)

. 
. * create job begin and end for each manager spell
. bys frame_id_numeric manager_id job_spell: egen job_begin = min(year)

. bys frame_id_numeric manager_id job_spell: egen job_end = max(year)

. keep frame_id_numeric manager_id job_spell year job_begin job_end expat found
> er insider outsider firm_birth foreign country_code

. 
. * if first managers arrive in year 1, extrapolate to year 0 - DROP SPELL
. bys frame_id_numeric: egen first_cohort = min(job_begin)

. replace job_begin = job_begin - 1 if (first_cohort == firm_birth + 1) & (job_
> begin == first_cohort)
(60,198 real changes made)

. 
. * NOTE: no collapse and expand --> there might be holes
. sort frame_id_numeric manager_id year

. count if frame_id_numeric == frame_id_numeric[_n-1] & manager_id == manager_i
> d[_n-1] & year != (year[_n-1] + 1)
  3,197

. 
. * expat before 1990
. replace expat = 0 if job_begin < 1990
(690 real changes made)

. 
. ***********************
. * time invariant vars and drop entire series of firms from sample *
. ***********************
. by frame_id_numeric: egen first_year_expat = min(cond(expat == 1, job_begin,.
> ))
(444,831 missing values generated)

. by frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.)
> )
(436,042 missing values generated)

. 
. * which of the two happened first?
. generate manager_after_owner = first_year_expat - first_year_foreign
(462,274 missing values generated)

. * event time relative to that
. generate event_time = year - first_year_expat
(444,831 missing values generated)

. 
. * if foreign manager arrives up to 2 years before 1 year later than foreign o
> wner, use foreign manager as arrival date. this is easier to implement
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(39 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(46 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(28 real changes made)

. 
. * drop firms where expat arrives earlier than 2 years before owner
. drop if manager_after_owner < -2
(6,001 observations deleted)

. 
. * ever expat and foreign created after foreign changes (drops were firm level
>  before so should not mess with ever variables)
. foreach X of var expat foreign {
  2.         by frame_id_numeric: egen ever_`X'_ceo = max(`X'==1)
  3. }

. 
. * drop if there was an expat but was never foreign
. drop if ever_expat == 1 & ever_foreign == 0
(17,443 observations deleted)

. scalar dropped_do3_expat_firmyears = r(N_drop)

. 
. * drop too many CEO-s - FIXME AND QUESTION: should be moved in the next file 
> where spells are limited - but there cannot be created without manager level 
> data
. egen fp_tag = tag(frame_id_numeric manager_id) 

. by frame_id_numeric: egen n_ceo_ever = sum(fp_tag)

. drop if n_ceo > 15
(13,554 observations deleted)

. scalar dropped_too_many_CEOs = r(N_drop)

. drop fp_tag n_ceo_ever

.         
. * hired or fired ceo since last observed year of firm - * POSSIBLE FIXME: exp
> at, owner, insider, outsider, founder - hire, fire combinations later
. tempvar previous_year

. generate previous_year = .
(493,854 missing values generated)

. forval t = 1985/2018 {
  2.         by frame_id_numeric: egen `previous_year' = max(cond(year < `t', y
> ear, .))
  3.         replace previous_year = `previous_year' if year == `t'
  4.         drop `previous_year'
  5. }
(437,603 missing values generated)
(2,009 real changes made)
(434,414 missing values generated)
(2,271 real changes made)
(432,411 missing values generated)
(2,467 real changes made)
(429,974 missing values generated)
(2,727 real changes made)
(427,699 missing values generated)
(2,954 real changes made)
(413,785 missing values generated)
(4,023 real changes made)
(376,502 missing values generated)
(6,661 real changes made)
(331,860 missing values generated)
(8,603 real changes made)
(276,115 missing values generated)
(10,504 real changes made)
(233,658 missing values generated)
(11,953 real changes made)
(202,009 missing values generated)
(12,813 real changes made)
(181,906 missing values generated)
(13,099 real changes made)
(161,444 missing values generated)
(13,541 real changes made)
(140,754 missing values generated)
(14,201 real changes made)
(124,768 missing values generated)
(14,581 real changes made)
(112,570 missing values generated)
(14,760 real changes made)
(98,902 missing values generated)
(15,114 real changes made)
(85,952 missing values generated)
(15,538 real changes made)
(76,687 missing values generated)
(15,682 real changes made)
(69,716 missing values generated)
(16,445 real changes made)
(62,902 missing values generated)
(16,704 real changes made)
(56,428 missing values generated)
(16,818 real changes made)
(49,982 missing values generated)
(17,134 real changes made)
(44,995 missing values generated)
(17,726 real changes made)
(39,964 missing values generated)
(17,489 real changes made)
(35,864 missing values generated)
(17,287 real changes made)
(32,144 missing values generated)
(16,997 real changes made)
(28,792 missing values generated)
(16,860 real changes made)
(25,931 missing values generated)
(16,994 real changes made)
(22,590 missing values generated)
(16,768 real changes made)
(20,032 missing values generated)
(15,812 real changes made)
(16,863 missing values generated)
(15,954 real changes made)
(9,743 missing values generated)
(17,793 real changes made)
(3,423 missing values generated)
(19,825 real changes made)

. 
. by frame_id_numeric: egen first_year = min(year)

. bys frame_id_numeric (year): generate byte hire = cond(first_year == year, 1,
>  (job_begin <= year) & (job_begin > previous_year))

. 
. tempvar next_year

. generate next_year = .
(493,854 missing values generated)

. forval t = 1985/2018 {
  2.         by frame_id_numeric: egen `next_year' = min(cond(year > `t', year,
>  .))
  3.         replace next_year = `next_year' if year == `t'
  4.         drop `next_year'
  5. }
(2,271 real changes made)
(2,468 real changes made)
(7 missing values generated)
(2,733 real changes made)
(68 missing values generated)
(2,955 real changes made)
(341 missing values generated)
(4,021 real changes made)
(1,575 missing values generated)
(6,681 real changes made)
(6,561 missing values generated)
(8,783 real changes made)
(12,608 missing values generated)
(10,723 real changes made)
(17,622 missing values generated)
(11,846 real changes made)
(22,534 missing values generated)
(12,846 real changes made)
(26,998 missing values generated)
(13,126 real changes made)
(31,946 missing values generated)
(13,597 real changes made)
(36,720 missing values generated)
(14,040 real changes made)
(41,093 missing values generated)
(14,624 real changes made)
(47,378 missing values generated)
(14,592 real changes made)
(52,602 missing values generated)
(15,064 real changes made)
(57,572 missing values generated)
(15,416 real changes made)
(63,628 missing values generated)
(15,643 real changes made)
(69,558 missing values generated)
(15,699 real changes made)
(76,847 missing values generated)
(16,363 real changes made)
(84,040 missing values generated)
(16,683 real changes made)
(91,556 missing values generated)
(16,758 real changes made)
(99,045 missing values generated)
(16,969 real changes made)
(108,479 missing values generated)
(17,438 real changes made)
(117,219 missing values generated)
(17,237 real changes made)
(125,672 missing values generated)
(17,056 real changes made)
(133,779 missing values generated)
(16,857 real changes made)
(140,337 missing values generated)
(16,793 real changes made)
(151,154 missing values generated)
(16,837 real changes made)
(172,016 missing values generated)
(15,992 real changes made)
(181,267 missing values generated)
(15,960 real changes made)
(189,715 missing values generated)
(17,720 real changes made)
(200,707 missing values generated)
(19,726 real changes made)
(493,854 missing values generated)
(0 real changes made)

. 
. gen byte fire = ((job_end >= year) & (job_end < next_year))

. tabulate hire fire 

           |         fire
      hire |         0          1 |     Total
-----------+----------------------+----------
         0 |   334,285     73,040 |   407,325 
         1 |    63,289     23,240 |    86,529 
-----------+----------------------+----------
     Total |   397,574     96,280 |   493,854 

. 
. gen hire_expat_ceo = hire * expat

. gen fire_expat_ceo = fire * expat

. 
. * number of expats and locals
. bys frame_id_numeric year: egen n_expat_ceo = total(cond(expat, 1, 0)) // cou
> ld be in collapse but local not

. bys frame_id_numeric year: egen n_local_ceo = total(cond(!expat, 1, 0))

. 
. * create firm-year data
. collapse (sum) n_founder_ceo = founder n_insider_ceo = insider n_outsider_ceo
>  = outsider (firstnm) n_expat_ceo n_local_ceo foreign_ceo = foreign ever_expa
> t_ceo ever_foreign_ceo (count) n_ceo = expat (max) hire_ceo = hire fire_ceo =
>  fire hire_expat_ceo fire_expat_ceo, by(frame_id_numeric year)

. 
. * managers in first year not classified as new hires and in last year not cla
> ssified as fired
. bys frame_id_numeric (year): replace hire_ceo = 0 if (_n==1)
(35,590 real changes made)

. bys frame_id_numeric (year): replace fire_ceo = 0 if (_n==_N)
(35,590 real changes made)

. bys frame_id_numeric (year): replace hire_expat_ceo = 0 if (_n==1)
(1492 real changes made)

. bys frame_id_numeric (year): replace fire_expat_ceo = 0 if (_n==_N)
(1777 real changes made)

. bys frame_id_numeric (year): gen ceo_spell_ceo = sum(hire_ceo | fire_ceo) + 1
>  // so that index start from 1

. 
. * create dummies from numbers
. foreach var in expat local founder insider outsider {
  2.         gen has_`var'_ceo = (n_`var'_ceo > 0) & n_`var'_ceo != .
  3. }

.         
. count
  344,063

. compress
  variable year was float now int
  variable n_expat_ceo was float now byte
  variable n_local_ceo was float now byte
  variable ever_expat_ceo was float now byte
  variable ever_foreign_ceo was float now byte
  variable n_ceo was long now byte
  variable hire_expat_ceo was float now byte
  variable fire_expat_ceo was float now byte
  variable ceo_spell_ceo was float now byte
  variable has_expat_ceo was float now byte
  variable has_local_ceo was float now byte
  variable has_founder_ceo was float now byte
  variable has_insider_ceo was float now byte
  variable has_outsider_ceo was float now byte
  variable n_founder_ceo was double now byte
  variable n_insider_ceo was double now byte
  variable n_outsider_ceo was double now byte
  (21,331,906 bytes saved)

. save "`here'/temp/firm_events.dta", replace
file /Users/koren/Tresorit/Mac/projects/expat//temp/firm_events.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/firm_panel.log
  log type:  text
 closed on:  24 Jan 2024, 18:17:53
-------------------------------------------------------------------------------

. 
end of do-file
