
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklós Koren
               Central European University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/create/firm_panel.do 

. *Betöltés
. set more off

. clear all

. capture log close

. 
. * find root folder
. here
/Users/koren/Tresorit/Mac2Mac/projects/expat/

. local here = r(here)

. 
. log using "`here'/output/firm_panel", text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/firm_panel.lo
> g
  log type:  text
 opened on:  19 Mar 2024, 18:46:05

. 
. * keep only sample from balance-small
. use "`here'/temp/balance-small-clean.dta"

. by frame_id_numeric: egen firm_birth = min(year)

. by frame_id_numeric: egen firm_death = max(year)

. keep frame_id year firm_birth firm_death foreign

. tempfile sample

. save `sample', replace
(file /var/folders/5z/21k9mmsd55d1w5_jl5n192sh0000gn/T//St37051.000001 not
    found)
file /var/folders/5z/21k9mmsd55d1w5_jl5n192sh0000gn/T//St37051.000001 saved
    as .dta format

. 
. use "`here'/temp/ceo-panel.dta", clear 

. 
. * only keep sample firms
. merge m:1 frame_id_numeric year using `sample', keep(match) nogen
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            88,349  
    -----------------------------------------

. count if first_year_of_firm == firm_birth
  43,025

. 
. *for descriptives (number of ceo-s and nceo-s in original data, number of ceo
>  and nceo job-spells in original data)
. count
  88,349

. egen company_manager_id = group(frame_id_numeric manager_id)

. codebook manager_id

-------------------------------------------------------------------------------
manager_id                                                    group(manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [143,1543909]                 Units: 1
         Unique values: 16,802                    Missing .: 0/88,349

                  Mean: 645850
             Std. dev.: 444596

           Percentiles:    10%       25%       50%       75%       90%
                         74526    247728    618346   1.0e+06   1.3e+06

. codebook company_manager_id

-------------------------------------------------------------------------------
company_manager_id                           group(frame_id_numeric manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [1,18255]                     Units: 1
         Unique values: 18,255                    Missing .: 0/88,349

                  Mean: 8624.87
             Std. dev.: 5056.81

           Percentiles:     10%       25%       50%       75%       90%
                           1796      4234      8577     12815     15680

. 
. * balance panel
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. by company_manager_id: generate gap = year - year[_n-1] - 1
(18,255 missing values generated)

. replace gap = 0 if missing(gap)
(18,255 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     87,009       98.48       98.48
          1 |        663        0.75       99.23
          2 |        245        0.28       99.51
          3 |        128        0.14       99.66
          4 |         70        0.08       99.74
          5 |         62        0.07       99.81
          6 |         42        0.05       99.85
          7 |         32        0.04       99.89
          8 |         18        0.02       99.91
          9 |         28        0.03       99.94
         10 |          9        0.01       99.95
         11 |         12        0.01       99.96
         12 |          5        0.01       99.97
         13 |          2        0.00       99.97
         14 |          7        0.01       99.98
         15 |          2        0.00       99.98
         16 |          3        0.00       99.99
         17 |          3        0.00       99.99
         18 |          1        0.00       99.99
         19 |          1        0.00       99.99
         20 |          3        0.00      100.00
         21 |          3        0.00      100.00
         23 |          1        0.00      100.00
------------+-----------------------------------
      Total |     88,349      100.00

. 
. * fill in holes of 1 year, but not longer
. expand 1 + (gap == 1), generate(filled_in)
(663 observations created)

. replace year = year - 1 if filled_in
(663 real changes made)

. 
. * create contiguous spells
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. gen change = ceo != L.ceo

. bysort company_manager_id (year): gen job_spell = sum(change)

. 
. * create job begin and end for each manager spell
. bys frame_id_numeric manager_id job_spell: egen job_begin = min(year)

. bys frame_id_numeric manager_id job_spell: egen job_end = max(year)

. keep frame_id_numeric manager_id job_spell year job_begin job_end expat firm_
> birth foreign

. 
. * if first managers arrive in year 1, extrapolate to year 0 - DROP SPELL
. bys frame_id_numeric: egen first_cohort = min(job_begin)

. replace job_begin = job_begin - 1 if (first_cohort == firm_birth + 1) & (job_
> begin == first_cohort)
(10,927 real changes made)

. 
. * NOTE: no collapse and expand --> there might be holes
. sort frame_id_numeric manager_id year

. count if frame_id_numeric == frame_id_numeric[_n-1] & manager_id == manager_i
> d[_n-1] & year != (year[_n-1] + 1)
  677

. 
. * expat before 1990 are mostly error, convert them to locals
. replace expat = 0 if job_begin < 1990
(857 real changes made)

. 
. ***********************
. * time invariant vars and drop entire series of firms from sample *
. ***********************
. by frame_id_numeric: egen first_year_expat = min(cond(expat == 1, job_begin,.
> ))
(21,978 missing values generated)

. by frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.)
> )
(888 missing values generated)

. 
. * which of the two happened first?
. generate manager_after_owner = first_year_expat - first_year_foreign
(22,224 missing values generated)

. tabulate manager_after_owner

manager_aft |
   er_owner |      Freq.     Percent        Cum.
------------+-----------------------------------
        -27 |         56        0.08        0.08
        -26 |         56        0.08        0.17
        -25 |         99        0.15        0.32
        -23 |         51        0.08        0.39
        -22 |        200        0.30        0.69
        -21 |         41        0.06        0.75
        -20 |         97        0.15        0.90
        -19 |        503        0.75        1.65
        -18 |        174        0.26        1.91
        -17 |        216        0.32        2.24
        -16 |        521        0.78        3.02
        -15 |        594        0.89        3.90
        -14 |        243        0.36        4.27
        -13 |        645        0.97        5.23
        -12 |        217        0.32        5.56
        -11 |        531        0.80        6.35
        -10 |        496        0.74        7.10
         -9 |        492        0.74        7.83
         -8 |        484        0.72        8.56
         -7 |        705        1.06        9.61
         -6 |        883        1.32       10.94
         -5 |        929        1.39       12.33
         -4 |      1,668        2.50       14.82
         -3 |      1,518        2.27       17.10
         -2 |        274        0.41       17.51
         -1 |     15,947       23.88       41.38
          0 |     28,364       42.47       83.85
          1 |        729        1.09       84.94
          2 |      1,365        2.04       86.99
          3 |      1,314        1.97       88.96
          4 |      1,004        1.50       90.46
          5 |        883        1.32       91.78
          6 |        777        1.16       92.94
          7 |        416        0.62       93.57
          8 |        624        0.93       94.50
          9 |        835        1.25       95.75
         10 |        569        0.85       96.60
         11 |        342        0.51       97.12
         12 |        230        0.34       97.46
         13 |        254        0.38       97.84
         14 |        209        0.31       98.15
         15 |         73        0.11       98.26
         16 |        196        0.29       98.56
         17 |        384        0.57       99.13
         18 |        323        0.48       99.62
         19 |         74        0.11       99.73
         24 |         76        0.11       99.84
         26 |         66        0.10       99.94
         28 |         41        0.06      100.00
------------+-----------------------------------
      Total |     66,788      100.00

. * event time relative to that
. generate event_time = year - first_year_expat
(21,978 missing values generated)

. 
. * if foreign manager arrives up to X years before or Y years later than forei
> gn owner, use foreign manager as arrival date. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(44 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(35 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(26 real changes made)

. 
. * drop firms where expat arrives earlier than X years before owner
. drop if manager_after_owner < -2
(11,419 observations deleted)

. 
. * ever expat and foreign created after foreign changes (drops were firm level
>  before so should not mess with ever variables)
. foreach X of var expat foreign {
  2.         by frame_id_numeric: egen ever_`X' = max(`X'==1)
  3. }

. 
. * drop if there was an expat but was never foreign - these are likely error
. drop if ever_expat == 1 & ever_foreign == 0
(246 observations deleted)

. 
. * drop too many CEO-s
. egen fp_tag = tag(frame_id_numeric manager_id) 

. by frame_id_numeric: egen n_ceo_ever = sum(fp_tag)

. drop if n_ceo > 15
(7,430 observations deleted)

. drop fp_tag n_ceo_ever

.         
. * hired or fired ceo since last observed year of firm
. tempvar previous_year

. generate previous_year = .
(69,917 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `previous_year' = max(cond(year 
> < `t', year, .))
  3.         quietly replace previous_year = `previous_year' if year == `t'
  4.         drop `previous_year'
  5. }

. 
. tempvar next_year

. generate next_year = .
(69,917 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `next_year' = min(cond(year > `t
> ', year, .))
  3.         quietly replace next_year = `next_year' if year == `t'
  4.         drop `next_year'
  5. }

. 
. generate byte hire = (job_begin <= year) & (job_begin > previous_year) & !mis
> sing(previous_year)

. generate byte fire = (job_end >= year) & (job_end < next_year) & !missing(nex
> t_year)

. tabulate hire fire 

           |         fire
      hire |         0          1 |     Total
-----------+----------------------+----------
         0 |    53,198      7,465 |    60,663 
         1 |     7,714      1,540 |     9,254 
-----------+----------------------+----------
     Total |    60,912      9,005 |    69,917 

. 
. * number of expats and locals
. bys frame_id_numeric year: egen n_expat_ceo = total(cond(expat, 1, 0))

. bys frame_id_numeric year: egen n_local_ceo = total(cond(!expat, 1, 0))

. 
. * create firm-year data
. collapse (firstnm) n_expat_ceo n_local_ceo foreign ever_expat ever_foreign (c
> ount) n_ceo = expat (max) hire_ceo = hire fire_ceo = fire, by(frame_id_numeri
> c year)

. 
. * if there is a change in the ceo team, hiring or firing, increement the spel
> l counter
. bys frame_id_numeric (year): gen ceo_spell = sum(hire_ceo | fire_ceo) + 1 // 
> so that index start from 1

. 
. tabulate n_expat_ceo n_local_ceo

 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         0          1          2          3          4 |     Total
-----------+-------------------------------------------------------+----------
         0 |         0     20,002      4,866      1,313        266 |    26,588 
         1 |     7,033      4,135        803        175         38 |    12,205 
         2 |     2,826      1,159        216         39          9 |     4,250 
         3 |       809        212         54         12         14 |     1,101 
         4 |       178         45          8          1          0 |       232 
         5 |        60         21          0          0          2 |        84 
         6 |        38          4          0          0          0 |        42 
         7 |         4          0          0          0          0 |         4 
-----------+-------------------------------------------------------+----------
     Total |    10,948     25,578      5,947      1,540        329 |    44,506 


 (firstnm) |
n_expat_ce |            (firstnm) n_local_ceo
         o |         5          6          7          8 |     Total
-----------+--------------------------------------------+----------
         0 |       103         32          3          3 |    26,588 
         1 |        16          5          0          0 |    12,205 
         2 |         1          0          0          0 |     4,250 
         3 |         0          0          0          0 |     1,101 
         4 |         0          0          0          0 |       232 
         5 |         0          1          0          0 |        84 
         6 |         0          0          0          0 |        42 
         7 |         0          0          0          0 |         4 
-----------+--------------------------------------------+----------
     Total |       120         38          3          3 |    44,506 

. * create dummies from numbers
. foreach var in expat local {
  2.         gen has_`var'_ceo = (n_`var'_ceo > 0) & !missing(n_`var'_ceo)
  3. }

.         
. count
  44,506

. compress
  variable year was float now int
  variable n_expat_ceo was float now byte
  variable n_local_ceo was float now byte
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable n_ceo was long now byte
  variable ceo_spell was float now byte
  variable has_expat_ceo was float now byte
  variable has_local_ceo was float now byte
  (1,157,156 bytes saved)

. save "`here'/temp/firm_events.dta", replace
file /Users/koren/Tresorit/Mac2Mac/projects/expat//temp/firm_events.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/firm_panel.lo
> g
  log type:  text
 closed on:  19 Mar 2024, 18:46:11
-------------------------------------------------------------------------------

. 
end of do-file
