
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/create/firm_panel.do 

. *Betöltés
. set more off

. clear all

. capture log close

. 
. * find root folder
. here
/Users/koren/Tresorit/Mac/projects/expat/

. local here = r(here)

. 
. log using "`here'/output/firm_panel", text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/firm_panel.log
  log type:  text
 opened on:  27 May 2024, 16:39:05

. 
. * keep only sample from balance-small
. use "`here'/temp/balance-small-clean.dta"

. 
. sort frame_id_numeric year

. by frame_id_numeric: egen firm_birth = min(year)

. by frame_id_numeric: egen firm_death = max(year)

. keep frame_id_numeric year firm_birth firm_death foreign

. tempfile sample

. save `sample', replace
(file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St41962.000001 not
    found)
file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St41962.000001 saved
    as .dta format

. 
. use "`here'/temp/ceo-panel.dta", clear 

. 
. * only keep sample firms
. merge m:1 frame_id_numeric year using `sample', keep(match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                         1,114,305  
    -----------------------------------------

. count if first_year_of_firm == firm_birth
  634,959

. 
. *for descriptives (number of ceo-s and nceo-s in original data, number of ceo
>  and nceo job-spells in original data)
. count
  1,114,305

. egen company_manager_id = group(frame_id_numeric manager_id)

. codebook manager_id

-------------------------------------------------------------------------------
manager_id                                                    group(manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [2,1607091]                   Units: 1
         Unique values: 143,715                   Missing .: 0/1,114,305

                  Mean: 871780
             Std. dev.: 405767

           Percentiles:    10%       25%       50%       75%       90%
                        298108    609566    853208   1.2e+06   1.4e+06

. codebook company_manager_id

-------------------------------------------------------------------------------
company_manager_id                           group(frame_id_numeric manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [1,171518]                    Units: 1
         Unique values: 171,518                   Missing .: 0/1,114,305

                  Mean: 82796.6
             Std. dev.: 48901.5

           Percentiles:     10%       25%       50%       75%       90%
                          16266     41103     81209    123190    151688

. 
. * balance panel
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2019, but with gaps
         Delta: 1 unit

. by company_manager_id: generate gap = year - year[_n-1] - 1
(171,518 missing values generated)

. replace gap = 0 if missing(gap)
(171,518 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,100,229       98.74       98.74
          1 |      7,539        0.68       99.41
          2 |      2,135        0.19       99.60
          3 |      1,292        0.12       99.72
          4 |        861        0.08       99.80
          5 |        656        0.06       99.86
          6 |        409        0.04       99.89
          7 |        275        0.02       99.92
          8 |        227        0.02       99.94
          9 |        193        0.02       99.96
         10 |        108        0.01       99.97
         11 |         89        0.01       99.97
         12 |         67        0.01       99.98
         13 |         56        0.01       99.98
         14 |         42        0.00       99.99
         15 |         36        0.00       99.99
         16 |         30        0.00       99.99
         17 |         13        0.00      100.00
         18 |         11        0.00      100.00
         19 |          8        0.00      100.00
         20 |         10        0.00      100.00
         21 |          7        0.00      100.00
         22 |          3        0.00      100.00
         23 |          3        0.00      100.00
         24 |          1        0.00      100.00
         25 |          5        0.00      100.00
------------+-----------------------------------
      Total |  1,114,305      100.00

. 
. * fill in holes of 1 year, but not longer
. expand 1 + (gap == 1), generate(filled_in)
(7,539 observations created)

. replace year = year - 1 if filled_in
(7,539 real changes made)

. 
. * create contiguous spells
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2019, but with gaps
         Delta: 1 unit

. gen change = ceo != L.ceo

. bysort company_manager_id (year): gen job_spell = sum(change)

. 
. * create job begin and end for each manager spell
. bys frame_id_numeric manager_id job_spell: egen job_begin = min(year)

. bys frame_id_numeric manager_id job_spell: egen job_end = max(year)

. keep frame_id_numeric manager_id job_spell year job_begin job_end firm_birth 
> foreign foreignness

. 
. * if first managers arrive in year 1, extrapolate to year 0 - DROP SPELL
. bys frame_id_numeric: egen first_cohort = min(job_begin)

. replace job_begin = job_begin - 1 if (first_cohort == firm_birth + 1) & (job_
> begin == first_cohort)
(139,206 real changes made)

. 
. * NOTE: no collapse and expand --> there might be holes
. sort frame_id_numeric manager_id year

. count if frame_id_numeric == frame_id_numeric[_n-1] & manager_id == manager_i
> d[_n-1] & year != (year[_n-1] + 1)
  6,537

. 
. * hired or fired ceo since last observed year of firm
. tempvar previous_year

. generate previous_year = .
(1,121,844 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `previous_year' = max(cond(year 
> < `t', year, .))
  3.         quietly replace previous_year = `previous_year' if year == `t'
  4.         drop `previous_year'
  5. }

. 
. tempvar next_year

. generate next_year = .
(1,121,844 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `next_year' = min(cond(year > `t
> ', year, .))
  3.         quietly replace next_year = `next_year' if year == `t'
  4.         drop `next_year'
  5. }

. 
. generate byte hire = (job_begin <= year) & (job_begin > previous_year) & !mis
> sing(previous_year)

. * first cohort of managers are classified as newly hired
. replace hire = 1 if job_begin == first_cohort
(503,472 real changes made)

. generate byte fire = (job_end >= year) & (job_end < next_year) & !missing(nex
> t_year)

. tabulate hire fire 

           |         fire
      hire |         0          1 |     Total
-----------+----------------------+----------
         0 |   480,003     45,826 |   525,829 
         1 |   550,568     45,447 |   596,015 
-----------+----------------------+----------
     Total | 1,030,571     91,273 | 1,121,844 

. 
. generate byte expat = foreignness > 0

. 
. * manager change may anticipate foreign change by max this many years
. local anticipation 1

. local lag 1

. tempvar time_foreign first_year_foreign ever_expat

. ***********************
. * time invariant vars and drop entire series of firms from sample *
. ***********************
. by frame_id_numeric: egen `first_year_foreign' = min(cond(foreign == 1, year,
> .))
(850,100 missing values generated)

. generate `time_foreign' = year - `first_year_foreign'
(850,100 missing values generated)

. by frame_id_numeric: egen `ever_expat' = max((expat == 1) & inrange(`time_for
> eign', -`anticipation', `lag'))

. by frame_id_numeric: egen first_year_hire = min(cond((hire == 1) & (`time_for
> eign' >= -`anticipation'), job_begin,.))
(73,258 missing values generated)

. by frame_id_numeric: egen first_year_expat = min(cond(expat == 1, job_begin,.
> ))
(891,352 missing values generated)

. by frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.)
> )
(850,100 missing values generated)

. 
. * which of the two happened first?
. generate expat_after_owner = first_year_expat - first_year_foreign
(921,909 missing values generated)

. generate manager_after_owner = first_year_hire - first_year_foreign
(862,705 missing values generated)

. tabulate manager_after_owner

manager_aft |
   er_owner |      Freq.     Percent        Cum.
------------+-----------------------------------
        -27 |        283        0.11        0.11
        -26 |         92        0.04        0.14
        -25 |        202        0.08        0.22
        -24 |        204        0.08        0.30
        -23 |        141        0.05        0.36
        -22 |        173        0.07        0.42
        -21 |        112        0.04        0.47
        -20 |        117        0.05        0.51
        -19 |        185        0.07        0.58
        -18 |        451        0.17        0.76
        -17 |        756        0.29        1.05
        -16 |      1,156        0.45        1.49
        -15 |        704        0.27        1.77
        -14 |        658        0.25        2.02
        -13 |      1,011        0.39        2.41
        -12 |      1,247        0.48        2.89
        -11 |      1,360        0.52        3.42
        -10 |      1,317        0.51        3.92
         -9 |      1,611        0.62        4.55
         -8 |      1,616        0.62        5.17
         -7 |      1,526        0.59        5.76
         -6 |      2,456        0.95        6.71
         -5 |      2,760        1.07        7.77
         -4 |      3,177        1.23        9.00
         -3 |      5,139        1.98       10.98
         -2 |      6,815        2.63       13.61
         -1 |     28,186       10.88       24.49
          0 |    148,438       57.28       81.77
          1 |     14,333        5.53       87.30
          2 |      7,552        2.91       90.21
          3 |      5,697        2.20       92.41
          4 |      3,455        1.33       93.75
          5 |      2,895        1.12       94.86
          6 |      2,635        1.02       95.88
          7 |      2,393        0.92       96.80
          8 |      1,444        0.56       97.36
          9 |      1,210        0.47       97.83
         10 |        845        0.33       98.15
         11 |        612        0.24       98.39
         12 |      1,162        0.45       98.84
         13 |        608        0.23       99.07
         14 |        375        0.14       99.22
         15 |        459        0.18       99.39
         16 |        322        0.12       99.52
         17 |        223        0.09       99.60
         18 |        155        0.06       99.66
         19 |        328        0.13       99.79
         20 |        144        0.06       99.85
         21 |         87        0.03       99.88
         22 |         91        0.04       99.91
         23 |         59        0.02       99.94
         25 |         86        0.03       99.97
         26 |         76        0.03      100.00
------------+-----------------------------------
      Total |    259,139      100.00

. 
. * if foreign manager arrives up to X years before or Y years later than forei
> gn owner, use foreign manager as arrival date. 
. forvalues t = -`anticipation'/-1 {
  2.         local k = abs(`t') - 1
  3.         replace foreign = 1 if (expat_after_owner == `t')       & inrange(
> year - first_year_expat, 0, `k')      & `ever_expat' 
  4. }
(481 real changes made)

. forvalues t = 1/`lag' {
  2.         local minust = -`t'
  3.         replace foreign = 0 if (expat_after_owner == `t')       & inrange(
> year - first_year_expat, `minust', -1)        & `ever_expat'
  4. }
(682 real changes made)

. * drop firms where expat arrives earlier than X years before owner
. drop if first_year_expat - first_year_foreign < -`anticipation'
(12,962 observations deleted)

. 
. * ever expat and foreign created after foreign changes (drops were firm level
>  before so should not mess with ever variables)
. foreach X of var expat foreign {
  2.         by frame_id_numeric: egen ever_`X' = max(`X'==1)
  3. }

. 
. * drop if there was an expat but was never foreign - these are likely error
. drop if ever_expat == 1 & ever_foreign == 0
(30,592 observations deleted)

. 
. * drop too many CEO-s
. egen fp_tag = tag(frame_id_numeric manager_id) 

. by frame_id_numeric: egen n_ceo_ever = sum(fp_tag)

. drop if n_ceo_ever > 15
(29,763 observations deleted)

. drop fp_tag n_ceo_ever

.         
. * create firm-year data
. collapse (firstnm) foreign ever_expat ever_foreign (count) n_ceo = expat (max
> ) hire_ceo = hire fire_ceo = fire foreignness, by(frame_id_numeric year)

. label values foreignness foreignness

. * define expat as any foreign link. we can limit the sample later
. generate has_expat_ceo = foreignness > 0 & !missing(foreignness)

. 
. * if there is a change in the ceo team, hiring, increement the spell counter
. bys frame_id_numeric (year): gen ceo_spell = sum(hire_ceo) + 1 // so that ind
> ex start from 1

. 
. count
  733,860

. compress
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable n_ceo was long now byte
  variable has_expat_ceo was float now byte
  variable ceo_spell was float now byte
  (11,007,900 bytes saved)

. save "`here'/temp/firm_events.dta", replace
(file /Users/koren/Tresorit/Mac/projects/expat//temp/firm_events.dta not
    found)
file /Users/koren/Tresorit/Mac/projects/expat//temp/firm_events.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/firm_panel.log
  log type:  text
 closed on:  27 May 2024, 16:40:00
-------------------------------------------------------------------------------

. 
end of do-file
