
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/create/firm_panel.do 

. *Betöltés
. set more off

. clear all

. capture log close

. 
. * find root folder
. here
/Users/koren/Tresorit/Mac/projects/expat/

. local here = r(here)

. 
. log using "`here'/output/firm_panel", text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/firm_panel.log
  log type:  text
 opened on:  26 Jan 2024, 18:39:05

. 
. * keep only sample from balance-small
. use "`here'/temp/balance-small-clean.dta"

. by frame_id_numeric: egen firm_birth = min(year)

. by frame_id_numeric: egen firm_death = max(year)

. keep frame_id year firm_birth firm_death foreign

. tempfile sample

. save `sample', replace
(file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St63959.000001 not
    found)
file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St63959.000001 saved
    as .dta format

. 
. use "`here'/input/ceo-panel/ceo-panel.dta", clear 

. rename person_id manager_id

. 
. * only keep sample firms
. merge m:1 frame_id_numeric year using `sample', keep(match) nogen
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           527,554  
    -----------------------------------------

. count if first_year_of_firm == firm_birth
  302,527

. 
. *for descriptives (number of ceo-s and nceo-s in original data, number of ceo
>  and nceo job-spells in original data)
. count
  527,554

. egen company_manager_id = group(frame_id_numeric manager_id)

. codebook manager_id

-------------------------------------------------------------------------------
manager_id                                       group(manager_id manager_type)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [31,1522626]                  Units: 1
         Unique values: 80,218                    Missing .: 0/527,554

                  Mean: 819478
             Std. dev.: 386661

           Percentiles:    10%       25%       50%       75%       90%
                        287783    550442    799819   1.1e+06   1.4e+06

. codebook company_manager_id

-------------------------------------------------------------------------------
company_manager_id                           group(frame_id_numeric manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [1,92284]                     Units: 1
         Unique values: 92,284                    Missing .: 0/527,554

                  Mean: 40685.3
             Std. dev.: 25042.6

           Percentiles:     10%       25%       50%       75%       90%
                           6923     19515     39901     59823     75286

. 
. * balance panel
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. by company_manager_id: generate gap = year - year[_n-1] - 1
(92,284 missing values generated)

. replace gap = 0 if missing(gap)
(92,284 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    521,059       98.77       98.77
          1 |      3,298        0.63       99.39
          2 |      1,033        0.20       99.59
          3 |        642        0.12       99.71
          4 |        391        0.07       99.79
          5 |        329        0.06       99.85
          6 |        207        0.04       99.89
          7 |        138        0.03       99.91
          8 |        110        0.02       99.93
          9 |        109        0.02       99.95
         10 |         56        0.01       99.97
         11 |         35        0.01       99.97
         12 |         30        0.01       99.98
         13 |         28        0.01       99.98
         14 |         21        0.00       99.99
         15 |         19        0.00       99.99
         16 |         11        0.00       99.99
         17 |         10        0.00       99.99
         18 |          6        0.00      100.00
         19 |          5        0.00      100.00
         20 |          7        0.00      100.00
         21 |          4        0.00      100.00
         22 |          2        0.00      100.00
         23 |          1        0.00      100.00
         24 |          1        0.00      100.00
         25 |          2        0.00      100.00
------------+-----------------------------------
      Total |    527,554      100.00

. 
. * fill in holes of 1 year, but not longer
. expand 1 + (gap == 1), generate(filled_in)
(3,298 observations created)

. replace year = year - 1 if filled_in
(3,298 real changes made)

. 
. * create contiguous spells
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. gen change = ceo != L.ceo

. bysort company_manager_id (year): gen job_spell = sum(change)

. 
. * create job begin and end for each manager spell
. bys frame_id_numeric manager_id job_spell: egen job_begin = min(year)

. bys frame_id_numeric manager_id job_spell: egen job_end = max(year)

. keep frame_id_numeric manager_id job_spell year job_begin job_end expat firm_
> birth foreign

. 
. * if first managers arrive in year 1, extrapolate to year 0 - DROP SPELL
. bys frame_id_numeric: egen first_cohort = min(job_begin)

. replace job_begin = job_begin - 1 if (first_cohort == firm_birth + 1) & (job_
> begin == first_cohort)
(60,198 real changes made)

. 
. * NOTE: no collapse and expand --> there might be holes
. sort frame_id_numeric manager_id year

. count if frame_id_numeric == frame_id_numeric[_n-1] & manager_id == manager_i
> d[_n-1] & year != (year[_n-1] + 1)
  3,197

. 
. * expat before 1990 are mostly error, convert them to locals
. replace expat = 0 if job_begin < 1990
(690 real changes made)

. 
. ***********************
. * time invariant vars and drop entire series of firms from sample *
. ***********************
. by frame_id_numeric: egen first_year_expat = min(cond(expat == 1, job_begin,.
> ))
(444,831 missing values generated)

. by frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.)
> )
(436,042 missing values generated)

. 
. * which of the two happened first?
. generate manager_after_owner = first_year_expat - first_year_foreign
(462,274 missing values generated)

. tabulate manager_after_owner

manager_aft |
   er_owner |      Freq.     Percent        Cum.
------------+-----------------------------------
        -27 |        122        0.18        0.18
        -26 |        128        0.19        0.36
        -25 |         61        0.09        0.45
        -24 |         70        0.10        0.56
        -23 |        113        0.16        0.72
        -21 |         37        0.05        0.77
        -20 |         38        0.06        0.83
        -19 |        116        0.17        1.00
        -18 |         35        0.05        1.05
        -17 |         60        0.09        1.14
        -16 |        133        0.19        1.33
        -15 |         70        0.10        1.43
        -14 |        116        0.17        1.60
        -13 |        450        0.66        2.26
        -12 |        218        0.32        2.58
        -11 |        147        0.21        2.79
        -10 |        222        0.32        3.11
         -9 |        225        0.33        3.44
         -8 |        454        0.66        4.10
         -7 |        454        0.66        4.77
         -6 |        500        0.73        5.50
         -5 |        438        0.64        6.13
         -4 |        447        0.65        6.79
         -3 |      1,347        1.96        8.75
         -2 |        266        0.39        9.14
         -1 |     14,559       21.23       30.37
          0 |     33,150       48.34       78.71
          1 |        952        1.39       80.10
          2 |      2,028        2.96       83.05
          3 |      1,449        2.11       85.17
          4 |      1,320        1.92       87.09
          5 |      1,156        1.69       88.78
          6 |      1,259        1.84       90.61
          7 |        831        1.21       91.82
          8 |        894        1.30       93.13
          9 |        821        1.20       94.32
         10 |        829        1.21       95.53
         11 |        497        0.72       96.26
         12 |        611        0.89       97.15
         13 |        255        0.37       97.52
         14 |        245        0.36       97.88
         15 |        107        0.16       98.03
         16 |        157        0.23       98.26
         17 |        404        0.59       98.85
         18 |        211        0.31       99.16
         19 |        117        0.17       99.33
         20 |         35        0.05       99.38
         21 |        103        0.15       99.53
         22 |         45        0.07       99.60
         23 |         34        0.05       99.65
         24 |        135        0.20       99.84
         26 |         66        0.10       99.94
         28 |         41        0.06      100.00
------------+-----------------------------------
      Total |     68,578      100.00

. * event time relative to that
. generate event_time = year - first_year_expat
(444,831 missing values generated)

. 
. * if foreign manager arrives up to X years before or Y years later than forei
> gn owner, use foreign manager as arrival date. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(39 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(46 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(28 real changes made)

. 
. * drop firms where expat arrives earlier than X years before owner
. drop if manager_after_owner < -2
(6,001 observations deleted)

. 
. * ever expat and foreign created after foreign changes (drops were firm level
>  before so should not mess with ever variables)
. foreach X of var expat foreign {
  2.         by frame_id_numeric: egen ever_`X' = max(`X'==1)
  3. }

. 
. * drop if there was an expat but was never foreign - these are likely error
. drop if ever_expat == 1 & ever_foreign == 0
(17,443 observations deleted)

. 
. * drop too many CEO-s
. egen fp_tag = tag(frame_id_numeric manager_id) 

. by frame_id_numeric: egen n_ceo_ever = sum(fp_tag)

. drop if n_ceo > 15
(13,554 observations deleted)

. drop fp_tag n_ceo_ever

.         
. * hired or fired ceo since last observed year of firm
. tempvar previous_year

. generate previous_year = .
(493,854 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `previous_year' = max(cond(year 
> < `t', year, .))
  3.         quietly replace previous_year = `previous_year' if year == `t'
  4.         drop `previous_year'
  5. }

. 
. tempvar next_year

. generate next_year = .
(493,854 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `next_year' = min(cond(year > `t
> ', year, .))
  3.         quietly replace next_year = `next_year' if year == `t'
  4.         drop `next_year'
  5. }

. 
. generate byte hire = (job_begin <= year) & (job_begin > previous_year) & !mis
> sing(previous_year)

. generate byte fire = (job_end >= year) & (job_end < next_year) & !missing(nex
> t_year)

. tabulate hire fire 

           |         fire
      hire |         0          1 |     Total
-----------+----------------------+----------
         0 |   420,657     32,643 |   453,300 
         1 |    35,254      5,300 |    40,554 
-----------+----------------------+----------
     Total |   455,911     37,943 |   493,854 

. 
. * number of expats and locals
. bys frame_id_numeric year: egen n_expat_ceo = total(cond(expat, 1, 0))

. bys frame_id_numeric year: egen n_local_ceo = total(cond(!expat, 1, 0))

. 
. * create firm-year data
. collapse (firstnm) n_expat_ceo n_local_ceo foreign ever_expat ever_foreign (c
> ount) n_ceo = expat (max) hire_ceo = hire fire_ceo = fire, by(frame_id_numeri
> c year)

. 
. * if there is a change in the ceo team, hiring or firing, increement the spel
> l counter
. bys frame_id_numeric (year): gen ceo_spell = sum(hire_ceo | fire_ceo) + 1 // 
> so that index start from 1

. 
. tabulate n_expat_ceo n_local_ceo

 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         0          1          2          3          4 |     Total
-----------+-------------------------------------------------------+----------
         0 |         0    233,673     64,953     18,408      3,669 |   324,594 
         1 |     7,285      4,895      1,051        211         66 |    13,528 
         2 |     2,846      1,299        247         52         15 |     4,465 
         3 |       702        287         84         14         14 |     1,102 
         4 |       191         37         14          1          0 |       243 
         5 |        49         33          2          0          0 |        87 
         6 |        27          4          0          0          0 |        40 
         7 |         4          0          0          0          0 |         4 
-----------+-------------------------------------------------------+----------
     Total |    11,104    240,228     66,351     18,686      3,764 |   344,063 


 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         5          6          7          8          9 |     Total
-----------+-------------------------------------------------------+----------
         0 |     2,514        575        525        115        106 |   324,594 
         1 |        17          3          0          0          0 |    13,528 
         2 |         4          2          0          0          0 |     4,465 
         3 |         1          0          0          0          0 |     1,102 
         4 |         0          0          0          0          0 |       243 
         5 |         3          0          0          0          0 |        87 
         6 |         9          0          0          0          0 |        40 
         7 |         0          0          0          0          0 |         4 
-----------+-------------------------------------------------------+----------
     Total |     2,548        580        525        115        106 |   344,063 


 (firstnm) |
n_expat_ce |            (firstnm) n_local_ceo
         o |        10         11         12         13 |     Total
-----------+--------------------------------------------+----------
         0 |        22         28          4          2 |   324,594 
         1 |         0          0          0          0 |    13,528 
         2 |         0          0          0          0 |     4,465 
         3 |         0          0          0          0 |     1,102 
         4 |         0          0          0          0 |       243 
         5 |         0          0          0          0 |        87 
         6 |         0          0          0          0 |        40 
         7 |         0          0          0          0 |         4 
-----------+--------------------------------------------+----------
     Total |        22         28          4          2 |   344,063 

. * create dummies from numbers
. foreach var in expat local {
  2.         gen has_`var'_ceo = (n_`var'_ceo > 0) & !missing(n_`var'_ceo)
  3. }

.         
. count
  344,063

. compress
  variable year was float now int
  variable n_expat_ceo was float now byte
  variable n_local_ceo was float now byte
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable n_ceo was long now byte
  variable ceo_spell was float now byte
  variable has_expat_ceo was float now byte
  variable has_local_ceo was float now byte
  (8,945,638 bytes saved)

. save "`here'/temp/firm_events.dta", replace
file /Users/koren/Tresorit/Mac/projects/expat//temp/firm_events.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/firm_panel.log
  log type:  text
 closed on:  26 Jan 2024, 18:39:35
-------------------------------------------------------------------------------

. 
end of do-file
