
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       BE—Basic Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 6-user network perpetual
Serial number: 501706335292
  Licensed to: Miklos Koren
               Central European University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.

. do code/create/manager_country.do 

. clear all

. here
/srv/sandbox/expat/almos/

. local here = r(here)

. use "`here'/input/ceo-panel/ceo-panel.dta", clear

. 
. rename person_id manager_id

. 
. * same manager with multiple countries changed to mode country
. tab country_code expat, missing

country_co |         expat
        de |         0          1 |     Total
-----------+----------------------+----------
           |    62,373      7,992 |    70,365 
        AD |         0         26 |        26 
        AE |         0      1,623 |     1,623 
        AF |         0        102 |       102 
        AG |         0         13 |        13 
        AL |         0        516 |       516 
        AM |         0        599 |       599 
        AN |         0        262 |       262 
        AO |         0         35 |        35 
        AQ |         0          2 |         2 
        AR |         0        318 |       318 
        AS |         0         64 |        64 
        AT |         0    109,054 |   109,054 
        AU |         0      3,283 |     3,283 
        AW |         0          6 |         6 
        AZ |         0        256 |       256 
        BA |         0      1,215 |     1,215 
        BB |         0         87 |        87 
        BD |         0         48 |        48 
        BE |         0     10,472 |    10,472 
        BF |         0          6 |         6 
        BG |         0      2,797 |     2,797 
        BH |         0        534 |       534 
        BI |         0         30 |        30 
        BJ |         0         17 |        17 
        BL |         0         28 |        28 
        BM |         0         33 |        33 
        BN |         0         20 |        20 
        BO |         0        197 |       197 
        BR |         0        550 |       550 
        BS |         0        149 |       149 
        BT |         0         67 |        67 
        BW |         0         19 |        19 
        BY |         0        995 |       995 
        BZ |         0         48 |        48 
        CA |         0      6,565 |     6,565 
        CD |         0         24 |        24 
        CF |         0          2 |         2 
        CG |         0         28 |        28 
        CH |         0     19,793 |    19,793 
        CI |         0          9 |         9 
        CK |         0          3 |         3 
        CL |         0         92 |        92 
        CM |         0        111 |       111 
        CN |         0     77,899 |    77,899 
        CO |         0        135 |       135 
        CR |         0        314 |       314 
        CS |         0        436 |       436 
        CU |         0         98 |        98 
        CW |         0          1 |         1 
        CY |         0      1,076 |     1,076 
        CZ |         0     10,083 |    10,083 
        DE |         0    119,442 |   119,442 
        DK |         0      2,368 |     2,368 
        DM |         0         76 |        76 
        DO |         0         99 |        99 
        DZ |         0        689 |       689 
        EC |         0         68 |        68 
        EE |         0        377 |       377 
        EG |         0      2,390 |     2,390 
        EH |         0          9 |         9 
        ER |         0          7 |         7 
        ES |         0      9,414 |     9,414 
        ET |         0        213 |       213 
        FI |         0      2,302 |     2,302 
        FJ |         0          1 |         1 
        FR |         0     15,421 |    15,421 
        FX |         0     21,512 |    21,512 
        GA |         0         39 |        39 
        GB |         0     25,561 |    25,561 
        GD |         0         10 |        10 
        GE |         0        646 |       646 
        GF |         0         11 |        11 
        GG |         0         22 |        22 
        GH |         0         32 |        32 
        GI |         0         25 |        25 
        GM |         0         20 |        20 
        GN |         0         84 |        84 
        GQ |         0          2 |         2 
        GR |         0      2,719 |     2,719 
        GT |         0         15 |        15 
        GU |         0         24 |        24 
        GW |         0         76 |        76 
        GY |         0         27 |        27 
        HK |         0        974 |       974 
        HN |         0         42 |        42 
        HR |         0     11,126 |    11,126 
        HU |12,350,266    318,667 |12,668,933 
        ID |         0        179 |       179 
        IE |         0     11,796 |    11,796 
        IL |         0     25,608 |    25,608 
        IM |         0         17 |        17 
        IN |         0      2,516 |     2,516 
        IQ |         0        432 |       432 
        IR |         0      2,718 |     2,718 
        IS |         0        852 |       852 
        IT |         0     42,967 |    42,967 
        JE |         0          3 |         3 
        JM |         0         18 |        18 
        JO |         0        847 |       847 
        JP |         0      2,730 |     2,730 
        KE |         0         37 |        37 
        KG |         0         61 |        61 
        KH |         0         64 |        64 
        KI |         0         12 |        12 
        KM |         0          1 |         1 
        KN |         0         23 |        23 
        KP |         0         25 |        25 
        KR |         0      1,648 |     1,648 
        KW |         0        296 |       296 
        KY |         0         40 |        40 
        KZ |         0      1,775 |     1,775 
        LA |         0         14 |        14 
        LB |         0        756 |       756 
        LI |         0        638 |       638 
        LK |         0         41 |        41 
        LR |         0         18 |        18 
        LS |         0         11 |        11 
        LT |         0        926 |       926 
        LU |         0      1,388 |     1,388 
        LV |         0        711 |       711 
        LY |         0        550 |       550 
        MA |         0        158 |       158 
        MC |         0        349 |       349 
        MD |         0      1,003 |     1,003 
        ME |         0         93 |        93 
        MG |         0         38 |        38 
        MK |         0      1,254 |     1,254 
        ML |         0         76 |        76 
        MM |         0         18 |        18 
        MN |         0      1,255 |     1,255 
        MO |         0        147 |       147 
        MQ |         0          1 |         1 
        MS |         0         11 |        11 
        MT |         0        622 |       622 
        MU |         0         67 |        67 
        MV |         0         18 |        18 
        MX |         0        238 |       238 
        MY |         0        356 |       356 
        MZ |         0          9 |         9 
        NC |         0         23 |        23 
        NE |         0        179 |       179 
        NF |         0         11 |        11 
        NG |         0        589 |       589 
        NI |         0         77 |        77 
        NL |         0     23,410 |    23,410 
        NO |         0      1,369 |     1,369 
        NP |         0         48 |        48 
        NR |         0          7 |         7 
        NZ |         0        193 |       193 
        OM |         0         88 |        88 
        PA |         0        122 |       122 
        PE |         0         94 |        94 
        PF |         0          1 |         1 
        PG |         0          3 |         3 
        PH |         0        190 |       190 
        PK |         0        555 |       555 
        PL |         0      8,932 |     8,932 
        PM |         0          9 |         9 
        PR |         0         18 |        18 
        PS |         0         14 |        14 
        PT |         0      1,375 |     1,375 
        PW |         0          2 |         2 
        PY |         0         46 |        46 
        QA |         0        167 |       167 
        RE |         0         12 |        12 
        RO |         0     88,013 |    88,013 
        RS |         0     70,185 |    70,185 
        RU |         0     36,494 |    36,494 
        SA |         0        306 |       306 
        SB |         0        557 |       557 
        SC |         0        257 |       257 
        SD |         0         47 |        47 
        SE |         0      7,059 |     7,059 
        SG |         0        692 |       692 
        SH |         0          3 |         3 
        SI |         0      2,473 |     2,473 
        SK |         0     27,424 |    27,424 
        SL |         0      1,376 |     1,376 
        SM |         0      1,274 |     1,274 
        SN |         0         62 |        62 
        SO |         0        145 |       145 
        SR |         0      4,928 |     4,928 
        ST |         0          6 |         6 
        SV |         0        209 |       209 
        SX |         0         21 |        21 
        SY |         0      3,167 |     3,167 
        SZ |         0         30 |        30 
        TC |         0          1 |         1 
        TD |         0          3 |         3 
        TG |         0         57 |        57 
        TH |         0        469 |       469 
        TJ |         0         15 |        15 
        TM |         0         20 |        20 
        TN |         0        213 |       213 
        TO |         0         16 |        16 
        TR |         0      8,027 |     8,027 
        TT |         0         35 |        35 
        TW |         0        636 |       636 
        TZ |         0         56 |        56 
        UA |         0     60,341 |    60,341 
        UG |         0         12 |        12 
        US |         0     23,545 |    23,545 
        UY |         0         73 |        73 
        UZ |         0        234 |       234 
        VA |         0        124 |       124 
        VE |         0        134 |       134 
        VG |         0          2 |         2 
        VN |         0      5,884 |     5,884 
        VU |         0         11 |        11 
        WS |         0         11 |        11 
        XK |         0        292 |       292 
        YE |         0         32 |        32 
        ZA |         0        616 |       616 
        ZM |         0          7 |         7 
        ZW |         0         18 |        18 
-----------+----------------------+----------
     Total |12,412,639  1,281,219 |13,693,858 

. bys frame_id_numeric manager_id: egen country_code_fill = mode(country_code),
>  minmode
warning: For at least one group, country_code contains all missing values.
         Generating missing values for the modes in these groups. Use option
         missing to treat missing values as a category.
(37,302 missing values generated)

. tab country_code_fill expat, missing

country_co |         expat
   de_fill |         0          1 |     Total
-----------+----------------------+----------
           |    32,808      4,494 |    37,302 
        AD |         0         15 |        15 
        AE |         0      1,585 |     1,585 
        AF |         0         98 |        98 
        AG |         0          8 |         8 
        AL |         0        487 |       487 
        AM |         0        598 |       598 
        AN |         0        119 |       119 
        AO |         0         36 |        36 
        AQ |         0          2 |         2 
        AR |         0        300 |       300 
        AS |         0         55 |        55 
        AT |         0    110,434 |   110,434 
        AU |         0      3,176 |     3,176 
        AW |         0          7 |         7 
        AZ |         0        251 |       251 
        BA |         0      1,191 |     1,191 
        BB |         0         87 |        87 
        BD |         0         56 |        56 
        BE |         0     10,638 |    10,638 
        BF |         0          6 |         6 
        BG |         0      2,745 |     2,745 
        BH |         0        557 |       557 
        BI |         0         30 |        30 
        BJ |         0         17 |        17 
        BL |         0         28 |        28 
        BM |         0         37 |        37 
        BN |         0         15 |        15 
        BO |         0        201 |       201 
        BR |         0        527 |       527 
        BS |         0        163 |       163 
        BT |         0         24 |        24 
        BW |         0         19 |        19 
        BY |         0      1,009 |     1,009 
        BZ |         0         48 |        48 
        CA |         0      6,718 |     6,718 
        CD |         0         26 |        26 
        CF |         0          2 |         2 
        CG |         0         31 |        31 
        CH |         0     19,992 |    19,992 
        CI |         0          9 |         9 
        CK |         0          1 |         1 
        CL |         0         92 |        92 
        CM |         0        115 |       115 
        CN |         0     76,487 |    76,487 
        CO |         0        110 |       110 
        CR |         0        278 |       278 
        CS |         0        426 |       426 
        CU |         0         92 |        92 
        CY |         0      1,101 |     1,101 
        CZ |         0     10,149 |    10,149 
        DE |         0    120,604 |   120,604 
        DK |         0      2,415 |     2,415 
        DM |         0         74 |        74 
        DO |         0         97 |        97 
        DZ |         0        702 |       702 
        EC |         0         68 |        68 
        EE |         0        371 |       371 
        EG |         0      2,348 |     2,348 
        EH |         0          9 |         9 
        ER |         0          4 |         4 
        ES |         0      9,519 |     9,519 
        ET |         0        229 |       229 
        FI |         0      2,239 |     2,239 
        FJ |         0          1 |         1 
        FR |         0     15,544 |    15,544 
        FX |         0     19,589 |    19,589 
        GA |         0         39 |        39 
        GB |         0     25,778 |    25,778 
        GE |         0        617 |       617 
        GF |         0          9 |         9 
        GG |         0         22 |        22 
        GH |         0         43 |        43 
        GI |         0         56 |        56 
        GM |         0         18 |        18 
        GN |         0         91 |        91 
        GQ |         0          2 |         2 
        GR |         0      2,712 |     2,712 
        GT |         0         20 |        20 
        GU |         0          8 |         8 
        GW |         0         76 |        76 
        GY |         0         30 |        30 
        HK |         0        954 |       954 
        HN |         0         30 |        30 
        HR |         0     11,075 |    11,075 
        HU |12,379,831    328,047 |12,707,878 
        ID |         0        181 |       181 
        IE |         0     11,737 |    11,737 
        IL |         0     25,678 |    25,678 
        IM |         0         14 |        14 
        IN |         0      2,441 |     2,441 
        IQ |         0        413 |       413 
        IR |         0      2,670 |     2,670 
        IS |         0        769 |       769 
        IT |         0     42,788 |    42,788 
        JE |         0          3 |         3 
        JM |         0         18 |        18 
        JO |         0        808 |       808 
        JP |         0      2,633 |     2,633 
        KE |         0         31 |        31 
        KG |         0         66 |        66 
        KH |         0         55 |        55 
        KI |         0          5 |         5 
        KM |         0          1 |         1 
        KN |         0         24 |        24 
        KP |         0         20 |        20 
        KR |         0      1,604 |     1,604 
        KW |         0        274 |       274 
        KY |         0         42 |        42 
        KZ |         0      1,755 |     1,755 
        LA |         0         12 |        12 
        LB |         0        757 |       757 
        LI |         0        583 |       583 
        LK |         0         33 |        33 
        LR |         0         18 |        18 
        LS |         0          9 |         9 
        LT |         0        916 |       916 
        LU |         0      1,329 |     1,329 
        LV |         0        699 |       699 
        LY |         0        554 |       554 
        MA |         0        154 |       154 
        MC |         0        352 |       352 
        MD |         0        992 |       992 
        ME |         0         78 |        78 
        MG |         0         38 |        38 
        MK |         0      1,249 |     1,249 
        ML |         0         74 |        74 
        MM |         0         16 |        16 
        MN |         0      1,264 |     1,264 
        MO |         0        147 |       147 
        MS |         0         10 |        10 
        MT |         0        563 |       563 
        MU |         0         62 |        62 
        MV |         0         18 |        18 
        MX |         0        234 |       234 
        MY |         0        367 |       367 
        NC |         0         19 |        19 
        NE |         0        177 |       177 
        NF |         0         11 |        11 
        NG |         0        588 |       588 
        NI |         0         76 |        76 
        NL |         0     23,600 |    23,600 
        NO |         0      1,358 |     1,358 
        NP |         0         49 |        49 
        NZ |         0        152 |       152 
        OM |         0         92 |        92 
        PA |         0        127 |       127 
        PE |         0         94 |        94 
        PF |         0          1 |         1 
        PH |         0        186 |       186 
        PK |         0        550 |       550 
        PL |         0      8,916 |     8,916 
        PM |         0          8 |         8 
        PR |         0         29 |        29 
        PS |         0         10 |        10 
        PT |         0      1,387 |     1,387 
        PY |         0         57 |        57 
        QA |         0        170 |       170 
        RE |         0         12 |        12 
        RO |         0     86,842 |    86,842 
        RS |         0     69,001 |    69,001 
        RU |         0     36,020 |    36,020 
        SA |         0        297 |       297 
        SB |         0        548 |       548 
        SC |         0        261 |       261 
        SD |         0         43 |        43 
        SE |         0      7,047 |     7,047 
        SG |         0        662 |       662 
        SH |         0          1 |         1 
        SI |         0      2,463 |     2,463 
        SK |         0     27,334 |    27,334 
        SL |         0      1,366 |     1,366 
        SM |         0      1,222 |     1,222 
        SN |         0         57 |        57 
        SO |         0        141 |       141 
        SR |         0      4,856 |     4,856 
        ST |         0          7 |         7 
        SV |         0        222 |       222 
        SX |         0         23 |        23 
        SY |         0      3,018 |     3,018 
        SZ |         0         30 |        30 
        TC |         0          1 |         1 
        TD |         0          3 |         3 
        TG |         0         47 |        47 
        TH |         0        447 |       447 
        TJ |         0         15 |        15 
        TM |         0         18 |        18 
        TN |         0        211 |       211 
        TO |         0         17 |        17 
        TR |         0      7,842 |     7,842 
        TT |         0         35 |        35 
        TW |         0        633 |       633 
        TZ |         0         56 |        56 
        UA |         0     59,996 |    59,996 
        UG |         0         12 |        12 
        US |         0     23,331 |    23,331 
        UY |         0         73 |        73 
        UZ |         0        219 |       219 
        VA |         0        126 |       126 
        VE |         0        128 |       128 
        VG |         0          2 |         2 
        VN |         0      5,225 |     5,225 
        VU |         0         11 |        11 
        WS |         0         11 |        11 
        XK |         0        281 |       281 
        YE |         0         22 |        22 
        ZA |         0        610 |       610 
        ZM |         0          7 |         7 
        ZW |         0         20 |        20 
-----------+----------------------+----------
     Total |12,412,639  1,281,219 |13,693,858 

. 
. * same manager with multiple countries changed to mode country
. bys manager_id: egen country_code_fill_manager = mode(country_code), minmode
warning: For at least one group, country_code contains all missing values.
         Generating missing values for the modes in these groups. Use option
         missing to treat missing values as a category.
(17,466 missing values generated)

. tab country_code_fill_manager expat, missing

country_co |
de_fill_ma |         expat
     nager |         0          1 |     Total
-----------+----------------------+----------
           |    14,993      2,473 |    17,466 
        AD |         0         15 |        15 
        AE |         0      1,608 |     1,608 
        AF |         0         99 |        99 
        AG |         0          7 |         7 
        AL |         0        466 |       466 
        AM |         0        587 |       587 
        AN |         0        114 |       114 
        AO |         0         36 |        36 
        AQ |         0          2 |         2 
        AR |         0        317 |       317 
        AS |         0         54 |        54 
        AT |         0    110,514 |   110,514 
        AU |         0      3,075 |     3,075 
        AW |         0          7 |         7 
        AZ |         0        265 |       265 
        BA |         0      1,160 |     1,160 
        BB |         0         83 |        83 
        BD |         0         51 |        51 
        BE |         0     10,693 |    10,693 
        BF |         0          6 |         6 
        BG |         0      2,712 |     2,712 
        BH |         0        565 |       565 
        BI |         0         28 |        28 
        BJ |         0         17 |        17 
        BL |         0         28 |        28 
        BM |         0         37 |        37 
        BN |         0         10 |        10 
        BO |         0        197 |       197 
        BR |         0        527 |       527 
        BS |         0        197 |       197 
        BT |         0         24 |        24 
        BW |         0         19 |        19 
        BY |         0        985 |       985 
        BZ |         0         48 |        48 
        CA |         0      6,438 |     6,438 
        CD |         0         20 |        20 
        CF |         0          2 |         2 
        CG |         0         33 |        33 
        CH |         0     19,827 |    19,827 
        CI |         0         12 |        12 
        CK |         0          1 |         1 
        CL |         0         92 |        92 
        CM |         0        109 |       109 
        CN |         0     73,735 |    73,735 
        CO |         0        122 |       122 
        CR |         0        264 |       264 
        CS |         0        421 |       421 
        CU |         0         96 |        96 
        CY |         0      1,064 |     1,064 
        CZ |         0     10,040 |    10,040 
        DE |         0    120,115 |   120,115 
        DK |         0      2,334 |     2,334 
        DM |         0         92 |        92 
        DO |         0         97 |        97 
        DZ |         0        689 |       689 
        EC |         0         68 |        68 
        EE |         0        364 |       364 
        EG |         0      2,361 |     2,361 
        EH |         0          9 |         9 
        ER |         0          4 |         4 
        ES |         0      9,498 |     9,498 
        ET |         0        214 |       214 
        FI |         0      2,211 |     2,211 
        FJ |         0          1 |         1 
        FR |         0     15,263 |    15,263 
        FX |         0     18,201 |    18,201 
        GA |         0         39 |        39 
        GB |         0     25,512 |    25,512 
        GE |         0        569 |       569 
        GF |         0          9 |         9 
        GG |         0         22 |        22 
        GH |         0         43 |        43 
        GI |         0         19 |        19 
        GM |         0         10 |        10 
        GN |         0        120 |       120 
        GQ |         0          2 |         2 
        GR |         0      2,743 |     2,743 
        GT |         0         12 |        12 
        GU |         0          8 |         8 
        GW |         0         63 |        63 
        GY |         0         30 |        30 
        HK |         0        939 |       939 
        HN |         0         29 |        29 
        HR |         0     11,032 |    11,032 
        HU |12,397,646    338,921 |12,736,567 
        ID |         0        180 |       180 
        IE |         0     11,852 |    11,852 
        IL |         0     26,036 |    26,036 
        IM |         0         14 |        14 
        IN |         0      2,404 |     2,404 
        IQ |         0        413 |       413 
        IR |         0      2,574 |     2,574 
        IS |         0        718 |       718 
        IT |         0     42,624 |    42,624 
        JE |         0          3 |         3 
        JM |         0         18 |        18 
        JO |         0        804 |       804 
        JP |         0      2,610 |     2,610 
        KE |         0         31 |        31 
        KG |         0         66 |        66 
        KH |         0         57 |        57 
        KI |         0          5 |         5 
        KM |         0          1 |         1 
        KN |         0         15 |        15 
        KP |         0         17 |        17 
        KR |         0      1,606 |     1,606 
        KW |         0        273 |       273 
        KY |         0         75 |        75 
        KZ |         0      1,760 |     1,760 
        LA |         0         12 |        12 
        LB |         0        740 |       740 
        LI |         0        565 |       565 
        LK |         0         33 |        33 
        LR |         0         18 |        18 
        LS |         0          3 |         3 
        LT |         0        915 |       915 
        LU |         0      1,355 |     1,355 
        LV |         0        713 |       713 
        LY |         0        550 |       550 
        MA |         0        158 |       158 
        MC |         0        343 |       343 
        MD |         0        989 |       989 
        ME |         0         72 |        72 
        MG |         0         35 |        35 
        MK |         0      1,244 |     1,244 
        ML |         0         59 |        59 
        MM |         0         10 |        10 
        MN |         0      1,250 |     1,250 
        MO |         0        146 |       146 
        MS |         0          9 |         9 
        MT |         0        562 |       562 
        MU |         0         62 |        62 
        MV |         0          9 |         9 
        MX |         0        230 |       230 
        MY |         0        373 |       373 
        NC |         0         14 |        14 
        NE |         0        158 |       158 
        NF |         0         11 |        11 
        NG |         0        566 |       566 
        NI |         0         77 |        77 
        NL |         0     23,524 |    23,524 
        NO |         0      1,354 |     1,354 
        NP |         0         49 |        49 
        NZ |         0        139 |       139 
        OM |         0         92 |        92 
        PA |         0        150 |       150 
        PE |         0        109 |       109 
        PF |         0          1 |         1 
        PH |         0        153 |       153 
        PK |         0        539 |       539 
        PL |         0      8,952 |     8,952 
        PM |         0          8 |         8 
        PR |         0         19 |        19 
        PS |         0         10 |        10 
        PT |         0      1,372 |     1,372 
        PY |         0         46 |        46 
        QA |         0        170 |       170 
        RE |         0         12 |        12 
        RO |         0     86,354 |    86,354 
        RS |         0     68,774 |    68,774 
        RU |         0     35,830 |    35,830 
        SA |         0        297 |       297 
        SB |         0        495 |       495 
        SC |         0        205 |       205 
        SD |         0         41 |        41 
        SE |         0      6,972 |     6,972 
        SG |         0        635 |       635 
        SH |         0          1 |         1 
        SI |         0      2,519 |     2,519 
        SK |         0     26,678 |    26,678 
        SL |         0      1,286 |     1,286 
        SM |         0      1,169 |     1,169 
        SN |         0         41 |        41 
        SO |         0        130 |       130 
        SR |         0      4,653 |     4,653 
        ST |         0          4 |         4 
        SV |         0        184 |       184 
        SX |         0         19 |        19 
        SY |         0      2,988 |     2,988 
        SZ |         0         34 |        34 
        TC |         0          1 |         1 
        TD |         0          3 |         3 
        TG |         0         47 |        47 
        TH |         0        432 |       432 
        TJ |         0         16 |        16 
        TM |         0         18 |        18 
        TN |         0        197 |       197 
        TO |         0         15 |        15 
        TR |         0      7,816 |     7,816 
        TT |         0         35 |        35 
        TW |         0        593 |       593 
        TZ |         0         56 |        56 
        UA |         0     60,019 |    60,019 
        UG |         0         12 |        12 
        US |         0     23,180 |    23,180 
        UY |         0         46 |        46 
        UZ |         0        213 |       213 
        VA |         0        132 |       132 
        VE |         0        125 |       125 
        VG |         0          2 |         2 
        VN |         0      4,913 |     4,913 
        VU |         0         11 |        11 
        WS |         0         11 |        11 
        XK |         0        272 |       272 
        YE |         0         22 |        22 
        ZA |         0        615 |       615 
        ZM |         0          7 |         7 
        ZW |         0         20 |        20 
-----------+----------------------+----------
     Total |12,412,639  1,281,219 |13,693,858 

. 
. * propagate country code for known names
. replace country_code = country_code_fill if missing(country_code) & !missing(
> country_code_fill)
(33,063 real changes made)

. replace country_code = country_code_fill_manager if missing(country_code) & !
> missing(country_code_fill_manager)
(19,836 real changes made)

. 
. drop if missing(country_code)
(17,466 observations deleted)

. * merge some easy-to-mix languages
. replace iso639 = "sk" if iso639 == "cs"
(0 real changes made)

. replace iso639 = "ru" if inlist(iso639, "bg", "uk", "sq")
(2 real changes made)

. replace iso639 = "sr" if inlist(iso639, "hr")
(0 real changes made)

. replace iso639 = "sv" if inlist(iso639, "no")
(8 real changes made)

. replace iso639 = "vi" if inlist(iso639, "th")
(0 real changes made)

. * flag non-expats as hungarian
. replace iso639 = "hu" if expat == 0
(12,397,642 real changes made)

. * NB: remove country-related languages
. levelsof iso639
`"de"' `"en"' `"es"' `"fr"' `"hu"' `"it"' `"nl"' `"pl"' `"pt"' `"ru"' `"sv"' `"
> vi"' `"zh"'

. local languages = r(levels)

. foreach lang in `languages' {
  2.         * add language inferred from name
.         generate byte cnt_`lang' = (iso639 == "`lang'")
  3. }

. 
. collapse (max) expat cnt_??, by(frame_id_numeric year country_code)

. drop expat

. 
. * convert YU country codes
. do "`here'/code/util/yugoslavia.do"

. local yugoslavia YU XS RS XM HR BA SI CS MK XK ME

. local ussr SU AM AZ BY GE KG KZ MD TJ TM UA UZ 

. 
. * Cannot separate Serbia and Montenegro, Kosovo
. replace country = "YU" if inlist(country, "XS", "XM", "CS", "RS", "XK", "ME")
(55,262 real changes made)

. 
. 
end of do-file

. 
. * adding all language codes for one firm-year into one variable
. generate str language_list = ""
(11,453,701 missing values generated)

. foreach language of var cnt_?? {
  2.         local lng = substr("`language'", 5, 2)
  3.         display "`lng'"
  4.         tempvar cnt
  5.         egen `cnt' = max(`language'), by(frame_id_numeric year)
  6.         replace language_list = language_list + "`lng'," if `cnt' == 1
  7.         drop `cnt'
  8. }
de
variable language_list was str1 now str3
(153 real changes made)
en
(3 real changes made)
es
(31 real changes made)
fr
(16 real changes made)
hu
variable language_list was str3 now str6
(10,583,334 real changes made)
it
(7 real changes made)
nl
(16 real changes made)
pl
(3 real changes made)
pt
(12 real changes made)
ru
(23 real changes made)
sv
(21 real changes made)
vi
(1 real change made)
zh
(3 real changes made)

. 
. * adding all country codes for one firm-year into one variable
. generate str country_list = ""
(11,453,701 missing values generated)

. levelsof country_code
`"AD"' `"AE"' `"AF"' `"AG"' `"AL"' `"AM"' `"AN"' `"AO"' `"AQ"' `"AR"' `"AS"' `"
> AT"' `"AU"' `"AW"' `"AZ"' `"BA"' `"BB"' `"BD"' `"BE"' `"BF"' `"BG"' `"BH"' `"
> BI"' `"BJ"' `"BL"' `"BM"' `"BN"' `"BO"' `"BR"' `"BS"' `"BT"' `"BW"' `"BY"' `"
> BZ"' `"CA"' `"CD"' `"CF"' `"CG"' `"CH"' `"CI"' `"CK"' `"CL"' `"CM"' `"CN"' `"
> CO"' `"CR"' `"CU"' `"CW"' `"CY"' `"CZ"' `"DE"' `"DK"' `"DM"' `"DO"' `"DZ"' `"
> EC"' `"EE"' `"EG"' `"EH"' `"ER"' `"ES"' `"ET"' `"FI"' `"FJ"' `"FR"' `"FX"' `"
> GA"' `"GB"' `"GD"' `"GE"' `"GF"' `"GG"' `"GH"' `"GI"' `"GM"' `"GN"' `"GQ"' `"
> GR"' `"GT"' `"GU"' `"GW"' `"GY"' `"HK"' `"HN"' `"HR"' `"HU"' `"ID"' `"IE"' `"
> IL"' `"IM"' `"IN"' `"IQ"' `"IR"' `"IS"' `"IT"' `"JE"' `"JM"' `"JO"' `"JP"' `"
> KE"' `"KG"' `"KH"' `"KI"' `"KM"' `"KN"' `"KP"' `"KR"' `"KW"' `"KY"' `"KZ"' `"
> LA"' `"LB"' `"LI"' `"LK"' `"LR"' `"LS"' `"LT"' `"LU"' `"LV"' `"LY"' `"MA"' `"
> MC"' `"MD"' `"MG"' `"MK"' `"ML"' `"MM"' `"MN"' `"MO"' `"MQ"' `"MS"' `"MT"' `"
> MU"' `"MV"' `"MX"' `"MY"' `"MZ"' `"NC"' `"NE"' `"NF"' `"NG"' `"NI"' `"NL"' `"
> NO"' `"NP"' `"NR"' `"NZ"' `"OM"' `"PA"' `"PE"' `"PF"' `"PG"' `"PH"' `"PK"' `"
> PL"' `"PM"' `"PR"' `"PS"' `"PT"' `"PW"' `"PY"' `"QA"' `"RE"' `"RO"' `"RU"' `"
> SA"' `"SB"' `"SC"' `"SD"' `"SE"' `"SG"' `"SH"' `"SI"' `"SK"' `"SL"' `"SM"' `"
> SN"' `"SO"' `"SR"' `"ST"' `"SV"' `"SX"' `"SY"' `"SZ"' `"TC"' `"TD"' `"TG"' `"
> TH"' `"TJ"' `"TM"' `"TN"' `"TO"' `"TR"' `"TT"' `"TW"' `"TZ"' `"UA"' `"UG"' `"
> US"' `"UY"' `"UZ"' `"VA"' `"VE"' `"VG"' `"VN"' `"VU"' `"WS"' `"YE"' `"YU"' `"
> ZA"' `"ZM"' `"ZW"'

. local countries = r(levels)

. foreach country in `countries' {
  2.         display "`country'"
  3.         tempvar cnt
  4.         egen `cnt' = max(country_code == "`country'"), by(frame_id_numeric
>  year)
  5.         replace country_list = country_list + "`country'," if `cnt' == 1
  6.         drop `cnt'
  7. }
AD
variable country_list was str1 now str3
(39 real changes made)
AE
(1,721 real changes made)
AF
(115 real changes made)
AG
(20 real changes made)
AL
variable country_list was str3 now str6
(581 real changes made)
AM
(492 real changes made)
AN
(156 real changes made)
AO
(39 real changes made)
AQ
(2 real changes made)
AR
(405 real changes made)
AS
(73 real changes made)
AT
(119,873 real changes made)
AU
(4,240 real changes made)
AW
(10 real changes made)
AZ
(254 real changes made)
BA
(1,283 real changes made)
BB
(155 real changes made)
BD
(58 real changes made)
BE
(12,596 real changes made)
BF
(10 real changes made)
BG
(3,076 real changes made)
BH
(581 real changes made)
BI
(32 real changes made)
BJ
(27 real changes made)
BL
(51 real changes made)
BM
(69 real changes made)
BN
(21 real changes made)
BO
(260 real changes made)
BR
(620 real changes made)
BS
(171 real changes made)
BT
(67 real changes made)
BW
(38 real changes made)
BY
(1,105 real changes made)
BZ
(48 real changes made)
CA
(9,135 real changes made)
CD
(30 real changes made)
CF
(2 real changes made)
CG
(32 real changes made)
CH
variable country_list was str6 now str9
(25,554 real changes made)
CI
(9 real changes made)
CK
(3 real changes made)
CL
(105 real changes made)
CM
(115 real changes made)
CN
(63,569 real changes made)
CO
(179 real changes made)
CR
(384 real changes made)
CU
(140 real changes made)
CW
(2 real changes made)
CY
(1,292 real changes made)
CZ
(12,873 real changes made)
DE
(139,280 real changes made)
DK
(2,822 real changes made)
DM
(102 real changes made)
DO
(111 real changes made)
DZ
(687 real changes made)
EC
(73 real changes made)
EE
(447 real changes made)
EG
(2,525 real changes made)
EH
(9 real changes made)
ER
(12 real changes made)
ES
(8,861 real changes made)
ET
(150 real changes made)
FI
(2,641 real changes made)
FJ
(1 real change made)
FR
variable country_list was str9 now str12
(18,848 real changes made)
FX
(27,812 real changes made)
GA
(69 real changes made)
GB
(31,630 real changes made)
GD
(5 real changes made)
GE
(689 real changes made)
GF
(13 real changes made)
GG
(35 real changes made)
GH
(36 real changes made)
GI
(102 real changes made)
GM
(47 real changes made)
GN
(94 real changes made)
GQ
(2 real changes made)
GR
(3,179 real changes made)
GT
(24 real changes made)
GU
(44 real changes made)
GW
(71 real changes made)
GY
(30 real changes made)
HK
(1,304 real changes made)
HN
(75 real changes made)
HR
(10,624 real changes made)
HU
variable country_list was str12 now str15
(10,827,524 real changes made)
ID
(220 real changes made)
IE
(11,234 real changes made)
IL
(26,650 real changes made)
IM
(29 real changes made)
IN
(2,626 real changes made)
IQ
(480 real changes made)
IR
(2,746 real changes made)
IS
(969 real changes made)
IT
(44,380 real changes made)
JE
(10 real changes made)
JM
(18 real changes made)
JO
(1,007 real changes made)
JP
(2,692 real changes made)
KE
(73 real changes made)
KG
(76 real changes made)
KH
(72 real changes made)
KI
(14 real changes made)
KM
(2 real changes made)
KN
(32 real changes made)
KP
(31 real changes made)
KR
(1,713 real changes made)
KW
(318 real changes made)
KY
(206 real changes made)
KZ
(1,820 real changes made)
LA
(16 real changes made)
LB
(892 real changes made)
LI
(774 real changes made)
LK
(55 real changes made)
LR
(26 real changes made)
LS
(14 real changes made)
LT
(1,028 real changes made)
LU
(2,233 real changes made)
LV
(796 real changes made)
LY
(588 real changes made)
MA
(230 real changes made)
MC
(525 real changes made)
MD
(1,180 real changes made)
MG
(48 real changes made)
MK
(1,244 real changes made)
ML
(76 real changes made)
MM
(26 real changes made)
MN
(980 real changes made)
MO
(150 real changes made)
MQ
(2 real changes made)
MS
(16 real changes made)
MT
(588 real changes made)
MU
(87 real changes made)
MV
(18 real changes made)
MX
(360 real changes made)
MY
(420 real changes made)
MZ
(18 real changes made)
NC
(47 real changes made)
NE
(233 real changes made)
NF
(28 real changes made)
NG
(672 real changes made)
NI
(107 real changes made)
NL
variable country_list was str15 now str18
(24,672 real changes made)
NO
(1,781 real changes made)
NP
(69 real changes made)
NR
(17 real changes made)
NZ
(283 real changes made)
OM
(177 real changes made)
PA
(173 real changes made)
PE
(109 real changes made)
PF
(1 real change made)
PG
(6 real changes made)
PH
(296 real changes made)
PK
(575 real changes made)
PL
(10,675 real changes made)
PM
(10 real changes made)
PR
(22 real changes made)
PS
(14 real changes made)
PT
(1,194 real changes made)
PW
(4 real changes made)
PY
(62 real changes made)
QA
(141 real changes made)
RE
(12 real changes made)
RO
(82,540 real changes made)
RU
(35,572 real changes made)
SA
(405 real changes made)
SB
(567 real changes made)
SC
(282 real changes made)
SD
(62 real changes made)
SE
(8,774 real changes made)
SG
(851 real changes made)
SH
(9 real changes made)
SI
(2,764 real changes made)
SK
(29,440 real changes made)
SL
(1,677 real changes made)
SM
(1,334 real changes made)
SN
(75 real changes made)
SO
(183 real changes made)
SR
(5,198 real changes made)
ST
(8 real changes made)
SV
(243 real changes made)
SX
(30 real changes made)
SY
(3,217 real changes made)
SZ
(51 real changes made)
TC
(1 real change made)
TD
(4 real changes made)
TG
(74 real changes made)
TH
(563 real changes made)
TJ
(24 real changes made)
TM
(21 real changes made)
TN
(286 real changes made)
TO
(27 real changes made)
TR
(8,195 real changes made)
TT
(23 real changes made)
TW
(739 real changes made)
TZ
(75 real changes made)
UA
(60,957 real changes made)
UG
(14 real changes made)
US
(29,991 real changes made)
UY
(95 real changes made)
UZ
(204 real changes made)
VA
(197 real changes made)
VE
(172 real changes made)
VG
(2 real changes made)
VN
(5,801 real changes made)
VU
(11 real changes made)
WS
(18 real changes made)
YE
(34 real changes made)
YU
(60,835 real changes made)
ZA
(728 real changes made)
ZM
(14 real changes made)
ZW
(24 real changes made)

. bysort frame_id_numeric year: generate keep = (_n==1)

. keep if keep
(181,387 observations deleted)

. keep frame_id_numeric year country_list language_list

. 
. compress
  (0 bytes saved)

. save "`here'/temp/manager_country.dta", replace
(file /srv/sandbox/expat/almos//temp/manager_country.dta not found)
file /srv/sandbox/expat/almos//temp/manager_country.dta saved

. 
end of do-file
