
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate/regressions.do 

. here
/Users/koren/Tresorit/Mac/projects/expat/

. global here = r(here)

. use "$here/temp/analysis_sample.dta", clear

. 
. *Samples
. global local_sample "(ever_local==1 | foreign==0)"

. global expat_sample "(ever_expat==1 | foreign==0)"

. 
. global varlist_rhs "lnK lnL TFP lnQ lnEx lnQd exporter"

. 
. tabulate foreignness ever_expat

                      |      ever_expat
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |     5,589      1,327 |     6,916 
Hungarian name, neigh |         0         33 |        33 
Foreign name, Hungari |         0        124 |       124 
Hungarian name, other |         0          5 |         5 
Foreign name, non-Wes |         0        222 |       222 
Foreign name, Western |         0      1,164 |     1,164 
----------------------+----------------------+----------
                Total |     5,589      2,875 |     8,464 

. tabulate foreignness ever_expat if time_foreign == 0

                      |      ever_expat
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |       732          0 |       732 
Hungarian name, neigh |         0         14 |        14 
Foreign name, Hungari |         0         36 |        36 
Hungarian name, other |         0          2 |         2 
Foreign name, non-Wes |         0         72 |        72 
Foreign name, Western |         0        313 |       313 
----------------------+----------------------+----------
                Total |       732        437 |     1,169 

. 
. tabulate time_foreign foreignness if inrange(time_foreign, -2, 2) 

time_forei |                   (max) foreignness
        gn | Hungarian  Hungarian  Foreign n  Hungarian  Foreign n |     Total
-----------+-------------------------------------------------------+----------
        -2 |       801          0          0          0          0 |       801 
        -1 |     1,123          0          0          0          0 |     1,126 
         0 |       732         14         36          2         72 |     1,169 
         1 |       664         10         30          1         45 |     1,009 
         2 |       534          5         23          1         43 |       827 
-----------+-------------------------------------------------------+----------
     Total |     3,854         29         89          4        160 |     4,932 


           |   (max)
           | foreignnes
time_forei |     s
        gn | Foreign n |     Total
-----------+-----------+----------
        -2 |         0 |       801 
        -1 |         3 |     1,126 
         0 |       313 |     1,169 
         1 |       259 |     1,009 
         2 |       221 |       827 
-----------+-----------+----------
     Total |       796 |     4,932 

. 
. tempvar western

. egen `western' = max(foreignness == 5), by(frame_id_numeric)

. 
. tabulate foreignness `western'

                      |       __000000
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |     5,928        988 |     6,916 
Hungarian name, neigh |        33          0 |        33 
Foreign name, Hungari |        85         39 |       124 
Hungarian name, other |         5          0 |         5 
Foreign name, non-Wes |       193         29 |       222 
Foreign name, Western |         0      1,164 |     1,164 
----------------------+----------------------+----------
                Total |     6,244      2,220 |     8,464 

. keep if ever_local | `western' == 1
(655 observations deleted)

. ****Average effect, foreign_hire sample, local and expat separately, xthdidre
> g
. 
. 
. *Full sample
. foreach Y in $varlist_rhs {
  2. 
.     display "`Y'"
  3. 
.     eststo clear
  4.     quietly xthdidregress ra (`Y') (local_ceo) if $local_sample, group(fra
> me_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  5.     eststo: quietly eventbaseline, pre(4) post(4) baseline(atet)
  6. 
.     quietly xthdidregress ra (`Y') (has_expat_ceo) if $expat_sample, group(fr
> ame_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  7.     eststo: quietly eventbaseline, pre(4) post(4) baseline(atet)
  8. 
.     eststo: quietly xt2treatments `Y',  treatment(has_expat_ceo) control(loca
> l_ceo) pre(4) post(4) baseline(atet)
  9. 
.     display "Full sample"
 10.     esttab, b(3) se  style(tex)
 11. 
. }
lnK
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnK             lnK             lnK   \\
------------------------------------------------------------
ATET                0.063           0.374**         0.347*  \\
                  (0.094)         (0.129)         (0.142)   \\
------------------------------------------------------------
N                    5908            4852            6730   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnL
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnL             lnL             lnL   \\
------------------------------------------------------------
ATET                0.117           0.550***        0.378** \\
                  (0.085)         (0.127)         (0.130)   \\
------------------------------------------------------------
N                    5908            4852            6730   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
TFP
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      TFP             TFP             TFP   \\
------------------------------------------------------------
ATET                0.053           0.138**         0.081   \\
                  (0.031)         (0.050)         (0.047)   \\
------------------------------------------------------------
N                    5908            4852            6730   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnQ
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnQ             lnQ             lnQ   \\
------------------------------------------------------------
ATET                0.255**         0.911***        0.687***\\
                  (0.083)         (0.148)         (0.154)   \\
------------------------------------------------------------
N                    5908            4852            6730   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnEx
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                     lnEx            lnEx            lnEx   \\
------------------------------------------------------------
ATET                0.915***        0.960***        0.272   \\
                  (0.177)         (0.219)         (0.231)   \\
------------------------------------------------------------
N                    2839            2446            3114   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnQd
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                     lnQd            lnQd            lnQd   \\
------------------------------------------------------------
ATET                0.165           0.657***        0.477** \\
                  (0.089)         (0.165)         (0.173)   \\
------------------------------------------------------------
N                    5858            4765            6622   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
exporter
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                 exporter        exporter        exporter   \\
------------------------------------------------------------
ATET                0.037           0.068*          0.024   \\
                  (0.024)         (0.034)         (0.034)   \\
------------------------------------------------------------
N                    5908            4852            6730   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. *Industrial sample
. preserve

. keep if industrial==1
(4,197 observations deleted)

. foreach Y in $varlist_rhs {
  2.     display "`Y'"
  3. 
.     eststo clear
  4.     quietly xthdidregress ra (`Y') (local_ceo) if $local_sample & industri
> al==1, group(frame_id_numeric) vce(cluster frame_id_numeric) controlgroup(not
> yet)
  5.     eststo: quietly eventbaseline, pre(4) post(4) baseline(atet)
  6.     quietly xthdidregress ra (`Y') (has_expat_ceo) if $expat_sample & indu
> strial==1, group(frame_id_numeric) vce(cluster frame_id_numeric) controlgroup
> (notyet)
  7.     eststo: quietly eventbaseline, pre(4) post(4) baseline(atet)
  8. 
.     eststo: quietly xt2treatments `Y',  treatment(has_expat_ceo) control(loca
> l_ceo) pre(4) post(4) baseline(atet)
  9. 
.     display "Industry sample"
 10.     esttab, b(3) se  style(tex)
 11. }
lnK
(est1 stored)
(est2 stored)
(est3 stored)
Industry sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnK             lnK             lnK   \\
------------------------------------------------------------
ATET                0.230           0.293           0.072   \\
                  (0.146)         (0.174)         (0.185)   \\
------------------------------------------------------------
N                    2650            2305            3157   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnL
(est1 stored)
(est2 stored)
(est3 stored)
Industry sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnL             lnL             lnL   \\
------------------------------------------------------------
ATET                0.215           0.257          -0.023   \\
                  (0.140)         (0.174)         (0.178)   \\
------------------------------------------------------------
N                    2650            2305            3157   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
TFP
(est1 stored)
(est2 stored)
(est3 stored)
Industry sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      TFP             TFP             TFP   \\
------------------------------------------------------------
ATET                0.083           0.073           0.040   \\
                  (0.054)         (0.061)         (0.055)   \\
------------------------------------------------------------
N                    2650            2305            3157   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnQ
(est1 stored)
(est2 stored)
(est3 stored)
Industry sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnQ             lnQ             lnQ   \\
------------------------------------------------------------
ATET                0.406**         0.598***        0.264   \\
                  (0.136)         (0.174)         (0.187)   \\
------------------------------------------------------------
N                    2650            2305            3157   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnEx
(est1 stored)
(est2 stored)
(est3 stored)
Industry sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                     lnEx            lnEx            lnEx   \\
------------------------------------------------------------
ATET                0.829***        0.820**         0.205   \\
                  (0.230)         (0.259)         (0.282)   \\
------------------------------------------------------------
N                    1711            1532            1994   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnQd
(est1 stored)
(est2 stored)
(est3 stored)
Industry sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                     lnQd            lnQd            lnQd   \\
------------------------------------------------------------
ATET                0.267           0.281           0.045   \\
                  (0.142)         (0.189)         (0.211)   \\
------------------------------------------------------------
N                    2609            2245            3076   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
exporter
(est1 stored)
(est2 stored)
(est3 stored)
Industry sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                 exporter        exporter        exporter   \\
------------------------------------------------------------
ATET                0.005           0.019          -0.025   \\
                  (0.040)         (0.045)         (0.045)   \\
------------------------------------------------------------
N                    2650            2305            3157   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. restore

. 
. *Service sample
. preserve

. keep if industrial==0
(3,612 observations deleted)

. foreach Y in $varlist_rhs {
  2. 
.     display "`Y'"
  3. 
.     eststo clear
  4.     quietly xthdidregress ra (`Y') (local_ceo) if $local_sample & industri
> al==0, group(frame_id_numeric) vce(cluster frame_id_numeric) controlgroup(not
> yet)
  5.     eststo: quietly eventbaseline, pre(4) post(4) baseline(atet)
  6.     quietly xthdidregress ra (`Y') (has_expat_ceo) if $expat_sample & indu
> strial==0, group(frame_id_numeric) vce(cluster frame_id_numeric) controlgroup
> (notyet)
  7.     eststo: quietly eventbaseline, pre(4) post(4) baseline(atet)
  8. 
.     eststo: quietly xt2treatments `Y',  treatment(has_expat_ceo) control(loca
> l_ceo) pre(4) post(4) baseline(atet)
  9. 
.     display "Service sample"
 10.     esttab, b(3) se style(tex)
 11. }
lnK
(est1 stored)
(est2 stored)
(est3 stored)
Service sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnK             lnK             lnK   \\
------------------------------------------------------------
ATET               -0.074           0.480*          0.622** \\
                  (0.121)         (0.196)         (0.222)   \\
------------------------------------------------------------
N                    3258            2547            3573   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnL
(est1 stored)
(est2 stored)
(est3 stored)
Service sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnL             lnL             lnL   \\
------------------------------------------------------------
ATET                0.064           0.994***        0.879***\\
                  (0.107)         (0.192)         (0.191)   \\
------------------------------------------------------------
N                    3258            2547            3573   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
TFP
(est1 stored)
(est2 stored)
(est3 stored)
Service sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      TFP             TFP             TFP   \\
------------------------------------------------------------
ATET                0.034           0.211*          0.121   \\
                  (0.036)         (0.085)         (0.082)   \\
------------------------------------------------------------
N                    3258            2547            3573   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnQ
(est1 stored)
(est2 stored)
(est3 stored)
Service sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnQ             lnQ             lnQ   \\
------------------------------------------------------------
ATET                0.135           1.336***        1.160***\\
                  (0.104)         (0.260)         (0.261)   \\
------------------------------------------------------------
N                    3258            2547            3573   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnEx
(est1 stored)
(est2 stored)
(est3 stored)
Service sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                     lnEx            lnEx            lnEx   \\
------------------------------------------------------------
ATET                0.930***        0.845*          0.142   \\
                  (0.234)         (0.403)         (0.422)   \\
------------------------------------------------------------
N                    1128             914            1120   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnQd
(est1 stored)
(est2 stored)
(est3 stored)
Service sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                     lnQd            lnQd            lnQd   \\
------------------------------------------------------------
ATET                0.103           1.210***        1.039***\\
                  (0.112)         (0.282)         (0.285)   \\
------------------------------------------------------------
N                    3249            2520            3546   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
exporter
(est1 stored)
(est2 stored)
(est3 stored)
Service sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                 exporter        exporter        exporter   \\
------------------------------------------------------------
ATET                0.034           0.111*          0.069   \\
                  (0.030)         (0.056)         (0.056)   \\
------------------------------------------------------------
N                    3258            2547            3573   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. restore

. 
. *****Figures
. 
. *Whole sample
. foreach Y in $varlist_rhs {
  2. 
.     quietly xthdidregress ra (`Y') (has_expat_ceo) if $expat_sample, group(fr
> ame_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  3.     eventbaseline, pre(4) post(4) baseline(-1) generate(event_expat)
  4. 
.     quietly xthdidregress ra (`Y') (local_ceo) if $local_sample, group(frame_
> id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  5.     eventbaseline, pre(4) post(4) baseline(-1) generate(event_local)
  6. 
.     frame event_expat: frlink 1:1 time, frame(event_local) generate(local)
  7.     frame event_expat: frget coef_local=coef upper_local=upper lower_local
> =lower, from(local)
  8. 
.     frame event_expat: graph twoway (rarea lower upper time, fcolor(red%10) l
> color(red%10)) (line coef time, color(red)) (rarea lower_local upper_local ti
> me, fcolor(gs10%10) lcolor(gs5%10)) (line coef_local time, color(grey)), grap
> hregion(color(white)) xlabel(-4(1)4) legend(off) xline(-0.5) xtitle("Event ti
> me") yline(0) 
  9. 
.     gr export "$here/output/twfe/expat_local_`Y'.pdf", replace
 10. 
. }

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 4,852

------------------------------------------------------------------------------
         lnK |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .2070417   .1312574     1.58   0.115     -.050218    .4643014
          -3 |   .1389857   .1204056     1.15   0.248    -.0970048    .3749763
          -2 |   .1149709   .0825116     1.39   0.164     -.046749    .2766907
          -1 |          0  (omitted)
           0 |   .2540524   .0666468     3.81   0.000     .1234271    .3846777
           1 |   .3726179   .0941647     3.96   0.000     .1880585    .5571773
           2 |   .4419768   .1164672     3.79   0.000     .2137053    .6702484
           3 |   .5257433   .1524532     3.45   0.001     .2269406    .8245461
           4 |   .8514679   .1858958     4.58   0.000     .4871188    1.215817
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 5,908

------------------------------------------------------------------------------
         lnK |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0712235   .0778102    -0.92   0.360    -.2237286    .0812817
          -3 |   .0078009   .0599575     0.13   0.896    -.1097135    .1253154
          -2 |   .0478627   .0419204     1.14   0.254    -.0342997    .1300251
          -1 |          0  (omitted)
           0 |   .0606722   .0463446     1.31   0.190    -.0301615    .1515059
           1 |   .0054018   .0661632     0.08   0.935    -.1242757    .1350793
           2 |   .0110472   .0916375     0.12   0.904    -.1685589    .1906534
           3 |   .0287841   .1188819     0.24   0.809    -.2042201    .2617883
           4 |   .1917837   .1525818     1.26   0.209    -.1072712    .4908386
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_lnK.pdf
    saved as PDF format

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 4,852

------------------------------------------------------------------------------
         lnL |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0171055   .1072894    -0.16   0.873    -.2273889    .1931778
          -3 |  -.0267307   .0882346    -0.30   0.762    -.1996672    .1462059
          -2 |  -.0437225   .0634097    -0.69   0.490    -.1680032    .0805581
          -1 |          0  (omitted)
           0 |   .2838843   .0790009     3.59   0.000     .1290454    .4387232
           1 |   .3625773   .1081268     3.35   0.001     .1506527     .574502
           2 |   .5698974   .1158432     4.92   0.000     .3428489     .796946
           3 |   .6575285   .1391467     4.73   0.000     .3848061     .930251
           4 |   .7650063   .1685949     4.54   0.000     .4345665    1.095446
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 5,908

------------------------------------------------------------------------------
         lnL |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0992637   .0746544     1.33   0.184    -.0470563    .2455837
          -3 |   .1455818   .0610308     2.39   0.017     .0259637    .2651999
          -2 |   .0535423     .04246     1.26   0.207    -.0296778    .1367624
          -1 |          0  (omitted)
           0 |   .1105423   .0459343     2.41   0.016     .0205127    .2005719
           1 |    .161998   .0628704     2.58   0.010     .0387742    .2852217
           2 |   .1891859   .0890479     2.12   0.034     .0146553    .3637166
           3 |   .2067951   .1076381     1.92   0.055    -.0041717    .4177619
           4 |    .290555   .1291657     2.25   0.024     .0373949    .5437151
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
