
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate/regressions.do 

. here
/Users/koren/Tresorit/Mac/projects/expat/

. global here = r(here)

. use "$here/temp/analysis_sample.dta", clear

. 
. *Samples
. global local_sample "(ever_local==1 | foreign==0)"

. global expat_sample "(ever_expat==1 | foreign==0)"

. 
. global varlist_rhs "lnK lnL TFP lnQ lnEx lnQd exporter"

. 
. tabulate foreignness ever_expat

                      |      ever_expat
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |     5,190      1,336 |     6,526 
Hungarian name, neigh |         0         23 |        23 
Foreign name, Hungari |         0        135 |       135 
Hungarian name, other |         0          4 |         4 
Foreign name, non-Wes |         0        200 |       200 
Foreign name, Western |         0      1,191 |     1,191 
----------------------+----------------------+----------
                Total |     5,190      2,889 |     8,079 

. tabulate foreignness ever_expat if time_foreign == 0

                      |      ever_expat
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |       670          0 |       670 
Hungarian name, neigh |         0         11 |        11 
Foreign name, Hungari |         0         36 |        36 
Hungarian name, other |         0          1 |         1 
Foreign name, non-Wes |         0         60 |        60 
Foreign name, Western |         0        307 |       307 
----------------------+----------------------+----------
                Total |       670        415 |     1,085 

. 
. tabulate time_foreign foreignness if inrange(time_foreign, -2, 2) 

time_forei |                   (max) foreignness
        gn | Hungarian  Hungarian  Foreign n  Hungarian  Foreign n |     Total
-----------+-------------------------------------------------------+----------
        -2 |       764          0          0          0          0 |       764 
        -1 |     1,042          0          0          0          0 |     1,046 
         0 |       670         11         36          1         60 |     1,085 
         1 |       613          7         32          1         41 |       958 
         2 |       496          3         26          1         40 |       796 
-----------+-------------------------------------------------------+----------
     Total |     3,585         21         94          3        141 |     4,649 


           |   (max)
           | foreignnes
time_forei |     s
        gn | Foreign n |     Total
-----------+-----------+----------
        -2 |         0 |       764 
        -1 |         4 |     1,046 
         0 |       307 |     1,085 
         1 |       264 |       958 
         2 |       230 |       796 
-----------+-----------+----------
     Total |       805 |     4,649 

. 
. tempvar western

. egen `western' = max(foreignness == 5), by(frame_id_numeric)

. 
. tabulate foreignness `western'

                      |       __000000
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |     5,513      1,013 |     6,526 
Hungarian name, neigh |        23          0 |        23 
Foreign name, Hungari |        97         38 |       135 
Hungarian name, other |         4          0 |         4 
Foreign name, non-Wes |       170         30 |       200 
Foreign name, Western |         0      1,191 |     1,191 
----------------------+----------------------+----------
                Total |     5,807      2,272 |     8,079 

. keep if ever_local | `western' == 1
(617 observations deleted)

. ****Average effect, foreign_hire sample, local and expat separately, xthdidre
> g
. 
. 
. *Full sample
. foreach Y in $varlist_rhs {
  2. 
.     display "`Y'"
  3. 
.     eststo clear
  4.     quietly xthdidregress ra (`Y') (local_ceo) if $local_sample, group(fra
> me_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  5.     eststo: quietly eventbaseline, pre(4) post(4) baseline(atet)
  6. 
.     quietly xthdidregress ra (`Y') (has_expat_ceo) if $expat_sample, group(fr
> ame_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  7.     eststo: quietly eventbaseline, pre(4) post(4) baseline(atet)
  8. 
.     eststo: quietly xt2treatments `Y',  treatment(has_expat_ceo) control(loca
> l_ceo) pre(4) post(4) baseline(atet)
  9. 
.     display "Full sample"
 10.     esttab, b(3) se  style(tex)
 11. 
. }
lnK
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnK             lnK             lnK   \\
------------------------------------------------------------
ATET                0.095           0.329**         0.247   \\
                  (0.092)         (0.121)         (0.174)   \\
------------------------------------------------------------
N                    5580            4690            6434   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnL
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnL             lnL             lnL   \\
------------------------------------------------------------
ATET                0.183*          0.488***        0.361*  \\
                  (0.085)         (0.121)         (0.166)   \\
------------------------------------------------------------
N                    5580            4690            6434   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
TFP
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      TFP             TFP             TFP   \\
------------------------------------------------------------
ATET                0.064*          0.141**        -0.011   \\
                  (0.031)         (0.047)         (0.070)   \\
------------------------------------------------------------
N                    5580            4690            6434   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnQ
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnQ             lnQ             lnQ   \\
------------------------------------------------------------
ATET                0.364***        0.818***        0.455*  \\
                  (0.085)         (0.136)         (0.182)   \\
------------------------------------------------------------
N                    5580            4690            6434   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnEx
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                     lnEx            lnEx            lnEx   \\
------------------------------------------------------------
ATET                0.930***        0.996***       -0.110   \\
                  (0.175)         (0.216)         (0.504)   \\
------------------------------------------------------------
N                    2803            2437            3103   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnQd
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                     lnQd            lnQd            lnQd   \\
------------------------------------------------------------
ATET                0.271**         0.548***        0.298   \\
                  (0.091)         (0.153)         (0.192)   \\
------------------------------------------------------------
N                    5530            4598            6321   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
exporter
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                 exporter        exporter        exporter   \\
------------------------------------------------------------
ATET                0.046           0.089**         0.005   \\
                  (0.024)         (0.034)         (0.039)   \\
------------------------------------------------------------
N                    5580            4690            6434   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. *Industrial sample
. preserve

. keep if industrial==1
industrial not found
r(111);

end of do-file
r(111);
