
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate/regressions.do 

. here
/Users/koren/Tresorit/Mac/projects/expat/

. global here = r(here)

. use "$here/temp/analysis_sample.dta", clear

. 
. *Samples
. global local_sample "(ever_local==1 | foreign==0)"

. global expat_sample "(ever_expat==1 | foreign==0)"

. 
. global varlist_rhs "lnK lnL TFP lnQ lnEx lnQd exporter"

. 
. tabulate foreignness ever_expat

                      |      ever_expat
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |     5,570      1,441 |     7,011 
Hungarian name, neigh |         0         33 |        33 
Foreign name, Hungari |         0        246 |       246 
Hungarian name, other |         0        125 |       125 
Foreign name, non-Wes |         0        244 |       244 
Foreign name, Western |         0      1,024 |     1,024 
----------------------+----------------------+----------
                Total |     5,570      3,113 |     8,683 

. tabulate foreignness ever_expat if time_foreign == 0

                      |      ever_expat
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |       730          0 |       730 
Hungarian name, neigh |         0         14 |        14 
Foreign name, Hungari |         0         73 |        73 
Hungarian name, other |         0         38 |        38 
Foreign name, non-Wes |         0         80 |        80 
Foreign name, Western |         0        270 |       270 
----------------------+----------------------+----------
                Total |       730        475 |     1,205 

. 
. tabulate time_foreign foreignness if inrange(time_foreign, -2, 2) 

time_forei |                   (max) foreignness
        gn | Hungarian  Hungarian  Foreign n  Hungarian  Foreign n |     Total
-----------+-------------------------------------------------------+----------
        -2 |       823          0          0          0          0 |       823 
        -1 |     1,157          0          1          1          0 |     1,161 
         0 |       730         14         73         38         80 |     1,205 
         1 |       662         10         60         30         50 |     1,038 
         2 |       533          5         47         22         47 |       850 
-----------+-------------------------------------------------------+----------
     Total |     3,905         29        181         91        177 |     5,077 


           |   (max)
           | foreignnes
time_forei |     s
        gn | Foreign n |     Total
-----------+-----------+----------
        -2 |         0 |       823 
        -1 |         2 |     1,161 
         0 |       270 |     1,205 
         1 |       226 |     1,038 
         2 |       196 |       850 
-----------+-----------+----------
     Total |       694 |     5,077 

. 
. tempvar f_fixed

. egen `f_fixed' = max(cond(time_foreign == 0, foreignness, .)), by(frame_id_nu
> meric)

. label values `f_fixed' foreignness

. 
. tabulate `f_fixed'

                           __000000 |      Freq.     Percent        Cum.
------------------------------------+-----------------------------------
         Hungarian name and address |      5,570       64.15       64.15
Hungarian name, neighboring address |         74        0.85       65.00
    Foreign name, Hungarian address |        468        5.39       70.39
      Hungarian name, other address |        245        2.82       73.21
  Foreign name, non-Western address |        481        5.54       78.75
      Foreign name, Western address |      1,845       21.25      100.00
------------------------------------+-----------------------------------
                              Total |      8,683      100.00

. keep if inlist(`f_fixed', 0, 5)
(1,268 observations deleted)

. 
. ****Average effect, foreign_hire sample, local and expat separately, xthdidre
> g
. 
. 
. *Full sample
. foreach Y in $varlist_rhs {
  2. 
.     display "`Y'"
  3. 
.     eststo clear
  4.     quietly xthdidregress ra (`Y') (local_ceo) if $local_sample, group(fra
> me_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  5.     eststo: quietly eventbaseline, pre(4) post(4) baseline(atet)
  6. 
.     quietly xthdidregress ra (`Y') (has_expat_ceo) if $expat_sample, group(fr
> ame_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  7.     eststo: quietly eventbaseline, pre(4) post(4) baseline(atet)
  8. 
.     eststo: quietly xt2treatments `Y',  treatment(has_expat_ceo) control(loca
> l_ceo) pre(4) post(4) baseline(atet)
  9. 
.     display "Full sample"
 10.     esttab, b(3) se  style(tex)
 11. 
. }
lnK
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnK             lnK             lnK   \\
------------------------------------------------------------
ATET                0.076           0.316*          0.302*  \\
                  (0.094)         (0.133)         (0.140)   \\
------------------------------------------------------------
N                    5728            4500            6392   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnL
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnL             lnL             lnL   \\
------------------------------------------------------------
ATET                0.135           0.588***        0.565***\\
                  (0.086)         (0.128)         (0.133)   \\
------------------------------------------------------------
N                    5728            4500            6392   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
TFP
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      TFP             TFP             TFP   \\
------------------------------------------------------------
ATET                0.057           0.142**         0.100   \\
                  (0.031)         (0.055)         (0.053)   \\
------------------------------------------------------------
N                    5728            4500            6392   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnQ
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnQ             lnQ             lnQ   \\
------------------------------------------------------------
ATET                0.276***        0.945***        0.766***\\
                  (0.082)         (0.155)         (0.157)   \\
------------------------------------------------------------
N                    5728            4500            6392   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnEx
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                     lnEx            lnEx            lnEx   \\
------------------------------------------------------------
ATET                0.915***        1.178***        0.492*  \\
                  (0.177)         (0.218)         (0.232)   \\
------------------------------------------------------------
N                    2732            2268            2946   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnQd
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                     lnQd            lnQd            lnQd   \\
------------------------------------------------------------
ATET                0.170           0.685***        0.532** \\
                  (0.087)         (0.176)         (0.180)   \\
------------------------------------------------------------
N                    5678            4418            6289   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
exporter
(est1 stored)
(est2 stored)
(est3 stored)
Full sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                 exporter        exporter        exporter   \\
------------------------------------------------------------
ATET                0.037           0.069           0.041   \\
                  (0.024)         (0.035)         (0.037)   \\
------------------------------------------------------------
N                    5728            4500            6392   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. *Industrial sample
. preserve

. keep if industrial==1
(3,987 observations deleted)

. foreach Y in $varlist_rhs {
  2.     display "`Y'"
  3. 
.     eststo clear
  4.     quietly xthdidregress ra (`Y') (local_ceo) if $local_sample & industri
> al==1, group(frame_id_numeric) vce(cluster frame_id_numeric) controlgroup(not
> yet)
  5.     eststo: quietly eventbaseline, pre(4) post(4) baseline(atet)
  6.     quietly xthdidregress ra (`Y') (has_expat_ceo) if $expat_sample & indu
> strial==1, group(frame_id_numeric) vce(cluster frame_id_numeric) controlgroup
> (notyet)
  7.     eststo: quietly eventbaseline, pre(4) post(4) baseline(atet)
  8. 
.     eststo: quietly xt2treatments `Y',  treatment(has_expat_ceo) control(loca
> l_ceo) pre(4) post(4) baseline(atet)
  9. 
.     display "Industry sample"
 10.     esttab, b(3) se  style(tex)
 11. }
lnK
(est1 stored)
(est2 stored)
(est3 stored)
Industry sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnK             lnK             lnK   \\
------------------------------------------------------------
ATET                0.270           0.269           0.160   \\
                  (0.144)         (0.176)         (0.181)   \\
------------------------------------------------------------
N                    2572            2139            2989   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnL
(est1 stored)
(est2 stored)
(est3 stored)
Industry sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnL             lnL             lnL   \\
------------------------------------------------------------
ATET                0.273           0.371*          0.268   \\
                  (0.145)         (0.165)         (0.173)   \\
------------------------------------------------------------
N                    2572            2139            2989   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
TFP
(est1 stored)
(est2 stored)
(est3 stored)
Industry sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      TFP             TFP             TFP   \\
------------------------------------------------------------
ATET                0.078           0.088           0.094   \\
                  (0.056)         (0.066)         (0.053)   \\
------------------------------------------------------------
N                    2572            2139            2989   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnQ
(est1 stored)
(est2 stored)
(est3 stored)
Industry sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnQ             lnQ             lnQ   \\
------------------------------------------------------------
ATET                0.440***        0.750***        0.515** \\
                  (0.131)         (0.173)         (0.168)   \\
------------------------------------------------------------
N                    2572            2139            2989   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnEx
(est1 stored)
(est2 stored)
(est3 stored)
Industry sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                     lnEx            lnEx            lnEx   \\
------------------------------------------------------------
ATET                0.756***        1.039***        0.441   \\
                  (0.225)         (0.242)         (0.290)   \\
------------------------------------------------------------
N                    1657            1419            1868   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnQd
(est1 stored)
(est2 stored)
(est3 stored)
Industry sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                     lnQd            lnQd            lnQd   \\
------------------------------------------------------------
ATET                0.293*          0.472*          0.248   \\
                  (0.135)         (0.195)         (0.210)   \\
------------------------------------------------------------
N                    2531            2080            2909   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
exporter
(est1 stored)
(est2 stored)
(est3 stored)
Industry sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                 exporter        exporter        exporter   \\
------------------------------------------------------------
ATET                0.001           0.031           0.011   \\
                  (0.040)         (0.046)         (0.046)   \\
------------------------------------------------------------
N                    2572            2139            2989   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. restore

. 
. *Service sample
. preserve

. keep if industrial==0
(3,428 observations deleted)

. foreach Y in $varlist_rhs {
  2. 
.     display "`Y'"
  3. 
.     eststo clear
  4.     quietly xthdidregress ra (`Y') (local_ceo) if $local_sample & industri
> al==0, group(frame_id_numeric) vce(cluster frame_id_numeric) controlgroup(not
> yet)
  5.     eststo: quietly eventbaseline, pre(4) post(4) baseline(atet)
  6.     quietly xthdidregress ra (`Y') (has_expat_ceo) if $expat_sample & indu
> strial==0, group(frame_id_numeric) vce(cluster frame_id_numeric) controlgroup
> (notyet)
  7.     eststo: quietly eventbaseline, pre(4) post(4) baseline(atet)
  8. 
.     eststo: quietly xt2treatments `Y',  treatment(has_expat_ceo) control(loca
> l_ceo) pre(4) post(4) baseline(atet)
  9. 
.     display "Service sample"
 10.     esttab, b(3) se style(tex)
 11. }
lnK
(est1 stored)
(est2 stored)
(est3 stored)
Service sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnK             lnK             lnK   \\
------------------------------------------------------------
ATET               -0.082           0.372           0.413   \\
                  (0.123)         (0.212)         (0.228)   \\
------------------------------------------------------------
N                    3156            2361            3392   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnL
(est1 stored)
(est2 stored)
(est3 stored)
Service sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnL             lnL             lnL   \\
------------------------------------------------------------
ATET                0.057           0.996***        0.917***\\
                  (0.108)         (0.212)         (0.221)   \\
------------------------------------------------------------
N                    3156            2361            3392   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
TFP
(est1 stored)
(est2 stored)
(est3 stored)
Service sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      TFP             TFP             TFP   \\
------------------------------------------------------------
ATET                0.050           0.205*          0.160   \\
                  (0.036)         (0.095)         (0.103)   \\
------------------------------------------------------------
N                    3156            2361            3392   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnQ
(est1 stored)
(est2 stored)
(est3 stored)
Service sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                      lnQ             lnQ             lnQ   \\
------------------------------------------------------------
ATET                0.153           1.246***        1.081***\\
                  (0.107)         (0.292)         (0.304)   \\
------------------------------------------------------------
N                    3156            2361            3392   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnEx
(est1 stored)
(est2 stored)
(est3 stored)
Service sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                     lnEx            lnEx            lnEx   \\
------------------------------------------------------------
ATET                1.026***        1.080*          0.411   \\
                  (0.244)         (0.456)         (0.520)   \\
------------------------------------------------------------
N                    1075             849            1041   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
lnQd
(est1 stored)
(est2 stored)
(est3 stored)
Service sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                     lnQd            lnQd            lnQd   \\
------------------------------------------------------------
ATET                0.105           1.128***        0.920** \\
                  (0.114)         (0.317)         (0.333)   \\
------------------------------------------------------------
N                    3147            2338            3369   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
exporter
(est1 stored)
(est2 stored)
(est3 stored)
Service sample

------------------------------------------------------------
                      (1)             (2)             (3)   \\
                 exporter        exporter        exporter   \\
------------------------------------------------------------
ATET                0.034           0.098           0.083   \\
                  (0.031)         (0.060)         (0.066)   \\
------------------------------------------------------------
N                    3156            2361            3392   \\
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. restore

. 
. *****Figures
. 
. *Whole sample
. foreach Y in $varlist_rhs {
  2. 
.     quietly xthdidregress ra (`Y') (has_expat_ceo) if $expat_sample, group(fr
> ame_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  3.     eventbaseline, pre(4) post(4) baseline(-1) generate(event_expat)
  4. 
.     quietly xthdidregress ra (`Y') (local_ceo) if $local_sample, group(frame_
> id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  5.     eventbaseline, pre(4) post(4) baseline(-1) generate(event_local)
  6. 
.     frame event_expat: frlink 1:1 time, frame(event_local) generate(local)
  7.     frame event_expat: frget coef_local=coef upper_local=upper lower_local
> =lower, from(local)
  8. 
.     frame event_expat: graph twoway (rarea lower upper time, fcolor(red%10) l
> color(red%10)) (line coef time, color(red)) (rarea lower_local upper_local ti
> me, fcolor(gs10%10) lcolor(gs5%10)) (line coef_local time, color(grey)), grap
> hregion(color(white)) xlabel(-4(1)4) legend(off) xline(-0.5) xtitle("Event ti
> me") yline(0) 
  9. 
.     gr export "$here/output/twfe/expat_local_`Y'.pdf", replace
 10. 
. }

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 4,500

------------------------------------------------------------------------------
         lnK |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .2146998   .1457346     1.47   0.141    -.0709347    .5003344
          -3 |   .1553188   .1369282     1.13   0.257    -.1130555     .423693
          -2 |   .1695243    .093398     1.82   0.070    -.0135324     .352581
          -1 |          0  (omitted)
           0 |   .1942789   .0668077     2.91   0.004     .0633382    .3252196
           1 |   .2994733   .0969145     3.09   0.002     .1095243    .4894223
           2 |   .4190536   .1194262     3.51   0.000     .1849824    .6531247
           3 |   .5179351   .1518119     3.41   0.001     .2203893    .8154809
           4 |   .8252632   .1823588     4.53   0.000     .4678465     1.18268
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 5,728

------------------------------------------------------------------------------
         lnK |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0724136   .0778596    -0.93   0.352    -.2250156    .0801885
          -3 |   .0030731   .0597679     0.05   0.959    -.1140698    .1202161
          -2 |   .0434383   .0426687     1.02   0.309    -.0401909    .1270674
          -1 |          0  (omitted)
           0 |   .0595495   .0464095     1.28   0.199    -.0314115    .1505104
           1 |   .0069654   .0667687     0.10   0.917    -.1238989    .1378297
           2 |   .0212075   .0951388     0.22   0.824    -.1652611     .207676
           3 |    .042643   .1193812     0.36   0.721    -.1913397    .2766258
           4 |   .2167095   .1524291     1.42   0.155     -.082046     .515465
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_lnK.pdf
    saved as PDF format

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 4,500

------------------------------------------------------------------------------
         lnL |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0486774   .1044779    -0.47   0.641    -.2534503    .1560955
          -3 |  -.0137235   .0819525    -0.17   0.867    -.1743473    .1469004
          -2 |  -.0553676   .0547334    -1.01   0.312    -.1626431    .0519079
          -1 |          0  (omitted)
           0 |   .2802285   .0879255     3.19   0.001     .1078976    .4525593
           1 |   .3716874   .1182105     3.14   0.002     .1399991    .6033757
           2 |   .6080905   .1211687     5.02   0.000     .3706042    .8455767
           3 |   .6918846   .1459856     4.74   0.000     .4057581     .978011
           4 |   .8386057   .1669572     5.02   0.000     .5113756    1.165836
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 5,728

------------------------------------------------------------------------------
         lnL |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0929911   .0737118     1.26   0.207    -.0514814    .2374637
          -3 |   .1409628   .0610081     2.31   0.021     .0213891    .2605366
          -2 |   .0516122   .0432839     1.19   0.233    -.0332227    .1364472
          -1 |          0  (omitted)
           0 |   .1189716   .0465231     2.56   0.011      .027788    .2101551
           1 |   .1672254   .0633302     2.64   0.008     .0431004    .2913503
           2 |   .2212963   .0915135     2.42   0.016      .041933    .4006595
           3 |   .2443383    .108881     2.24   0.025     .0309355    .4577411
           4 |   .2812412   .1318251     2.13   0.033     .0228686    .5396137
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_lnL.pdf
    saved as PDF format

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 4,500

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0462532   .0547087     0.85   0.398    -.0609739    .1534803
          -3 |  -.0024788   .0409274    -0.06   0.952     -.082695    .0777375
          -2 |   .0551816   .0281092     1.96   0.050     .0000885    .1102747
          -1 |          0  (omitted)
           0 |   .1311518   .0379074     3.46   0.001     .0568547    .2054489
           1 |   .1677538   .0529029     3.17   0.002     .0640661    .2714415
           2 |   .2083022   .0530311     3.93   0.000     .1043631    .3122413
           3 |   .1902539   .0576017     3.30   0.001     .0773565    .3031512
           4 |    .137718   .0711713     1.94   0.053    -.0017752    .2772111
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 5,728

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   -.025593   .0316379    -0.81   0.419    -.0876022    .0364161
          -3 |  -.0435151   .0293886    -1.48   0.139    -.1011157    .0140855
          -2 |  -.0353661   .0247118    -1.43   0.152    -.0838003    .0130681
          -1 |          0  (omitted)
           0 |   .0219831   .0214656     1.02   0.306    -.0200888    .0640549
           1 |   .0048599   .0256522     0.19   0.850    -.0454175    .0551372
           2 |   .0489016   .0297207     1.65   0.100    -.0093499     .107153
           3 |   .0369914   .0339208     1.09   0.275    -.0294921    .1034749
           4 |   .0399283   .0531348     0.75   0.452     -.064214    .1440706
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_TFP.pdf
    saved as PDF format

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 4,500

------------------------------------------------------------------------------
         lnQ |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0222278   .1341183    -0.17   0.868    -.2850947    .2406392
          -3 |  -.0051989   .1144141    -0.05   0.964    -.2294463    .2190486
          -2 |   .0179137   .0538622     0.33   0.739    -.0876542    .1234816
          -1 |          0  (omitted)
           0 |   .5052091   .0931134     5.43   0.000     .3227102    .6877079
           1 |   .7675688   .1254908     6.12   0.000     .5216113    1.013526
           2 |   1.036666   .1507314     6.88   0.000     .7412382    1.332094
           3 |   1.154263   .1682517     6.86   0.000     .8244958     1.48403
           4 |     1.2512    .200946     6.23   0.000     .8573533    1.645047
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 5,728

------------------------------------------------------------------------------
         lnQ |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.1064979   .0710571    -1.50   0.134    -.2457673    .0327715
          -3 |  -.0419799   .0574979    -0.73   0.465    -.1546737    .0707138
          -2 |  -.0612399    .043772    -1.40   0.162    -.1470315    .0245516
          -1 |          0  (omitted)
           0 |   .1202941   .0421602     2.85   0.004     .0376616    .2029266
           1 |   .1693324   .0644412     2.63   0.009     .0430299    .2956348
           2 |   .2496507   .0834566     2.99   0.003     .0860787    .4132227
           3 |   .2366416   .0995636     2.38   0.017     .0415006    .4317827
           4 |   .3395859   .1271831     2.67   0.008     .0903117    .5888601
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_lnQ.pdf
    saved as PDF format

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 2,268

------------------------------------------------------------------------------
        lnEx |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .1398778   .2165593     0.65   0.518    -.2845707    .5643263
          -3 |  -.0652802   .1911898    -0.34   0.733    -.4400053    .3094449
          -2 |  -.0477839   .1267622    -0.38   0.706    -.2962332    .2006654
          -1 |          0  (omitted)
           0 |   .4384594   .1346765     3.26   0.001     .1744982    .7024205
           1 |   .8627122   .1851219     4.66   0.000       .49988    1.225544
           2 |   1.218808   .2226561     5.47   0.000     .7824097    1.655206
           3 |    1.45838   .2493897     5.85   0.000     .9695848    1.947174
           4 |   1.944096    .331519     5.86   0.000      1.29433    2.593861
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 2,732

------------------------------------------------------------------------------
        lnEx |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   -.412293   .2100124    -1.96   0.050    -.8239097   -.0006763
          -3 |  -.3984483   .1472508    -2.71   0.007    -.6870546   -.1098421
          -2 |  -.2343606   .0978134    -2.40   0.017    -.4260714   -.0426498
          -1 |          0  (omitted)
           0 |   .2976251   .0910327     3.27   0.001     .1192042     .476046
           1 |   .4429129    .136504     3.24   0.001       .17537    .7104559
           2 |   .7928084   .1857515     4.27   0.000     .4287422    1.156875
           3 |    .736294   .2225364     3.31   0.001     .3001307    1.172457
           4 |   1.000693   .2856203     3.50   0.000     .4408871    1.560498
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_lnEx.pd
    > f saved as PDF format

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 4,418

------------------------------------------------------------------------------
        lnQd |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0207144   .1605462     0.13   0.897    -.2939503    .3353791
          -3 |  -.0505294   .1427786    -0.35   0.723    -.3303703    .2293115
          -2 |   .0475488   .0762746     0.62   0.533    -.1019468    .1970444
          -1 |          0  (omitted)
           0 |   .4309356   .1127418     3.82   0.000     .2099657    .6519056
           1 |   .6075986   .1460365     4.16   0.000     .3213723    .8938248
           2 |   .8563896   .1663721     5.15   0.000     .5303063    1.182473
           3 |   .7803193    .201476     3.87   0.000     .3854335    1.175205
           4 |   .7708518   .2457451     3.14   0.002     .2892002    1.252503
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 5,678

------------------------------------------------------------------------------
        lnQd |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.1076426   .0772319    -1.39   0.163    -.2590144    .0437292
          -3 |  -.0580182   .0606748    -0.96   0.339    -.1769386    .0609023
          -2 |  -.0454756   .0427661    -1.06   0.288    -.1292957    .0383444
          -1 |          0  (omitted)
           0 |   .0541663    .043034     1.26   0.208    -.0301787    .1385113
           1 |   .0768424   .0652522     1.18   0.239    -.0510495    .2047344
           2 |   .1239337   .0855004     1.45   0.147    -.0436441    .2915115
           3 |   .1041024    .105845     0.98   0.325      -.10335    .3115548
           4 |   .2292391   .1339824     1.71   0.087    -.0333616    .4918398
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_lnQd.pd
    > f saved as PDF format

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 4,500

------------------------------------------------------------------------------
    exporter |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0128706   .0436148    -0.30   0.768    -.0983539    .0726128
          -3 |  -.0646046   .0340201    -1.90   0.058    -.1312829    .0020736
          -2 |  -.0416065   .0309849    -1.34   0.179    -.1023358    .0191228
          -1 |          0  (omitted)
           0 |   .0125837   .0269195     0.47   0.640    -.0401776     .065345
           1 |  -.0025176   .0352254    -0.07   0.943    -.0715581    .0665229
           2 |   .0370972    .039884     0.93   0.352     -.041074    .1152684
           3 |   .0769359   .0408219     1.88   0.059    -.0030735    .1569453
           4 |   .0722863   .0455286     1.59   0.112    -.0169481    .1615206
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 5,728

------------------------------------------------------------------------------
    exporter |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0083541   .0278842    -0.30   0.764    -.0630062     .046298
          -3 |  -.0015788   .0215529    -0.07   0.942    -.0438217    .0406641
          -2 |  -.0089051   .0174468    -0.51   0.610    -.0431001    .0252899
          -1 |          0  (omitted)
           0 |    .031607   .0154661     2.04   0.041      .001294    .0619199
           1 |   .0337258   .0202079     1.67   0.095    -.0058809    .0733326
           2 |   .0300677   .0255753     1.18   0.240    -.0200589    .0801943
           3 |   .0194947   .0300681     0.65   0.517    -.0394377    .0784272
           4 |   .0467497   .0387852     1.21   0.228    -.0292679    .1227673
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_exporte
    > r.pdf saved as PDF format

. 
. *Industry
. 
. preserve

. keep if industrial==1
(3,987 observations deleted)

. 
. foreach Y in $varlist_rhs {
  2. 
.     quietly xthdidregress ra (`Y') (has_expat_ceo) if $expat_sample, group(fr
> ame_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  3.     eventbaseline, pre(4) post(4) baseline(-1) generate(event_expat)
  4. 
.     quietly xthdidregress ra (`Y') (local_ceo) if $local_sample, group(frame_
> id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  5.     eventbaseline, pre(4) post(4) baseline(-1) generate(event_local)
  6. 
.     frame event_expat: frlink 1:1 time, frame(event_local) generate(local)
  7.     frame event_expat: frget coef_local=coef upper_local=upper lower_local
> =lower, from(local)
  8. 
.     frame event_expat: graph twoway (rarea lower upper time, fcolor(red%10) l
> color(red%10)) (line coef time, color(red)) (rarea lower_local upper_local ti
> me, fcolor(gs10%10) lcolor(gs5%10)) (line coef_local time, color(grey)), grap
> hregion(color(white)) xlabel(-4(1)4) legend(off) xline(-0.5) xtitle("Event ti
> me") yline(0) 
  9. 
.     gr export "$here/output/twfe/expat_local_ind_`Y'.pdf", replace
 10. 
. }

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 2,139

------------------------------------------------------------------------------
         lnK |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .2094546   .1793856     1.17   0.243    -.1421348     .561044
          -3 |    .088149   .1575188     0.56   0.576    -.2205821    .3968801
          -2 |  -.0211033   .1117397    -0.19   0.850    -.2401091    .1979025
          -1 |          0  (omitted)
           0 |   .1851921     .08354     2.22   0.027     .0214568    .3489274
           1 |   .2864751   .1293483     2.21   0.027     .0329572    .5399931
           2 |   .3162103   .1702574     1.86   0.063     -.017488    .6499086
           3 |   .3791597   .2091696     1.81   0.070    -.0308051    .7891245
           4 |   .5234692   .2683101     1.95   0.051    -.0024089    1.049347
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 2,572

------------------------------------------------------------------------------
         lnK |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.1618065   .1245346    -1.30   0.194    -.4058899    .0822769
          -3 |  -.0546217   .0792912    -0.69   0.491    -.2100297    .1007863
          -2 |  -.0120011   .0518681    -0.23   0.817    -.1136606    .0896585
          -1 |          0  (omitted)
           0 |   .1126219   .0642733     1.75   0.080    -.0133514    .2385953
           1 |   .0838486   .0869104     0.96   0.335    -.0864927    .2541898
           2 |   .2249767   .1247884     1.80   0.071    -.0196039    .4695574
           3 |   .2433602    .191016     1.27   0.203    -.1310242    .6177446
           4 |   .3984317   .2406738     1.66   0.098    -.0732802    .8701436
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_ind_lnK
    > .pdf saved as PDF format

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 2,139

------------------------------------------------------------------------------
         lnL |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0778626   .1296819     0.60   0.548    -.1763092    .3320344
          -3 |    .058034    .102252     0.57   0.570    -.1423763    .2584443
          -2 |  -.0226134   .0482459    -0.47   0.639    -.1171736    .0719469
          -1 |          0  (omitted)
           0 |   .2934106   .1113693     2.63   0.008     .0751307    .5116904
           1 |   .3444498   .1379987     2.50   0.013     .0739774    .6149223
           2 |   .4339451   .1465542     2.96   0.003     .1467042    .7211861
           3 |   .4115219   .1775395     2.32   0.020     .0635507     .759493
           4 |   .5127633   .2318898     2.21   0.027     .0582677    .9672589
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 2,572

------------------------------------------------------------------------------
         lnL |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0728177   .1159224    -0.63   0.530    -.3000215    .1543861
          -3 |  -.0230813   .0907462    -0.25   0.799    -.2009405    .1547779
          -2 |  -.0376436   .0708414    -0.53   0.595    -.1764901     .101203
          -1 |          0  (omitted)
           0 |   .1172398   .0824053     1.42   0.155    -.0442716    .2787512
           1 |   .1150164   .0999307     1.15   0.250    -.0808442    .3108771
           2 |    .256999   .1457127     1.76   0.078    -.0285925    .5425906
           3 |   .3076765   .1830577     1.68   0.093      -.05111     .666463
           4 |   .3989499   .2140547     1.86   0.062    -.0205896    .8184893
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_ind_lnL
    > .pdf saved as PDF format

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 2,139

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0368719   .0793158     0.46   0.642    -.1185843     .192328
          -3 |   .0118342   .0383854     0.31   0.758    -.0633998    .0870683
          -2 |   .0190119   .0304993     0.62   0.533    -.0407657    .0787894
          -1 |          0  (omitted)
           0 |   .0851093   .0511401     1.66   0.096    -.0151233     .185342
           1 |   .0963504   .0547763     1.76   0.079    -.0110092    .2037101
           2 |   .1541198    .061105     2.52   0.012     .0343562    .2738833
           3 |   .1148045   .0642453     1.79   0.074     -.011114     .240723
           4 |    .072659   .0745211     0.98   0.330    -.0733998    .2187177
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 2,572

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0445106   .0585776    -0.76   0.447    -.1593205    .0702994
          -3 |  -.0783792   .0549664    -1.43   0.154    -.1861112    .0293529
          -2 |  -.0897729   .0557869    -1.61   0.108    -.1991133    .0195674
          -1 |          0  (omitted)
           0 |   .0444072   .0301984     1.47   0.141    -.0147806    .1035951
           1 |   .0231283   .0371582     0.62   0.534    -.0497005    .0959571
           2 |   .0405183   .0472206     0.86   0.391    -.0520323    .1330688
           3 |  -.0038195   .0476687    -0.08   0.936    -.0972485    .0896094
           4 |   .0199222   .1056252     0.19   0.850    -.1870994    .2269438
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_ind_TFP
    > .pdf saved as PDF format

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 2,139

------------------------------------------------------------------------------
         lnQ |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .1884085   .1491651     1.26   0.207    -.1039498    .4807668
          -3 |   .1692538   .1003873     1.69   0.092    -.0275018    .3660094
          -2 |   .0105251   .0691348     0.15   0.879    -.1249766    .1460269
          -1 |          0  (omitted)
           0 |   .4676628    .113774     4.11   0.000     .2446698    .6906558
           1 |   .7458559   .1406913     5.30   0.000      .470106    1.021606
           2 |   .9551129   .1676574     5.70   0.000     .6265106    1.283715
           3 |   1.019794   .1908859     5.34   0.000     .6456644    1.393924
           4 |   1.023409   .2537905     4.03   0.000     .5259887    1.520829
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 2,572

------------------------------------------------------------------------------
         lnQ |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.2422583   .1222423    -1.98   0.048    -.4818488   -.0026679
          -3 |  -.2154638   .1014734    -2.12   0.034    -.4143481   -.0165796
          -2 |   -.151391   .0769783    -1.97   0.049    -.3022656   -.0005163
          -1 |          0  (omitted)
           0 |   .1483735   .0617998     2.40   0.016     .0272482    .2694989
           1 |   .1530545   .0890701     1.72   0.086    -.0215198    .3276287
           2 |   .3743567   .1101333     3.40   0.001     .1584995     .590214
           3 |   .3119935   .1347957     2.31   0.021     .0477988    .5761882
           4 |   .4515415   .1994918     2.26   0.024     .0605448    .8425382
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_ind_lnQ
    > .pdf saved as PDF format

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 1,419

------------------------------------------------------------------------------
        lnEx |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |     .28255   .2532032     1.12   0.264    -.2137192    .7788192
          -3 |    .010085   .2165988     0.05   0.963    -.4144409    .4346109
          -2 |   .0189595    .148039     0.13   0.898    -.2711917    .3091106
          -1 |          0  (omitted)
           0 |   .5737049   .1498029     3.83   0.000     .2800967    .8673131
           1 |   1.029749   .2069692     4.98   0.000     .6240966    1.435401
           2 |   1.077792   .2562131     4.21   0.000     .5756235     1.57996
           3 |    1.37559   .2828877     4.86   0.000     .8211408     1.93004
           4 |   1.528166   .3777009     4.05   0.000     .7878855    2.268446
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 1,657

------------------------------------------------------------------------------
        lnEx |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.2805481   .2752652    -1.02   0.308    -.8200579    .2589617
          -3 |   -.462113   .1982214    -2.33   0.020    -.8506199   -.0736061
          -2 |  -.3760647   .1316925    -2.86   0.004    -.6341774   -.1179521
          -1 |          0  (omitted)
           0 |   .1981298   .1080436     1.83   0.067    -.0136319    .4098914
           1 |   .4212896   .1672595     2.52   0.012      .093467    .7491122
           2 |   .6497508   .2133026     3.05   0.002     .2316854    1.067816
           3 |   .6569036   .2429636     2.70   0.007     .1807037    1.133103
           4 |   .4533735   .3011451     1.51   0.132      -.13686    1.043607
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_ind_lnE
    > x.pdf saved as PDF format

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 2,080

------------------------------------------------------------------------------
        lnQd |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .3182918   .1852687     1.72   0.086    -.0448282    .6814117
          -3 |   .1379271   .1522892     0.91   0.365    -.1605542    .4364084
          -2 |   .0522848   .1070365     0.49   0.625    -.1575029    .2620726
          -1 |          0  (omitted)
           0 |   .3849449   .1491444     2.58   0.010     .0926273    .6772624
           1 |   .5011171   .1814441     2.76   0.006     .1454932     .856741
           2 |   .7775543   .1915247     4.06   0.000     .4021728    1.152936
           3 |   .7379498   .2247965     3.28   0.001     .2973567    1.178543
           4 |    .594191   .2704728     2.20   0.028     .0640741    1.124308
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 2,531

------------------------------------------------------------------------------
        lnQd |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.2659342   .1290252    -2.06   0.039    -.5188189   -.0130494
          -3 |  -.2596969   .1053775    -2.46   0.014     -.466233   -.0531608
          -2 |  -.0905412   .0709919    -1.28   0.202    -.2296829    .0486004
          -1 |          0  (omitted)
           0 |   .0633271   .0588538     1.08   0.282    -.0520242    .1786783
           1 |  -.0222919   .0885823    -0.25   0.801      -.19591    .1513262
           2 |   .1337946   .1164128     1.15   0.250    -.0943702    .3619595
           3 |   .0680803   .1513183     0.45   0.653    -.2284981    .3646587
           4 |   .4495094   .2297606     1.96   0.050    -.0008131    .8998319
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_ind_lnQ
    > d.pdf saved as PDF format

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 2,139

------------------------------------------------------------------------------
    exporter |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0131422   .0551808    -0.24   0.812    -.1212945    .0950101
          -3 |   -.016277   .0382941    -0.43   0.671     -.091332     .058778
          -2 |  -.0622873   .0384335    -1.62   0.105    -.1376156    .0130411
          -1 |          0  (omitted)
           0 |   .0066129   .0314401     0.21   0.833    -.0550086    .0682345
           1 |   .0091086    .043781     0.21   0.835    -.0767006    .0949177
           2 |   .0022736   .0469311     0.05   0.961    -.0897098    .0942569
           3 |   .0178016   .0501895     0.35   0.723    -.0805679    .1161712
           4 |   .0027728   .0576352     0.05   0.962    -.1101901    .1157357
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 2,572

------------------------------------------------------------------------------
    exporter |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0247081   .0435687     0.57   0.571    -.0606849    .1101011
          -3 |   .0438721   .0371126     1.18   0.237    -.0288673    .1166116
          -2 |   .0014421   .0277172     0.05   0.959    -.0528827    .0557669
          -1 |          0  (omitted)
           0 |   .0148724   .0263197     0.57   0.572    -.0367132     .066458
           1 |   .0096275   .0340827     0.28   0.778    -.0571733    .0764284
           2 |   .0369519   .0407414     0.91   0.364    -.0428997    .1168036
           3 |   .0497201    .049356     1.01   0.314    -.0470159    .1464561
           4 |  -.0206434   .0670873    -0.31   0.758    -.1521321    .1108454
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_ind_exp
    > orter.pdf saved as PDF format

. restore

. 
. *Services
. preserve

. keep if industrial==0
(3,428 observations deleted)

. 
. foreach Y in $varlist_rhs {     
  2. 
.     quietly xthdidregress ra (`Y') (has_expat_ceo) if $expat_sample, group(fr
> ame_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  3.     eventbaseline, pre(4) post(4) baseline(-1) generate(event_expat)
  4. 
.     quietly xthdidregress ra (`Y') (local_ceo) if $local_sample, group(frame_
> id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  5.     eventbaseline, pre(4) post(4) baseline(-1) generate(event_local)
  6. 
.     frame event_expat: frlink 1:1 time, frame(event_local) generate(local)
  7.     frame event_expat: frget coef_local=coef upper_local=upper lower_local
> =lower, from(local)
  8. 
.     frame event_expat: graph twoway (rarea lower upper time, fcolor(red%10) l
> color(red%10)) (line coef time, color(red)) (rarea lower_local upper_local ti
> me, fcolor(gs10%10) lcolor(gs5%10)) (line coef_local time, color(grey)), grap
> hregion(color(white)) xlabel(-4(1)4) legend(off) xline(-0.5) xtitle("Event ti
> me") yline(0) 
  9. 
.     gr export "$here/output/twfe/expat_local_serv_`Y'.pdf", replace
 10. 
. }

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 2,361

------------------------------------------------------------------------------
         lnK |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .1828809   .2548691     0.72   0.473    -.3166532    .6824151
          -3 |   .2031056   .2420609     0.84   0.401    -.2713251    .6775363
          -2 |   .4054769   .1583633     2.56   0.010     .0950906    .7158633
          -1 |          0  (omitted)
           0 |   .2104726   .1152202     1.83   0.068    -.0153548       .4363
           1 |   .3118639   .1545341     2.02   0.044     .0089827    .6147451
           2 |   .5771368   .1839499     3.14   0.002     .2166016    .9376721
           3 |   .6462747   .2403548     2.69   0.007      .175188    1.117361
           4 |   1.104497   .2608281     4.23   0.000     .5932837    1.615711
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 3,156

------------------------------------------------------------------------------
         lnK |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0108185   .0976997     0.11   0.912    -.1806695    .2023064
          -3 |   .0380472   .0811357     0.47   0.639    -.1209758    .1970702
          -2 |   .0766167   .0622231     1.23   0.218    -.0453382    .1985717
          -1 |          0  (omitted)
           0 |   .0135654   .0657781     0.21   0.837    -.1153573    .1424881
           1 |  -.0481109   .0944805    -0.51   0.611    -.2332892    .1370675
           2 |   -.089444   .1251934    -0.71   0.475    -.3348185    .1559306
           3 |   -.108416   .1603423    -0.68   0.499    -.4226812    .2058491
           4 |  -.0220812   .1965762    -0.11   0.911    -.4073634     .363201
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_serv_ln
    > K.pdf saved as PDF format

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 2,361

------------------------------------------------------------------------------
         lnL |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.2925067   .1782315    -1.64   0.101    -.6418341    .0568207
          -3 |  -.1799998   .1399978    -1.29   0.199    -.4543904    .0943909
          -2 |  -.1563388   .1219098    -1.28   0.200    -.3952775       .0826
          -1 |          0  (omitted)
           0 |   .2877655   .1443588     1.99   0.046     .0048275    .5707036
           1 |   .4433767    .214031     2.07   0.038     .0238836    .8628698
           2 |   .9552446   .2036072     4.69   0.000     .5561818    1.354307
           3 |   1.157312   .2519616     4.59   0.000     .6634762    1.651148
           4 |   1.350952   .2696257     5.01   0.000     .8224948    1.879408
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 3,156

------------------------------------------------------------------------------
         lnL |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .1800638   .0934648     1.93   0.054    -.0031238    .3632514
          -3 |   .2046707   .0724705     2.82   0.005     .0626311    .3467103
          -2 |   .0780045   .0489699     1.59   0.111    -.0179748    .1739838
          -1 |          0  (omitted)
           0 |   .1018193   .0578103     1.76   0.078    -.0114868    .2151255
           1 |   .1780573   .0867535     2.05   0.040     .0080236    .3480909
           2 |   .1745568   .1185607     1.47   0.141    -.0578179    .4069316
           3 |   .1763235   .1378403     1.28   0.201    -.0938386    .4464856
           4 |   .2341004   .1656718     1.41   0.158    -.0906104    .5588112
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_serv_ln
    > L.pdf saved as PDF format

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 2,361

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0895663   .0816514     1.10   0.273    -.0704674       .2496
          -3 |   .0150027   .0834043     0.18   0.857    -.1484667    .1784721
          -2 |    .129223   .0574361     2.25   0.024     .0166502    .2417957
          -1 |          0  (omitted)
           0 |   .1883777   .0567082     3.32   0.001     .0772317    .2995238
           1 |   .2929472   .1059053     2.77   0.006     .0853767    .5005177
           2 |   .3025604   .0984326     3.07   0.002      .109636    .4954848
           3 |   .2763352     .10612     2.60   0.009     .0683437    .4843266
           4 |   .2546966   .1340951     1.90   0.058    -.0081249    .5175181
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 3,156

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0115337   .0382369    -0.30   0.763    -.0864767    .0634093
          -3 |  -.0242382   .0346605    -0.70   0.484    -.0921715    .0436952
          -2 |  -.0135784   .0252637    -0.54   0.591    -.0630944    .0359376
          -1 |          0  (omitted)
           0 |   .0094814   .0303318     0.31   0.755    -.0499679    .0689306
           1 |   .0027417   .0357832     0.08   0.939    -.0673921    .0728756
           2 |   .0654265    .039776     1.64   0.100     -.012533    .1433861
           3 |   .0649209   .0470448     1.38   0.168    -.0272853    .1571271
           4 |   .0435436   .0581593     0.75   0.454    -.0704464    .1575337
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_serv_TF
    > P.pdf saved as PDF format

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 2,361

------------------------------------------------------------------------------
         lnQ |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.3168095   .2556433    -1.24   0.215    -.8178612    .1842423
          -3 |  -.2494181   .2405649    -1.04   0.300    -.7209167    .2220805
          -2 |   .0153786    .090987     0.17   0.866    -.1629526    .1937098
          -1 |          0  (omitted)
           0 |   .5865051   .1586137     3.70   0.000      .275628    .8973822
           1 |   .8259729   .2363206     3.50   0.000      .362793    1.289153
           2 |   1.242067   .2792506     4.45   0.000      .694746    1.789388
           3 |   1.371865   .3045493     4.50   0.000     .7749589     1.96877
           4 |    1.51487   .3688804     4.11   0.000     .7918778    2.237862
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 3,156

------------------------------------------------------------------------------
         lnQ |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0012133   .0879678     0.01   0.989    -.1712004    .1736271
          -3 |    .081556   .0690739     1.18   0.238    -.0538264    .2169383
          -2 |  -.0074151   .0511552    -0.14   0.885    -.1076774    .0928473
          -1 |          0  (omitted)
           0 |   .0943103   .0557554     1.69   0.091    -.0149682    .2035888
           1 |   .1926256   .0904863     2.13   0.033     .0152756    .3699755
           2 |   .1711813    .114495     1.50   0.135    -.0532247    .3955873
           3 |   .1702825   .1406906     1.21   0.226    -.1054661     .446031
           4 |    .229456    .161489     1.42   0.155    -.0870567    .5459687
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_serv_ln
    > Q.pdf saved as PDF format

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1                 Number of obs = 849

------------------------------------------------------------------------------
        lnEx |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0481692   .4022277    -0.12   0.905    -.8365209    .7401825
          -3 |  -.0939793   .4099093    -0.23   0.819    -.8973868    .7094282
          -2 |  -.3185637   .2608741    -1.22   0.222    -.8298675    .1927401
          -1 |          0  (omitted)
           0 |   .0648247   .3025093     0.21   0.830    -.5280827    .6577321
           1 |   .3921579   .4310415     0.91   0.363     -.452668    1.236984
           2 |    1.23651   .4663367     2.65   0.008     .3225065    2.150513
           3 |   1.602181   .6153304     2.60   0.009      .396155    2.808206
           4 |   1.529423   .5492917     2.78   0.005     .4528311    2.606015
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 1,075

------------------------------------------------------------------------------
        lnEx |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.6937332   .3059257    -2.27   0.023    -1.293337   -.0941299
          -3 |  -.3841537   .2237255    -1.72   0.086    -.8226477    .0543403
          -2 |  -.0427704   .1608798    -0.27   0.790    -.3580891    .2725483
          -1 |          0  (omitted)
           0 |   .4331449   .1548782     2.80   0.005     .1295893    .7367005
           1 |   .4795245   .2455397     1.95   0.051    -.0017245    .9607734
           2 |   1.029681   .3256836     3.16   0.002     .3913531    1.668009
           3 |   .8761004   .3879404     2.26   0.024     .1157512     1.63645
           4 |   .9117183    .371434     2.45   0.014     .1837211    1.639715
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_serv_ln
    > Ex.pdf saved as PDF format

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 2,338

------------------------------------------------------------------------------
        lnQd |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.4482071   .2814653    -1.59   0.111    -.9998688    .1034547
          -3 |  -.3732245   .2641534    -1.41   0.158    -.8909556    .1445067
          -2 |   .0026842   .1010467     0.03   0.979    -.1953637     .200732
          -1 |          0  (omitted)
           0 |   .5761603   .1752104     3.29   0.001     .2327541    .9195664
           1 |   .8249117   .2548381     3.24   0.001     .3254381    1.324385
           2 |   1.143683   .3044766     3.76   0.000     .5469195    1.740446
           3 |   1.020875   .3777157     2.70   0.007     .2805662    1.761185
           4 |   1.053249   .4319999     2.44   0.015      .206545    1.899954
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 3,147

------------------------------------------------------------------------------
        lnQd |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0220087   .0971043     0.23   0.821    -.1683123    .2123297
          -3 |   .0688352   .0739926     0.93   0.352    -.0761876    .2138579
          -2 |  -.0315628    .053979    -0.58   0.559    -.1373596    .0742341
          -1 |          0  (omitted)
           0 |    .056407   .0590054     0.96   0.339    -.0592413    .1720554
           1 |   .1715999   .0903226     1.90   0.057     -.005429    .3486289
           2 |   .1289891   .1140403     1.13   0.258    -.0945258     .352504
           3 |   .1126725   .1474751     0.76   0.445    -.1763734    .4017183
           4 |   .1269602   .1713585     0.74   0.459    -.2088962    .4628166
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_serv_ln
    > Qd.pdf saved as PDF format

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 2,361

------------------------------------------------------------------------------
    exporter |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0042625    .075281     0.06   0.955    -.1432856    .1518106
          -3 |   -.119834   .0660112    -1.82   0.069    -.2492134    .0095455
          -2 |  -.0028943   .0532512    -0.05   0.957    -.1072647     .101476
          -1 |          0  (omitted)
           0 |   .0275261   .0491031     0.56   0.575    -.0687141    .1237664
           1 |  -.0116074   .0601618    -0.19   0.847    -.1295224    .1063076
           2 |   .0858959   .0729851     1.18   0.239    -.0571524    .2289441
           3 |   .1303211   .0730291     1.78   0.074    -.0128133    .2734555
           4 |   .1099107   .0840519     1.31   0.191    -.0548279    .2746493
------------------------------------------------------------------------------

Time variable: time, -4 to 4
        Delta: 1 unit

Event study relative to -1               Number of obs = 3,156

------------------------------------------------------------------------------
    exporter |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0260715   .0342481    -0.76   0.447    -.0931965    .0410535
          -3 |  -.0155504   .0268068    -0.58   0.562    -.0680909      .03699
          -2 |  -.0080054   .0222735    -0.36   0.719    -.0516607      .03565
          -1 |          0  (omitted)
           0 |   .0383525   .0183863     2.09   0.037     .0023161    .0743889
           1 |   .0393613   .0259565     1.52   0.129    -.0115125    .0902352
           2 |   .0115392   .0335226     0.34   0.731     -.054164    .0772423
           3 |  -.0261455   .0387238    -0.68   0.500    -.1020428    .0497518
           4 |   .0440199   .0489436     0.90   0.368    -.0519077    .1399475
------------------------------------------------------------------------------
(all observations in frame event_expat matched)
(3 variables copied from linked frame)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
file
    /Users/koren/Tresorit/Mac/projects/expat//output/twfe/expat_local_serv_ex
    > porter.pdf saved as PDF format

. restore

. 
end of do-file
