
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate/regressions.do 

. set varabbrev off, permanently
(set varabbrev preference recorded)

. here
/Users/koren/Tresorit/Mac/projects/expat/

. global here = r(here)

. use "$here/temp/analysis_sample.dta", clear

. 
. *Samples
. global local_sample "(ever_local==1 | foreign==0) & !fake"

. global expat_sample "(ever_expat==1 | foreign==0) & !fake"

. 
. global varlist_rhs "lnK lnL TFP lnQ lnEx lnQd exporter"

. 
. do "code/create/fake_controls.do"

. tempfile fake

. * generate fake controls with 0 effect, to estimate the average effect in the
>  treatment group
. levelsof year, local(years)
1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999
>  2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2
> 015 2016 2017 2018

. local N_years : word count `years'

. local K 231

. 
. preserve

.     clear

.     set obs `=`K'*`N_years''
Number of observations (_N) was 0, now 8,085.

.     generate long frame_id_numeric = .
(8,085 missing values generated)

.     forvalues k = 1/`K' {
  2.         quietly replace frame_id_numeric = `k' if inrange(_n, (`k'-1)*`N_y
> ears'+1, `k'*`N_years')
  3.     }

.     generate year = .
(8,085 missing values generated)

.     forvalues i = 1/`N_years' {
  2.         local year : word `i' of `years'
  3.         quietly replace year = `year' if _n == (frame_id_numeric - 1)*`N_y
> ears' + `i'
  4.     }

.     foreach Y in $varlist_rhs local_ceo has_expat_ceo ever_expat ever_local f
> oreign {
  2.         generate `Y' = 0
  3.     }

.     compress
  variable frame_id_numeric was long now int
  variable year was float now int
  variable lnK was float now byte
  variable lnL was float now byte
  variable TFP was float now byte
  variable lnQ was float now byte
  variable lnEx was float now byte
  variable lnQd was float now byte
  variable exporter was float now byte
  variable local_ceo was float now byte
  variable has_expat_ceo was float now byte
  variable ever_expat was float now byte
  variable ever_local was float now byte
  variable foreign was float now byte
  (323,400 bytes saved)

.     save `fake', replace
(file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St24960.000001 not
    found)
file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St24960.000001 saved
    as .dta format

. restore

. append using `fake', generate(fake)

. 
. generate byte control = !fake & !foreign

. egen N_control = total(control), by(year)

. tabulate year control

      Year |        control
 1980-2018 |         0          1 |     Total
-----------+----------------------+----------
      1984 |       231          1 |       232 
      1985 |       231          3 |       234 
      1986 |       231          8 |       239 
      1987 |       231         12 |       243 
      1988 |       231         20 |       251 
      1989 |       231         68 |       299 
      1990 |       266        113 |       379 
      1991 |       291        159 |       450 
      1992 |       360        167 |       527 
      1993 |       404        174 |       578 
      1994 |       425        231 |       656 
      1995 |       433        215 |       648 
      1996 |       453        203 |       656 
      1997 |       430        194 |       624 
      1998 |       448        160 |       608 
      1999 |       439        169 |       608 
      2000 |       429        154 |       583 
      2001 |       422        168 |       590 
      2002 |       407        184 |       591 
      2003 |       370        194 |       564 
      2004 |       349        184 |       533 
      2005 |       363        162 |       525 
      2006 |       352        166 |       518 
      2007 |       378        129 |       507 
      2008 |       410         94 |       504 
      2009 |       404         75 |       479 
      2010 |       370         72 |       442 
      2011 |       361         81 |       442 
      2012 |       330         73 |       403 
      2013 |       315         63 |       378 
      2014 |       297         54 |       351 
      2015 |       293         40 |       333 
      2016 |       286         35 |       321 
      2017 |       290         18 |       308 
      2018 |       290          0 |       290 
-----------+----------------------+----------
     Total |    12,051      3,843 |    15,894 

. 
. * the time pattern of the fake control group should be the same as the real c
> ontrol group
. drop if (frame_id_numeric > N_control) & fake
(4,242 observations deleted)

. tabulate year if fake

       Year |
  1980-2018 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1984 |          1        0.03        0.03
       1985 |          3        0.08        0.10
       1986 |          8        0.21        0.31
       1987 |         12        0.31        0.62
       1988 |         20        0.52        1.14
       1989 |         68        1.77        2.91
       1990 |        113        2.94        5.85
       1991 |        159        4.14        9.99
       1992 |        167        4.35       14.34
       1993 |        174        4.53       18.87
       1994 |        231        6.01       24.88
       1995 |        215        5.59       30.47
       1996 |        203        5.28       35.75
       1997 |        194        5.05       40.80
       1998 |        160        4.16       44.96
       1999 |        169        4.40       49.36
       2000 |        154        4.01       53.37
       2001 |        168        4.37       57.74
       2002 |        184        4.79       62.53
       2003 |        194        5.05       67.58
       2004 |        184        4.79       72.37
       2005 |        162        4.22       76.58
       2006 |        166        4.32       80.90
       2007 |        129        3.36       84.26
       2008 |         94        2.45       86.70
       2009 |         75        1.95       88.65
       2010 |         72        1.87       90.53
       2011 |         81        2.11       92.64
       2012 |         73        1.90       94.54
       2013 |         63        1.64       96.17
       2014 |         54        1.41       97.58
       2015 |         40        1.04       98.62
       2016 |         35        0.91       99.53
       2017 |         18        0.47      100.00
------------+-----------------------------------
      Total |      3,843      100.00

. drop N_control

. 
. xtset frame_id_numeric year

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1984 to 2018, but with gaps
         Delta: 1 unit

. 
end of do-file

. tempvar N_control Yg

. 
. ****Average effect, foreign_hire sample, local and expat separately, xthdidre
> g
. 
. *Full sample
. foreach Y in $varlist_rhs {
  2. 
.     display "`Y'"
  3. 
.     eststo clear
  4.     xtset frame_id_numeric year
  5. 
.     tabulate local_ceo if $local_sample, missing
  6. 
.     quietly xthdidregress ra (`Y') (local_ceo) if $local_sample, group(frame_
> id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  7.     egen `N_control' = total(control & e(sample)), by(year)
  8.     eststo: quietly eventbaseline, pre(4) post(4) baseline(atet)
  9.     scalar mean1l = e(b)[1,1]
 10. 
.     quietly xthdidregress ra (`Y') (has_expat_ceo) if $expat_sample, group(fr
> ame_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
 11.     eststo: quietly eventbaseline, pre(4) post(4) baseline(atet)
 12.     scalar mean1e = e(b)[1,1]
 13. 
.     quietly xthdidregress ra (`Y') (local_ceo) if (ever_local==1)|(fake & (fr
> ame_id_numeric <= `N_control')), group(frame_id_numeric) vce(cluster frame_id
> _numeric) controlgroup(never)
 14.     eststo: quietly eventbaseline, pre(4) post(4) baseline(atet)
 15.     scalar mean2l = e(b)[1,1]
 16.     scalar variancel = e(V)[1,1]
 17. 
.     quietly xthdidregress ra (`Y') (has_expat_ceo) if (ever_expat==1)|(fake &
>  (frame_id_numeric <= `N_control')), group(frame_id_numeric) vce(cluster fram
> e_id_numeric) controlgroup(never)
 18.     eststo: quietly eventbaseline, pre(4) post(4) baseline(atet)
 19.     scalar mean2e = e(b)[1,1]
 20.     scalar variancee = e(V)[1,1]
 21. 
.     display "Full sample"
 22.     esttab, b(3) se  style(tex)
 23.     display "Difference in means: " mean1l - mean1e
 24.     display "ATET of differences: " mean2l - mean2e
 25.     display "Standard error of difference: " sqrt(variancel + variancee)
 26. 
.     drop `N_control'
 27. 
. }
lnK

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1984 to 2018, but with gaps
         Delta: 1 unit

  local_ceo |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,843       58.40       58.40
          1 |      2,737       41.60      100.00
------------+-----------------------------------
      Total |      6,580      100.00
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
Full sample

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   \\
                      lnK             lnK             lnK             lnK   \\
----------------------------------------------------------------------------
ATET                0.063           0.374**         0.703***        0.981***\\
                  (0.094)         (0.129)         (0.078)         (0.124)   \\
----------------------------------------------------------------------------
N                    5908            4852            8760            5843   \\
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
Difference in means: -.31049435
ATET of differences: -.27849076
Standard error of difference: .14626365
lnL

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1984 to 2018, but with gaps
         Delta: 1 unit

  local_ceo |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,843       58.40       58.40
          1 |      2,737       41.60      100.00
------------+-----------------------------------
      Total |      6,580      100.00
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
Full sample

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   \\
                      lnL             lnL             lnL             lnL   \\
----------------------------------------------------------------------------
ATET                0.117           0.550***        0.417***        0.736***\\
                  (0.085)         (0.127)         (0.067)         (0.118)   \\
----------------------------------------------------------------------------
N                    5908            4852            8760            5843   \\
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
Difference in means: -.43245015
ATET of differences: -.31911605
Standard error of difference: .13598804
TFP

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1984 to 2018, but with gaps
         Delta: 1 unit

  local_ceo |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,843       58.40       58.40
          1 |      2,737       41.60      100.00
------------+-----------------------------------
      Total |      6,580      100.00
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
Full sample

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   \\
                      TFP             TFP             TFP             TFP   \\
----------------------------------------------------------------------------
ATET                0.053           0.138**         0.044*          0.136** \\
                  (0.031)         (0.050)         (0.020)         (0.043)   \\
----------------------------------------------------------------------------
N                    5908            4852            8760            5843   \\
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
Difference in means: -.08534782
ATET of differences: -.09237357
Standard error of difference: .04779486
lnQ

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1984 to 2018, but with gaps
         Delta: 1 unit

  local_ceo |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,843       58.40       58.40
          1 |      2,737       41.60      100.00
------------+-----------------------------------
      Total |      6,580      100.00
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
Full sample

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   \\
                      lnQ             lnQ             lnQ             lnQ   \\
----------------------------------------------------------------------------
ATET                0.255**         0.911***        0.850***        1.483***\\
                  (0.083)         (0.148)         (0.075)         (0.144)   \\
----------------------------------------------------------------------------
N                    5908            4852            8760            5843   \\
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
Difference in means: -.65667545
ATET of differences: -.63315378
Standard error of difference: .16216372
lnEx

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1984 to 2018, but with gaps
         Delta: 1 unit

  local_ceo |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,843       58.40       58.40
          1 |      2,737       41.60      100.00
------------+-----------------------------------
      Total |      6,580      100.00
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
Full sample

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   \\
                     lnEx            lnEx            lnEx            lnEx   \\
----------------------------------------------------------------------------
ATET                0.915***        0.960***        1.311***        1.348***\\
                  (0.177)         (0.219)         (0.134)         (0.191)   \\
----------------------------------------------------------------------------
N                    2839            2446            4106            3044   \\
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
Difference in means: -.04436526
ATET of differences: -.03785384
Standard error of difference: .23314969
lnQd

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1984 to 2018, but with gaps
         Delta: 1 unit

  local_ceo |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,843       58.40       58.40
          1 |      2,737       41.60      100.00
------------+-----------------------------------
      Total |      6,580      100.00
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
Full sample

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   \\
                     lnQd            lnQd            lnQd            lnQd   \\
----------------------------------------------------------------------------
ATET                0.165           0.657***        0.731***        1.226***\\
                  (0.089)         (0.165)         (0.074)         (0.163)   \\
----------------------------------------------------------------------------
N                    5858            4765            8690            5745   \\
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
Difference in means: -.49243873
ATET of differences: -.49512347
Standard error of difference: .17847962
exporter

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1984 to 2018, but with gaps
         Delta: 1 unit

  local_ceo |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,843       58.40       58.40
          1 |      2,737       41.60      100.00
------------+-----------------------------------
      Total |      6,580      100.00
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
Full sample

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   \\
                 exporter        exporter        exporter        exporter   \\
----------------------------------------------------------------------------
ATET                0.037           0.068*          0.106***        0.122***\\
                  (0.024)         (0.034)         (0.016)         (0.031)   \\
----------------------------------------------------------------------------
N                    5908            4852            8760            5843   \\
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
Difference in means: -.0312255
ATET of differences: -.01584858
Standard error of difference: .03473579

. BRK
command BRK is unrecognized
r(199);

end of do-file
r(199);
