
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklós Koren
               Central European University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate/regression.do 

. *Tables and figures for expat study
. 
. use "temp/analysis_sample.dta", clear

. which xt2treatments
/Users/koren/Library/Application Support/Stata/ado/plus/x/xt2treatments.ado
*! version 0.8.4 21may2024

. which e2frame
/Users/koren/Library/Application Support/Stata/ado/plus/e/e2frame.ado
*! version 0.1.0 21may2024

. which reghdfe
/Users/koren/Library/Application Support/Stata/ado/plus/r/reghdfe.ado
*! version 6.12.5 27Dec2023

. which estout
/Users/koren/Library/Application Support/Stata/ado/plus/e/estout.ado
*! version 3.31  26apr2022  Ben Jann

. 
. *Descriptive statistics
. format tradable_sector TFP lnKL export_share %5.3f

. format lnL lnK lnQ lnQd %6.2f

. 
. *Desciptives table
. eststo clear

. 
. quietly estpost sum tradable_sector emp lnK lnQ lnKL TFP export_share if ever
> _local==1 & (time_foreign==-1)

. est store local

. 
. quietly estpost sum tradable_sector emp lnK lnQ lnKL TFP export_share if ever
> _expat==1 & (time_foreign==-1)

. est store expat

. 
. esttab local expat using "output/table/desc_firmvars.tex", main(mean) aux(sd)
>  mtitle("Local CEO" "Expatriate CEO") label pare nolegend nonote replace
(output written to output/table/desc_firmvars.tex)

. 
. *Selection regression
. reghdfe ever_expat lnL lnKL TFP export_share tradable_sector time_treat_1990s
>  if time_foreign==-1, noabsorb cluster(frame_id_numeric)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,995
Absorbing 1 HDFE group                            F(   6,   1988) =       9.58
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0331
                                                  Adj R-squared   =     0.0302
                                                  Within R-sq.    =     0.0331
Number of clusters (frame_id_numeric) =      1,995Root MSE        =     0.4189

                   (Std. err. adjusted for 1,995 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
  ever_expat | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lnL |   .0037235    .006186     0.60   0.547    -.0084082    .0158553
        lnKL |   .0100588    .004465     2.25   0.024     .0013022    .0188155
         TFP |  -.0224266   .0188516    -1.19   0.234    -.0593976    .0145445
export_share |   .1020337   .0669225     1.52   0.128    -.0292119    .2332793
tradable_s~r |   .0869663   .0196573     4.42   0.000     .0484151    .1255174
time_t~1990s |   .0605027   .0199337     3.04   0.002     .0214094    .0995959
       _cons |   .0528671   .0441163     1.20   0.231    -.0336519    .1393862
------------------------------------------------------------------------------

. sum ever_expat if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  ever_expat |      1,995    .2370927    .4254063          0          1

. estadd scalar mean2 = r(mean)

added scalar:
              e(mean2) =  .23709273

. est store est1

. 
. reghdfe ever_expat lnL lnKL TFP export_share if time_foreign==-1, absorb(year
> ##teaor08_2d_pre) cluster(frame_id_numeric)
(dropped 392 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,603
Absorbing 1 HDFE group                            F(   4,   1178) =       0.56
Statistics robust to heteroskedasticity           Prob > F        =     0.6926
                                                  R-squared       =     0.3345
                                                  Adj R-squared   =     0.0950
                                                  Within R-sq.    =     0.0039
Number of clusters (frame_id_numeric) =      1,603Root MSE        =     0.4065

                   (Std. err. adjusted for 1,603 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
  ever_expat | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lnL |   .0040278   .0087691     0.46   0.646    -.0131769    .0212325
        lnKL |   .0060627   .0065076     0.93   0.352    -.0067052    .0188305
         TFP |  -.0187868   .0225291    -0.83   0.405    -.0629883    .0254148
export_share |   .0556588   .0677883     0.82   0.412    -.0773404    .1886581
       _cons |   .1697891   .0651507     2.61   0.009     .0419647    .2976134
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year#teaor08_2d_pre |       421           0         421     |
---------------------------------------------------------------+

. sum ever_expat if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  ever_expat |      1,603    .2401747    .4273227          0          1

. estadd scalar mean2 = r(mean)

added scalar:
              e(mean2) =  .24017467

. est store est2

. 
. esttab est1 est2  using "output/table/selection_reg.tex", nostar b(3) scalar(
> "mean2 Mean dep.var.") noconstant nonote se replace label r2 nolegend nonote
(output written to output/table/selection_reg.tex)

. 
. 
. *Regressions
. global varlist_rhs "lnK lnL TFP lnQ export_share lnQd"

. 
. local estab_options nostar b(3) se scalar("mean2 Mean dep.var.")  style(tex) 
> replace nolegend label nonote coeflabels(ATET "Expatriate CEO")

. local xt2treatments_options treatment(has_expat_ceo) control(local_ceo) pre(4
> ) post(4) baseline(atet) weighting(optimal)

. local lnQd_condition "lnQd_exist_post=="

. *Full sample
. 
. eststo clear

. foreach Y in $varlist_rhs {
  2.         xt2treatments `Y' if ``Y'_condition' 1, `xt2treatments_options'
  3.         sum `Y' if e(sample)
  4.         estadd scalar mean2 = r(mean)
  5.         eststo 
  6. }

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet            Number of obs = 12,714

------------------------------------------------------------------------------
         lnK |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .3157956   .1015839     3.11   0.002     .1166948    .5148965
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         lnK |     12,714    11.58952    2.362135   1.098612    20.0784

added scalar:
              e(mean2) =  11.589517
(est1 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet            Number of obs = 12,714

------------------------------------------------------------------------------
         lnL |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .3677388   .0916857     4.01   0.000     .1880382    .5474394
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         lnL |     12,714    3.441347    1.527151          0   8.439232

added scalar:
              e(mean2) =  3.4413467
(est2 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet            Number of obs = 12,714

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .1237343   .0438497     2.82   0.005     .0377905    .2096782
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         TFP |     12,714    .0041726    .4593204  -5.844438   5.277672

added scalar:
              e(mean2) =  .00417261
(est3 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet            Number of obs = 12,714

------------------------------------------------------------------------------
         lnQ |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .6682752    .110757     6.03   0.000     .4511954     .885355
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         lnQ |     12,714     13.4566    1.837304   1.767058   19.90297

added scalar:
              e(mean2) =  13.456602
(est4 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet            Number of obs = 12,714

------------------------------------------------------------------------------
export_share |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .0555552   .0231434     2.40   0.016     .0101951    .1009154
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
export_share |     12,714    .1541333    .3651372          0   23.72011

added scalar:
              e(mean2) =  .15413328
(est5 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet            Number of obs = 12,466

------------------------------------------------------------------------------
        lnQd |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .3819559   .1272546     3.00   0.003     .1325415    .6313703
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        lnQd |     12,466    13.17723     1.98374   .0408518   19.85426

added scalar:
              e(mean2) =  13.177228
(est6 stored)

. 
. esttab using "output/table/reg_full_sample.tex", `estab_options' 
(output written to output/table/reg_full_sample.tex)

. 
. *Tradable/nontradable
. 
. 
. forvalues i=0/1 {
  2.         eststo clear
  3.         foreach Y in $varlist_rhs {
  4.                 xt2treatments `Y' if ``Y'_condition' 1 & tradable_sector==
> `i', `xt2treatments_options'
  5.                 sum `Y' if e(sample)
  6.                 estadd scalar mean2 = r(mean)
  7.                 eststo 
  8.         }
  9.         esttab using "output/table/reg_tradable`i'_sample.tex", `estab_opt
> ions'
 10. }

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 5,417

------------------------------------------------------------------------------
         lnK |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |    .283963    .166352     1.71   0.088    -.0420808    .6100069
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         lnK |      5,417    11.28751    2.294593   1.098612   17.98325

added scalar:
              e(mean2) =  11.287505
(est1 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 5,417

------------------------------------------------------------------------------
         lnL |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .5088573   .1329862     3.83   0.000     .2482092    .7695055
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         lnL |      5,417    3.161032    1.416369          0   8.420682

added scalar:
              e(mean2) =  3.1610318
(est2 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 5,417

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .2038102   .0816481     2.50   0.013      .043783    .3638375
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         TFP |      5,417    .0036787    .4824667  -5.548406   5.277672

added scalar:
              e(mean2) =  .00367873
(est3 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 5,417

------------------------------------------------------------------------------
         lnQ |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .6996121   .1814752     3.86   0.000     .3439273    1.055297
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         lnQ |      5,417    13.55839    1.817534   1.767058   19.90297

added scalar:
              e(mean2) =  13.558392
(est4 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 5,417

------------------------------------------------------------------------------
export_share |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |  -.0139282   .0262031    -0.53   0.595    -.0652853    .0374289
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
export_share |      5,417    .0820033    .2110132          0          1

added scalar:
              e(mean2) =  .08200332
(est5 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 5,371

------------------------------------------------------------------------------
        lnQd |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |    .572134   .2087323     2.74   0.006     .1630262    .9812417
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        lnQd |      5,371    13.41081    1.900835   1.767058   19.85426

added scalar:
              e(mean2) =  13.410807
(est6 stored)
(output written to output/table/reg_tradable0_sample.tex)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 7,297

------------------------------------------------------------------------------
         lnK |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .3324823   .1274814     2.61   0.009     .0826234    .5823412
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         lnK |      7,297    11.81372    2.386615   2.397895    20.0784

added scalar:
              e(mean2) =  11.813719
(est1 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 7,297

------------------------------------------------------------------------------
         lnL |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .2967734   .1171369     2.53   0.011     .0671893    .5263574
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         lnL |      7,297    3.649441    1.572554          0   8.439232

added scalar:
              e(mean2) =  3.6494412
(est2 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 7,297

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .0836674   .0458282     1.83   0.068    -.0061542    .1734889
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         TFP |      7,297    .0045392    .4413864  -5.844438   3.525578

added scalar:
              e(mean2) =  .00453924
(est3 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 7,297

------------------------------------------------------------------------------
         lnQ |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .6184273   .1325444     4.67   0.000     .3586451    .8782095
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         lnQ |      7,297    13.38104    1.848346   2.012259   19.73901

added scalar:
              e(mean2) =  13.381037
(est4 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 7,297

------------------------------------------------------------------------------
export_share |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .0847111   .0346706     2.44   0.015     .0167579    .1526643
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
export_share |      7,297    .2076797    .4387828          0   23.72011

added scalar:
              e(mean2) =  .20767966
(est5 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 7,095

------------------------------------------------------------------------------
        lnQd |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .2909061   .1546649     1.88   0.060    -.0122316    .5940437
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        lnQd |      7,095    13.00041    2.026571   .0408518   19.68982

added scalar:
              e(mean2) =  13.000405
(est6 stored)
(output written to output/table/reg_tradable1_sample.tex)

. 
. 
. *Export, export entry
. eststo clear

. xt2treatments exporter, `xt2treatments_options'

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet            Number of obs = 12,714

------------------------------------------------------------------------------
    exporter |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .0853787   .0271662     3.14   0.002     .0321339    .1386236
------------------------------------------------------------------------------

. sum `Y' if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  originalid |     12,714    1.23e+07     3400788   1.00e+07   2.91e+07
        year |     12,714     2002.58     7.58995       1986       2019
       sales |     12,714     1750806     8508011          1   3.79e+08
         emp |     12,714    102.4598    274.8373          1       4625
      tanass |     12,633    527966.8     2717977          0   8.76e+07
-------------+---------------------------------------------------------
        eszk |     12,707     1334186     5563387          0   1.86e+08
         hlk |     11,226    150247.8    679645.2          0   2.06e+07
         rlk |     12,701    509388.1     2022409      -2340   9.46e+07
      export |     12,714    391322.6     6129229          0   3.74e+08
    egyebbev |     12,349    53095.12      191946      -2129    6637349
-------------+---------------------------------------------------------
    aktivalt |      9,531    25704.77    207130.2  -1.02e+07    5117254
      ranyag |     12,714     1417432     7920201          1   3.66e+08
    ranyag01 |     12,094      485215     5082513       -522   3.04e+08
    ranyag02 |     11,605    181523.2    604513.6          0   1.54e+07
    ranyag03 |     10,590    750473.3     5267816     -30129   2.58e+08
-------------+---------------------------------------------------------
    ranyag04 |     10,301    167515.5    981947.6        -63   3.19e+07
   ranyagesz |      6,654    24190.81    321193.5          0   1.91e+07
       wbill |     12,104    120318.8    312142.7          0    7275332
     persexp |     12,664    183184.5    468747.3          0   1.02e+07
        kecs |     12,679    55125.17    252923.7          0    8702484
-------------+---------------------------------------------------------
    egyebraf |     12,525     77537.9    319895.3      -3068   1.47e+07
    ereduzem |     12,277    52814.76    620756.8  -1.01e+07   4.25e+07
      pretax |     12,714    43373.45    732091.6  -1.03e+07   5.24e+07
       jetok |     12,693    349333.8     2359744          5   6.07e+07
     jetok01 |        649     1200096     5522766          1   5.84e+07
-------------+---------------------------------------------------------
     jetok03 |      6,625    37288.14    176717.9          1    6586030
     jetok06 |      5,937    323270.3     1831845          5   4.65e+07
     jetok02 |        465    208597.6    926005.8         25   1.01e+07
     jetok04 |      4,954      244650    974501.7          1   2.99e+07
       immat |      8,212    41827.65    332521.8          0    8754478
-------------+---------------------------------------------------------
       satok |     12,640    631846.3     3885539   -6220689   1.75e+08
igb_vett_s~g |        275    68462.09      410186          0    4094212
igb_vett_s~1 |        277     57052.7    367175.3          0    4094212
igb_vett_s~2 |        264     47617.2    325843.8          0    4094212
   teaor_raw |     12,692    4245.105    2076.033          1       9609
-------------+---------------------------------------------------------
  teaor03_2d |     12,714    43.67013    21.12634          1         93
  teaor08_2d |     12,714    39.37471    19.68839          1         96
   foundyear |     12,714    1994.248    9.094112       1948       2018
     firmage |     12,714    8.331131    8.028532          0         68
         tax |     12,269    9362.771     69676.1          0    4740880
-------------+---------------------------------------------------------
         ppi |     12,709    .5839048    .2648815   .0360175   1.540488
      county |     12,676    6.215999    6.044037          1         20
  teaor03_1d |          0
  teaor08_1d |          0
so3_with_mo3 |     12,714    .0531697    .2243806          0          1
-------------+---------------------------------------------------------
         so3 |     12,714    .0507315    .2194575          0          1
         do3 |     12,714    .3696712    .4827346          0          1
         mo3 |     12,714    .0024383    .0493204          0          1
      region |     12,676    2.572815    2.057857          1          7
final_netgep |     12,714    167532.9    716800.8       -104   1.85e+07
-------------+---------------------------------------------------------
final_gep_~g |     12,714    32309.08    134481.4          0    4648243
frame_id_n~c |     12,714    1.27e+07     4582488   1.00e+07   5.48e+07
     minyear |     12,714    1995.905    6.461501       1980       2019
     maxyear |     12,714     2013.02    7.895522       1989       2019
     avg_emp |     12,714    95.71795    208.7655         10   3484.034
-------------+---------------------------------------------------------
industry_m~e |     12,714     39.3246    19.72396          1         95
    sales_18 |     12,714     3604568    1.57e+07   5.853607   4.40e+08
   export_18 |     12,714    617034.4     6473022          0   3.68e+08
   tanass_18 |     12,714     1522839    1.38e+07          3   5.25e+08
    jetok_18 |     12,693     1242169    1.30e+07   37.57185   4.89e+08
-------------+---------------------------------------------------------
   ranyag_18 |     12,714     2849692    1.37e+07   5.807776   4.22e+08
    immat_18 |      8,212    60266.89    462278.1          0   1.26e+07
         lnL |     12,714    3.441347    1.527151          0   8.439232
         lnM |     12,714    13.00669    1.984438   1.759198   19.86078
         lnQ |     12,714     13.4566    1.837304   1.767058   19.90297
-------------+---------------------------------------------------------
        lnQL |     12,714    10.01526    1.336199   1.767058    19.0702
        lnMQ |     12,714   -.4499092    .6449317  -8.455318   5.831882
        lnEx |      6,301     11.5486    2.489545   1.448807   19.72379
        lnQd |     12,594    13.14372    2.023611   .0408518   19.85426
    exporter |     12,714    .4955954    .5000003          0          1
-------------+---------------------------------------------------------
export_share |     12,714    .1541333    .3651372          0   23.72011
  exporter_5 |     12,714    .3286141    .4697278          0          1
         lnK |     12,714    11.58952    2.362135   1.098612    20.0784
        lnKL |     12,714    8.148171    1.970875  -2.358155   18.72417
       RperK |     12,635    .0553409    .1584586          0          1
-------------+---------------------------------------------------------
         age |     12,714    8.331131    8.028532          0         68
domestic_s~s |     12,714     1359533     5655232          0   2.79e+08
     foreign |     12,714    .5579676    .4966479          0          1
       n_ceo |     12,714    1.415212    .7577232          1         11
    hire_ceo |     12,714    .6774422    .4674735          0          1
-------------+---------------------------------------------------------
    fire_ceo |     12,714    .1984427    .3988429          0          1
 foreignness |     12,714     .688611    1.715927          0          5
has_expat_~o |     12,714    .1396099    .3465955          0          1
   ceo_spell |     12,714    6.354334    4.863145          1         31
 owner_spell |     12,714    1.557968    .4966479          1          2
-------------+---------------------------------------------------------
    firm_tag |     12,714    .0882492    .2836681          0          1
industry_y~r |     12,714    232.9145    136.5725         10        697
foreign_hire |     12,714    .5579676    .4966479          0          1
ceo_foreig~l |     12,714     1.13961    .3465955          1          2
foreign_only |     12,714           0           0          0          0
-------------+---------------------------------------------------------
   local_ceo |     12,714    .4191443    .4934384          0          1
ever_local~o |     12,714    .7707252    .4203829          0          1
  ever_local |     12,714    .7707252    .4203829          0          1
first_year~n |     12,714    2002.658    7.587298       1990       2019
time_foreign |     12,714   -.0786535    2.282691         -4          4
-------------+---------------------------------------------------------
  ever_expat |     12,714    .2292748    .4203829          0          1
exporter_pre |     12,714    .5416077    .4982854          0          1
export_entry |      5,828    .1348662    .3416099          0          1
teaor08_1d~m |     12,714     6.25995    3.427209          1         18
teaor08_2d~e |     12,714    39.20529     19.4669          1         74
-------------+---------------------------------------------------------
teaor08_1d~e |     12,714    6.229589    3.374928          1         13
         TFP |     12,714    .0041726    .4593204  -5.844438   5.277672
industrial~e |     12,714    .3766714    .4845705          0          1
tradable_n~e |     12,714    .4042787    .4907712          0          1
tradable_s~e |     12,714    .1696555    .3753446          0          1
-------------+---------------------------------------------------------
tradable_s~r |     12,714    .5739342     .494523          0          1
  time_treat |     12,714    2002.658    7.587298       1990       2019
time_t~1990s |     12,714    .3941325    .4886828          0          1
time_trada~t |     12,714    .2549158     .435831          0          1
lnQd_exist~e |     12,714    .9915841    .0913551          0          1
-------------+---------------------------------------------------------
lnQd_exist~t |     12,714    .9984269    .0396323          0          1
lnQd_missing |     12,714    .0300456    .1707196          0          1

. estadd scalar mean2 = r(mean)

added scalar:
              e(mean2) =  .03004562

. eststo 
(est1 stored)

. xt2treatments exporter if tradable_sector==0, `xt2treatments_options'

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 5,417

------------------------------------------------------------------------------
    exporter |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .0684665   .0467963     1.46   0.143    -.0232526    .1601856
------------------------------------------------------------------------------

. sum `Y' if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  originalid |      5,417    1.26e+07     3848713   1.00e+07   2.91e+07
        year |      5,417     2003.48    7.229848       1986       2019
       sales |      5,417     1558947     4065356          5   1.07e+08
         emp |      5,417    66.45387    181.2593          1       4540
      tanass |      5,376    291820.2     1035222          0   2.64e+07
-------------+---------------------------------------------------------
        eszk |      5,416    964740.5     2276150          0   3.31e+07
         hlk |      4,659    145917.4      774612          0   2.06e+07
         rlk |      5,412    452681.6     1136390      -2340   1.96e+07
      export |      5,417    169621.2     1253437          0   5.41e+07
    egyebbev |      5,263    46511.81    163016.8          0    3579061
-------------+---------------------------------------------------------
    aktivalt |      3,536    5831.685    217109.5  -1.02e+07    5117254
      ranyag |      5,417     1318593     3764963          1   1.05e+08
    ranyag01 |      5,187    138678.7    512613.5       -522   1.26e+07
    ranyag02 |      5,010      172459      646934          0   1.44e+07
    ranyag03 |      4,654    998381.5     3504369     -30129   1.04e+08
-------------+---------------------------------------------------------
    ranyag04 |      4,321    175026.2    993957.1        -63   3.15e+07
   ranyagesz |      3,204    22964.22    347119.3          0   1.91e+07
       wbill |      5,167    90333.02    305266.3          0    7275332
     persexp |      5,389    139262.2      449023          0   1.02e+07
        kecs |      5,397    27560.16    82508.76          0    1382727
-------------+---------------------------------------------------------
    egyebraf |      5,356    61776.93    198725.9      -3068    3642132
    ereduzem |      5,286    31174.28      341978  -1.01e+07    4863044
      pretax |      5,417     27050.6    343479.5  -1.03e+07    4633054
       jetok |      5,412    153934.8    639423.5          5   1.95e+07
     jetok01 |        164    243893.9    567399.3        100    5500000
-------------+---------------------------------------------------------
     jetok03 |      2,994    23742.79    112135.6          1    2925000
     jetok06 |      2,246    147304.3    602221.8         37   1.30e+07
     jetok02 |        133    67063.27     98992.3         25     447720
     jetok04 |      2,113    161825.2    702651.3          1   1.95e+07
       immat |      3,668    33038.91    359730.2          0    7914568
-------------+---------------------------------------------------------
       satok |      5,397      334509     1155033   -1836282   2.74e+07
igb_vett_s~g |        119    139365.1    615741.5          0    4094212
igb_vett_s~1 |        119    114205.7    554433.6          0    4094212
igb_vett_s~2 |        105    95503.76    509204.3          0    4094212
   teaor_raw |      5,407    5227.845     1123.49         38       9609
-------------+---------------------------------------------------------
  teaor03_2d |      5,417    53.95883    10.56177          1         93
  teaor08_2d |      5,417    48.42884    9.252857          1         96
   foundyear |      5,417    1995.197    8.793791       1949       2017
     firmage |      5,417    8.283183    7.414973          0         58
         tax |      5,278    7343.576    27216.56          0     712630
-------------+---------------------------------------------------------
         ppi |      5,414    .5745294    .2562989   .0360175   1.395474
      county |      5,399    5.526023    5.865481          1         20
  teaor03_1d |          0
  teaor08_1d |          0
so3_with_mo3 |      5,417    .0380284    .1912826          0          1
-------------+---------------------------------------------------------
         so3 |      5,417    .0337825    .1806856          0          1
         do3 |      5,417    .4050212    .4909415          0          1
         mo3 |      5,417    .0042459     .065028          0          1
      region |      5,399    2.242082    1.872491          1          7
final_netgep |      5,417    68619.24    248325.7       -104    5038701
-------------+---------------------------------------------------------
final_gep_~g |      5,417    17979.74    85697.09          0    4648243
frame_id_n~c |      5,417    1.32e+07     5320744   1.00e+07   5.48e+07
     minyear |      5,417    1996.466    6.591252       1980       2017
     maxyear |      5,417    2013.519    7.481493       1991       2019
     avg_emp |      5,417    66.06833    152.8554         10   1929.688
-------------+---------------------------------------------------------
industry_m~e |      5,417    47.98283    10.58255          1         95
    sales_18 |      5,417     3186246    1.11e+07   5.853607   4.40e+08
   export_18 |      5,417    318383.1     2391159          0   1.15e+08
   tanass_18 |      5,417    606695.3     2319963          3   6.46e+07
    jetok_18 |      5,412    438032.3     2007823   37.57185   5.10e+07
-------------+---------------------------------------------------------
   ranyag_18 |      5,417     2615334    1.03e+07   5.807776   4.22e+08
    immat_18 |      3,668    47655.92    491415.6          0   1.26e+07
         lnL |      5,417    3.161032    1.416369          0   8.420682
         lnM |      5,417    13.18572    1.949106   1.759198   19.86078
         lnQ |      5,417    13.55839    1.817534   1.767058   19.90297
-------------+---------------------------------------------------------
        lnQL |      5,417    10.39736    1.333158   1.767058   16.17154
        lnMQ |      5,417   -.3726725      .64402  -8.455318   4.760479
        lnEx |      1,992    11.22186    2.544709   2.145708   18.56209
        lnQd |      5,392    13.39864     1.91253   1.767058   19.85426
    exporter |      5,417    .3677312    .4822322          0          1
-------------+---------------------------------------------------------
export_share |      5,417    .0820033    .2110132          0          1
  exporter_5 |      5,417    .1977109    .3983097          0          1
         lnK |      5,417    11.28751    2.294593   1.098612   17.98325
        lnKL |      5,417    8.126473    2.031777  -2.358155   16.59696
       RperK |      5,377    .0444549    .1373332          0          1
-------------+---------------------------------------------------------
         age |      5,417    8.283183    7.414973          0         58
domestic_s~s |      5,417     1389325     3522472          0   6.79e+07
     foreign |      5,417    .5434742    .4981524          0          1
       n_ceo |      5,417    1.367547    .6855243          1         11
    hire_ceo |      5,417    .6906037    .4622875          0          1
-------------+---------------------------------------------------------
    fire_ceo |      5,417    .1966033    .3974665          0          1
 foreignness |      5,417    .4904929    1.478287          0          5
has_expat_~o |      5,417    .1000554    .3001015          0          1
   ceo_spell |      5,417    6.541628    4.787641          1         30
 owner_spell |      5,417    1.543474    .4981524          1          2
-------------+---------------------------------------------------------
    firm_tag |      5,417    .0817796    .2740539          0          1
industry_y~r |      5,417    285.7262    77.12888         11        697
foreign_hire |      5,417    .5434742    .4981524          0          1
ceo_foreig~l |      5,417    1.100055    .3001015          1          2
foreign_only |      5,417           0           0          0          0
-------------+---------------------------------------------------------
   local_ceo |      5,417    .4436035    .4968551          0          1
ever_local~o |      5,417    .8338564    .3722439          0          1
  ever_local |      5,417    .8338564    .3722439          0          1
first_year~n |      5,417    2003.645    7.147451       1990       2019
time_foreign |      5,417   -.1648514    2.289183         -4          4
-------------+---------------------------------------------------------
  ever_expat |      5,417    .1661436    .3722439          0          1
exporter_pre |      5,417    .4199742    .4935999          0          1
export_entry |      3,142    .0951623    .2934857          0          1
teaor08_1d~m |      5,417    7.553997     1.95256          1         18
teaor08_2d~e |      5,417    48.76518    7.371716         37         68
-------------+---------------------------------------------------------
teaor08_1d~e |      5,417     7.58741    1.677731          5         12
         TFP |      5,417    .0036787    .4824667  -5.548406   5.277672
industrial~e |      5,417     .034521    .1825799          0          1
tradable_n~e |      5,417           0           0          0          0
tradable_s~e |      5,417           0           0          0          0
-------------+---------------------------------------------------------
tradable_s~r |      5,417           0           0          0          0
  time_treat |      5,417    2003.645    7.147451       1990       2019
time_t~1990s |      5,417    .3267491     .469068          0          1
time_trada~t |      5,417           0           0          0          0
lnQd_exist~e |      5,417    .9966771    .0575538          0          1
-------------+---------------------------------------------------------
lnQd_exist~t |      5,417    .9994462    .0235289          0          1
lnQd_missing |      5,417    .0182758    .1339593          0          1
   _est_est1 |      5,417           1           0          1          1

. estadd scalar mean2 = r(mean)

added scalar:
              e(mean2) =  1

. eststo 
(est2 stored)

. xt2treatments exporter if tradable_sector==1, `xt2treatments_options'

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 7,297

------------------------------------------------------------------------------
    exporter |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .0890882   .0331711     2.69   0.007      .024074    .1541024
------------------------------------------------------------------------------

. sum `Y' if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  originalid |      7,297    1.20e+07     3000302   1.00e+07   2.84e+07
        year |      7,297    2001.911    7.779909       1986       2019
       sales |      7,297     1893235    1.07e+07          1   3.79e+08
         emp |      7,297    129.1891    324.8871          1       4625
      tanass |      7,257    702904.7     3463374          0   8.76e+07
-------------+---------------------------------------------------------
        eszk |      7,291     1608622     7065481          0   1.86e+08
         hlk |      6,567    153320.1    603316.8          0   1.08e+07
         rlk |      7,289    551491.9     2482838         -7   9.46e+07
      export |      7,297    555904.9     8014361          0   3.74e+08
    egyebbev |      7,086    57984.76      210758      -2129    6637349
-------------+---------------------------------------------------------
    aktivalt |      5,995     37426.4    200107.2   -2108016    4157294
      ranyag |      7,297     1490806     9938252          2   3.66e+08
    ranyag01 |      6,907    745455.8     6699156          0   3.04e+08
    ranyag02 |      6,595    188408.9    570136.7          0   1.54e+07
    ranyag03 |      5,936    556105.9     6308439        -69   2.58e+08
-------------+---------------------------------------------------------
    ranyag04 |      5,980    162088.4      973225          0   3.19e+07
   ranyagesz |      3,450    25329.93    295130.1          0   1.43e+07
       wbill |      6,937    142653.7    315341.9          0    5181200
     persexp |      7,275    215720.3    480286.5          0    7461974
        kecs |      7,282    75554.78    324595.5          0    8702484
-------------+---------------------------------------------------------
    egyebraf |      7,169       89313    385965.8          0   1.47e+07
    ereduzem |      6,991    69177.44    766613.8   -8101121   4.25e+07
      pretax |      7,297    55490.89    919762.8   -6893137   5.24e+07
       jetok |      7,281    494574.8     3058529         50   6.07e+07
     jetok01 |        485     1523431     6349251          1   5.84e+07
-------------+---------------------------------------------------------
     jetok03 |      3,631    48457.18      215274          1    6586030
     jetok06 |      3,691    430346.8     2268741          5   4.65e+07
     jetok02 |        332    265296.6     1089428        100   1.01e+07
     jetok04 |      2,841    306251.1     1131437          6   2.99e+07
       immat |      4,544    48922.08    308673.3          0    8754478
-------------+---------------------------------------------------------
       satok |      7,243    853402.1     5023896   -6220689   1.75e+08
igb_vett_s~g |        156    14375.82    44602.97          0     318792
igb_vett_s~1 |        158    14007.07    40334.21          0     257565
igb_vett_s~2 |        159    15993.99    59425.66          0     615582
   teaor_raw |      7,285    3515.706    2307.252          1       9512
-------------+---------------------------------------------------------
  teaor03_2d |      7,297    36.03221    23.62099          1         92
  teaor08_2d |      7,297    32.65328    22.49072          1         95
   foundyear |      7,297    1993.544    9.248652       1948       2018
     firmage |      7,297    8.366726    8.455594          0         68
         tax |      6,991     10887.2    89195.68          0    4740880
-------------+---------------------------------------------------------
         ppi |      7,295    .5908627    .2708833   .0476838   1.540488
      county |      7,277     6.72791    6.123537          1         20
  teaor03_1d |          0
  teaor08_1d |          0
so3_with_mo3 |      7,297      .06441    .2454988          0          1
-------------+---------------------------------------------------------
         so3 |      7,297    .0633137     .243543          0          1
         do3 |      7,297    .3434288    .4748856          0          1
         mo3 |      7,297    .0010963    .0330952          0          1
      region |      7,277    2.818194    2.152784          1          7
final_netgep |      7,297    240962.5      914795          0   1.85e+07
-------------+---------------------------------------------------------
final_gep_~g |      7,297     42946.6    160610.1          0    3223904
frame_id_n~c |      7,297    1.22e+07     3891078   1.00e+07   5.33e+07
     minyear |      7,297    1995.489    6.331869       1980       2019
     maxyear |      7,297    2012.649    8.170169       1989       2019
     avg_emp |      7,297    117.7286    239.7088         10   3484.034
-------------+---------------------------------------------------------
industry_m~e |      7,297    32.89708     22.3107          1         93
    sales_18 |      7,297     3915113    1.84e+07   7.480198   3.74e+08
   export_18 |      7,297    838741.1     8285496          0   3.68e+08
   tanass_18 |      7,297     2202948    1.80e+07         11   5.25e+08
    jetok_18 |      7,281     1839887    1.71e+07   76.83056   4.89e+08
-------------+---------------------------------------------------------
   ranyag_18 |      7,297     3023670    1.57e+07   6.026082   3.60e+08
    immat_18 |      4,544     70446.7    437133.9          0   1.01e+07
         lnL |      7,297    3.649441    1.572554          0   8.439232
         lnM |      7,297    12.87379    2.000061   1.796097   19.70274
         lnQ |      7,297    13.38104    1.848346   2.012259   19.73901
-------------+---------------------------------------------------------
        lnQL |      7,297    9.731596    1.266026   2.012259    19.0702
        lnMQ |      7,297   -.5072467    .6396475   -6.40798   5.831882
        lnEx |      4,309    11.69965    2.449232   1.448807   19.72379
        lnQd |      7,202    12.95287    2.082742   .0408518   19.68982
    exporter |      7,297    .5905167    .4917722          0          1
-------------+---------------------------------------------------------
export_share |      7,297    .2076797    .4387828          0   23.72011
  exporter_5 |      7,297    .4257914    .4944963          0          1
         lnK |      7,297    11.81372    2.386615   2.397895    20.0784
        lnKL |      7,297    8.164278      1.9244  -.4732876   18.72417
       RperK |      7,258    .0634056     .172014          0          1
-------------+---------------------------------------------------------
         age |      7,297    8.366726    8.455594          0         68
domestic_s~s |      7,297     1337417     6820193          0   2.79e+08
     foreign |      7,297    .5687269     .495288          0          1
       n_ceo |      7,297    1.450596    .8053787          1          7
    hire_ceo |      7,297    .6676716    .4710803          0          1
-------------+---------------------------------------------------------
    fire_ceo |      7,297    .1998081    .3998834          0          1
 foreignness |      7,297    .8356859    1.859438          0          5
has_expat_~o |      7,297    .1689736    .3747542          0          1
   ceo_spell |      7,297    6.215294    4.914159          1         31
 owner_spell |      7,297    1.568727     .495288          1          2
-------------+---------------------------------------------------------
    firm_tag |      7,297    .0930519    .2905251          0          1
industry_y~r |      7,297    193.7092    156.4495         10        696
foreign_hire |      7,297    .5687269     .495288          0          1
ceo_foreig~l |      7,297    1.168974    .3747542          1          2
foreign_only |      7,297           0           0          0          0
-------------+---------------------------------------------------------
   local_ceo |      7,297    .4009867    .4901319          0          1
ever_local~o |      7,297    .7238591     .447118          0          1
  ever_local |      7,297    .7238591     .447118          0          1
first_year~n |      7,297    2001.925    7.818296       1990       2019
time_foreign |      7,297   -.0146636    2.275906         -4          4
-------------+---------------------------------------------------------
  ever_expat |      7,297    .2761409     .447118          0          1
exporter_pre |      7,297    .6319035    .4823208          0          1
export_entry |      2,686    .1813105     .385347          0          1
teaor08_1d~m |      7,297    5.299301    3.933213          1         18
teaor08_2d~e |      7,297     32.1084    22.39992          1         74
-------------+---------------------------------------------------------
teaor08_1d~e |      7,297    5.221598    3.920759          1         13
         TFP |      7,297    .0045392    .4413864  -5.844438   3.525578
industrial~e |      7,297    .6306701    .4826564          0          1
tradable_n~e |      7,297    .7043991    .4563437          0          1
tradable_s~e |      7,297    .2956009    .4563437          0          1
-------------+---------------------------------------------------------
tradable_s~r |      7,297           1           0          1          1
  time_treat |      7,297    2001.925    7.818296       1990       2019
time_t~1990s |      7,297    .4441551    .4969056          0          1
time_trada~t |      7,297    .4441551    .4969056          0          1
lnQd_exist~e |      7,297    .9878032     .109771          0          1
-------------+---------------------------------------------------------
lnQd_exist~t |      7,297    .9976703    .0482143          0          1
lnQd_missing |      7,297    .0387831    .1930908          0          1
   _est_est1 |      7,297           1           0          1          1
   _est_est2 |      7,297           0           0          0          0

. estadd scalar mean2 = r(mean)

added scalar:
              e(mean2) =  0

. eststo 
(est3 stored)

. esttab using "output/table/reg_exporter.tex", `estab_options' mtitle("Full sa
> mple" "Nontradable" "Tradable")
(output written to output/table/reg_exporter.tex)

. 
. 
end of do-file
