
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklós Koren
               Central European University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate/regression.do 

. *Tables and figures for expat study
. 
. use "temp/analysis_sample.dta", clear

. which xt2treatments
/Users/koren/Library/Application Support/Stata/ado/plus/x/xt2treatments.ado
*! version 0.8.4 21may2024

. which e2frame
/Users/koren/Library/Application Support/Stata/ado/plus/e/e2frame.ado
*! version 0.1.0 21may2024

. which reghdfe
/Users/koren/Library/Application Support/Stata/ado/plus/r/reghdfe.ado
*! version 6.12.5 27Dec2023

. which estout
/Users/koren/Library/Application Support/Stata/ado/plus/e/estout.ado
*! version 3.31  26apr2022  Ben Jann

. 
. *Descriptive statistics
. format tradable_sector TFP lnKL export_share %5.3f

. format lnL lnK lnQ lnQd %6.2f

. 
. *Desciptives table
. eststo clear

. 
. quietly estpost sum tradable_sector emp lnK lnQ lnKL TFP export_share if ever
> _local==1 & (time_foreign==-1)

. est store local

. 
. quietly estpost sum tradable_sector emp lnK lnQ lnKL TFP export_share if ever
> _expat==1 & (time_foreign==-1)

. est store expat

. 
. esttab local expat using "output/table/desc_firmvars.tex", main(mean) aux(sd)
>  mtitle("Local CEO" "Expatriate CEO") label pare nolegend nonote replace
(output written to output/table/desc_firmvars.tex)

. 
. *Selection regression
. reghdfe ever_expat lnL lnKL TFP export_share tradable_sector time_treat_1990s
>  if time_foreign==-1, noabsorb cluster(frame_id_numeric)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,995
Absorbing 1 HDFE group                            F(   6,   1988) =       9.58
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0331
                                                  Adj R-squared   =     0.0302
                                                  Within R-sq.    =     0.0331
Number of clusters (frame_id_numeric) =      1,995Root MSE        =     0.4189

                   (Std. err. adjusted for 1,995 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
  ever_expat | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lnL |   .0037235    .006186     0.60   0.547    -.0084082    .0158553
        lnKL |   .0100588    .004465     2.25   0.024     .0013022    .0188155
         TFP |  -.0224266   .0188516    -1.19   0.234    -.0593976    .0145445
export_share |   .1020337   .0669225     1.52   0.128    -.0292119    .2332793
tradable_s~r |   .0869663   .0196573     4.42   0.000     .0484151    .1255174
time_t~1990s |   .0605027   .0199337     3.04   0.002     .0214094    .0995959
       _cons |   .0528671   .0441163     1.20   0.231    -.0336519    .1393862
------------------------------------------------------------------------------

. sum ever_expat if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  ever_expat |      1,995    .2370927    .4254063          0          1

. estadd scalar mean2 = r(mean)

added scalar:
              e(mean2) =  .23709273

. est store est1

. 
. reghdfe ever_expat lnL lnKL TFP export_share if time_foreign==-1, absorb(year
> ##teaor08_2d_pre) cluster(frame_id_numeric)
(dropped 392 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,603
Absorbing 1 HDFE group                            F(   4,   1178) =       0.56
Statistics robust to heteroskedasticity           Prob > F        =     0.6926
                                                  R-squared       =     0.3345
                                                  Adj R-squared   =     0.0950
                                                  Within R-sq.    =     0.0039
Number of clusters (frame_id_numeric) =      1,603Root MSE        =     0.4065

                   (Std. err. adjusted for 1,603 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
  ever_expat | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lnL |   .0040278   .0087691     0.46   0.646    -.0131769    .0212325
        lnKL |   .0060627   .0065076     0.93   0.352    -.0067052    .0188305
         TFP |  -.0187868   .0225291    -0.83   0.405    -.0629883    .0254148
export_share |   .0556588   .0677883     0.82   0.412    -.0773404    .1886581
       _cons |   .1697891   .0651507     2.61   0.009     .0419647    .2976134
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year#teaor08_2d_pre |       421           0         421     |
---------------------------------------------------------------+

. sum ever_expat if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  ever_expat |      1,603    .2401747    .4273227          0          1

. estadd scalar mean2 = r(mean)

added scalar:
              e(mean2) =  .24017467

. est store est2

. 
. esttab est1 est2  using "output/table/selection_reg.tex", nostar b(3) scalar(
> "mean2 Mean dep.var.") noconstant nonote se replace label r2 nolegend nonote
(output written to output/table/selection_reg.tex)

. 
. 
. *Regressions
. global varlist_rhs "lnK lnL TFP lnQ export_share lnQd"

. 
. local estab_options nostar b(3) se scalar("mean2 Mean dep.var.")  style(tex) 
> replace nolegend label nonote coeflabels(ATET "Expatriate CEO")

. local xt2treatments_options treatment(has_expat_ceo) control(local_ceo) pre(4
> ) post(4) baseline(atet) weighting(optimal)

. local lnQd_condition "lnQd_exist_post=="

. *Full sample
. 
. eststo clear

. foreach Y in $varlist_rhs {
  2.         xt2treatments `Y' if ``Y'_condition' 1, `xt2treatments_options'
  3.         sum `Y' if e(sample)
  4.         estadd scalar mean2 = r(mean)
  5.         eststo 
  6. }

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet            Number of obs = 12,714

------------------------------------------------------------------------------
         lnK |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .3157956   .1015839     3.11   0.002     .1166948    .5148965
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         lnK |     12,714    11.58952    2.362135   1.098612    20.0784

added scalar:
              e(mean2) =  11.589517
(est1 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet            Number of obs = 12,714

------------------------------------------------------------------------------
         lnL |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .3677388   .0916857     4.01   0.000     .1880382    .5474394
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         lnL |     12,714    3.441347    1.527151          0   8.439232

added scalar:
              e(mean2) =  3.4413467
(est2 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet            Number of obs = 12,714

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .1237343   .0438497     2.82   0.005     .0377905    .2096782
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         TFP |     12,714    .0041726    .4593204  -5.844438   5.277672

added scalar:
              e(mean2) =  .00417261
(est3 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet            Number of obs = 12,714

------------------------------------------------------------------------------
         lnQ |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .6682752    .110757     6.03   0.000     .4511954     .885355
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         lnQ |     12,714     13.4566    1.837304   1.767058   19.90297

added scalar:
              e(mean2) =  13.456602
(est4 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet            Number of obs = 12,714

------------------------------------------------------------------------------
export_share |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .0555552   .0231434     2.40   0.016     .0101951    .1009154
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
export_share |     12,714    .1541333    .3651372          0   23.72011

added scalar:
              e(mean2) =  .15413328
(est5 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet            Number of obs = 12,466

------------------------------------------------------------------------------
        lnQd |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .3819559   .1272546     3.00   0.003     .1325415    .6313703
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        lnQd |     12,466    13.17723     1.98374   .0408518   19.85426

added scalar:
              e(mean2) =  13.177228
(est6 stored)

. 
. esttab using "output/table/reg_full_sample.tex", `estab_options' 
(output written to output/table/reg_full_sample.tex)

. 
. *Tradable/nontradable
. 
. 
. forvalues i=0/1 {
  2.         eststo clear
  3.         foreach Y in $varlist_rhs {
  4.                 xt2treatments `Y' if ``Y'_condition' 1 & tradable_sector==
> `i', `xt2treatments_options'
  5.                 sum `Y' if e(sample)
  6.                 estadd scalar mean2 = r(mean)
  7.                 eststo 
  8.         }
  9.         esttab using "output/table/reg_tradable`i'_sample.tex", `estab_opt
> ions'
 10. }

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 5,417

------------------------------------------------------------------------------
         lnK |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |    .283963    .166352     1.71   0.088    -.0420808    .6100069
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         lnK |      5,417    11.28751    2.294593   1.098612   17.98325

added scalar:
              e(mean2) =  11.287505
(est1 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 5,417

------------------------------------------------------------------------------
         lnL |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .5088573   .1329862     3.83   0.000     .2482092    .7695055
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         lnL |      5,417    3.161032    1.416369          0   8.420682

added scalar:
              e(mean2) =  3.1610318
(est2 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 5,417

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .2038102   .0816481     2.50   0.013      .043783    .3638375
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         TFP |      5,417    .0036787    .4824667  -5.548406   5.277672

added scalar:
              e(mean2) =  .00367873
(est3 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 5,417

------------------------------------------------------------------------------
         lnQ |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .6996121   .1814752     3.86   0.000     .3439273    1.055297
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         lnQ |      5,417    13.55839    1.817534   1.767058   19.90297

added scalar:
              e(mean2) =  13.558392
(est4 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 5,417

------------------------------------------------------------------------------
export_share |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |  -.0139282   .0262031    -0.53   0.595    -.0652853    .0374289
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
export_share |      5,417    .0820033    .2110132          0          1

added scalar:
              e(mean2) =  .08200332
(est5 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 5,371

------------------------------------------------------------------------------
        lnQd |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |    .572134   .2087323     2.74   0.006     .1630262    .9812417
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        lnQd |      5,371    13.41081    1.900835   1.767058   19.85426

added scalar:
              e(mean2) =  13.410807
(est6 stored)
(output written to output/table/reg_tradable0_sample.tex)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 7,297

------------------------------------------------------------------------------
         lnK |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .3324823   .1274814     2.61   0.009     .0826234    .5823412
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         lnK |      7,297    11.81372    2.386615   2.397895    20.0784

added scalar:
              e(mean2) =  11.813719
(est1 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 7,297

------------------------------------------------------------------------------
         lnL |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .2967734   .1171369     2.53   0.011     .0671893    .5263574
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         lnL |      7,297    3.649441    1.572554          0   8.439232

added scalar:
              e(mean2) =  3.6494412
(est2 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 7,297

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .0836674   .0458282     1.83   0.068    -.0061542    .1734889
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         TFP |      7,297    .0045392    .4413864  -5.844438   3.525578

added scalar:
              e(mean2) =  .00453924
(est3 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 7,297

------------------------------------------------------------------------------
         lnQ |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .6184273   .1325444     4.67   0.000     .3586451    .8782095
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         lnQ |      7,297    13.38104    1.848346   2.012259   19.73901

added scalar:
              e(mean2) =  13.381037
(est4 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 7,297

------------------------------------------------------------------------------
export_share |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .0847111   .0346706     2.44   0.015     .0167579    .1526643
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
export_share |      7,297    .2076797    .4387828          0   23.72011

added scalar:
              e(mean2) =  .20767966
(est5 stored)

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 7,095

------------------------------------------------------------------------------
        lnQd |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .2909061   .1546649     1.88   0.060    -.0122316    .5940437
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        lnQd |      7,095    13.00041    2.026571   .0408518   19.68982

added scalar:
              e(mean2) =  13.000405
(est6 stored)
(output written to output/table/reg_tradable1_sample.tex)

. 
. 
. *Export, export entry
. eststo clear

. xt2treatments exporter, `xt2treatments_options'

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet            Number of obs = 12,714

------------------------------------------------------------------------------
    exporter |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .0853787   .0271662     3.14   0.002     .0321339    .1386236
------------------------------------------------------------------------------

. sum exporter if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    exporter |     12,714    .4955954    .5000003          0          1

. estadd scalar mean2 = r(mean)

added scalar:
              e(mean2) =  .49559541

. eststo 
(est1 stored)

. xt2treatments exporter if tradable_sector==0, `xt2treatments_options'

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 5,417

------------------------------------------------------------------------------
    exporter |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .0684665   .0467963     1.46   0.143    -.0232526    .1601856
------------------------------------------------------------------------------

. sum exporter if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    exporter |      5,417    .3677312    .4822322          0          1

. estadd scalar mean2 = r(mean)

added scalar:
              e(mean2) =  .36773122

. eststo 
(est2 stored)

. xt2treatments exporter if tradable_sector==1, `xt2treatments_options'

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1986 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet             Number of obs = 7,297

------------------------------------------------------------------------------
    exporter |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .0890882   .0331711     2.69   0.007      .024074    .1541024
------------------------------------------------------------------------------

. sum exporter if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    exporter |      7,297    .5905167    .4917722          0          1

. estadd scalar mean2 = r(mean)

added scalar:
              e(mean2) =  .59051665

. eststo 
(est3 stored)

. esttab using "output/table/reg_exporter.tex", `estab_options' mtitle("Full sa
> mple" "Nontradable" "Tradable")
(output written to output/table/reg_exporter.tex)

. 
. 
end of do-file
