
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.0   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do code/estimate/selection.do 

. here
/Users/koren/Tresorit/projects/expat/

. local here = r(here)

. 
. use "`here'/temp/analysis_sample.dta", clear

. 
. local explanatory lnL exporter TFP_cd RperK ??

. local dummies teaor08_2d##year

. local options keep(lnL exporter TFP_cd RperK) tex(frag) dec(3) nocons nonotes
>  addtext(Ind-year FE, YES)

. local sample1 !foreign & owner_spell == 1

. 
. * selection into foreign acquisition
. reghdfe ever_foreign `explanatory' if `sample1', a(`dummies') cluster(origina
> lid)
(dropped 39 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    108,933
Absorbing 1 HDFE group                            F(  12,  17786) =     895.58
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0954
                                                  Adj R-squared   =     0.0885
                                                  Within R-sq.    =     0.0632
Number of clusters (originalid) =     17,787      Root MSE        =     0.2175

                        (Std. Err. adjusted for 17,787 clusters in originalid)
------------------------------------------------------------------------------
             |               Robust
ever_foreign |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lnL |   .0095699   .0016155     5.92   0.000     .0064033    .0127364
    exporter |   .0297072   .0040019     7.42   0.000     .0218631    .0375513
      TFP_cd |  -.0030502   .0030413    -1.00   0.316    -.0090115    .0029111
       RperK |   .0455956   .0150053     3.04   0.002     .0161838    .0750074
          DE |   .8333165   .0379931    21.93   0.000     .7588463    .9077866
          AT |   .7919622   .0556802    14.22   0.000     .6828235    .9011009
          CH |   .7979351    .076957    10.37   0.000     .6470919    .9487783
          NL |   .7701803   .0873124     8.82   0.000     .5990395    .9413211
          FR |   .9060815   .0101545    89.23   0.000     .8861778    .9259852
          GB |   .8742392   .0450872    19.39   0.000      .785864    .9626145
          IT |   .7186563   .1332746     5.39   0.000     .4574252    .9798874
          US |   .7088509   .0994051     7.13   0.000     .5140073    .9036945
       _cons |   .0075924   .0057394     1.32   0.186    -.0036573    .0188421
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------+
       Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------+---------------------------------------|
   teaor08_2d#year |       815           0         815     |
-----------------------------------------------------------+

. outreg2 using "`here'/output/table/selection.tex", replace `options'
/Users/koren/Tresorit/projects/expat//output/table/selection.tex
dir : seeout

. 
. * selection into manager hire
. reghdfe ever_foreign_hire `explanatory' if ever_foreign & `sample1', a(`dummi
> es') cluster(originalid)
(dropped 149 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      5,839
Absorbing 1 HDFE group                            F(  12,   1254) =       3.09
Statistics robust to heteroskedasticity           Prob > F        =     0.0003
                                                  R-squared       =     0.1122
                                                  Adj R-squared   =     0.0114
                                                  Within R-sq.    =     0.0127
Number of clusters (originalid) =      1,255      Root MSE        =     0.4663

                         (Std. Err. adjusted for 1,255 clusters in originalid)
------------------------------------------------------------------------------
             |               Robust
ever_forei~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lnL |   .0073305   .0119361     0.61   0.539    -.0160865    .0307474
    exporter |    .052366   .0323313     1.62   0.106    -.0110634    .1157955
      TFP_cd |  -.0482895   .0283725    -1.70   0.089    -.1039524    .0073733
       RperK |   .1523557   .1186813     1.28   0.199      -.08048    .3851914
          DE |   .0459464   .0693376     0.66   0.508     -.090084    .1819768
          AT |     .06777   .0839589     0.81   0.420    -.0969455    .2324854
          CH |   .1747263   .1555153     1.12   0.261    -.1303726    .4798252
          NL |   .1871004   .1047427     1.79   0.074    -.0183898    .3925907
          FR |   .1434804   .1331103     1.08   0.281     -.117663    .4046238
          GB |   .1877948   .1489134     1.26   0.208    -.1043521    .4799418
          IT |   .2340483   .0735599     3.18   0.001     .0897342    .3783623
          US |   .2283619   .0756664     3.02   0.003     .0799153    .3768086
       _cons |   .6085422   .0487549    12.48   0.000     .5128922    .7041923
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------+
       Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------+---------------------------------------|
   teaor08_2d#year |       584           0         584     |
-----------------------------------------------------------+

. outreg2 using "`here'/output/table/selection.tex", append `options'
/Users/koren/Tresorit/projects/expat//output/table/selection.tex
dir : seeout

. 
. * selection into expat hire
. reghdfe ever_expat `explanatory' if ever_foreign & ever_foreign_hire & `sampl
> e1', a(`dummies') cluster(originalid)
(dropped 153 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      3,883
Absorbing 1 HDFE group                            F(  12,    868) =       8.64
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2073
                                                  Adj R-squared   =     0.0798
                                                  Within R-sq.    =     0.0265
Number of clusters (originalid) =        869      Root MSE        =     0.4793

                           (Std. Err. adjusted for 869 clusters in originalid)
------------------------------------------------------------------------------
             |               Robust
  ever_expat |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lnL |  -.0163173   .0143539    -1.14   0.256    -.0444897    .0118552
    exporter |   .0731001   .0406228     1.80   0.072    -.0066304    .1528306
      TFP_cd |   .0281705   .0411722     0.68   0.494    -.0526383    .1089793
       RperK |   -.241785   .1271862    -1.90   0.058    -.4914133    .0078434
          DE |   .0876788   .1042743     0.84   0.401    -.1169805    .2923381
          AT |   .2124678   .0812369     2.62   0.009     .0530241    .3719114
          CH |   .2774723   .1732399     1.60   0.110    -.0625458    .6174904
          NL |    .094399   .1854208     0.51   0.611    -.2695266    .4583245
          FR |   .4743976    .061493     7.71   0.000     .3537052      .59509
          GB |   .4014536   .1081695     3.71   0.000     .1891492    .6137579
          IT |   .0907196    .197793     0.46   0.647    -.2974889    .4789281
          US |  -.2248115   .1647293    -1.36   0.173    -.5481259    .0985029
       _cons |   .5048637   .0593647     8.50   0.000     .3883485    .6213789
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------+
       Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------+---------------------------------------|
   teaor08_2d#year |       527           0         527     |
-----------------------------------------------------------+

. outreg2 using "`here'/output/table/selection.tex", append `options'
/Users/koren/Tresorit/projects/expat//output/table/selection.tex
dir : seeout

. 
. generate degree_control = ever_foreign + ever_foreign_hire + ever_expat 

. label define dc 0 "Domestic" 1 "Foreign owner" 2 "Foreign hire" 3 "Expat hire
> "

. label value degree_control dc

. 
. tabulate degree_control

degree_contro |
            l |      Freq.     Percent        Cum.
--------------+-----------------------------------
     Domestic |    103,929       91.11       91.11
Foreign owner |      2,652        2.32       93.43
 Foreign hire |      3,391        2.97       96.41
   Expat hire |      4,100        3.59      100.00
--------------+-----------------------------------
        Total |    114,072      100.00

. *oprobit degree_control `explanatory'  i.teaor08_2d#year if `sample1', vce(cl
> uster originalid)
. *outreg2 using "`here'/output/table/selection.tex", append `options'
. 
end of do-file
