
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do select_sample 

. clear all

. set more off

. use "input/balance-small/balance-small.dta"

. * proxy firm founding date with first balance sheet filed
. tempvar foundyear

. egen `foundyear' = min(year), by(frame_id)

. replace foundyear = `foundyear' if missing(foundyear)
(0 real changes made)

. drop `foundyear'

. 
. * limit sample before large merge
. *Függő változók készítése
. gen lnL=ln(emp)
(2,913,579 missing values generated)

. gen lnM=ln(ranyag)
(850,265 missing values generated)

. replace lnM = ln(ranyag8091) if year <= 1991
(107,281 real changes made)

. gen lnQ=ln(sales)
(1,453,068 missing values generated)

. gen lnQL=lnQ-lnL
(3,167,279 missing values generated)

. gen lnMQ = lnM - lnQ
(1,565,423 missing values generated)

. gen byte exporter = export>0&export!=.

. gen exporter_5 = (export/sales > .05 & export < .)

. gen export_share = export/sales
(5,445,398 missing values generated)

. 
. *Átlagos létszám változó
. bys frame_id: egen avg_emp = mean(emp)
(97361 missing values generated)

. *Mintavétel cégszintű változók alapján, cégév a modellek előtt
. local sample (avg_emp>=20) //&!missing(lnL,lnQ,exporter)

. count
  8,314,786

. tempvar before

. gen `before' = r(N)

. keep if `sample'
(7,561,752 observations deleted)

. count
  753,034

. tempvar after

. gen `after' = r(N)

. scalar dropped_size_or_missing = `before'-`after'

. di dropped_size_or_missing
7561752

. *scalar dropped_size_or_missing = r(N_drop)
. 
. ren fo3 foreign

. *foreign átalakítása 
. recode foreign (.=0)
(foreign: 72741 changes made)

. * FIXME: interpolate small holes
. 
. * keep only numeric part of frame_id
. keep if substr(frame_id, 1, 2) == "ft"
(223,690 observations deleted)

. generate long frame_id_numeric = real(substr(frame_id, 3, 8))

. codebook frame_id*

-------------------------------------------------------------------------------
frame_id               Frame_id identify one firm. Only_originalid if not valid
-------------------------------------------------------------------------------

                  type:  string (str15), but longest is str10

         unique values:  80,255                   missing "":  0/529,344

              examples:  "ft10356601"
                         "ft11009319"
                         "ft12178201"
                         "ft23592896"

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [10000049,90620052]          units:  1
         unique values:  80,255                   missing .:  0/529,344

                  mean:   1.5e+07
              std. dev:   7.0e+06

           percentiles:        10%       25%       50%       75%       90%
                           1.0e+07   1.0e+07   1.1e+07   2.0e+07   2.6e+07

. 
. drop frame_id

. 
. *foreign-at többször váltók kidobása
. xtset frame_id_numeric year
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1980 to 2018, but with gaps
                delta:  1 unit

. *lyukak miatt [n_1]
. *gen foreign_change=1 if l1.foreign==0&foreign==1
. *gen foreign_change_rev=1 if l1.foreign==1&foreign==0
. sort frame_id year

. gen foreign_change=1 if foreign[_n-1]==0&foreign==1&frame_id[_n-1]==frame_id
(524,952 missing values generated)

. gen foreign_change_rev=1 if foreign[_n-1]==1&foreign==0&frame_id[_n-1]==frame
> _id
(525,755 missing values generated)

. bys frame_id: egen foreign_change_total=total(foreign_change)

. bys frame_id: egen foreign_change_rev_total=total(foreign_change_rev)

. count
  529,344

. tempvar before

. gen `before' = r(N)

. drop if foreign_change_total>1|foreign_change_rev_total>1
(11,883 observations deleted)

. count
  517,461

. tempvar after

. gen `after' = r(N)

. scalar dropped_too_many_foreign_change = `before'-`after'

. display dropped_too_many_foreign_change
11883

. 
. *divesztíció
. recode foreign_change_rev (.=0)
(foreign_change_rev: 514826 changes made)

. bys frame_id (year): gen divest=sum(foreign_change_rev)

. replace divest=1 if divest>0
(0 real changes made)

. drop foreign_change foreign_change_rev foreign_change_total foreign_change_re
> v_total

. 
. *Greenfield - foreign húzás után, de a sampling előtt
. bys frame_id (year): gen relative_year=_n

. gen foreign_infirst=1 if relative_year==1&foreign==1
(507,448 missing values generated)

. bys frame_id: egen byte greenfield=max(foreign_infirst)
(446029 missing values generated)

. 
. recode greenfield (.=0)
(greenfield: 446029 changes made)

. 
. * extrapolate capital stock
. xtset frame_id year
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1980 to 2018, but with gaps
                delta:  1 unit

. 
. inspect tanass

tanass:  Tangible assets 1000HUF                Number of Observations
--------------------------------       ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            4             4             -
|  #                         Zero           75,508        75,508             -
|  #                         Positive      426,472       426,462            10
|  #                                   -----------   -----------   -----------
|  #                         Total         501,984       501,974            10
|  #   .   .   .   .         Missing        15,477
+----------------------                -----------
-735           6.09e+09                    517,461
(More than 99 unique values)

. tempvar gap 

. generate `gap' = missing(tanass) | (tanass <= 0)

. bysort frame_id (year): generate spell = sum(`gap' != `gap'[_n-1])

. 
. egen gap_length = count(1), by(frame_id spell)

. egen max_spell = max(spell), by(frame_id)

. * if gap_length <= 2, interpolate tanass with geometric average
. bysort frame_id (year): replace tanass = sqrt(tanass[_n-1] * tanass[_n+1]) if
>  gap_length==1 & `gap'==1
(24879 real changes made, 23428 to missing)

. bysort frame_id (year): replace tanass = tanass[_n-1]^0.67 * tanass[_n+2]^0.3
> 3 if gap_length==2 & `gap'==1 & `gap'[_n-1]==0
(851 real changes made, 633 to missing)

. bysort frame_id (year): replace tanass = tanass[_n-2]^0.33 * tanass[_n+1]^0.6
> 7 if gap_length==2 & `gap'==1 & `gap'[_n+1]==0
(1633 real changes made, 1415 to missing)

. * at either end, extrapolate for 1 year
. bysort frame_id (year): replace tanass = tanass[_n+1] if spell==1 & `gap'==1 
> & `gap'[_n+1]==0
(10120 real changes made)

. bysort frame_id (year): replace tanass = tanass[_n-1] if spell==max_spell & `
> gap'==1 & `gap'[_n-1]==0
(4077 real changes made)

. 
. drop spell gap_length max_spell

. replace tanass = round(tanass)
(1,884 real changes made)

. inspect tanass

tanass:  Tangible assets 1000HUF                Number of Observations
--------------------------------       ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            2             2             -
|  #                         Zero           47,596        47,596             -
|  #                         Positive      442,556       442,554             2
|  #                                   -----------   -----------   -----------
|  #                         Total         490,154       490,152             2
|  #   .   .   .   .         Missing        27,307
+----------------------                -----------
-55            6.09e+09                    517,461
(More than 99 unique values)

. 
. gen lnK = ln(tanass)
(74,905 missing values generated)

. gen lnKL = lnK - lnL
(128,830 missing values generated)

. drop if missing(lnK) & year>1991
(74,399 observations deleted)

. 
. *TFP (Cobb-Douglas)
. *FIXME: Replace CD with something fancy
. 
. bysort frame_id: egen teaor_mode = mode(teaor08_2d), maxmode
Warning: at least one group contains all missing values or contains multiple
modes.  Generating missing values for the mode of these groups.  Use the
missing, maxmode, minmode, or nummode() options to control this behavior.
(120 missing values generated)

. recode teaor_mode (6 75 = .) (7 = .) (66 = .) (84 = .) (19 = .) (51 = .)
(teaor_mode: 2203 changes made)

. 
. levelsof teaor_mode, local(levels)
1 2 3 5 8 9 10 11 12 13 14 15 16 17 18 20 21 22 23 24 25 26 27 28 29 30 31 32 3
> 3 35 36 37 38 39 41 42 43 45 46 47 49 50 52 53 55 56 64 65 68 69 70 71 72 73 
> 74 77 78 79 80 81 82 85 86 87 88 90 91 92 93 94 95 96

.         foreach l of local levels {
  2.         disp `l'
  3.         qui reghdfe lnQ lnL lnK lnM if teaor_mode == `l', a(frame_id year 
> foundyear) resid
  4.         predict tfp_cd_`l', res
  5.         }
1
(397,615 missing values generated)
2
(442,061 missing values generated)
3
(442,361 missing values generated)
5
(442,846 missing values generated)
8
(441,931 missing values generated)
9
(442,956 missing values generated)
10
(424,171 missing values generated)
11
(440,755 missing values generated)
12
(442,912 missing values generated)
13
(438,638 missing values generated)
14
(432,627 missing values generated)
15
(438,861 missing values generated)
16
(437,835 missing values generated)
17
(440,722 missing values generated)
18
(439,451 missing values generated)
20
(440,294 missing values generated)
21
(442,095 missing values generated)
22
(434,396 missing values generated)
23
(438,144 missing values generated)
24
(440,762 missing values generated)
25
(423,350 missing values generated)
26
(436,979 missing values generated)
27
(438,385 missing values generated)
28
(432,418 missing values generated)
29
(439,313 missing values generated)
30
(442,442 missing values generated)
31
(438,190 missing values generated)
32
(440,862 missing values generated)
33
(441,804 missing values generated)
35
(440,490 missing values generated)
36
(440,223 missing values generated)
37
(442,688 missing values generated)
38
(439,719 missing values generated)
39
(442,268 missing values generated)
41
(431,932 missing values generated)
42
(430,904 missing values generated)
43
(431,091 missing values generated)
45
(431,520 missing values generated)
46
(411,502 missing values generated)
47
(416,339 missing values generated)
49
(432,841 missing values generated)
50
(442,792 missing values generated)
52
(437,919 missing values generated)
53
(442,523 missing values generated)
55
(438,742 missing values generated)
56
(434,432 missing values generated)
64
(439,306 missing values generated)
65
(442,531 missing values generated)
68
(433,595 missing values generated)
69
(441,617 missing values generated)
70
(440,064 missing values generated)
71
(436,905 missing values generated)
72
(441,343 missing values generated)
73
(441,455 missing values generated)
74
(442,194 missing values generated)
77
(441,714 missing values generated)
78
(439,592 missing values generated)
79
(442,022 missing values generated)
80
(439,401 missing values generated)
81
(437,030 missing values generated)
82
(439,687 missing values generated)
85
(441,519 missing values generated)
86
(440,498 missing values generated)
87
(442,308 missing values generated)
88
(442,278 missing values generated)
90
(442,258 missing values generated)
91
(442,684 missing values generated)
92
(442,663 missing values generated)
93
(441,566 missing values generated)
94
(442,729 missing values generated)
95
(441,937 missing values generated)
96
(440,247 missing values generated)

. 
. gen  TFP_cd =  .
(443,062 missing values generated)

. levelsof teaor_mode, local(levels)
1 2 3 5 8 9 10 11 12 13 14 15 16 17 18 20 21 22 23 24 25 26 27 28 29 30 31 32 3
> 3 35 36 37 38 39 41 42 43 45 46 47 49 50 52 53 55 56 64 65 68 69 70 71 72 73 
> 74 77 78 79 80 81 82 85 86 87 88 90 91 92 93 94 95 96

. foreach l of local levels {
  2. 
.                 qui replace TFP_cd = tfp_cd_`l' if TFP_cd == .
  3. }

. 
. drop tfp_cd_*

. 
. 
. *Industry_year dummy
. egen industry_year = group(teaor08_2d year)
(120 missing values generated)

. 
. *Industry dummy
. gen byte ind = inlist(teaor08_1d,"B","C","D","E")

. egen ind_year=group(ind year)

. 
. *Manufacaturing dummy
. gen manufacturing=0

. replace manufacturing=1 if teaor08_1d=="C"
(133,332 real changes made)

. 
. *Életkor változó
. gen age=year-foundyear

. 
. clonevar age_cat = age

. recode age_cat 20/24=20 25/29=25 30/39=30 40/49=40 50/max=50
(age_cat: 81932 changes made)

. tab age_cat

    age_cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,847        7.19        7.19
          1 |     33,325        7.52       14.71
          2 |     28,690        6.48       21.18
          3 |     24,127        5.45       26.63
          4 |     20,853        4.71       31.34
          5 |     19,712        4.45       35.79
          6 |     18,615        4.20       39.99
          7 |     17,698        3.99       43.98
          8 |     16,658        3.76       47.74
          9 |     15,723        3.55       51.29
         10 |     14,947        3.37       54.66
         11 |     14,132        3.19       57.85
         12 |     13,037        2.94       60.80
         13 |     12,386        2.80       63.59
         14 |     11,656        2.63       66.22
         15 |     11,043        2.49       68.71
         16 |     10,421        2.35       71.07
         17 |      9,867        2.23       73.29
         18 |      9,276        2.09       75.39
         19 |      8,681        1.96       77.35
         20 |     35,642        8.04       85.39
         25 |     19,495        4.40       89.79
         30 |     19,815        4.47       94.26
         40 |     14,151        3.19       97.46
         50 |     11,265        2.54      100.00
------------+-----------------------------------
      Total |    443,062      100.00

. 
. 
. 
. *Pénzügyi szektorban működő vállalatok kiszűrése
. * break the tie when mode is not unique
. bys frame_id: egen industry_mode=mode(teaor08_2d), minmode
Warning: at least one group contains all missing values or contains multiple
modes.  Generating missing values for the mode of these groups.  Use the
missing, maxmode, minmode, or nummode() options to control this behavior.
(120 missing values generated)

. count
  443,062

. tempvar before

. gen `before' = r(N)

. drop if industry_mode==64|industry_mode==65|industry_mode==66
(8,910 observations deleted)

. count
  434,152

. tempvar after

. gen `after' = r(N)

. scalar dropped_finance = `before'-`after'

. di dropped_finance
8910

. *scalar dropped_finance = r(N_drop)
. 
. save_all_to_json

. drop __*

. save "temp/balance-small.dta", replace
file temp/balance-small.dta saved

. 
end of do-file
