
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.0   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do code/estimate/selection.do 

. here
/Users/koren/Tresorit/projects/expat/

. local here = r(here)

. 
. use "`here'/temp/analysis_sample.dta", clear

. 
. local explanatory lnL exporter import_capital import_material TFP_cd RperK ??

. local dummies teaor08_2d##year

. local options keep(lnL exporter import_capital import_material TFP_cd RperK) 
> tex(frag) dec(3) nocons nonotes addtext(Ind-year FE, YES)

. local sample1 !foreign & owner_spell == 1

. 
. * selection into foreign acquisition
. reghdfe ever_foreign `explanatory' if `sample1', a(`dummies') cluster(origina
> lid)
(dropped 39 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    108,933
Absorbing 1 HDFE group                            F(  14,  17786) =     563.91
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0988
                                                  Adj R-squared   =     0.0919
                                                  Within R-sq.    =     0.0666
Number of clusters (originalid) =     17,787      Root MSE        =     0.2171

                        (Std. Err. adjusted for 17,787 clusters in originalid)
------------------------------------------------------------------------------
             |               Robust
ever_foreign |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lnL |   .0072379      .0016     4.52   0.000     .0041017     .010374
    exporter |   .0153785      .0041     3.75   0.000     .0073421    .0234149
import_cap~l |   .0255268    .004806     5.31   0.000     .0161067     .034947
import_mat~l |    .021875   .0042959     5.09   0.000     .0134546    .0302954
      TFP_cd |  -.0035237   .0030336    -1.16   0.245    -.0094699    .0024225
       RperK |   .0450377    .014957     3.01   0.003     .0157205    .0743549
          DE |   .8266969   .0388166    21.30   0.000     .7506126    .9027811
          AT |   .7844303    .055545    14.12   0.000     .6755567    .8933039
          CH |   .7856401   .0759928    10.34   0.000     .6366868    .9345935
          NL |   .7543931   .0834601     9.04   0.000     .5908031    .9179831
          FR |   .8934673    .012264    72.85   0.000     .8694286    .9175061
          GB |   .8719438   .0461168    18.91   0.000     .7815504    .9623371
          IT |   .7157211   .1315352     5.44   0.000     .4578993    .9735429
          US |   .7047974    .101848     6.92   0.000     .5051653    .9044295
       _cons |   .0106749   .0057021     1.87   0.061    -.0005018    .0218516
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------+
       Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------+---------------------------------------|
   teaor08_2d#year |       815           0         815     |
-----------------------------------------------------------+

. outreg2 using "`here'/output/table/selection.tex", replace `options'
/Users/koren/Tresorit/projects/expat//output/table/selection.tex
dir : seeout

. 
. * selection into manager hire
. reghdfe ever_foreign_hire `explanatory' if ever_foreign & `sample1', a(`dummi
> es') cluster(originalid)
(dropped 149 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      5,839
Absorbing 1 HDFE group                            F(  14,   1254) =       2.88
Statistics robust to heteroskedasticity           Prob > F        =     0.0003
                                                  R-squared       =     0.1151
                                                  Adj R-squared   =     0.0143
                                                  Within R-sq.    =     0.0160
Number of clusters (originalid) =      1,255      Root MSE        =     0.4656

                         (Std. Err. adjusted for 1,255 clusters in originalid)
------------------------------------------------------------------------------
             |               Robust
ever_forei~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lnL |   .0019371   .0122193     0.16   0.874    -.0220354    .0259096
    exporter |   .0293138   .0326122     0.90   0.369    -.0346666    .0932942
import_cap~l |  -.0064173   .0286137    -0.22   0.823    -.0625533    .0497188
import_mat~l |   .0717658   .0335346     2.14   0.033     .0059756     .137556
      TFP_cd |  -.0472259   .0282339    -1.67   0.095    -.1026167    .0081649
       RperK |   .1496688    .118311     1.27   0.206    -.0824405    .3817781
          DE |    .043415    .070613     0.61   0.539    -.0951176    .1819476
          AT |   .0618402   .0821491     0.75   0.452    -.0993246     .223005
          CH |   .1640895   .1546584     1.06   0.289    -.1393283    .4675073
          NL |   .1719603   .1036441     1.66   0.097    -.0313746    .3752951
          FR |   .1258944   .1290513     0.98   0.329    -.1272858    .3790745
          GB |    .187948   .1520868     1.24   0.217    -.1104246    .4863206
          IT |   .2358136   .0716516     3.29   0.001     .0952433    .3763838
          US |    .222539   .0758578     2.93   0.003     .0737169    .3713612
       _cons |   .6112251   .0486045    12.58   0.000       .51587    .7065803
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------+
       Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------+---------------------------------------|
   teaor08_2d#year |       584           0         584     |
-----------------------------------------------------------+

. outreg2 using "`here'/output/table/selection.tex", append `options'
/Users/koren/Tresorit/projects/expat//output/table/selection.tex
dir : seeout

. 
. * selection into expat hire
. reghdfe ever_expat `explanatory' if ever_foreign & ever_foreign_hire & `sampl
> e1', a(`dummies') cluster(originalid)
(dropped 153 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      3,883
Absorbing 1 HDFE group                            F(  14,    868) =       8.08
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2161
                                                  Adj R-squared   =     0.0895
                                                  Within R-sq.    =     0.0373
Number of clusters (originalid) =        869      Root MSE        =     0.4768

                           (Std. Err. adjusted for 869 clusters in originalid)
------------------------------------------------------------------------------
             |               Robust
  ever_expat |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lnL |  -.0266131   .0149201    -1.78   0.075    -.0558968    .0026705
    exporter |   .0316631   .0407545     0.78   0.437    -.0483257     .111652
import_cap~l |   .0291513   .0379187     0.77   0.442    -.0452717    .1035744
import_mat~l |    .114196   .0453379     2.52   0.012     .0252114    .2031807
      TFP_cd |   .0286327   .0409835     0.70   0.485    -.0518056    .1090711
       RperK |  -.2337274   .1272042    -1.84   0.066    -.4833911    .0159363
          DE |   .0813847   .1104908     0.74   0.462    -.1354757     .298245
          AT |   .1901819   .0810703     2.35   0.019     .0310651    .3492986
          CH |   .2473175   .1738768     1.42   0.155    -.0939506    .5885857
          NL |   .0704114   .1943683     0.36   0.717    -.3110755    .4518983
          FR |   .4265884   .0626377     6.81   0.000     .3036493    .5495275
          GB |   .4087299   .1115559     3.66   0.000      .189779    .6276807
          IT |    .096681   .1855194     0.52   0.602     -.267438       .4608
          US |  -.2270831   .1653991    -1.37   0.170    -.5517121    .0975458
       _cons |   .5047258   .0585424     8.62   0.000     .3898245     .619627
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------+
       Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------+---------------------------------------|
   teaor08_2d#year |       527           0         527     |
-----------------------------------------------------------+

. outreg2 using "`here'/output/table/selection.tex", append `options'
/Users/koren/Tresorit/projects/expat//output/table/selection.tex
dir : seeout

. 
. generate degree_control = ever_foreign + ever_foreign_hire + ever_expat 

. label define dc 0 "Domestic" 1 "Foreign owner" 2 "Foreign hire" 3 "Expat hire
> "

. label value degree_control dc

. 
. tabulate degree_control

degree_contro |
            l |      Freq.     Percent        Cum.
--------------+-----------------------------------
     Domestic |    103,929       91.11       91.11
Foreign owner |      2,652        2.32       93.43
 Foreign hire |      3,391        2.97       96.41
   Expat hire |      4,100        3.59      100.00
--------------+-----------------------------------
        Total |    114,072      100.00

. *oprobit degree_control `explanatory'  i.teaor08_2d#year if `sample1', vce(cl
> uster originalid)
. *outreg2 using "`here'/output/table/selection.tex", append `options'
. 
end of do-file
