
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.0   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do code/estimate/selection.do 

. here
/Users/koren/Tresorit/projects/expat/

. local here = r(here)

. 
. use "`here'/temp/analysis_sample.dta", clear

. 
. local explanatory lnL exporter import_capital import_material export_same_cou
> ntry import_capital_same_country import_material_same_country TFP_cd RperK ??

. local dummies teaor08_2d##year

. local options keep(lnL exporter import_capital import_material export_same_co
> untry import_capital_same_country import_material_same_country TFP_cd RperK) 
> tex(frag) dec(3) nocons nonotes addtext(Ind-year FE, YES)

. local sample1 !foreign & owner_spell == 1

. 
. * selection into foreign acquisition
. reghdfe ever_foreign `explanatory' if `sample1', a(`dummies') cluster(origina
> lid)
(dropped 39 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    108,933
Absorbing 1 HDFE group                            F(  17,  17786) =     891.58
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0988
                                                  Adj R-squared   =     0.0919
                                                  Within R-sq.    =     0.0667
Number of clusters (originalid) =     17,787      Root MSE        =     0.2171

                        (Std. Err. adjusted for 17,787 clusters in originalid)
------------------------------------------------------------------------------
             |               Robust
ever_foreign |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lnL |   .0072253   .0015998     4.52   0.000     .0040894    .0103611
    exporter |   .0153281   .0040993     3.74   0.000     .0072931    .0233631
import_cap~l |   .0256562   .0048151     5.33   0.000     .0162182    .0350942
import_mat~l |   .0218954   .0042993     5.09   0.000     .0134684    .0303225
export_sam~y |   .0427575    .039868     1.07   0.284    -.0353876    .1209026
import_cap.. |  -.0253507   .0336273    -0.75   0.451    -.0912635    .0405622
import_mat.. |  -.0139686   .0288895    -0.48   0.629    -.0705948    .0426577
      TFP_cd |  -.0035451   .0030324    -1.17   0.242     -.009489    .0023988
       RperK |   .0451032   .0149599     3.01   0.003     .0157803    .0744261
          DE |   .8266522   .0384646    21.49   0.000     .7512578    .9020466
          AT |   .7837889   .0581079    13.49   0.000     .6698918     .897686
          CH |   .7854978   .0772723    10.17   0.000     .6340364    .9369591
          NL |   .7559716   .0850228     8.89   0.000     .5893186    .9226246
          FR |   .9064773   .0213243    42.51   0.000     .8646796    .9482749
          GB |   .8721186   .0476622    18.30   0.000      .778696    .9655411
          IT |   .7138232   .1321462     5.40   0.000     .4548038    .9728425
          US |   .7014089   .0991799     7.07   0.000     .5070066    .8958112
       _cons |   .0107083   .0057016     1.88   0.060    -.0004674    .0218839
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------+
       Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------+---------------------------------------|
   teaor08_2d#year |       815           0         815     |
-----------------------------------------------------------+

. outreg2 using "`here'/output/table/selection.tex", replace `options'
/Users/koren/Tresorit/projects/expat//output/table/selection.tex
dir : seeout

. 
. * selection into manager hire
. reghdfe ever_foreign_hire `explanatory' if ever_foreign & `sample1', a(`dummi
> es') cluster(originalid)
(dropped 149 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      5,839
Absorbing 1 HDFE group                            F(  17,   1254) =       2.65
Statistics robust to heteroskedasticity           Prob > F        =     0.0003
                                                  R-squared       =     0.1154
                                                  Adj R-squared   =     0.0141
                                                  Within R-sq.    =     0.0163
Number of clusters (originalid) =      1,255      Root MSE        =     0.4656

                         (Std. Err. adjusted for 1,255 clusters in originalid)
------------------------------------------------------------------------------
             |               Robust
ever_forei~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lnL |   .0017884   .0122541     0.15   0.884    -.0222524    .0258292
    exporter |   .0284272   .0325851     0.87   0.383       -.0355    .0923545
import_cap~l |  -.0059766   .0293093    -0.20   0.838    -.0634773    .0515241
import_mat~l |   .0715449   .0340454     2.10   0.036     .0047527    .1383371
export_sam~y |   .0795236   .0705916     1.13   0.260     -.058967    .2180142
import_cap.. |  -.0036522   .0722913    -0.05   0.960    -.1454775    .1381731
import_mat.. |  -.0091512    .081202    -0.11   0.910    -.1684578    .1501555
      TFP_cd |  -.0473839   .0282613    -1.68   0.094    -.1028286    .0080609
       RperK |   .1515745   .1183994     1.28   0.201    -.0807083    .3838573
          DE |   .0178501   .0779567     0.23   0.819    -.1350899    .1707902
          AT |   .0457073   .0944501     0.48   0.629    -.1395903    .2310049
          CH |   .1591646   .1551868     1.03   0.305    -.1452898     .463619
          NL |   .1623527   .1056733     1.54   0.125    -.0449633    .3696688
          FR |   .1254081   .1407765     0.89   0.373    -.1507754    .4015916
          GB |   .1796635   .1561415     1.15   0.250    -.1266638    .4859908
          IT |    .207937   .0845591     2.46   0.014     .0420441    .3738298
          US |   .2118925    .074823     2.83   0.005     .0651004    .3586846
       _cons |   .6120634    .048617    12.59   0.000     .5166838    .7074431
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------+
       Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------+---------------------------------------|
   teaor08_2d#year |       584           0         584     |
-----------------------------------------------------------+

. outreg2 using "`here'/output/table/selection.tex", append `options'
/Users/koren/Tresorit/projects/expat//output/table/selection.tex
dir : seeout

. 
. * selection into expat hire
. reghdfe ever_expat `explanatory' if ever_foreign & ever_foreign_hire & `sampl
> e1', a(`dummies') cluster(originalid)
(dropped 153 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      3,883
Absorbing 1 HDFE group                            F(  17,    868) =       7.11
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2180
                                                  Adj R-squared   =     0.0908
                                                  Within R-sq.    =     0.0396
Number of clusters (originalid) =        869      Root MSE        =     0.4764

                           (Std. Err. adjusted for 869 clusters in originalid)
------------------------------------------------------------------------------
             |               Robust
  ever_expat |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lnL |  -.0272615    .014927    -1.83   0.068    -.0565586    .0020357
    exporter |   .0335712   .0406324     0.83   0.409     -.046178    .1133204
import_cap~l |    .034755   .0388925     0.89   0.372    -.0415794    .1110893
import_mat~l |   .1154773   .0457429     2.52   0.012     .0256976    .2052569
export_sam~y |  -.1592161   .1056923    -1.51   0.132    -.3666585    .0482263
import_cap.. |  -.0871486   .0857947    -1.02   0.310     -.255538    .0812408
import_mat.. |   .0001909   .1023732     0.00   0.999     -.200737    .2011188
      TFP_cd |   .0270892   .0408451     0.66   0.507    -.0530775    .1072559
       RperK |  -.2344427   .1268675    -1.85   0.065    -.4834457    .0145603
          DE |   .1807836   .1316523     1.37   0.170    -.0776105    .4391778
          AT |   .2549056   .0856943     2.97   0.003     .0867134    .4230979
          CH |   .2582645   .1797445     1.44   0.151    -.0945203    .6110492
          NL |   .1271495   .1925605     0.66   0.509    -.2507892    .5050882
          FR |   .4783461   .0981745     4.87   0.000      .285659    .6710333
          GB |   .4449572   .1114453     3.99   0.000     .2262235    .6636909
          IT |   .2016792   .2045701     0.99   0.324    -.1998307     .603189
          US |  -.1976964   .1600494    -1.24   0.217    -.5118254    .1164327
       _cons |   .5043263   .0584229     8.63   0.000     .3896597    .6189929
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------+
       Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------+---------------------------------------|
   teaor08_2d#year |       527           0         527     |
-----------------------------------------------------------+

. outreg2 using "`here'/output/table/selection.tex", append `options'
/Users/koren/Tresorit/projects/expat//output/table/selection.tex
dir : seeout

. 
. generate degree_control = ever_foreign + ever_foreign_hire + ever_expat 

. label define dc 0 "Domestic" 1 "Foreign owner" 2 "Foreign hire" 3 "Expat hire
> "

. label value degree_control dc

. 
. tabulate degree_control

degree_contro |
            l |      Freq.     Percent        Cum.
--------------+-----------------------------------
     Domestic |    103,929       91.11       91.11
Foreign owner |      2,652        2.32       93.43
 Foreign hire |      3,391        2.97       96.41
   Expat hire |      4,100        3.59      100.00
--------------+-----------------------------------
        Total |    114,072      100.00

. *oprobit degree_control `explanatory'  i.teaor08_2d#year if `sample1', vce(cl
> uster originalid)
. *outreg2 using "`here'/output/table/selection.tex", append `options'
. 
end of do-file
