
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do code/estimate/selection.do 

. here
/Users/koren/Tresorit/projects/expat/

. local here = r(here)

. 
. use "`here'/temp/analysis_sample.dta", clear

. 
. local explanatory lnL exporter TFP_cd RperK ??

. local dummies teaor08_2d industry_year

. 
. * selection into foreign acquisition
. reghdfe ever_foreign `explanatory' if !foreign & owner_spell == 1, a(`dummies
> ') cluster(originalid)
(dropped 9 singleton observations)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =    250,512
Absorbing 2 HDFE groups                           F(  12,  23553) =    1729.61
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0999
                                                  Adj R-squared   =     0.0978
                                                  Within R-sq.    =     0.0683
Number of clusters (originalid) =     23,554      Root MSE        =     0.1796

                        (Std. Err. adjusted for 23,554 clusters in originalid)
------------------------------------------------------------------------------
             |               Robust
ever_foreign |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lnL |   .0045585   .0009924     4.59   0.000     .0026134    .0065036
    exporter |   .0202421   .0025009     8.09   0.000     .0153402    .0251441
      TFP_cd |  -.0029221   .0014999    -1.95   0.051     -.005862    .0000178
       RperK |   .0231647   .0076867     3.01   0.003     .0080982    .0382313
          DE |   .8650836   .0269028    32.16   0.000     .8123524    .9178148
          AT |   .8401293   .0423157    19.85   0.000     .7571879    .9230708
          CH |   .8568008   .0430996    19.88   0.000     .7723229    .9412788
          NL |   .7745972   .0711404    10.89   0.000     .6351574    .9140371
          FR |   .9246304    .007237   127.76   0.000     .9104454    .9388155
          GB |   .9013816   .0337101    26.74   0.000     .8353076    .9674556
          IT |   .7518681   .1231647     6.10   0.000     .5104573    .9932788
          US |   .8174938   .0606748    13.47   0.000     .6985672    .9364203
       _cons |   .0116801   .0035637     3.28   0.001     .0046949    .0186653
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
    teaor08_2d |        77           0          77     |
 industry_year |       520          18         502     |
-------------------------------------------------------+

. outreg2 using "`here'/output/table/selection.tex", replace `options'
/Users/koren/Tresorit/projects/expat//output/table/selection.tex
dir : seeout

. 
. * selection into manager hire
. reghdfe ever_foreign_hire `explanatory' if ever_foreign & time_foreign == las
> t_before_acquisition, a(`dummies') cluster(originalid)
(dropped 84 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =      1,600
Absorbing 2 HDFE groups                           F(  12,   1325) =       2.94
Statistics robust to heteroskedasticity           Prob > F        =     0.0005
                                                  R-squared       =     0.2105
                                                  Adj R-squared   =     0.0472
                                                  Within R-sq.    =     0.0150
Number of clusters (originalid) =      1,600      Root MSE        =     0.4516

                         (Std. Err. adjusted for 1,600 clusters in originalid)
------------------------------------------------------------------------------
             |               Robust
ever_forei~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lnL |   .0007349   .0093049     0.08   0.937     -.017519    .0189889
    exporter |   .0481275   .0303324     1.59   0.113    -.0113773    .1076324
      TFP_cd |  -.0402578   .0243947    -1.65   0.099    -.0881142    .0075987
       RperK |   .0762749   .1001951     0.76   0.447    -.1202835    .2728333
          DE |   .0347918   .0509818     0.68   0.495    -.0652219    .1348056
          AT |   .1480015   .0558165     2.65   0.008     .0385031    .2574999
          CH |    .190116   .0821664     2.31   0.021     .0289255    .3513066
          NL |  -.0483348   .1260336    -0.38   0.701     -.295582    .1989123
          FR |  -.0440523   .1499382    -0.29   0.769    -.3381944    .2500898
          GB |   .2754164   .0723846     3.80   0.000     .1334155    .4174173
          IT |   .0710421    .139473     0.51   0.611    -.2025698     .344654
          US |   .0183398   .0969459     0.19   0.850    -.1718443    .2085239
       _cons |   .6457729   .0389148    16.59   0.000     .5694316    .7221142
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
    teaor08_2d |        59           0          59     |
 industry_year |       219          15         204     |
-------------------------------------------------------+

. outreg2 using "`here'/output/table/selection.tex", append `options'
/Users/koren/Tresorit/projects/expat//output/table/selection.tex
dir : seeout

. 
. * selection into expat hire
. reghdfe ever_expat `explanatory' if ever_foreign & ever_foreign_hire & time_f
> oreign == last_before_acquisition, a(`dummies') cluster(originalid)
(dropped 94 singleton observations)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =      1,067
Absorbing 2 HDFE groups                           F(  12,    837) =       6.80
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.3270
                                                  Adj R-squared   =     0.1429
                                                  Within R-sq.    =     0.0670
Number of clusters (originalid) =      1,067      Root MSE        =     0.4619

                         (Std. Err. adjusted for 1,067 clusters in originalid)
------------------------------------------------------------------------------
             |               Robust
  ever_expat |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lnL |  -.0139387   .0117768    -1.18   0.237    -.0370543    .0091769
    exporter |   .0294862   .0397227     0.74   0.458    -.0484816    .1074539
      TFP_cd |  -.0396481   .0315282    -1.26   0.209    -.1015317    .0222355
       RperK |   .1354902   .1302562     1.04   0.299    -.1201771    .3911574
          DE |   .2491016   .0585757     4.25   0.000     .1341291    .3640742
          AT |   .3123435   .0652734     4.79   0.000     .1842247    .4404622
          CH |   .3276655   .0825538     3.97   0.000     .1656286    .4897023
          NL |   .1865566   .1429964     1.30   0.192     -.094117    .4672302
          FR |   .2213157   .1624846     1.36   0.174    -.0976094    .5402408
          GB |   .2523995   .1261897     2.00   0.046     .0047141    .5000848
          IT |   .2374922   .1710598     1.39   0.165    -.0982645    .5732488
          US |   .2646269   .1145899     2.31   0.021     .0397095    .4895443
       _cons |   .5155322   .0509079    10.13   0.000     .4156101    .6154542
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
    teaor08_2d |        55           0          55     |
 industry_year |       177          14         163     |
-------------------------------------------------------+

. outreg2 using "`here'/output/table/selection.tex", append `options'
/Users/koren/Tresorit/projects/expat//output/table/selection.tex
dir : seeout

. 
. * selection into same country
. reghdfe ever_same_country `explanatory' if ever_foreign & ever_foreign_hire &
>  ever_expat & time_foreign == last_before_acquisition, a(`dummies') cluster(o
> riginalid)
(dropped 73 singleton observations)
(MWFE estimator converged in 16 iterations)

HDFE Linear regression                            Number of obs   =        532
Absorbing 2 HDFE groups                           F(  12,    371) =       2.47
Statistics robust to heteroskedasticity           Prob > F        =     0.0040
                                                  R-squared       =     0.3362
                                                  Adj R-squared   =     0.0499
                                                  Within R-sq.    =     0.0723
Number of clusters (originalid) =        532      Root MSE        =     0.4851

                           (Std. Err. adjusted for 532 clusters in originalid)
------------------------------------------------------------------------------
             |               Robust
ever_same_~y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lnL |  -.0369974   .0170781    -2.17   0.031    -.0705793   -.0034154
    exporter |  -.0732968   .0650444    -1.13   0.261    -.2011987    .0546051
      TFP_cd |  -.0709525   .0573453    -1.24   0.217    -.1837152    .0418102
       RperK |  -.3791084   .2274379    -1.67   0.096    -.8263376    .0681207
          DE |   .1619638    .083189     1.95   0.052    -.0016172    .3255449
          AT |   .1443592   .0985352     1.47   0.144    -.0493983    .3381166
          CH |  -.0093724   .1545633    -0.06   0.952    -.3133023    .2945575
          NL |  -.1896176   .1909077    -0.99   0.321    -.5650144    .1857791
          FR |   .4001398   .2313144     1.73   0.084    -.0547119    .8549914
          GB |    .401303   .1833944     2.19   0.029     .0406801    .7619258
          IT |  -.1305085    .187237    -0.70   0.486    -.4986874    .2376704
          US |   .2394132   .2045428     1.17   0.243    -.1627955    .6416218
       _cons |   .6067169   .0763339     7.95   0.000     .4566154    .7568183
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
    teaor08_2d |        47           0          47     |
 industry_year |       113          11         102     |
-------------------------------------------------------+

. outreg2 using "`here'/output/table/selection.tex", append `options'
/Users/koren/Tresorit/projects/expat//output/table/selection.tex
dir : seeout

. 
. generate degree_control = ever_foreign + ever_foreign_hire + ever_expat + eve
> r_same_country 

. label define dc 0 "Domestic" 1 "Foreign owner" 2 "Foreign hire" 3 "Expat hire
> " 4 "Hire from same country"

. label value degree_control dc

. 
. tabulate degree_control

        degree_control |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
              Domestic |    243,388       92.13       92.13
         Foreign owner |      4,909        1.86       93.99
          Foreign hire |      6,776        2.57       96.56
            Expat hire |      4,723        1.79       98.34
Hire from same country |      4,373        1.66      100.00
-----------------------+-----------------------------------
                 Total |    264,169      100.00

. oprobit degree_control `explanatory' i.teaor08_2d i.industry_year if !foreign
>  & owner_spell == 1, vce(cluster originalid)

note: 62.industry_year omitted because of collinearity
note: 93.industry_year omitted because of collinearity
note: 124.industry_year omitted because of collinearity
note: 155.industry_year omitted because of collinearity
note: 186.industry_year omitted because of collinearity
note: 217.industry_year omitted because of collinearity
note: 248.industry_year omitted because of collinearity
note: 279.industry_year omitted because of collinearity
note: 306.industry_year omitted because of collinearity
note: 337.industry_year omitted because of collinearity
note: 368.industry_year omitted because of collinearity
note: 399.industry_year omitted because of collinearity
note: 416.industry_year omitted because of collinearity
note: 444.industry_year omitted because of collinearity
note: 471.industry_year omitted because of collinearity
note: 499.industry_year omitted because of collinearity
note: 530.industry_year omitted because of collinearity
Iteration 0:   log pseudolikelihood = -51892.235  
Iteration 1:   log pseudolikelihood = -46366.594  
Iteration 2:   log pseudolikelihood = -45949.358  
Iteration 3:   log pseudolikelihood = -45906.587  
Iteration 4:   log pseudolikelihood =  -45898.86  
Iteration 5:   log pseudolikelihood = -45897.329  
Iteration 6:   log pseudolikelihood = -45897.023  
Iteration 7:   log pseudolikelihood =  -45896.97  
Iteration 8:   log pseudolikelihood = -45896.962  
Iteration 9:   log pseudolikelihood = -45896.961  
Iteration 10:  log pseudolikelihood =  -45896.96  
Iteration 11:  log pseudolikelihood =  -45896.96  
Iteration 12:  log pseudolikelihood =  -45896.96  

Ordered probit regression                       Number of obs     =    250,521
                                                Wald chi2(102)    =          .
                                                Prob > chi2       =          .
Log pseudolikelihood =  -45896.96               Pseudo R2         =     0.1155

                        (Std. Err. adjusted for 23,554 clusters in originalid)
------------------------------------------------------------------------------
             |               Robust
degree_con~l |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lnL |   .0514387   .0116668     4.41   0.000     .0285722    .0743052
    exporter |   .2562834   .0274946     9.32   0.000      .202395    .3101718
      TFP_cd |  -.0405637   .0196001    -2.07   0.038    -.0789792   -.0021482
       RperK |   .3339033     .08383     3.98   0.000     .1695995    .4982071
          DE |    2.25054   .1456238    15.45   0.000     1.965123    2.535957
          AT |   2.100918   .1391509    15.10   0.000     1.828188    2.373649
          CH |   2.212115   .1268485    17.44   0.000     1.963497    2.460734
          NL |   1.855474   .1874721     9.90   0.000     1.488036    2.222913
          FR |   2.426805   .2050475    11.84   0.000     2.024919     2.82869
          GB |   2.920657   .4124416     7.08   0.000     2.112286    3.729027
          IT |   1.780371   .3606701     4.94   0.000     1.073471    2.487272
          US |   1.705791   .2014465     8.47   0.000     1.310963    2.100619
             |
  teaor08_2d |
          2  |  -.2728558   .3569205    -0.76   0.445    -.9724072    .4266956
          3  |  -4.449279   .0784228   -56.73   0.000    -4.602985   -4.295573
          5  |  -3.817102          .        .       .            .           .
          6  |  -3.109449          .        .       .            .           .
          7  |  -9.334657          .        .       .            .           .
          8  |  -3.796848          .        .       .            .           .
          9  |   -4.07093          .        .       .            .           .
         10  |  -4.000907          .        .       .            .           .
         11  |  -3.798573          .        .       .            .           .
         12  |  -3.488899   .4893712    -7.13   0.000    -4.448049    -2.52975
         13  |   -4.19031          .        .       .            .           .
         14  |   -4.53143          .        .       .            .           .
         15  |  -4.264839          .        .       .            .           .
         16  |  -4.393925          .        .       .            .           .
         17  |  -3.942636          .        .       .            .           .
         18  |  -4.093795          .        .       .            .           .
         20  |  -4.114792          .        .       .            .           .
         21  |  -3.303206          .        .       .            .           .
         22  |  -4.099366   .1153761   -35.53   0.000    -4.325499   -3.873233
         23  |  -3.819241   .3079697   -12.40   0.000    -4.422851   -3.215631
         24  |  -3.980949          .        .       .            .           .
         25  |  -4.029205          .        .       .            .           .
         26  |  -3.945228          .        .       .            .           .
         27  |  -4.028124          .        .       .            .           .
         28  |  -4.102625          .        .       .            .           .
         29  |  -4.287909          .        .       .            .           .
         30  |  -3.541077          .        .       .            .           .
         31  |   -4.46177          .        .       .            .           .
         32  |  -4.372614          .        .       .            .           .
         33  |  -4.010329          .        .       .            .           .
         35  |  -3.874128          .        .       .            .           .
         36  |  -4.933378          .        .       .            .           .
         37  |  -4.050971          .        .       .            .           .
         38  |  -3.796848          .        .       .            .           .
         39  |  -4.182033   .5219086    -8.01   0.000    -5.204955   -3.159111
         41  |   -3.78869          .        .       .            .           .
         42  |  -3.769572          .        .       .            .           .
         43  |  -3.867213   .2261965   -17.10   0.000     -4.31055   -3.423876
         45  |  -4.008801          .        .       .            .           .
         46  |  -3.833037   1.079279    -3.55   0.000    -5.948385   -1.717689
         47  |  -4.181154          .        .       .            .           .
         49  |  -4.202396   .8170484    -5.14   0.000    -5.803781    -2.60101
         50  |  -3.905327   1.366752    -2.86   0.004    -6.584112   -1.226542
         51  |  -8.990508          .        .       .            .           .
         52  |  -3.739218   .5566217    -6.72   0.000    -4.830176   -2.648259
         53  |  -3.610264   1.404269    -2.57   0.010    -6.362579   -.8579479
         55  |  -3.566497          .        .       .            .           .
         56  |  -4.130183          .        .       .            .           .
         64  |  -3.792673   2.177937    -1.74   0.082    -8.061352    .4760053
         66  |  -3.389283          .        .       .            .           .
         68  |  -3.775933          .        .       .            .           .
         69  |   -3.94333   .3761183   -10.48   0.000    -4.680508   -3.206152
         70  |  -3.954872          .        .       .            .           .
         71  |  -4.127381   1.355664    -3.04   0.002    -6.784433   -1.470329
         72  |  -3.907022          .        .       .            .           .
         73  |   -3.65076    1.68181    -2.17   0.030    -6.947046   -.3544733
         74  |  -4.142356   1.476256    -2.81   0.005    -7.035765   -1.248947
         75  |  -2.103618   1.207244    -1.74   0.081    -4.469772    .2625373
         77  |   -3.53614          .        .       .            .           .
         78  |  -3.943644          .        .       .            .           .
         79  |  -3.592361          .        .       .            .           .
         80  |  -4.248655          .        .       .            .           .
         81  |  -4.205819          .        .       .            .           .
         82  |  -3.795318          .        .       .            .           .
         84  |   -3.76926   .1979194   -19.04   0.000    -4.157175   -3.381345
         85  |  -3.779164          .        .       .            .           .
         86  |  -3.786339   .6228849    -6.08   0.000    -5.007171   -2.565507
         87  |  -3.648461          .        .       .            .           .
         88  |  -8.568097   .8701782    -9.85   0.000    -10.27361   -6.862579
         90  |   -3.86475   1.352262    -2.86   0.004    -6.515134   -1.214365
         91  |   -3.84203   1.230395    -3.12   0.002     -6.25356   -1.430499
         92  |  -3.408989          .        .       .            .           .
         93  |  -4.140296          .        .       .            .           .
         94  |  -7.943744          .        .       .            .           .
         95  |  -4.000101          .        .       .            .           .
         96  |  -3.851091          .        .       .            .           .
             |
industry_y~r |
          2  |   -.006844   .0033051    -2.07   0.038    -.0133219   -.0003662
          3  |   .1307689   .1363121     0.96   0.337    -.1363979    .3979357
          4  |   .3188059   .1349493     2.36   0.018     .0543103    .5833016
          5  |   .3931574   .1410332     2.79   0.005     .1167374    .6695774
          6  |   .3346539   .1487658     2.25   0.024     .0430783    .6262295
          7  |   .4668036   .1541451     3.03   0.002     .1646847    .7689225
          8  |   .5294123   .1549112     3.42   0.001     .2257918    .8330327
          9  |   .5631535   .1551744     3.63   0.000     .2590173    .8672897
         10  |   .5835006   .1556801     3.75   0.000     .2783733     .888628
         11  |    .601028   .1561609     3.85   0.000     .2949583    .9070978
         12  |   .6261122   .1559187     4.02   0.000     .3205172    .9317071
         13  |   .6571378   .1560083     4.21   0.000     .3513672    .9629084
         14  |   .7139388   .1566857     4.56   0.000     .4068405    1.021037
         15  |   .7034489   .1608767     4.37   0.000     .3881364    1.018762
         16  |   .7325568   .1673128     4.38   0.000     .4046297    1.060484
         17  |   .7864885   .1672371     4.70   0.000     .4587099    1.114267
         18  |   .7620967   .1679675     4.54   0.000     .4328865    1.091307
         19  |   .7036311   .1683984     4.18   0.000     .3735762    1.033686
         20  |   .6184641   .1799421     3.44   0.001     .2657841    .9711441
         21  |   .5344551   .1818368     2.94   0.003     .1780616    .8908487
         22  |   .4480629   .1835495     2.44   0.015     .0883125    .8078132
         23  |   .3238993   .1905814     1.70   0.089    -.0496334    .6974319
         24  |   .2385105   .2142291     1.11   0.266    -.1813708    .6583917
         25  |   -.251326   .2675144    -0.94   0.347    -.7756447    .2729927
         26  |  -.1368024   .2543905    -0.54   0.591    -.6353986    .3617938
         27  |  -3.846581   .1630959   -23.58   0.000    -4.166243   -3.526919
         28  |  -3.821459   .1634311   -23.38   0.000    -4.141778    -3.50114
         29  |  -3.809855   .1635271   -23.30   0.000    -4.130363   -3.489348
         30  |  -3.804577     .16355   -23.26   0.000     -4.12513   -3.484025
         31  |  -3.798894   .1635631   -23.23   0.000    -4.119472   -3.478316
         32  |  -.2845848          .        .       .            .           .
         33  |  -.2806214          .        .       .            .           .
         34  |   -.177216          .        .       .            .           .
         35  |   4.949872   6.321972     0.78   0.434    -7.440966    17.34071
         36  |   5.770653   8.343107     0.69   0.489    -10.58154    22.12284
         37  |     5.7392   11.75264     0.49   0.625    -17.29555    28.77395
         38  |   5.630559   9.790613     0.58   0.565    -13.55869    24.81981
         39  |   5.651738          .        .       .            .           .
         40  |    5.54668          .        .       .            .           .
         41  |   5.491319   3.731714     1.47   0.141    -1.822705    12.80534
         42  |   5.307505          .        .       .            .           .
         43  |   5.179042   7.397566     0.70   0.484    -9.319922      19.678
         44  |   5.193425   14.50037     0.36   0.720    -23.22678    33.61363
         45  |   5.154123   15.85544     0.33   0.745    -25.92197    36.23022
         46  |   5.031023    10.9014     0.46   0.644    -16.33534    26.39738
         47  |   5.015586          .        .       .            .           .
         48  |    5.08511   6.308139     0.81   0.420    -7.278615    17.44884
         49  |   4.692891          .        .       .            .           .
         50  |   4.685233    8.28236     0.57   0.572    -11.54789    20.91836
         51  |   4.528737          .        .       .            .           .
         52  |   4.624543   11.81151     0.39   0.695    -18.52559    27.77468
         53  |   4.659914          .        .       .            .           .
         54  |  -.0918229   14.75752    -0.01   0.995    -29.01603    28.83238
         55  |  -.0982952          .        .       .            .           .
         56  |   4.494066          .        .       .            .           .
         57  |   4.495111   8.276973     0.54   0.587    -11.72746    20.71768
         58  |   4.463123          .        .       .            .           .
         59  |   4.652421          .        .       .            .           .
         60  |   4.650511   10.89388     0.43   0.669    -16.70111    26.00213
         61  |  -.0441689   5.251941    -0.01   0.993    -10.33778    10.24945
         62  |          0  (omitted)
         63  |   4.678461          .        .       .            .           .
         64  |   4.707858          .        .       .            .           .
         65  |    5.11578          .        .       .            .           .
         66  |   5.163639   .4743493    10.89   0.000     4.233932    6.093347
         67  |   5.105905          .        .       .            .           .
         68  |   5.065251          .        .       .            .           .
         69  |    5.11522          .        .       .            .           .
         70  |   5.085128          .        .       .            .           .
         71  |   5.013871          .        .       .            .           .
         72  |   4.985897          .        .       .            .           .
         73  |   4.904774    .446823    10.98   0.000     4.029018    5.780531
         74  |   4.834054   .3477613    13.90   0.000     4.152454    5.515653
         75  |   4.792406          .        .       .            .           .
         76  |   4.779906   .3860015    12.38   0.000     4.023356    5.536455
         77  |   4.759479          .        .       .            .           .
         78  |   4.751594          .        .       .            .           .
         79  |   4.757707          .        .       .            .           .
         80  |   4.711636          .        .       .            .           .
         81  |   4.695535   .1626548    28.87   0.000     4.376737    5.014333
         82  |   4.572519          .        .       .            .           .
         83  |   4.480602          .        .       .            .           .
         84  |   4.391882   .3270725    13.43   0.000     3.750831    5.032932
         85  |   4.357576          .        .       .            .           .
         86  |   4.325636          .        .       .            .           .
         87  |   4.276393          .        .       .            .           .
         88  |   4.305532          .        .       .            .           .
         89  |   4.258685          .        .       .            .           .
         90  |   4.074874          .        .       .            .           .
         91  |     3.9735          .        .       .            .           .
         92  |   3.458109          .        .       .            .           .
         93  |          0  (omitted)
         94  |   5.488534   4.974579     1.10   0.270    -4.261462    15.23853
         95  |   5.487456    6.41526     0.86   0.392    -7.086223    18.06113
         96  |    5.16081   3.442651     1.50   0.134    -1.586662    11.90828
         97  |  -.0987989          .        .       .            .           .
         98  |   5.718343   3.593773     1.59   0.112    -1.325322    12.76201
         99  |   5.650984   1.560879     3.62   0.000     2.591718     8.71025
        100  |   5.659414   4.006691     1.41   0.158    -2.193556    13.51238
        101  |   5.647221          .        .       .            .           .
        102  |   5.127941          .        .       .            .           .
        103  |   4.960602   4.276848     1.16   0.246    -3.421866    13.34307
        104  |   5.009954          .        .       .            .           .
        105  |   4.861726          .        .       .            .           .
        106  |   4.886522   6.484426     0.75   0.451     -7.82272    17.59576
        107  |    4.70923   4.885706     0.96   0.335    -4.866579    14.28504
        108  |   4.509064   4.674884     0.96   0.335     -4.65354    13.67167
        109  |   4.668682   7.435339     0.63   0.530    -9.904315    19.24168
        110  |   4.688542          .        .       .            .           .
        111  |   4.705419    3.80287     1.24   0.216    -2.748069    12.15891
        112  |   4.725771   4.602324     1.03   0.305    -4.294619    13.74616
        113  |   4.284754   4.446665     0.96   0.335    -4.430549    13.00006
        114  |   4.340041    3.71524     1.17   0.243    -2.941696    11.62178
        115  |   4.328498   3.730651     1.16   0.246    -2.983444    11.64044
        116  |  -.0100285   5.605743    -0.00   0.999    -10.99708    10.97703
        117  |  -.0096728          .        .       .            .           .
        118  |  -.0144503     3.5715    -0.00   0.997    -7.014462    6.985562
        119  |   .0338184    3.39081     0.01   0.992    -6.612048    6.679685
        120  |    .024384   2.812628     0.01   0.993    -5.488266    5.537034
        121  |   .0162536   4.211865     0.00   0.997    -8.238851    8.271358
        122  |   -.009443   2.002142    -0.00   0.996    -3.933569    3.914683
        123  |  -.0290832   3.919449    -0.01   0.994    -7.711062    7.652896
        124  |          0  (omitted)
        125  |   .9731919          .        .       .            .           .
        126  |   .4516466          .        .       .            .           .
        127  |   .2294954          .        .       .            .           .
        128  |   .1961596   1.076247     0.18   0.855    -1.913246    2.305565
        129  |   5.133857    1.05398     4.87   0.000     3.068095    7.199619
        130  |   5.070768          .        .       .            .           .
        131  |   5.095016          .        .       .            .           .
        132  |   5.224494          .        .       .            .           .
        133  |    5.22891   1.115009     4.69   0.000     3.043532    7.414288
        134  |   5.199707          .        .       .            .           .
        135  |   5.154792          .        .       .            .           .
        136  |    5.25264   .5394373     9.74   0.000     4.195362    6.309918
        137  |   5.140932          .        .       .            .           .
        138  |   5.042614   .9786134     5.15   0.000     3.124567    6.960661
        139  |   4.939999          .        .       .            .           .
        140  |   4.842764   .7932997     6.10   0.000     3.287925    6.397602
        141  |   4.820065          .        .       .            .           .
        142  |   4.763852   1.387041     3.43   0.001     2.045302    7.482402
        143  |   4.675787    .786286     5.95   0.000     3.134695     6.21688
        144  |   4.532247   1.100634     4.12   0.000     2.375045    6.689449
        145  |   4.355218          .        .       .            .           .
        146  |   4.147592   .3892198    10.66   0.000     3.384735    4.910448
        147  |   3.921689   .3321026    11.81   0.000      3.27078    4.572598
        148  |    .071745          .        .       .            .           .
        149  |   .0874779          .        .       .            .           .
        150  |   .0419083          .        .       .            .           .
        151  |   3.893292   1.205218     3.23   0.001     1.531108    6.255476
        152  |   3.929558   .7798373     5.04   0.000     2.401105    5.458011
        153  |  -.0064917          .        .       .            .           .
        154  |  -.0064334          .        .       .            .           .
        155  |          0  (omitted)
        156  |   3.976453          .        .       .            .           .
        157  |   3.917476   .6055631     6.47   0.000     2.730594    5.104357
        158  |   4.181289          .        .       .            .           .
        159  |   4.285737   .3301009    12.98   0.000     3.638751    4.932722
        160  |   4.224419   .3196749    13.21   0.000     3.597867     4.85097
        161  |   4.321386   .4862253     8.89   0.000     3.368402    5.274369
        162  |   4.415785   .5471898     8.07   0.000     3.343313    5.488257
        163  |   4.423882   .4897303     9.03   0.000     3.464028    5.383736
        164  |   4.458782   .5537661     8.05   0.000     3.373421    5.544144
        165  |   4.472839   .8737384     5.12   0.000     2.760343    6.185335
        166  |   4.432579          .        .       .            .           .
        167  |   4.404391   .1917817    22.97   0.000     4.028506    4.780276
        168  |   4.397631    1.01954     4.31   0.000     2.399369    6.395892
        169  |    4.42044          .        .       .            .           .
        170  |   4.323991          .        .       .            .           .
        171  |   4.371847          .        .       .            .           .
        172  |   4.349356   .2925249    14.87   0.000     3.776017    4.922694
        173  |   4.358627   .4417532     9.87   0.000     3.492806    5.224447
        174  |   4.277034   .6356673     6.73   0.000     3.031149    5.522919
        175  |   4.186495   1.196096     3.50   0.000      1.84219      6.5308
        176  |   4.062653   .8052721     5.05   0.000     2.484348    5.640957
        177  |   3.914183   .8445267     4.63   0.000     2.258941    5.569425
        178  |   3.969561          .        .       .            .           .
        179  |   3.872351   .2964192    13.06   0.000      3.29138    4.453322
        180  |   3.815372   .3538979    10.78   0.000     3.121745    4.508999
        181  |   3.739608   .6335998     5.90   0.000     2.497775    4.981441
        182  |   3.732128   .5813368     6.42   0.000     2.592729    4.871527
        183  |   3.666655   .9056662     4.05   0.000     1.891582    5.441728
        184  |   3.532388          .        .       .            .           .
        185  |  -.0043565          .        .       .            .           .
        186  |          0  (omitted)
        187  |   4.609598   .7984748     5.77   0.000     3.044617     6.17458
        188  |   4.643897    .537982     8.63   0.000     3.589472    5.698322
        189  |   4.783996   .9130303     5.24   0.000     2.994489    6.573502
        190  |   4.972742          .        .       .            .           .
        191  |    4.99217   .3550907    14.06   0.000     4.296205    5.688135
        192  |   4.934584    .713697     6.91   0.000     3.535764    6.333405
        193  |   4.963813          .        .       .            .           .
        194  |   4.970369          .        .       .            .           .
        195  |   4.911966   .2790084    17.61   0.000     4.365119    5.458812
        196  |   4.914782          .        .       .            .           .
        197  |   4.920803   .6256815     7.86   0.000     3.694489    6.147116
        198  |   4.928179          .        .       .            .           .
        199  |   4.906765   .3271203    15.00   0.000     4.265621    5.547909
        200  |   4.866084          .        .       .            .           .
        201  |   4.855862          .        .       .            .           .
        202  |    4.84082          .        .       .            .           .
        203  |   4.809456          .        .       .            .           .
        204  |    4.84164          .        .       .            .           .
        205  |   4.740948          .        .       .            .           .
        206  |   4.604926   .4853517     9.49   0.000     3.653654    5.556198
        207  |   4.479784          .        .       .            .           .
        208  |    4.39382   1.128159     3.89   0.000     2.182669     6.60497
        209  |   4.416903          .        .       .            .           .
        210  |   4.359097   .8860876     4.92   0.000     2.622397    6.095797
        211  |   4.332067   .9279265     4.67   0.000     2.513364    6.150769
        212  |   4.225074   .6657611     6.35   0.000     2.920206    5.529942
        213  |   4.118789   .7953808     5.18   0.000     2.559871    5.677707
        214  |   3.909335          .        .       .            .           .
        215  |   3.700326          .        .       .            .           .
        216  |   .0082148          .        .       .            .           .
        217  |          0  (omitted)
        218  |   .1355344   .5440107     0.25   0.803    -.9307069    1.201776
        219  |   .1555328    1.83037     0.08   0.932    -3.431926    3.742992
        220  |   5.571408   .8871352     6.28   0.000     3.832655    7.310161
        221  |    5.39601          .        .       .            .           .
        222  |   5.130687   1.641839     3.12   0.002     1.912742    8.348633
        223  |   5.239046   1.315314     3.98   0.000     2.661077    7.817014
        224  |   5.173987          .        .       .            .           .
        225  |    5.22974   1.109648     4.71   0.000     3.054869    7.404611
        226  |   5.141018          .        .       .            .           .
        227  |    5.13173          .        .       .            .           .
        228  |   5.070795   .6306083     8.04   0.000     3.834826    6.306764
        229  |   4.990939   1.738018     2.87   0.004     1.584487    8.397391
        230  |   4.870647   1.147645     4.24   0.000     2.621304     7.11999
        231  |   4.946567   1.244903     3.97   0.000     2.506603    7.386532
        232  |   4.914635          .        .       .            .           .
        233  |   4.970505          .        .       .            .           .
        234  |   4.946605    .992348     4.98   0.000     3.001638    6.891571
        235  |   4.845707   1.643171     2.95   0.003     1.625151    8.066263
        236  |   4.987073   1.855952     2.69   0.007     1.349474    8.624672
        237  |   4.857966   1.832895     2.65   0.008     1.265557    8.450375
        238  |   4.561173   1.351892     3.37   0.001     1.911514    7.210832
        239  |   4.437424   1.686107     2.63   0.008     1.132714    7.742134
        240  |   4.401834   1.017935     4.32   0.000     2.406717     6.39695
        241  |   4.805329   1.766906     2.72   0.007     1.342256    8.268401
        242  |   4.128185   .5674733     7.27   0.000     3.015957    5.240412
        243  |   4.052777    1.93843     2.09   0.037     .2535236    7.852031
        244  |   3.688445          .        .       .            .           .
        245  |   3.632596   1.485612     2.45   0.014     .7208496    6.544342
        246  |    .026402   1.626257     0.02   0.987    -3.161003    3.213807
        247  |  -.0023492   1.826662    -0.00   0.999     -3.58254    3.577842
        248  |          0  (omitted)
        249  |   .0653121    .668074     0.10   0.922    -1.244089    1.374713
        250  |   .1020799   .8401612     0.12   0.903    -1.544606    1.748766
        251  |   5.638374          .        .       .            .           .
        252  |   5.440842    1.09721     4.96   0.000      3.29035    7.591335
        253  |   5.154939          .        .       .            .           .
        254  |    5.07784          .        .       .            .           .
        255  |   5.081177          .        .       .            .           .
        256  |   4.966266   .6860393     7.24   0.000     3.621654    6.310879
        257  |   4.904404          .        .       .            .           .
        258  |   4.987231          .        .       .            .           .
        259  |   4.841546          .        .       .            .           .
        260  |   4.828195   1.461728     3.30   0.001      1.96326    7.693129
        261  |   4.755823   .4541495    10.47   0.000     3.865707     5.64594
        262  |   4.828279          .        .       .            .           .
        263  |    4.86161          .        .       .            .           .
        264  |    4.87016   .4786081    10.18   0.000     3.932106    5.808215
        265  |   4.896592          .        .       .            .           .
        266  |   4.854738          .        .       .            .           .
        267  |   4.925566   .2191097    22.48   0.000     4.496119    5.355013
        268  |   4.862913   .5271734     9.22   0.000     3.829672    5.896154
        269  |   4.530394          .        .       .            .           .
        270  |   4.386509          .        .       .            .           .
        271  |   4.375641          .        .       .            .           .
        272  |   4.274792          .        .       .            .           .
        273  |   4.221839          .        .       .            .           .
        274  |   4.025046   .7976234     5.05   0.000     2.461732    5.588359
        275  |   3.629157          .        .       .            .           .
        276  |   3.866944          .        .       .            .           .
        277  |   3.623509   .5102559     7.10   0.000     2.623426    4.623593
        278  |   3.611455          .        .       .            .           .
        279  |          0  (omitted)
        280  |  -.4303322          .        .       .            .           .
        281  |   6.149484          .        .       .            .           .
        282  |   6.045453   3.547428     1.70   0.088    -.9073778    12.99828
        283  |   5.839649          .        .       .            .           .
        284  |   5.989769          .        .       .            .           .
        285  |   5.766177          .        .       .            .           .
        286  |   5.681095   3.108832     1.83   0.068     -.412103    11.77429
        287  |    5.43615          .        .       .            .           .
        288  |   5.806666          .        .       .            .           .
        289  |  -.2267138          .        .       .            .           .
        290  |  -.4588721   2.072059    -0.22   0.825    -4.520032    3.602288
        291  |  -.2877364          .        .       .            .           .
        293  |  -.0899735          .        .       .            .           .
        294  |   .0497321   3.481079     0.01   0.989    -6.773058    6.872522
        295  |  -.2495855          .        .       .            .           .
        296  |  -.2938199   .7688102    -0.38   0.702     -1.80066     1.21302
        297  |  -.1765068          .        .       .            .           .
        298  |  -.3124428   3.849734    -0.08   0.935    -7.857783    7.232897
        299  |  -.2276319    3.11261    -0.07   0.942    -6.328234    5.872971
        300  |  -.2401775   1.462772    -0.16   0.870    -3.107159    2.626803
        301  |  -.2759464          .        .       .            .           .
        302  |  -.2573039   3.259319    -0.08   0.937    -6.645452    6.130844
        303  |  -.2556454   2.745037    -0.09   0.926     -5.63582    5.124529
        304  |  -.4565711   3.502268    -0.13   0.896     -7.32089    6.407748
        305  |  -.1286923          .        .       .            .           .
        306  |          0  (omitted)
        307  |  -.2877507          .        .       .            .           .
        308  |  -.3081918          .        .       .            .           .
        309  |  -.1992468          .        .       .            .           .
        310  |  -.1193305          .        .       .            .           .
        311  |   4.239904          .        .       .            .           .
        312  |   4.141097          .        .       .            .           .
        313  |   4.516116          .        .       .            .           .
        314  |   4.697257   .8085921     5.81   0.000     3.112446    6.282069
        315  |   4.679197          .        .       .            .           .
        316  |   4.645565          .        .       .            .           .
        317  |   4.663114          .        .       .            .           .
        318  |   4.796719          .        .       .            .           .
        319  |   4.819163          .        .       .            .           .
        320  |   4.645011          .        .       .            .           .
        321  |   4.694484          .        .       .            .           .
        322  |   4.762906          .        .       .            .           .
        323  |   4.705352          .        .       .            .           .
        324  |   4.740409          .        .       .            .           .
        325  |   4.769356   1.744874     2.73   0.006     1.349465    8.189246
        326  |   4.652698          .        .       .            .           .
        327  |   4.569315          .        .       .            .           .
        328  |   4.086588          .        .       .            .           .
        329  |   4.296591          .        .       .            .           .
        330  |   4.094132          .        .       .            .           .
        331  |   3.999641          .        .       .            .           .
        332  |   3.911262          .        .       .            .           .
        333  |   3.700284          .        .       .            .           .
        334  |   3.637839          .        .       .            .           .
        335  |   3.629117          .        .       .            .           .
        336  |   .0041291          .        .       .            .           .
        337  |          0  (omitted)
        338  |   4.925673          .        .       .            .           .
        339  |   5.027006   2.063652     2.44   0.015     .9823235    9.071689
        340  |   5.144858   1.240215     4.15   0.000     2.714081    7.575636
        341  |   5.259467          .        .       .            .           .
        342  |    5.31407          .        .       .            .           .
        343  |    5.25295          .        .       .            .           .
        344  |   5.211303          .        .       .            .           .
        345  |   5.143438          .        .       .            .           .
        346  |   5.322302     .98207     5.42   0.000      3.39748    7.247123
        347  |   5.267454          .        .       .            .           .
        348  |   5.229102          .        .       .            .           .
        349  |   5.151408          .        .       .            .           .
        350  |    5.21056   1.445697     3.60   0.000     2.377047    8.044074
        351  |   5.180808    1.53408     3.38   0.001     2.174067    8.187549
        352  |   5.191072   .9554264     5.43   0.000     3.318471    7.063674
        353  |   5.084157          .        .       .            .           .
        354  |   5.025321          .        .       .            .           .
        355  |   5.053795          .        .       .            .           .
        356  |   5.103387          .        .       .            .           .
        357  |   5.019758   1.632327     3.08   0.002     1.820456     8.21906
        358  |   4.915599          .        .       .            .           .
        359  |   4.876838          .        .       .            .           .
        360  |   4.763743          .        .       .            .           .
        361  |   4.692856          .        .       .            .           .
        362  |    4.68118          .        .       .            .           .
        363  |   4.328638   1.122134     3.86   0.000     2.129297     6.52798
        364  |   4.299342   1.314324     3.27   0.001     1.723315    6.875369
        365  |    4.35425   1.388377     3.14   0.002     1.633082    7.075419
        366  |   4.190619          .        .       .            .           .
        367  |   3.928404          .        .       .            .           .
        368  |          0  (omitted)
        369  |   5.417473          .        .       .            .           .
        370  |   5.438608          .        .       .            .           .
        371  |   5.410649          .        .       .            .           .
        372  |    5.24694          .        .       .            .           .
        373  |   5.122559          .        .       .            .           .
        374  |   5.084896          .        .       .            .           .
        375  |   5.103417          .        .       .            .           .
        376  |   5.119649          .        .       .            .           .
        377  |   5.100851          .        .       .            .           .
        378  |   5.041736          .        .       .            .           .
        379  |   5.011491          .        .       .            .           .
        380  |   5.022394          .        .       .            .           .
        381  |   5.045305          .        .       .            .           .
        382  |   4.970723          .        .       .            .           .
        383  |   4.882656          .        .       .            .           .
        384  |   4.846103          .        .       .            .           .
        385  |   4.824562          .        .       .            .           .
        386  |   4.754144          .        .       .            .           .
        387  |   4.675319          .        .       .            .           .
        388  |    4.65547          .        .       .            .           .
        389  |   4.545469          .        .       .            .           .
        390  |   4.551051          .        .       .            .           .
        391  |   4.658124          .        .       .            .           .
        392  |   4.604963          .        .       .            .           .
        393  |   4.550749          .        .       .            .           .
        394  |   4.573046          .        .       .            .           .
        395  |   4.424911          .        .       .            .           .
        396  |   4.100754          .        .       .            .           .
        397  |   3.702501          .        .       .            .           .
        398  |   .0148335          .        .       .            .           .
        399  |          0  (omitted)
        400  |  -.0301827   .1933336    -0.16   0.876    -.4091096    .3487442
        401  |  -.0251599   .1932962    -0.13   0.896    -.4040135    .3536938
        402  |  -.0243902   .1932929    -0.13   0.900    -.4032373    .3544569
        403  |  -.0241218   .1932915    -0.12   0.901    -.4029663    .3547226
        404  |  -.0268685   .1587088    -0.17   0.866     -.337932    .2841951
        405  |  -.1961569   .1968921    -1.00   0.319    -.5820583    .1897446
        406  |  -.2293661   .2015511    -1.14   0.255     -.624399    .1656668
        407  |  -.1208147   .1599399    -0.76   0.450    -.4342911    .1926617
        408  |  -.2670206   .1710004    -1.56   0.118    -.6021753    .0681341
        409  |  -.2632255   .1779025    -1.48   0.139    -.6119081     .085457
        410  |  -.2064327    .143932    -1.43   0.152    -.4885344    .0756689
        411  |  -.0393591   .1110641    -0.35   0.723    -.2570407    .1783224
        412  |  -.0029643   .0988786    -0.03   0.976    -.1967627    .1908342
        413  |   .0128706   .0924102     0.14   0.889    -.1682501    .1939913
        414  |    .027566   .0526295     0.52   0.600     -.075586     .130718
        415  |   .0342843   .0349987     0.98   0.327     -.034312    .1028805
        416  |          0  (omitted)
        417  |   .0165627          .        .       .            .           .
        418  |   5.303743   5.678145     0.93   0.350    -5.825217     16.4327
        419  |   4.980377          .        .       .            .           .
        420  |   5.010731          .        .       .            .           .
        421  |   4.960434          .        .       .            .           .
        422  |    4.98389          .        .       .            .           .
        423  |   4.919302          .        .       .            .           .
        424  |   4.921468          .        .       .            .           .
        425  |   4.682203   4.135513     1.13   0.258    -3.423253    12.78766
        426  |   4.674214          .        .       .            .           .
        427  |   4.865744          .        .       .            .           .
        428  |   4.762845          .        .       .            .           .
        429  |   4.904963          .        .       .            .           .
        430  |   4.890233          .        .       .            .           .
        431  |   4.569519          .        .       .            .           .
        432  |   4.705361          .        .       .            .           .
        433  |   4.864522          .        .       .            .           .
        434  |   4.670508          .        .       .            .           .
        435  |   4.519878          .        .       .            .           .
        436  |   4.529964          .        .       .            .           .
        437  |   4.513996          .        .       .            .           .
        438  |   4.480039          .        .       .            .           .
        439  |   4.467894          .        .       .            .           .
        440  |    4.29939          .        .       .            .           .
        441  |   4.308147   3.995484     1.08   0.281    -3.522857    12.13915
        442  |   .0128989   4.983948     0.00   0.998     -9.75546    9.781258
        443  |   .0065628   4.215452     0.00   0.999    -8.255572    8.268698
        444  |          0  (omitted)
        445  |  -.0956124    .384247    -0.25   0.803    -.8487227     .657498
        446  |   5.189766   .9261339     5.60   0.000     3.374577    7.004955
        447  |   5.476417          .        .       .            .           .
        448  |   5.287825    .756789     6.99   0.000     3.804546    6.771104
        449  |   5.184369          .        .       .            .           .
        450  |   5.179695   1.167876     4.44   0.000       2.8907    7.468691
        451  |   5.178576   1.125547     4.60   0.000     2.972544    7.384608
        452  |   5.012537          .        .       .            .           .
        453  |   4.845021   1.021254     4.74   0.000       2.8434    6.846643
        454  |   4.849384   1.282287     3.78   0.000     2.336147    7.362621
        455  |   4.889079   .6759201     7.23   0.000       3.5643    6.213858
        456  |   4.839221          .        .       .            .           .
        457  |   4.628529   .7708096     6.00   0.000      3.11777    6.139288
        458  |   4.725652   .6734544     7.02   0.000     3.405706    6.045599
        459  |   4.655443   .3085933    15.09   0.000     4.050611    5.260275
        460  |   4.581128   .8163859     5.61   0.000     2.981041    6.181215
        461  |   4.722696          .        .       .            .           .
        462  |   4.677698          .        .       .            .           .
        463  |   4.317615   .7870836     5.49   0.000      2.77496    5.860271
        464  |   4.192599          .        .       .            .           .
        465  |   4.206437   .7461896     5.64   0.000     2.743932    5.668942
        466  |   3.820918          .        .       .            .           .
        467  |   3.817617   1.427191     2.67   0.007     1.020374    6.614861
        468  |   .0118436   .3771544     0.03   0.975    -.7273655    .7510527
        469  |  -.0035999          .        .       .            .           .
        470  |   .0068298          .        .       .            .           .
        471  |          0  (omitted)
        472  |   .4471596          .        .       .            .           .
        473  |   5.420253   2.078508     2.61   0.009     1.346452    9.494055
        474  |   5.538299          .        .       .            .           .
        475  |   5.602279          .        .       .            .           .
        476  |   5.420951   1.667758     3.25   0.001     2.152206    8.689697
        477  |   5.366566   1.216551     4.41   0.000     2.982169    7.750962
        478  |   5.376093   .9292481     5.79   0.000       3.5548    7.197386
        479  |   4.819832   1.114571     4.32   0.000     2.635313    7.004351
        480  |   4.931732   1.282031     3.85   0.000     2.418997    7.444467
        481  |   4.641875   1.136244     4.09   0.000     2.414879    6.868872
        482  |   4.792664   1.446517     3.31   0.001     1.957543    7.627786
        483  |   4.699324   1.321153     3.56   0.000     2.109913    7.288735
        484  |   4.862088   .8860992     5.49   0.000     3.125366    6.598811
        485  |   4.814913   .9369143     5.14   0.000     2.978594    6.651231
        486  |   4.737398          .        .       .            .           .
        487  |   4.730256    1.11744     4.23   0.000     2.540115    6.920397
        488  |   4.549978   1.507055     3.02   0.003     1.596204    7.503752
        489  |   4.406719   1.287485     3.42   0.001     1.883295    6.930142
        490  |   4.407748   1.429756     3.08   0.002     1.605478    7.210017
        491  |   4.191294   1.419171     2.95   0.003      1.40977    6.972818
        492  |    4.16922   1.054545     3.95   0.000     2.102349     6.23609
        493  |   3.940325   .5770999     6.83   0.000      2.80923     5.07142
        494  |   3.959665   1.513996     2.62   0.009     .9922872    6.927043
        495  |   4.260437    1.22766     3.47   0.001     1.854267    6.666607
        496  |   4.277408   1.297268     3.30   0.001     1.734809    6.820007
        497  |   3.888241   .9115414     4.27   0.000     2.101653     5.67483
        498  |   .0098548   .3444141     0.03   0.977    -.6651846    .6848941
        499  |          0  (omitted)
        500  |   4.676838   .9465951     4.94   0.000     2.821546    6.532131
        501  |   4.598579   .7524142     6.11   0.000     3.123874    6.073284
        502  |   4.646296          .        .       .            .           .
        503  |   4.297691          .        .       .            .           .
        504  |   4.441846          .        .       .            .           .
        505  |   4.304763          .        .       .            .           .
        506  |   4.284389          .        .       .            .           .
        507  |   4.088694          .        .       .            .           .
        508  |   4.088698          .        .       .            .           .
        509  |   4.298445   1.225305     3.51   0.000     1.896891    6.699999
        510  |   4.293118          .        .       .            .           .
        511  |   4.348437   1.111605     3.91   0.000     2.169732    6.527142
        512  |   3.660537          .        .       .            .           .
        513  |   3.705466   .9751296     3.80   0.000     1.794247    5.616685
        514  |   .0823922   2.050731     0.04   0.968    -3.936967    4.101751
        515  |    .096595   2.023731     0.05   0.962    -3.869845    4.063035
        516  |   .1043095          .        .       .            .           .
        517  |   .1044824          .        .       .            .           .
        518  |    4.19165          .        .       .            .           .
        519  |   .0974246   .9959413     0.10   0.922    -1.854584    2.049434
        520  |   4.232191          .        .       .            .           .
        521  |   4.193586          .        .       .            .           .
        522  |   4.152825   1.305051     3.18   0.001     1.594972    6.710679
        523  |    4.16379   .6188884     6.73   0.000     2.950791    5.376789
        524  |   4.166841   1.807074     2.31   0.021     .6250409    7.708641
        525  |   4.165917   2.143016     1.94   0.052    -.0343175    8.366151
        526  |   4.133005   1.806328     2.29   0.022     .5926664    7.673343
        527  |   4.212991          .        .       .            .           .
        528  |   4.202153          .        .       .            .           .
        529  |   3.750875   1.031971     3.63   0.000     1.728248    5.773501
        530  |          0  (omitted)
-------------+----------------------------------------------------------------
       /cut1 |   2.775268   .1756675                      2.430966     3.11957
       /cut2 |   2.981801   .1765635                      2.635742    3.327859
       /cut3 |    3.33587   .1796808                      2.983702    3.688038
       /cut4 |   3.760296   .1789989                      3.409464    4.111127
------------------------------------------------------------------------------
Note: 18380 observations completely determined.  Standard errors
      questionable.

. 
end of do-file
