
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.0   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do code/estimate/selection.do 

. here
/Users/koren/Tresorit/projects/expat/

. local here = r(here)

. 
. use "`here'/temp/analysis_sample.dta", clear

. 
. local explanatory lnL exporter TFP_cd RperK ??

. local dummies teaor08_2d##year

. local options keep(lnL exporter TFP_cd RperK) tex(frag) dec(3)

. local sample1 !foreign & owner_spell == 1

. 
. * selection into foreign acquisition
. reghdfe ever_foreign `explanatory' if `sample1', a(`dummies') cluster(origina
> lid)
(dropped 70 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    161,429
Absorbing 1 HDFE group                            F(  12,  14546) =     770.49
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.1234
                                                  Adj R-squared   =     0.1121
                                                  Within R-sq.    =     0.0701
Number of clusters (originalid) =     14,547      Root MSE        =     0.2032

                        (Std. Err. adjusted for 14,547 clusters in originalid)
------------------------------------------------------------------------------
             |               Robust
ever_foreign |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lnL |    .004148   .0012909     3.21   0.001     .0016177    .0066784
    exporter |    .028998   .0036758     7.89   0.000     .0217929    .0362031
      TFP_cd |  -.0032184   .0019249    -1.67   0.095    -.0069914    .0005546
       RperK |   .0287713   .0102293     2.81   0.005     .0087205     .048822
          DE |   .8504725   .0309435    27.48   0.000     .7898193    .9111256
          AT |   .8154866   .0456245    17.87   0.000     .7260567    .9049165
          CH |   .8408776   .0467531    17.99   0.000     .7492356    .9325196
          NL |   .7757115   .0728327    10.65   0.000     .6329502    .9184727
          FR |   .8963909   .0111481    80.41   0.000     .8745391    .9182426
          GB |   .8788297   .0391633    22.44   0.000     .8020647    .9555947
          IT |   .7300096   .1376006     5.31   0.000     .4602949    .9997242
          US |   .8067365   .0616397    13.09   0.000     .6859149    .9275581
       _cons |   .0209995    .004833     4.35   0.000     .0115263    .0304728
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------+
       Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------+---------------------------------------|
   teaor08_2d#year |      2052           0        2052     |
-----------------------------------------------------------+

. outreg2 using "`here'/output/table/selection.tex", replace `options'
/Users/koren/Tresorit/projects/expat//output/table/selection.tex
dir : seeout

. 
. * selection into manager hire
. reghdfe ever_foreign_hire `explanatory' if ever_foreign & `sample1', a(`dummi
> es') cluster(originalid)
(dropped 395 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      7,512
Absorbing 1 HDFE group                            F(  12,   1364) =       2.25
Statistics robust to heteroskedasticity           Prob > F        =     0.0082
                                                  R-squared       =     0.1420
                                                  Adj R-squared   =     0.0098
                                                  Within R-sq.    =     0.0104
Number of clusters (originalid) =      1,365      Root MSE        =     0.4374

                         (Std. Err. adjusted for 1,365 clusters in originalid)
------------------------------------------------------------------------------
             |               Robust
ever_forei~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lnL |  -.0152142   .0109109    -1.39   0.163    -.0366181    .0061897
    exporter |   .0638312   .0315364     2.02   0.043      .001966    .1256963
      TFP_cd |  -.0317697    .020407    -1.56   0.120    -.0718022    .0082628
       RperK |   .0535053   .0911193     0.59   0.557    -.1252439    .2322545
          DE |   .1001286   .0567383     1.76   0.078    -.0111752    .2114323
          AT |   .0612381   .0792614     0.77   0.440    -.0942492    .2167255
          CH |    .040965   .1351411     0.30   0.762     -.224142     .306072
          NL |   .1021876   .1039496     0.98   0.326    -.1017307    .3061059
          FR |   .2494149   .0787418     3.17   0.002     .0949467    .4038831
          GB |   .1622372   .0836498     1.94   0.053     -.001859    .3263334
          IT |   .0973749   .0658759     1.48   0.140    -.0318541    .2266039
          US |  -.0161045   .0849723    -0.19   0.850    -.1827951    .1505862
       _cons |   .7602037   .0444089    17.12   0.000     .6730866    .8473208
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------+
       Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------+---------------------------------------|
   teaor08_2d#year |       992           0         992     |
-----------------------------------------------------------+

. outreg2 using "`here'/output/table/selection.tex", append `options'
/Users/koren/Tresorit/projects/expat//output/table/selection.tex
dir : seeout

. 
. * selection into expat hire
. reghdfe ever_expat `explanatory' if ever_foreign & ever_foreign_hire & `sampl
> e1', a(`dummies') cluster(originalid)
(dropped 409 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      5,438
Absorbing 1 HDFE group                            F(  12,   1047) =       9.04
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2398
                                                  Adj R-squared   =     0.0933
                                                  Within R-sq.    =     0.0333
Number of clusters (originalid) =      1,048      Root MSE        =     0.4758

                         (Std. Err. adjusted for 1,048 clusters in originalid)
------------------------------------------------------------------------------
             |               Robust
  ever_expat |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lnL |  -.0172035   .0130492    -1.32   0.188     -.042809     .008402
    exporter |   .0769817   .0375475     2.05   0.041     .0033049    .1506586
      TFP_cd |   .0065809   .0292604     0.22   0.822    -.0508349    .0639967
       RperK |  -.2463455   .0944934    -2.61   0.009    -.4317635   -.0609274
          DE |   .1737681   .0850358     2.04   0.041     .0069082    .3406281
          AT |   .2039246   .0757854     2.69   0.007      .055216    .3526333
          CH |   .2694826   .1676476     1.61   0.108    -.0594809     .598446
          NL |   .1610561   .1569322     1.03   0.305    -.1468813    .4689935
          FR |     .46215   .0644736     7.17   0.000     .3356379    .5886622
          GB |   .5119691   .1220764     4.19   0.000     .2724269    .7515113
          IT |   .1214492   .1905408     0.64   0.524    -.2524361    .4953344
          US |  -.1886246   .1426628    -1.32   0.186    -.4685621     .091313
       _cons |   .5033621   .0545748     9.22   0.000     .3962737    .6104506
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------+
       Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------+---------------------------------------|
   teaor08_2d#year |       867           0         867     |
-----------------------------------------------------------+

. outreg2 using "`here'/output/table/selection.tex", append `options'
/Users/koren/Tresorit/projects/expat//output/table/selection.tex
dir : seeout

. 
. generate degree_control = ever_foreign + ever_foreign_hire + ever_expat 

. label define dc 0 "Domestic" 1 "Foreign owner" 2 "Foreign hire" 3 "Expat hire
> "

. label value degree_control dc

. 
. tabulate degree_control

degree_contro |
            l |      Freq.     Percent        Cum.
--------------+-----------------------------------
     Domestic |    154,710       89.38       89.38
Foreign owner |      3,107        1.80       91.18
 Foreign hire |      6,437        3.72       94.90
   Expat hire |      8,831        5.10      100.00
--------------+-----------------------------------
        Total |    173,085      100.00

. *oprobit degree_control `explanatory'  i.teaor08_2d#year if `sample1', vce(cl
> uster originalid)
. *outreg2 using "`here'/output/table/selection.tex", append `options'
. 
end of do-file
