
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate/tfp.do 

. here
/Users/koren/Tresorit/Mac/projects/expat/

. global here = r(here)

. use "$here/temp/analysis_sample.dta", clear

. 
. which xthdidregress
/Applications/Stata/ado/base/x/xthdidregress.ado
*! version 1.0.4  24may2023

. which eventbaseline
/Users/koren/Library/Application Support/Stata/ado/plus/e/eventbaseline.ado
*! version 0.7.2 23jan2024

. which xt2treatments
/Users/koren/Library/Application Support/Stata/ado/plus/x/xt2treatments.ado
*! version 0.6.0 28mar2024

. which estout
/Users/koren/Library/Application Support/Stata/ado/plus/e/estout.ado
*! version 3.31  26apr2022  Ben Jann

. 
. *Samples
. global local_sample "(ever_local==1 | foreign==0)"

. global expat_sample "(ever_expat==1 | foreign==0)"

. 
. tabulate foreignness ever_expat

                      |      ever_expat
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |     6,245      1,018 |     7,263 
Foreign name, Hungari |         0         38 |        38 
Foreign name, non-Wes |         0         30 |        30 
Foreign name, Western |         0      1,197 |     1,197 
----------------------+----------------------+----------
                Total |     6,245      2,283 |     8,528 

. tabulate foreignness ever_expat if time_foreign == 0

                      |      ever_expat
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |       772          0 |       772 
Foreign name, Hungari |         0          8 |         8 
Foreign name, non-Wes |         0          7 |         7 
Foreign name, Western |         0        308 |       308 
----------------------+----------------------+----------
                Total |       772        323 |     1,095 

. 
. foreach bs in atet -1 {
  2.     quietly xthdidregress ra (TFP) (local_ceo) if $local_sample, group(fra
> me_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  3.     eventbaseline, pre(4) post(4) baseline(`bs')
  4. 
.     quietly xthdidregress ra (TFP) (has_expat_ceo) if $expat_sample, group(fr
> ame_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  5.     eventbaseline, pre(4) post(4) baseline(`bs')
  6. }

Event study relative to atet             Number of obs = 6,396

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |    .030899   .0250108     1.24   0.217    -.0181212    .0799192
------------------------------------------------------------------------------

Event study relative to atet             Number of obs = 5,496

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .1155643   .0453916     2.55   0.011     .0265985    .2045302
------------------------------------------------------------------------------

Event study relative to -1               Number of obs = 6,396

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0294292   .0282914    -1.04   0.298    -.0848794     .026021
          -3 |  -.0404441   .0217858    -1.86   0.063    -.0831436    .0022554
          -2 |  -.0111387   .0160749    -0.69   0.488    -.0426449    .0203675
          -1 |          0  (omitted)
           0 |  -.0005659   .0159259    -0.04   0.972      -.03178    .0306482
           1 |   -.010335   .0211045    -0.49   0.624     -.051699     .031029
           2 |   .0234528   .0254518     0.92   0.357    -.0264318    .0733375
           3 |   .0076164   .0283637     0.27   0.788    -.0479754    .0632082
           4 |   .0330619   .0419613     0.79   0.431    -.0491808    .1153046
------------------------------------------------------------------------------

Event study relative to -1               Number of obs = 5,496

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0478556   .0348451     1.37   0.170    -.0204394    .1161507
          -3 |   .0479827   .0355515     1.35   0.177     -.021697    .1176624
          -2 |   .0673727   .0222463     3.03   0.002     .0237706    .1109747
          -1 |          0  (omitted)
           0 |   .1035027   .0344846     3.00   0.003     .0359141    .1710913
           1 |   .1617626   .0488699     3.31   0.001     .0659795    .2575458
           2 |   .2130502   .0468936     4.54   0.000     .1211403    .3049601
           3 |    .169892   .0510977     3.32   0.001     .0697423    .2700416
           4 |   .1336279    .065023     2.06   0.040     .0061851    .2610707
------------------------------------------------------------------------------

. 
end of do-file
