
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate/tfp.do 

. here
/Users/koren/Tresorit/Mac/projects/expat/

. global here = r(here)

. use "$here/temp/analysis_sample.dta", clear

. 
. which xthdidregress
/Applications/Stata/ado/base/x/xthdidregress.ado
*! version 1.0.4  24may2023

. which eventbaseline
/Users/koren/Library/Application Support/Stata/ado/plus/e/eventbaseline.ado
*! version 0.7.2 23jan2024

. which xt2treatments
/Users/koren/Library/Application Support/Stata/ado/plus/x/xt2treatments.ado
*! version 0.6.0 28mar2024

. which estout
/Users/koren/Library/Application Support/Stata/ado/plus/e/estout.ado
*! version 3.31  26apr2022  Ben Jann

. 
. *Samples
. global local_sample "(ever_local==1 | foreign==0)"

. global expat_sample "(ever_expat==1 | foreign==0)"

. 
. tabulate foreignness ever_expat

                      |      ever_expat
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |     9,376      1,295 |    10,671 
Foreign name, Hungari |         0         44 |        44 
Foreign name, non-Wes |         0         37 |        37 
Foreign name, Western |         0      1,505 |     1,505 
----------------------+----------------------+----------
                Total |     9,376      2,881 |    12,257 

. tabulate foreignness ever_expat if time_foreign == 0

                      |      ever_expat
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |     1,171          0 |     1,171 
Foreign name, Hungari |         0          9 |         9 
Foreign name, non-Wes |         0          9 |         9 
Foreign name, Western |         0        402 |       402 
----------------------+----------------------+----------
                Total |     1,171        420 |     1,591 

. 
. foreach bs in atet -1 {
  2.     quietly xthdidregress ra (TFP) (local_ceo) if $local_sample, group(fra
> me_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  3.     eventbaseline, pre(4) post(4) baseline(`bs')
  4. 
.     quietly xthdidregress ra (TFP) (has_expat_ceo) if $expat_sample, group(fr
> ame_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  5.     eventbaseline, pre(4) post(4) baseline(`bs')
  6. }

Event study relative to atet             Number of obs = 9,374

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |  -.0055629   .0239173    -0.23   0.816    -.0524399    .0413141
------------------------------------------------------------------------------

Event study relative to atet             Number of obs = 7,782

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .1277702   .0466602     2.74   0.006     .0363179    .2192226
------------------------------------------------------------------------------

Event study relative to -1               Number of obs = 9,374

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0191513   .0268667    -0.71   0.476     -.071809    .0335064
          -3 |  -.0295319   .0197253    -1.50   0.134    -.0681927     .009129
          -2 |  -.0135317   .0154739    -0.87   0.382      -.04386    .0167965
          -1 |          0  (omitted)
           0 |    -.02591   .0142249    -1.82   0.069    -.0537902    .0019702
           1 |  -.0238389     .01829    -1.30   0.192    -.0596868    .0120089
           2 |  -.0195772   .0253815    -0.77   0.441     -.069324    .0301697
           3 |  -.0227548   .0261219    -0.87   0.384    -.0739528    .0284433
           4 |  -.0135022   .0357204    -0.38   0.705    -.0835128    .0565084
------------------------------------------------------------------------------

Event study relative to -1               Number of obs = 7,782

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |    .025633   .0423531     0.61   0.545    -.0573775    .1086435
          -3 |   .0152954   .0388275     0.39   0.694    -.0608052     .091396
          -2 |   .0456945   .0285427     1.60   0.109    -.0102481    .1016371
          -1 |          0  (omitted)
           0 |   .1031997   .0350448     2.94   0.003     .0345133    .1718862
           1 |   .1484923   .0471204     3.15   0.002     .0561381    .2408466
           2 |   .1957435   .0494259     3.96   0.000     .0988705    .2926165
           3 |   .1795723   .0536977     3.34   0.001     .0743267     .284818
           4 |   .1201219   .0689088     1.74   0.081    -.0149368    .2551806
------------------------------------------------------------------------------

. 
end of do-file
