
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate/tfp.do 

. here
/Users/koren/Tresorit/Mac/projects/expat/

. global here = r(here)

. use "$here/temp/analysis_sample.dta", clear

. 
. which xthdidregress
/Applications/Stata/ado/base/x/xthdidregress.ado
*! version 1.0.4  24may2023

. which eventbaseline
/Users/koren/Library/Application Support/Stata/ado/plus/e/eventbaseline.ado
*! version 0.7.2 23jan2024

. which xt2treatments
/Users/koren/Library/Application Support/Stata/ado/plus/x/xt2treatments.ado
*! version 0.6.0 28mar2024

. which estout
/Users/koren/Library/Application Support/Stata/ado/plus/e/estout.ado
*! version 3.31  26apr2022  Ben Jann

. 
. *Samples
. global local_sample "(ever_local==1 | foreign==0)"

. global expat_sample "(ever_expat==1 | foreign==0)"

. 
. tabulate foreignness ever_expat

                      |      ever_expat
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |     9,412      1,442 |    10,854 
Foreign name, Hungari |         0         23 |        23 
Hungarian name, other |         0          1 |         1 
Foreign name, non-Wes |         0         37 |        37 
Foreign name, Western |         0      1,705 |     1,705 
----------------------+----------------------+----------
                Total |     9,412      3,208 |    12,620 

. tabulate foreignness ever_expat if time_foreign == 0

                      |      ever_expat
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |     1,175          0 |     1,175 
Foreign name, non-Wes |         0          9 |         9 
Foreign name, Western |         0        463 |       463 
----------------------+----------------------+----------
                Total |     1,175        472 |     1,647 

. 
. foreach bs in atet -1 {
  2.     quietly xthdidregress ra (TFP) (local_ceo) if $local_sample, group(fra
> me_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  3.     eventbaseline, pre(4) post(4) baseline(`bs')
  4. 
.     quietly xthdidregress ra (TFP) (has_expat_ceo) if $expat_sample, group(fr
> ame_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  5.     eventbaseline, pre(4) post(4) baseline(`bs')
  6. }

Event study relative to atet             Number of obs = 9,553

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |  -.0143263   .0241278    -0.59   0.553    -.0616159    .0329633
------------------------------------------------------------------------------

Event study relative to atet             Number of obs = 8,102

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .1511718   .0470382     3.21   0.001     .0589787    .2433649
------------------------------------------------------------------------------

Event study relative to -1               Number of obs = 9,553

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |  -.0146611   .0263097    -0.56   0.577    -.0662272    .0369049
          -3 |  -.0236903    .019379    -1.22   0.222    -.0616724    .0142917
          -2 |  -.0100412    .014776    -0.68   0.497    -.0390017    .0189193
          -1 |          0  (omitted)
           0 |  -.0262309    .014142    -1.85   0.064    -.0539488    .0014869
           1 |  -.0273152   .0183683    -1.49   0.137    -.0633164     .008686
           2 |  -.0270329   .0257003    -1.05   0.293    -.0774046    .0233389
           3 |  -.0322836   .0268243    -1.20   0.229    -.0848582     .020291
           4 |  -.0192598   .0363087    -0.53   0.596    -.0904236     .051904
------------------------------------------------------------------------------

Event study relative to -1               Number of obs = 8,102

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0114194   .0395245     0.29   0.773    -.0660473     .088886
          -3 |   .0092628   .0357226     0.26   0.795    -.0607523    .0792778
          -2 |   .0471126   .0261942     1.80   0.072    -.0042272    .0984524
          -1 |          0  (omitted)
           0 |   .1116059   .0340857     3.27   0.001     .0447991    .1784127
           1 |   .1550221   .0455851     3.40   0.001      .065677    .2443673
           2 |   .2058944   .0494112     4.17   0.000     .1090502    .3027386
           3 |   .1914269   .0542951     3.53   0.000     .0850105    .2978434
           4 |    .176653   .0722042     2.45   0.014     .0351353    .3181707
------------------------------------------------------------------------------

. 
end of do-file
