
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate/tfp.do 

. here
/Users/koren/Tresorit/Mac/projects/expat/

. global here = r(here)

. use "$here/temp/analysis_sample.dta", clear

. 
. which xthdidregress
/Applications/Stata/ado/base/x/xthdidregress.ado
*! version 1.0.4  24may2023

. which eventbaseline
/Users/koren/Library/Application Support/Stata/ado/plus/e/eventbaseline.ado
*! version 0.7.2 23jan2024

. which xt2treatments
/Users/koren/Library/Application Support/Stata/ado/plus/x/xt2treatments.ado
*! version 0.6.0 28mar2024

. which estout
/Users/koren/Library/Application Support/Stata/ado/plus/e/estout.ado
*! version 3.31  26apr2022  Ben Jann

. 
. *Samples
. global local_sample "(ever_local==1 | foreign==0)"

. global expat_sample "(ever_expat==1 | foreign==0)"

. 
. tabulate foreignness ever_expat

                      |      ever_expat
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |    10,377      1,383 |    11,760 
Foreign name, Hungari |         0         23 |        23 
Hungarian name, other |         0          1 |         1 
Foreign name, non-Wes |         0         35 |        35 
Foreign name, Western |         0      1,639 |     1,639 
----------------------+----------------------+----------
                Total |    10,377      3,081 |    13,458 

. tabulate foreignness ever_expat if time_foreign == 0

                      |      ever_expat
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |     1,436          0 |     1,436 
Foreign name, non-Wes |         0          8 |         8 
Foreign name, Western |         0        447 |       447 
----------------------+----------------------+----------
                Total |     1,436        455 |     1,891 

. 
. local outcome TFP

. 
. foreach bs in atet -1 {
  2.     quietly xthdidregress ra (`outcome') (local_ceo) if $local_sample, gro
> up(frame_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  3.     eventbaseline, pre(4) post(4) baseline(`bs')
  4. 
.     quietly xthdidregress ra (`outcome') (has_expat_ceo) if $expat_sample, gr
> oup(frame_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  5.     eventbaseline, pre(4) post(4) baseline(`bs')
  6. }

Event study relative to atet            Number of obs = 10,540

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |  -.0235555   .0312818    -0.75   0.451    -.0848668    .0377557
------------------------------------------------------------------------------

Event study relative to atet             Number of obs = 8,173

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .1667411   .0502188     3.32   0.001      .068314    .2651681
------------------------------------------------------------------------------

Event study relative to -1              Number of obs = 10,540

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0081961   .0288304     0.28   0.776    -.0483104    .0647026
          -3 |  -.0010993     .02295    -0.05   0.962    -.0460805     .043882
          -2 |  -.0036834   .0190291    -0.19   0.847    -.0409796    .0336129
          -1 |          0  (omitted)
           0 |   .0036664   .0175933     0.21   0.835    -.0308157    .0381486
           1 |  -.0165433   .0218264    -0.76   0.448    -.0593223    .0262357
           2 |  -.0034036   .0274666    -0.12   0.901    -.0572371      .05043
           3 |   -.036542   .0343035    -1.07   0.287    -.1037756    .0306916
           4 |  -.0606883   .0522046    -1.16   0.245    -.1630075    .0416309
------------------------------------------------------------------------------

Event study relative to -1               Number of obs = 8,173

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0036271   .0465714     0.08   0.938    -.0876512    .0949054
          -3 |   .0064484   .0382974     0.17   0.866    -.0686132    .0815099
          -2 |    .049971   .0276832     1.81   0.071     -.004287    .1042291
          -1 |          0  (omitted)
           0 |   .1159289   .0345847     3.35   0.001     .0481441    .1837136
           1 |   .1565802   .0469727     3.33   0.001     .0645155    .2486449
           2 |   .2091579   .0505104     4.14   0.000     .1101593    .3081564
           3 |   .2116731   .0564839     3.75   0.000     .1009666    .3223795
           4 |   .2154235   .0764001     2.82   0.005     .0656821    .3651649
------------------------------------------------------------------------------

. 
end of do-file
