
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate/tfp.do 

. here
/Users/koren/Tresorit/Mac/projects/expat/

. global here = r(here)

. use "$here/temp/analysis_sample.dta", clear

. 
. which xthdidregress
/Applications/Stata/ado/base/x/xthdidregress.ado
*! version 1.0.4  24may2023

. which eventbaseline
/Users/koren/Library/Application Support/Stata/ado/plus/e/eventbaseline.ado
*! version 0.7.2 23jan2024

. which xt2treatments
/Users/koren/Library/Application Support/Stata/ado/plus/x/xt2treatments.ado
*! version 0.6.0 28mar2024

. which estout
/Users/koren/Library/Application Support/Stata/ado/plus/e/estout.ado
*! version 3.31  26apr2022  Ben Jann

. 
. *Samples
. global local_sample "(ever_local==1 | foreign==0)"

. global expat_sample "(ever_expat==1 | foreign==0)"

. 
. tabulate foreignness ever_expat

                      |      ever_expat
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |    10,377      1,442 |    11,819 
Foreign name, Hungari |         0         23 |        23 
Hungarian name, other |         0          1 |         1 
Foreign name, non-Wes |         0         37 |        37 
Foreign name, Western |         0      1,705 |     1,705 
----------------------+----------------------+----------
                Total |    10,377      3,208 |    13,585 

. tabulate foreignness ever_expat if time_foreign == 0

                      |      ever_expat
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |     1,436          0 |     1,436 
Foreign name, non-Wes |         0          9 |         9 
Foreign name, Western |         0        463 |       463 
----------------------+----------------------+----------
                Total |     1,436        472 |     1,908 

. 
. local outcome TFP

. 
. foreach bs in atet -1 {
  2.     quietly xthdidregress ra (`outcome') (local_ceo) if $local_sample, gro
> up(frame_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  3.     eventbaseline, pre(4) post(4) baseline(`bs')
  4. 
.     quietly xthdidregress ra (`outcome') (has_expat_ceo) if $expat_sample, gr
> oup(frame_id_numeric) vce(cluster frame_id_numeric) controlgroup(notyet)
  5.     eventbaseline, pre(4) post(4) baseline(`bs')
  6. }

Event study relative to atet            Number of obs = 10,599

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |  -.0226313   .0308159    -0.73   0.463    -.0830293    .0377668
------------------------------------------------------------------------------

Event study relative to atet             Number of obs = 8,285

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .1763934   .0500367     3.53   0.000     .0783234    .2744635
------------------------------------------------------------------------------

Event study relative to -1              Number of obs = 10,599

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |   .0056645   .0285555     0.20   0.843    -.0503032    .0616323
          -3 |   -.003097   .0228331    -0.14   0.892     -.047849    .0416551
          -2 |  -.0041637    .018977    -0.22   0.826    -.0413579    .0330305
          -1 |          0  (omitted)
           0 |       .003   .0175499     0.17   0.864    -.0313972    .0373973
           1 |  -.0161113   .0218879    -0.74   0.462    -.0590108    .0267881
           2 |  -.0009903   .0272803    -0.04   0.971    -.0544588    .0524781
           3 |  -.0378946   .0338808    -1.12   0.263    -.1042997    .0285104
           4 |  -.0631552   .0507604    -1.24   0.213    -.1626438    .0363334
------------------------------------------------------------------------------

Event study relative to -1               Number of obs = 8,285

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |    .001934   .0449279     0.04   0.966    -.0861231    .0899911
          -3 |   .0052609   .0369463     0.14   0.887    -.0671525    .0776743
          -2 |   .0421529   .0269313     1.57   0.118    -.0106315    .0949372
          -1 |          0  (omitted)
           0 |   .1208095   .0345415     3.50   0.000     .0531095    .1885095
           1 |   .1672626   .0463144     3.61   0.000     .0764881    .2580372
           2 |   .2221076   .0503488     4.41   0.000     .1234258    .3207894
           3 |    .222272   .0559327     3.97   0.000     .1126459    .3318981
           4 |      .2112   .0764087     2.76   0.006     .0614418    .3609583
------------------------------------------------------------------------------

. 
end of do-file
