
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate/tfp.do 

. here
/Users/koren/Tresorit/Mac/projects/expat/

. global here = r(here)

. use "$here/temp/analysis_sample.dta", clear

. 
. which xthdidregress
/Applications/Stata/ado/base/x/xthdidregress.ado
*! version 1.0.4  24may2023

. which eventbaseline
/Users/koren/Library/Application Support/Stata/ado/plus/e/eventbaseline.ado
*! version 0.7.2 23jan2024

. which xt2treatments
/Users/koren/Library/Application Support/Stata/ado/plus/x/xt2treatments.ado
*! version 0.8.2 10may2024

. which estout
/Users/koren/Library/Application Support/Stata/ado/plus/e/estout.ado
*! version 3.31  26apr2022  Ben Jann

. 
. *Samples
. global local_sample "(ever_local==1 | foreign==0)"

. global expat_sample "(ever_expat==1 | foreign==0)"

. 
. tabulate foreignness ever_expat

                      |      ever_expat
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |    11,393      1,496 |    12,889 
Foreign name, Hungari |         0         26 |        26 
Hungarian name, other |         0          5 |         5 
Foreign name, non-Wes |         0         36 |        36 
Foreign name, Western |         0      1,770 |     1,770 
----------------------+----------------------+----------
                Total |    11,393      3,333 |    14,726 

. tabulate foreignness ever_expat if time_foreign == 0

                      |      ever_expat
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |     1,578          0 |     1,578 
Foreign name, non-Wes |         0          9 |         9 
Foreign name, Western |         0        483 |       483 
----------------------+----------------------+----------
                Total |     1,578        492 |     2,070 

. 
. local outcome TFP

. 
. foreach bs in atet -1 {
  2.     xt2treatments `outcome', treatment(has_expat_ceo) control(local_ceo) p
> re(4) post(4) baseline(`bs') weighting(optimal)
  3. }

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1984 to 2019, but with gaps
         Delta: 1 unit

Event study relative to atet            Number of obs = 14,310

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ATET |   .1370721   .0460445     2.98   0.003     .0468265    .2273177
------------------------------------------------------------------------------

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1984 to 2019, but with gaps
         Delta: 1 unit

Event study relative to -1              Number of obs = 14,310

------------------------------------------------------------------------------
         TFP |       ATET   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          -4 |    .003791   .0441978     0.09   0.932    -.0828351     .090417
          -3 |   .0073437   .0400089     0.18   0.854    -.0710723    .0857597
          -2 |   .0119676   .0313102     0.38   0.702    -.0493994    .0733345
          -1 |          0  (omitted)
           0 |   .0800284   .0371198     2.16   0.031     .0072749    .1527818
           1 |   .1222858   .0457905     2.67   0.008     .0325381    .2120336
           2 |   .1478798   .0498549     2.97   0.003     .0501659    .2455937
           3 |   .1958182    .054337     3.60   0.000     .0893196    .3023168
           4 |    .168226   .0668842     2.52   0.012     .0371354    .2993166
------------------------------------------------------------------------------

. 
end of do-file
