-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/analysis_sample.l
> og
  log type:  text
 opened on:  21 Mar 2024, 16:18:43

. 
. use "`here'/temp/balance-small-clean.dta"

. drop foreign

. 
. merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(match) noge
> n

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           339,972  
    -----------------------------------------

. 
. * many foreign changes deleted
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric (year): egen owner_spell_total = total(foreign != foreig
> n[_n-1])

. tabulate owner_spell_total

owner_spell |
     _total |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    292,239       85.96       85.96
          2 |     30,322        8.92       94.88
          3 |     12,120        3.56       98.44
          4 |      3,181        0.94       99.38
          5 |      1,549        0.46       99.83
          6 |        372        0.11       99.94
          7 |        138        0.04       99.98
          8 |         26        0.01       99.99
          9 |         25        0.01      100.00
------------+-----------------------------------
      Total |    339,972      100.00

. 
. drop if owner_spell_total > 3 
(5,291 observations deleted)

. 
. * divestment
. bys frame_id_numeric (year): gen divest = sum(owner_spell != owner_spell[_n-1
> ] & foreign == 0 & _n != 1)

. replace divest = 1 if divest > 0
(0 real changes made)

. 
. * only D, D-F F owner spells
. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (fore
> ign == 0))

. tabulate start_as_domestic

start_as_do |
     mestic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,042       16.45       16.45
          1 |    279,639       83.55      100.00
------------+-----------------------------------
      Total |    334,681      100.00

. keep if start_as_domestic
(55,042 observations deleted)

. keep if owner_spell <= 2
(3,697 observations deleted)

. drop if divest == 1
(0 observations deleted)

. 
. drop owner_spell_total divest start_as_domestic

. 
. * check foreign and expat numbers
. egen firm_tag = tag(frame_id_numeric)

. 
. count if ever_foreign
  25,173

. count if ever_foreign & firm_tag
  1,833

. count if ever_expat & firm_tag
  683

. 
. count if has_expat_ceo == 1
  4,947

. count if has_expat_ceo == 1 & foreign == 0 
  7

. count if ever_expat == 1 & ever_foreign == 0
  0

. 
. egen industry_year = group(teaor08_1d year)

. 
. *for descriptives (number of firms and firm-years in final data)
. codebook frame_id_numeric

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [10000049,74849574]           Units: 1
         Unique values: 31,009                    Missing .: 0/275,942

                  Mean: 1.4e+07
             Std. dev.: 6.8e+06

           Percentiles:     10%       25%       50%       75%       90%
                        1.0e+07   1.0e+07   1.1e+07   1.3e+07   2.5e+07

. count if firm_tag
  31,009

. count
  275,942

. 
. count if ever_foreign
  25,173

. count if ever_foreign & firm_tag
  1,833

. count if ever_expat & firm_tag
  683

. count if has_expat_ceo
  4,947

. 
. drop ever_expat ever_foreign

. egen ever_foreign = max(foreign), by(frame_id_numeric)

. * did new foreign owner hire any ceos?
. egen ever_foreign_hire = max((hire_ceo == 1) & (foreign == 1) * (owner_spell 
> == 2)), by(frame_id_numeric)

. generate foreign_hire = ever_foreign_hire & foreign

. 
. * check the patterns of expat - local transitions. 
. local ceo has_expat_ceo

. bys frame_id_numeric (year): generate ceo_foreign_spell = sum(`ceo' != `ceo'[
> _n-1])

. 
. * drop after first expat leaves
. drop if ceo_foreign_spell > 2
(2,158 observations deleted)

. drop if ceo_foreign_spell == 2 & has_expat_ceo == 0
(0 observations deleted)

. 
. keep if ever_foreign == 1
(250,769 observations deleted)

. 
. generate foreign_only = foreign & !foreign_hire

. generate local_ceo = foreign_hire & !has_expat_ceo

. egen ever_local_ceo = max(local_ceo), by(frame_id_numeric)

. 
. * drop if local hires are much later replaced by expats
. drop if ever_local_ceo & has_expat_ceo
(1,375 observations deleted)

. 
. tabulate foreign_only foreign_hire

foreign_on |     foreign_hire
        ly |         0          1 |     Total
-----------+----------------------+----------
         0 |    10,889      8,571 |    19,460 
         1 |     2,180          0 |     2,180 
-----------+----------------------+----------
     Total |    13,069      8,571 |    21,640 

. tabulate local_ceo has_expat_ceo

           |     has_expat_ceo
 local_ceo |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,051      3,041 |    16,092 
         1 |     5,548          0 |     5,548 
-----------+----------------------+----------
     Total |    18,599      3,041 |    21,640 

. 
. keep if ever_foreign_hire
(5,958 observations deleted)

. * no variation in these, drop
. drop ever_foreign ever_foreign_hire

. 
. egen first_year_foreign = min(cond(foreign==1, year, .)), by(frame_id_numeric
> ) 

. generate time_foreign = year - first_year_foreign

. 
. egen ever_expat = max(has_expat_ceo), by(frame_id_numeric)

. 
. * limit sample to event window
. keep if inrange(time_foreign, -6, 4)
(6,724 observations deleted)

. 
. egen exporter_pre = max(exporter & inrange(time_foreign, -3, -1)), by(frame_i
> d_numeric)

. * different ways of measuring export orientation
. clonevar export_entry = exporter

. replace export_entry = . if exporter_pre == 1
(5,157 real changes made, 5,157 to missing)

. 
. *Create teaor in year -1, drop agriculture
. 
. egen teaor08_1d_num = group(teaor08_1d)

. tempvar last_year_before 

. egen `last_year_before' = max(cond(time_foreign < 0, year,.)), by(frame_id_nu
> meric)
(5 missing values generated)

. drop if missing(`last_year_before')
(5 observations deleted)

. 
. egen teaor08_2d_pre = max(cond(year==`last_year_before', teaor08_2d, .)), by(
> frame_id_numeric)

. egen teaor08_1d_pre = max(cond(year==`last_year_before', teaor08_1d_num, .)),
>  by(frame_id_numeric)

. assert !missing(teaor08_2d_pre)

. drop `last_year_before'

. 
. * compute TFP
. 
. quietly regress lnQ lnK lnL lnM i.teaor08_2d##year if industrial==1

. predict TFP if e(sample), resid
(4,816 missing values generated)

. 
. quietly regress lnQ lnK lnL lnM i.teaor08_2d##year if industrial==0

. predict TFP_temp if e(sample), resid
(4,137 missing values generated)

. 
. replace TFP = TFP_temp if missing(TFP)
(4,816 real changes made)

. drop TFP_temp

. 
. compress
  variable year was float now int
  variable minyear was float now int
  variable maxyear was float now int
  variable industrial was float now byte
  variable exporter_5 was float now byte
  variable age was float now byte
  variable owner_spell was float now byte
  variable industry_year was float now int
  variable foreign_hire was float now byte
  variable ceo_foreign_spell was float now byte
  variable foreign_only was float now byte
  variable local_ceo was float now byte
  variable ever_local_ceo was float now byte
  variable first_year_foreign was float now int
  variable time_foreign was float now byte
  variable ever_expat was float now byte
  variable exporter_pre was float now byte
  variable teaor08_1d_num was float now byte
  variable teaor08_2d_pre was float now byte
  variable teaor08_1d_pre was float now byte
  variable originalid was double now long
  variable sales was double now long
  variable tanass was double now long
  variable jetok was double now long
  variable export was double now long
  variable ranyag was double now long
  variable immat was double now long
  variable final_netgep was double now long
  variable tanass_18 was double now long
  (814,723 bytes saved)

. save "`here'/temp/analysis_sample.dta", replace
file /Users/koren/Tresorit/Mac/projects/expat//temp/analysis_sample.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/analysis_sample.l
> og
  log type:  text
 closed on:  21 Mar 2024, 16:19:05
-------------------------------------------------------------------------------
