-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//o
> utput/analysis_sample.log
  log type:  text
 opened on:  15 May 2021, 10:18:58

. 
. use "`here'/temp/balance-small-clean.dta"

. drop foreign

. 
. sort frame_id_numeric year

. gen x_before = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1
> ]
(25,486 missing values generated)

. gen hole2_before = (x_before > 2 & x_before != .)

. gen hole1_before = (x_before > 1 & x_before != .)

. 
. merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(match) noge
> n

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           299,131  
    -----------------------------------------

. *merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(1 3) //nog
> en
. *merge 1:1 frame_id year using "`here'/temp/firm_events.dta"
. 
. sort frame_id_numeric year

. gen x_after = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(24,134 missing values generated)

. gen hole2_after = (x_after > 2 & x_after != .)

. gen hole1_after = (x_after > 1 & x_after != .)

. 
. foreach var of varlist hole* {
  2.         tab `var'
  3.         *tab `var' _merge
. }

hole2_befor |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    297,954       99.61       99.61
          1 |      1,177        0.39      100.00
------------+-----------------------------------
      Total |    299,131      100.00

hole1_befor |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    295,217       98.69       98.69
          1 |      3,914        1.31      100.00
------------+-----------------------------------
      Total |    299,131      100.00

hole2_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    297,843       99.57       99.57
          1 |      1,288        0.43      100.00
------------+-----------------------------------
      Total |    299,131      100.00

hole1_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    295,143       98.67       98.67
          1 |      3,988        1.33      100.00
------------+-----------------------------------
      Total |    299,131      100.00

. 
. *tab _merge
. 
. drop x_after x_before hole*

. 
. * not so elegant
. merge m:1 frame_id_numeric year using "`here'/temp/ever_foreign.dta", keepusi
> ng(ever_foreign) keep(1 3) gen(filter)

    Result                           # of obs.
    -----------------------------------------
    not matched                       276,106
        from master                   276,106  (filter==1)
        from using                          0  (filter==2)

    matched                            23,025  (filter==3)
    -----------------------------------------

. drop ever_foreign

. 
. rename foreign_ceo foreign

. rename ever_foreign_ceo ever_foreign

. drop foreign_nceo ever_foreign_nceo

. 
. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 fore
> ign3 count, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1
---------+------------------------------------------------------------
     sum |     30036      1161      1354      1635      2058      2790
----------------------------------------------------------------------

   stats |  foreign2  foreign3     count
---------+------------------------------
     sum |      2692      2509    299131
----------------------------------------

. mat total = r(StatTotal)

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 fore
> ign3 count if filter == 3, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1
---------+------------------------------------------------------------
     sum |     10701       971      1122      1361      1454      1274
----------------------------------------------------------------------

   stats |  foreign2  foreign3     count
---------+------------------------------
     sum |      1149      1038     23025
----------------------------------------

. mat total = (total \ r(StatTotal))

. 
. *nceo overriden to have zeros
. mvencode *_nceo, mv(0) override
n_found~nceo: 271214 missing values recoded
n_insid~nceo: 271214 missing values recoded
n_outsi~nceo: 271214 missing values recoded
n_expat_nceo: 271214 missing values recoded
n_local_nceo: 271214 missing values recoded
ever_ex~nceo: 271214 missing values recoded
      n_nceo: 271214 missing values recoded
   hire_nceo: 271214 missing values recoded
   fire_nceo: 271214 missing values recoded
hire_ex~nceo: 271214 missing values recoded
fire_ex~nceo: 271214 missing values recoded
ceo_spe~nceo: 271214 missing values recoded
has_exp~nceo: 271214 missing values recoded
has_loc~nceo: 271214 missing values recoded
has_fou~nceo: 271214 missing values recoded
has_ins~nceo: 271214 missing values recoded
has_out~nceo: 271214 missing values recoded

. 
. * many foreign changes deleted
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric (year): egen owner_spell_total = total(foreign != foreig
> n[_n-1])

. 
. drop if owner_spell_total > 3 // FIXME: doublecheck the length of spells
(3,654 observations deleted)

. scalar dropped_too_many_foreign_change = r(N_drop)

. display dropped_too_many_foreign_change
3654

. 
. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 fore
> ign3 count, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1
---------+------------------------------------------------------------
     sum |     28104      1081      1255      1507      1904      2615
----------------------------------------------------------------------

   stats |  foreign2  foreign3     count
---------+------------------------------
     sum |      2517      2338    295477
----------------------------------------

. mat total = (total \ r(StatTotal))

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 fore
> ign3 count if filter == 3, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1
---------+------------------------------------------------------------
     sum |     10679       967      1118      1357      1451      1272
----------------------------------------------------------------------

   stats |  foreign2  foreign3     count
---------+------------------------------
     sum |      1147      1036     22979
----------------------------------------

. mat total = (total \ r(StatTotal))

. 
. * divestiture
. bys frame_id_numeric (year): gen divest = sum(cond(owner_spell != owner_spell
> [_n-1] & foreign == 0 & _n != 1, 1, 0))

. replace divest = 1 if divest > 0
(0 real changes made)

. 
. * only keep D, D-F owner spells
. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (fore
> ign == 0))

. *keep if start_as_domestic & owner_spell <= 2
. keep if start_as_domestic
(18,436 observations deleted)

. keep if owner_spell <= 2
(3,257 observations deleted)

. 
. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 fore
> ign3 count, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1
---------+------------------------------------------------------------
     sum |     11559      1081      1232      1457      1517      1325
----------------------------------------------------------------------

   stats |  foreign2  foreign3     count
---------+------------------------------
     sum |      1090       919    273784
----------------------------------------

. mat total = (total \ r(StatTotal))

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 fore
> ign3 count if filter == 3, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1
---------+------------------------------------------------------------
     sum |     10679       967      1118      1357      1451      1262
----------------------------------------------------------------------

   stats |  foreign2  foreign3     count
---------+------------------------------
     sum |      1030       858     19868
----------------------------------------

. mat total = (total \ r(StatTotal))

. 
. mat list total

total[6,9]
       foreign  foreign_3  foreign_2  foreign_1   foreign0   foreign1
sum      30036       1161       1354       1635       2058       2790
sum      10701        971       1122       1361       1454       1274
sum      28104       1081       1255       1507       1904       2615
sum      10679        967       1118       1357       1451       1272
sum      11559       1081       1232       1457       1517       1325
sum      10679        967       1118       1357       1451       1262

      foreign2   foreign3      count
sum       2692       2509     299131
sum       1149       1038      23025
sum       2517       2338     295477
sum       1147       1036      22979
sum       1090        919     273784
sum       1030        858      19868

. 
. * check foreign end expat numbers
. egen firm_tag = tag(frame_id_numeric)

. count if ever_foreign & firm_tag
  1,537

. count if ever_expat_ceo & firm_tag
  543

. count if ever_expat_nceo & firm_tag
  8

. 
. count if has_expat_nceo == 1
  296

. count if has_expat_nceo == 1 & foreign == 0
  9

. count if has_expat_ceo == 1
  3,870

. count if has_expat_ceo == 1 & foreign == 0 // FIXME - should be 0
  0

. count if ever_expat_nceo == 1 & ever_foreign == 0
  1

. count if ever_expat_ceo == 1 & ever_foreign == 0
  0

. 
. *do "`here'/code/create/event_dummies_firmlevel.do"
. 
. *merge 1:1 originalid year using "input/fo3-owner-names/country_codes.dta", k
> eep(match master) nogen
. * "same country" only applies to expats at foreign firms
. *replace country_same = 0 if (has_expat == 0) | (foreign == 0)
. 
. egen industry_year = group(teaor08_1d year)

. *egen last_before_acquisition = max(cond(time_foreign<0, time_foreign, .)), b
> y(originalid)
. *egen ever_same_country = max(country_same), by(originalid)
. 
. *do "`here'/code/create/countries.do"
. 
. *for descriptives (number of firms and firm-years in final data)
. codebook frame_id_numeric

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [10000049,90620052]          units:  1
         unique values:  22,465                   missing .:  0/273,784

                  mean:   1.3e+07
              std. dev:   6.5e+06

           percentiles:        10%       25%       50%       75%       90%
                           1.0e+07   1.0e+07   1.1e+07   1.2e+07   2.2e+07

. count if firm_tag
  22,465

. count
  273,784

. 
. mata : mat_total_analysis = st_matrix("total")

. mata: mata matsave "temp/matrix-analysis" mat_total_analysis, replace
(saving mat_total_analysis[6,9])
file temp/matrix-analysis.mmat saved

. 
. drop first_year_foreign time_foreign foreign_* foreign? count

. 
. bys frame_id_numeric: egen first_year_foreign_new = min(cond(foreign == 1, ye
> ar,.))
(252,722 missing values generated)

. generate time_foreign_new = year - first_year_foreign_new
(252,722 missing values generated)

. gen foreign0_new = (time_foreign_new == 0)

. count if foreign0_new == 1
  1,537

. drop *new

. 
. compress
  variable minyear was float now int
  variable maxyear was float now int
  variable exporter_5 was float now byte
  variable age was float now int
  variable owner_spell was float now byte
  variable owner_spell_total was float now byte
  variable divest was float now byte
  variable start_as_domestic was float now byte
  variable industry_year was float now int
  variable jetok was double now long
  variable export was double now long
  variable immat was double now long
  variable final_netgep was double now long
  variable ranyag8091_18 was double now long
  variable country_all_ceo was str12 now str9
  (12,594,064 bytes saved)

. save "`here'/temp/analysis_sample.dta", replace
file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//temp/anal
> ysis_sample.dta saved

. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//o
> utput/analysis_sample.log
  log type:  text
 closed on:  15 May 2021, 10:19:04
-------------------------------------------------------------------------------
