-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Documents/workspace/expat//output/analysis_sample.log
  log type:  text
 opened on:   6 May 2022, 17:53:32

. 
. use "`here'/temp/balance-small-clean.dta"

. drop foreign

. 
. sort frame_id_numeric year

. gen x_before = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1
> ]
(27,711 missing values generated)

. gen hole10_before = (x_before > 10 & x_before != .)

. gen hole2_before = (x_before > 2 & x_before != .)

. gen hole1_before = (x_before > 1 & x_before != .)

. 
. foreach var of varlist hole* {
  2.         tab `var'
  3. }

hole10_befo |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    367,194       99.99       99.99
          1 |         32        0.01      100.00
------------+-----------------------------------
      Total |    367,226      100.00

hole2_befor |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    366,061       99.68       99.68
          1 |      1,165        0.32      100.00
------------+-----------------------------------
      Total |    367,226      100.00

hole1_befor |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    362,994       98.85       98.85
          1 |      4,232        1.15      100.00
------------+-----------------------------------
      Total |    367,226      100.00

. 
. drop x_before hole*

. 
. merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(match) noge
> n

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           308,124  
    -----------------------------------------

. *merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(1 3) //nog
> en
. *merge 1:1 frame_id year using "`here'/temp/firm_events.dta"
. 
. sort frame_id_numeric year

. gen x_after = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(25,520 missing values generated)

. gen hole10_after_m = (x_after > 10 & x_after != .)

. gen hole2_after_m = (x_after > 2 & x_after != .)

. gen hole1_after_m = (x_after > 1 & x_after != .)

. 
. foreach var of varlist hole* {
  2.         tab `var'
  3. }

hole10_afte |
        r_m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    308,080       99.99       99.99
          1 |         44        0.01      100.00
------------+-----------------------------------
      Total |    308,124      100.00

hole2_after |
         _m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    306,963       99.62       99.62
          1 |      1,161        0.38      100.00
------------+-----------------------------------
      Total |    308,124      100.00

hole1_after |
         _m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    304,344       98.77       98.77
          1 |      3,780        1.23      100.00
------------+-----------------------------------
      Total |    308,124      100.00

. 
. *tab _merge
. 
. drop x_after hole*

. 
. preserve

. use "`here'/temp/balance-small-clean.dta", clear

.         drop foreign

.         merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(1 3
> )

    Result                      Number of obs
    -----------------------------------------
    Not matched                        59,102
        from master                    59,102  (_merge==1)
        from using                          0  (_merge==2)

    Matched                           308,124  (_merge==3)
    -----------------------------------------

.         sort frame_id_numeric year

.         gen x_after = year - year[_n-1] if frame_id_numeric == frame_id_numer
> ic[_n-1]
(27,711 missing values generated)

.         gen hole10_after_mm = (x_after > 10 & x_after != .)

.         gen hole2_after_mm = (x_after > 2 & x_after != .)

.         gen hole1_after_mm = (x_after > 1 & x_after != .)

. 
.         foreach var of varlist hole* {
  2.                 tab `var'
  3.         }

hole10_afte |
       r_mm |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    367,194       99.99       99.99
          1 |         32        0.01      100.00
------------+-----------------------------------
      Total |    367,226      100.00

hole2_after |
        _mm |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    366,061       99.68       99.68
          1 |      1,165        0.32      100.00
------------+-----------------------------------
      Total |    367,226      100.00

hole1_after |
        _mm |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    362,994       98.85       98.85
          1 |      4,232        1.15      100.00
------------+-----------------------------------
      Total |    367,226      100.00

.         drop x_after hole*

. restore

. 
. preserve

.         use "`here'/temp/balance-small-clean.dta", clear

.         merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(2 3
> )

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,046
        from master                         0  (_merge==1)
        from using                      2,046  (_merge==2)

    Matched                           308,124  (_merge==3)
    -----------------------------------------

.         sort frame_id_numeric year

.         gen x_after = year - year[_n-1] if frame_id_numeric == frame_id_numer
> ic[_n-1]
(25,520 missing values generated)

.         gen hole10_after_um = (x_after > 10 & x_after != .)

.         gen hole2_after_um = (x_after > 2 & x_after != .)

.         gen hole1_after_um = (x_after > 1 & x_after != .)

. 
.         foreach var of varlist hole* {
  2.                 tab `var'
  3.         }

hole10_afte |
       r_um |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    310,126       99.99       99.99
          1 |         44        0.01      100.00
------------+-----------------------------------
      Total |    310,170      100.00

hole2_after |
        _um |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    309,009       99.63       99.63
          1 |      1,161        0.37      100.00
------------+-----------------------------------
      Total |    310,170      100.00

hole1_after |
        _um |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    308,436       99.44       99.44
          1 |      1,734        0.56      100.00
------------+-----------------------------------
      Total |    310,170      100.00

.         drop x_after hole*

. restore

. 
. rename foreign_ceo foreign

. rename ever_foreign_ceo ever_foreign

. drop foreign_nceo ever_foreign_nceo

. 
. *nceo overriden to have zeros
. mvencode *_nceo, mv(0) override
n_found~nceo: 279801 missing values recoded
n_insid~nceo: 279801 missing values recoded
n_outsi~nceo: 279801 missing values recoded
n_expat_nceo: 279801 missing values recoded
n_local_nceo: 279801 missing values recoded
ever_ex~nceo: 279801 missing values recoded
      n_nceo: 279801 missing values recoded
   hire_nceo: 279801 missing values recoded
   fire_nceo: 279801 missing values recoded
hire_ex~nceo: 279801 missing values recoded
fire_ex~nceo: 279801 missing values recoded
ceo_spe~nceo: 279801 missing values recoded
has_exp~nceo: 279801 missing values recoded
has_loc~nceo: 279801 missing values recoded
has_fou~nceo: 279801 missing values recoded
has_ins~nceo: 279801 missing values recoded
has_out~nceo: 279801 missing values recoded

. 
. * many foreign changes deleted
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric (year): egen owner_spell_total = total(foreign != foreig
> n[_n-1])

. 
. drop if owner_spell_total > 3 // FIXME: doublecheck the length of spells
(2,532 observations deleted)

. scalar dropped_too_many_foreign_change = r(N_drop)

. display dropped_too_many_foreign_change
2532

. 
. * divestiture
. bys frame_id_numeric (year): gen divest = sum(cond(owner_spell != owner_spell
> [_n-1] & foreign == 0 & _n != 1, 1, 0))

. replace divest = 1 if divest > 0
(0 real changes made)

. 
. * only keep D, D-F owner spells
. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (fore
> ign == 0))

. *keep if start_as_domestic & owner_spell <= 2
. keep if start_as_domestic
(18,356 observations deleted)

. keep if owner_spell <= 2
(2,681 observations deleted)

. 
. * check foreign end expat numbers
. egen firm_tag = tag(frame_id_numeric)

. 
. count if ever_foreign
  16,151

. count if ever_foreign & firm_tag
  1,127

. count if ever_expat_ceo & firm_tag
  500

. count if ever_expat_nceo & firm_tag
  13

. 
. count if has_expat_nceo == 1
  312

. count if has_expat_nceo == 1 & foreign == 0
  13

. count if has_expat_ceo == 1
  3,846

. count if has_expat_ceo == 1 & foreign == 0 // FIXME - should be 0
  0

. count if ever_expat_nceo == 1 & ever_foreign == 0
  11

. count if ever_expat_ceo == 1 & ever_foreign == 0
  0

. 
. *do "`here'/code/create/event_dummies_firmlevel.do"
. 
. *merge 1:1 originalid year using "input/fo3-owner-names/country_codes.dta", k
> eep(match master) nogen
. * "same country" only applies to expats at foreign firms
. *replace country_same = 0 if (has_expat == 0) | (foreign == 0)
. 
. egen industry_year = group(teaor08_1d year)

. *egen last_before_acquisition = max(cond(time_foreign<0, time_foreign, .)), b
> y(originalid)
. *egen ever_same_country = max(country_same), by(originalid)
. 
. *do "`here'/code/create/countries.do"
. 
. *for descriptives (number of firms and firm-years in final data)
. codebook frame_id_numeric

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [10000049,74849574]           Units: 1
         Unique values: 23,961                    Missing .: 0/284,555

                  Mean: 1.3e+07
             Std. dev.: 6.3e+06

           Percentiles:     10%       25%       50%       75%       90%
                        1.0e+07   1.0e+07   1.1e+07   1.2e+07   2.1e+07

. count if firm_tag
  23,961

. count
  284,555

. 
. drop first_year_foreign time_foreign foreign_* foreign? count

. 
. bys frame_id_numeric: egen first_year_foreign_new = min(cond(foreign == 1, ye
> ar,.))
(268,404 missing values generated)

. generate time_foreign_new = year - first_year_foreign_new
(268,404 missing values generated)

. gen foreign0_new = (time_foreign_new == 0)

. count if foreign0_new == 1
  1,127

. drop *new

. 
. do "`here'/code/create/event_dummies_firmlevel"

. *cd C:\Users\Almos\Documents\Research\Expat\Expat_git\expat-analysis
. *clear all
. *here
. *local here = r(here)
. 
. *use "`here'/temp/analysis_sample.dta", clear
. 
. tsset frame_id_numeric year

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1985 to 2018, but with gaps
         Delta: 1 unit

. 
. *******Check number of ceos******************
. bys frame_id_numeric: egen max_n_ceo = max(n_ceo)

. bys frame_id_numeric: egen min_n_ceo = min(n_ceo)

. gen diff = max_n_ceo-min_n_ceo

. 
. reghdfe n_ceo foreign has_expat_ceo lnL, a(teaor08_2d##year) cluster(frame_id
> _numeric)
(dropped 101 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    284,454
Absorbing 1 HDFE group                            F(   3,  23960) =      74.24
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0632
                                                  Adj R-squared   =     0.0554
                                                  Within R-sq.    =     0.0079
Number of clusters (frame_id_numeric) =     23,961Root MSE        =     0.6973

                  (Std. err. adjusted for 23,961 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
       n_ceo | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     foreign |  -.1409323   .0208558    -6.76   0.000     -.181811   -.1000536
has_exp~_ceo |   .6470509   .0437989    14.77   0.000     .5612023    .7328994
         lnL |   .0049246   .0031145     1.58   0.114    -.0011801    .0110292
       _cons |   1.352618   .0120818   111.96   0.000     1.328937    1.376299
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------+
       Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------+---------------------------------------|
   teaor08_2d#year |      2351           0        2351     |
-----------------------------------------------------------+

. 
. ******Event-time variable foreign**************
. sort frame_id_numeric year

. tempvar t_year

. gen `t_year' = year if foreign==1 & foreign[_n-1]==0 
(283,428 missing values generated)

. bys frame_id_numeric: egen first_year_foreign=max(`t_year')
(268,404 missing values generated)

. gen time_foreign = year-first_year_foreign
(268,404 missing values generated)

. replace time_foreign=. if foreign==0 & time_foreign>0
(0 real changes made)

. 
. forval i=0/5 {
  2.         
.         gen foreign_e`i'=(time_foreign==-`i')
  3.         gen foreigne`i'=(time_foreign==`i')
  4. 
.         }

. 
. replace foreigne5=1 if time_foreign>5 & time_foreign<.
(4,649 real changes made)

. drop foreign_e0

. 
. order foreign_e5 foreign_e4 foreign_e3 foreign_e2 foreign_e1 foreigne0 foreig
> ne1 foreigne2 foreigne3 foreigne4 foreigne5, a(time_foreign) 

. 
. **Recompute spell using only hires
. bys frame_id_numeric: egen first_year_firm = min(year)

. tempvar t_hire

. gen `t_hire'=hire_ceo

. replace `t_hire' = 1 if first_year_firm==year 
(23,961 real changes made)

. bys frame_id_numeric: gen ceo_spell_hire=sum(`t_hire')

. 
. 
. ******Foreign-hired ceo***********
. tempvar t_ceo

. bys frame_id_numeric: egen `t_ceo'= max(ceo_spell_hire) if !foreign
(9,462 missing values generated)

. bys frame_id_numeric: egen last_ceo_spell_do = max(`t_ceo')

. gen foreign_hire = (ceo_spell_hire > last_ceo_spell_do)

. replace foreign_hire = . if last_ceo_spell_do == .
(0 real changes made)

. 
. bys frame_id_numeric: egen ever_foreign_hire = max(foreign_hire)

. 
. 
. **********Insider vs. outsider local CEO***************
. tempvar fh_ins

. gen `fh_ins'=(foreign_hire==1 & has_insider_ceo==1 & hire_ceo==1)

. bysort frame_id_numeric ceo_spell_hire: egen foreign_hire_insider=max(`fh_ins
> ') 

. 
. 
. *****expat alone
. gen expat_alone = (has_expat_ceo & !has_local_ceo)

. 
. *******First, second etc ceos************
. 
. gen ceo_spell_foreign = ceo_spell_hire - last_ceo_spell_do

. replace ceo_spell_foreign = 0 if ceo_spell_foreign<0
(122,732 real changes made)

. 
. tempvar t_expat

. bys frame_id_numeric ceo_spell_foreign: egen `t_expat' = max(hire_expat_ceo)

. 
. forval i=1/11 {
  2.         gen foreign_hire_local_`i' = (ceo_spell_foreign == `i' & `t_expat'
> ==0)
  3.         gen foreign_hire_expat_`i' = (ceo_spell_foreign == `i' & `t_expat'
> ==1)  
  4.         }

. 
. gen foreign_hire_local_3plus = (ceo_spell_foreign > 2 & `t_expat'==0)

. gen foreign_hire_expat_3plus = (ceo_spell_foreign > 2 & `t_expat'==1)

. 
. 
. **********Sequence of hires*********
. tempvar t_LL 

. tempvar t_LE

. tempvar t_EL

. tempvar t_EE

. 
. tsset frame_id_numeric year

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1985 to 2018, but with gaps
         Delta: 1 unit

. gen `t_LL' = (foreign_hire_local_2==1 & l.foreign_hire_local_1==1)

. bys frame_id_numeric foreign_hire_local_2: egen foreign_hire_LL_2 = max(`t_LL
> ') 

. tsset frame_id_numeric year

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1985 to 2018, but with gaps
         Delta: 1 unit

. gen `t_LE' = (foreign_hire_expat_2==1 & l.foreign_hire_local_1==1)

. bys frame_id_numeric foreign_hire_expat_2: egen foreign_hire_LE_2 = max(`t_LE
> ') 

. tsset frame_id_numeric year

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1985 to 2018, but with gaps
         Delta: 1 unit

. gen `t_EL' = (foreign_hire_local_2==1 & l.foreign_hire_expat_1==1)

. bys frame_id_numeric foreign_hire_local_2: egen foreign_hire_EL_2 = max(`t_EL
> ')

. tsset frame_id_numeric year

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1985 to 2018, but with gaps
         Delta: 1 unit

. gen `t_EE' = (foreign_hire_expat_2==1 & l.foreign_hire_expat_1==1)

. bys frame_id_numeric foreign_hire_expat_2: egen foreign_hire_EE_2 = max(`t_EE
> ')

. 
. 
. ***********Event time dummies for foreign_hire, expat************
. sort frame_id_numeric year

. foreach mantype in hire_local hire_expat `X' {
  2.         
.         tempvar t_year
  3.         tempvar t_year_max
  4.         gen `t_year' = year if foreign_`mantype'_1==1 & foreign_`mantype'_
> 1[_n-1]==0 
  5.         bys frame_id_numeric: egen `t_year_max'=max(`t_year')
  6.         gen time_foreign_`mantype' = year-`t_year_max'
  7.         *Make the variable 0 when the manager leaves
.         replace time_foreign_`mantype'=. if foreign_`mantype'_1==0 & time_for
> eign_`mantype'>0
  8. 
. 
. forval i=0/5 {
  9.         
.         gen foreign_`mantype'_1_e`i'=(time_foreign_`mantype'==-`i')
 10.         gen foreign_`mantype'_1e`i'=(time_foreign_`mantype'==`i')
 11. 
.         }
 12. 
. replace foreign_`mantype'_1e5=1 if time_foreign_`mantype'>5 & time_foreign_`m
> antype'<.
 13. drop foreign_`mantype'_1_e0
 14. }
(284,197 missing values generated)
(279,279 missing values generated)
(279,279 missing values generated)
(1,157 real changes made, 1,157 to missing)
(226 real changes made)
(284,127 missing values generated)
(277,291 missing values generated)
(277,291 missing values generated)
(2,919 real changes made, 2,919 to missing)
(273 real changes made)

. 
. order foreign_hire_local_1_e5 foreign_hire_local_1_e4 foreign_hire_local_1_e3
>  foreign_hire_local_1_e2 foreign_hire_local_1_e1 foreign_hire_local_1e0 forei
> gn_hire_local_1e1 foreign_hire_local_1e2 foreign_hire_local_1e3 foreign_hire_
> local_1e4 foreign_hire_local_1e5 foreign_hire_expat_1_e5 foreign_hire_expat_1
> _e4 foreign_hire_expat_1_e3 foreign_hire_expat_1_e2 foreign_hire_expat_1_e1 f
> oreign_hire_expat_1e0 foreign_hire_expat_1e1 foreign_hire_expat_1e2 foreign_h
> ire_expat_1e3 foreign_hire_expat_1e4 foreign_hire_expat_1e5, a(time_foreign_h
> ire_expat)

. 
. *save, replace
. 
end of do-file

. 
. count
  284,555

. count if ever_foreign
  16,151

. count if ever_foreign & firm_tag
  1,127

. count if ever_expat_ceo & firm_tag
  500

. count if has_expat_ceo
  3,846

. 
. drop if time_foreign > 5 //& time_foreign != .
(273,053 observations deleted)

. drop ever_expat* ever_foreign_hire

. 
. by frame_id_numeric: egen ever_expat = max(has_expat_ceo)

. by frame_id_numeric: egen ever_foreign_hire = max(foreign_hire)

. 
. count
  11,502

. count if ever_foreign
  11,502

. count if ever_foreign & firm_tag
  1,127

. count if ever_expat & firm_tag
  424

. count if has_expat_ceo
  1,674

. 
. replace foreign_hire = 1 if ever_foreign_hire == 1 & foreign == 1
(515 real changes made)

. replace has_expat_ceo = 1 if ever_expat == 1 & foreign == 1
(389 real changes made)

. 
. gen foreign_only = foreign & !foreign_hire

. gen foreign_hire_only = foreign_hire & !has_expat_ceo

. 
. tab foreign_only foreign_hire

foreign_on |     foreign_hire
        ly |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,689      3,297 |     9,986 
         1 |     1,516          0 |     1,516 
-----------+----------------------+----------
     Total |     8,205      3,297 |    11,502 

. tab foreign_hire_only has_expat_ceo

foreign_hi |     has_expat_ceo
   re_only |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,205      2,063 |    10,268 
         1 |     1,234          0 |     1,234 
-----------+----------------------+----------
     Total |     9,439      2,063 |    11,502 

. 
. drop foreign_e5 foreign_e4 foreign_e3 foreign_e2 foreign_e1 foreigne0 foreign
> e1 foreigne2 foreigne3 foreigne4 foreigne5 foreign_hire_local_1 foreign_hire_
> expat_1 foreign_hire_local_2 foreign_hire_expat_2 foreign_hire_local_3 foreig
> n_hire_expat_3 foreign_hire_local_4 foreign_hire_expat_4 foreign_hire_local_5
>  foreign_hire_expat_5 foreign_hire_local_6 foreign_hire_expat_6 foreign_hire_
> local_7 foreign_hire_expat_7 foreign_hire_local_8 foreign_hire_expat_8 foreig
> n_hire_local_9 foreign_hire_expat_9 foreign_hire_local_10 foreign_hire_expat_
> 10 foreign_hire_local_11 foreign_hire_expat_11 foreign_hire_local_3plus forei
> gn_hire_expat_3plus foreign_hire_LL_2 foreign_hire_LE_2 foreign_hire_EL_2 for
> eign_hire_EE_2 foreign_hire_local_1_e5 foreign_hire_local_1_e4 foreign_hire_l
> ocal_1_e3 foreign_hire_local_1_e2 foreign_hire_local_1_e1 foreign_hire_local_
> 1e0 foreign_hire_local_1e1 foreign_hire_local_1e2 foreign_hire_local_1e3 fore
> ign_hire_local_1e4 foreign_hire_local_1e5 foreign_hire_expat_1_e5 foreign_hir
> e_expat_1_e4 foreign_hire_expat_1_e3 foreign_hire_expat_1_e2 foreign_hire_exp
> at_1_e1 foreign_hire_expat_1e0 foreign_hire_expat_1e1 foreign_hire_expat_1e2 
> foreign_hire_expat_1e3 foreign_hire_expat_1e4 foreign_hire_expat_1e5

. 
. compress
  variable year was float now int
  variable minyear was float now int
  variable maxyear was float now int
  variable exporter_5 was float now byte
  variable age was float now byte
  variable owner_spell was float now byte
  variable owner_spell_total was float now byte
  variable divest was float now byte
  variable start_as_domestic was float now byte
  variable industry_year was float now int
  variable max_n_ceo was float now byte
  variable min_n_ceo was float now byte
  variable diff was float now byte
  variable first_year_foreign was float now int
  variable time_foreign was float now byte
  variable first_year_firm was float now int
  variable ceo_spell_hire was float now byte
  variable last_ceo_spell_do was float now byte
  variable foreign_hire was float now byte
  variable foreign_hire_insider was float now byte
  variable expat_alone was float now byte
  variable ceo_spell_foreign was float now byte
  variable time_foreign_hire_local was float now byte
  variable time_foreign_hire_expat was float now byte
  variable ever_expat was float now byte
  variable ever_foreign_hire was float now byte
  variable foreign_only was float now byte
  variable foreign_hire_only was float now byte
  variable originalid was double now long
  variable sales was double now long
  variable tanass was double now long
  variable jetok was double now long
  variable export was double now long
  variable ranyag was double now long
  variable immat was double now long
  variable final_netgep was double now long
  variable country_all_ceo was str12 now str9
  (1,299,726 bytes saved)

. save "`here'/temp/analysis_sample.dta", replace
file /Users/koren/Documents/workspace/expat//temp/analysis_sample.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Documents/workspace/expat//output/analysis_sample.log
  log type:  text
 closed on:   6 May 2022, 17:53:43
-------------------------------------------------------------------------------
