-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/expat/miklos//output/analysis_sample.log
  log type:  text
 opened on:   1 Mar 2024, 15:20:07

. 
. use "`here'/temp/balance-small-clean.dta"

. drop foreign

. 
. merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(match) noge
> n

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           342,420  
    -----------------------------------------

. 
. * many foreign changes deleted
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric (year): egen owner_spell_total = total(foreign != foreig
> n[_n-1])

. tabulate owner_spell_total

owner_spell |
     _total |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    306,313       89.46       89.46
          2 |     21,291        6.22       95.67
          3 |     11,006        3.21       98.89
          4 |      2,217        0.65       99.53
          5 |      1,214        0.35       99.89
          6 |        222        0.06       99.95
          7 |        131        0.04       99.99
          8 |         26        0.01      100.00
------------+-----------------------------------
      Total |    342,420      100.00

. 
. drop if owner_spell_total > 3 
(3,810 observations deleted)

. 
. * divestment
. bys frame_id_numeric (year): gen divest = sum(owner_spell != owner_spell[_n-1
> ] & foreign == 0 & _n != 1)

. replace divest = 1 if divest > 0
(0 real changes made)

. 
. * only D, D-F F owner spells
. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (fore
> ign == 0))

. tabulate start_as_domestic

start_as_do |
     mestic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,747        5.24        5.24
          1 |    320,863       94.76      100.00
------------+-----------------------------------
      Total |    338,610      100.00

. keep if start_as_domestic
(17,747 observations deleted)

. keep if owner_spell <= 2
(3,705 observations deleted)

. drop if divest == 1
(0 observations deleted)

. 
. drop owner_spell_total divest start_as_domestic

. 
. * check foreign and expat numbers
. egen firm_tag = tag(frame_id_numeric)

. 
. count if ever_foreign
  24,499

. count if ever_foreign & firm_tag
  1,734

. count if ever_expat & firm_tag
  694

. 
. count if has_expat_ceo == 1
  5,221

. count if has_expat_ceo == 1 & foreign == 0 
  0

. count if ever_expat == 1 & ever_foreign == 0
  0

. 
. egen industry_year = group(teaor08_1d year)

. 
. *for descriptives (number of firms and firm-years in final data)
. codebook frame_id_numeric

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [10000049,74849574]           Units: 1
         Unique values: 33,674                    Missing .: 0/317,158

                  Mean: 1.4e+07
             Std. dev.: 6.6e+06

           Percentiles:     10%       25%       50%       75%       90%
                        1.0e+07   1.0e+07   1.1e+07   1.3e+07   2.4e+07

. count if firm_tag
  33,674

. count
  317,158

. 
. drop first_year_foreign time_foreign 

. 
. count
  317,158

. count if ever_foreign
  24,499

. count if ever_foreign & firm_tag
  1,734

. count if ever_expat & firm_tag
  694

. count if has_expat_ceo
  5,221

. 
. drop ever_expat ever_foreign

. egen ever_foreign = max(foreign), by(frame_id_numeric)

. * did new foreign owner hire any ceos?
. egen ever_foreign_hire = max((hire_ceo == 1) & (foreign == 1) & (owner_spell 
> == 2)), by(frame_id_numeric)

. generate foreign_hire = ever_foreign_hire & foreign

. 
. * check the patterns of expat - local transitions. 
. local ceo has_expat_ceo

. bys frame_id_numeric (year): generate ceo_foreign_spell = sum(`ceo' != `ceo'[
> _n-1])

. 
. keep if ever_foreign == 1
(292,659 observations deleted)

. keep if ever_foreign_hire
(5,472 observations deleted)

. * no variation in these, drop
. drop ever_foreign ever_foreign_hire

. 
. egen ever_expat = max(has_expat_ceo & ceo_foreign_spell==2), by(frame_id_nume
> ric)

. generate ever_local = !ever_expat

. generate local_ceo = foreign_hire & ever_local

. * to ensure staggered treatment - this is intent to treat estimate
. replace has_expat_ceo = foreign_hire & ever_expat
(2,781 real changes made)

. 
. egen first_year_foreign = min(cond(foreign==1, year, .)), by(frame_id_numeric
> ) 

. generate time_foreign = year - first_year_foreign

. 
. * drop if local hires are much later replaced by expats
. drop if ever_local & has_expat_ceo
(0 observations deleted)

. 
. tabulate local_ceo has_expat_ceo

           |     has_expat_ceo
 local_ceo |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,192      8,002 |    15,194 
         1 |     3,833          0 |     3,833 
-----------+----------------------+----------
     Total |    11,025      8,002 |    19,027 

. tabulate ever_expat ever_local if time_foreign == 0

           |      ever_local
ever_expat |         0          1 |     Total
-----------+----------------------+----------
         0 |         0        548 |       548 
         1 |       675          0 |       675 
-----------+----------------------+----------
     Total |       675        548 |     1,223 

. 
. * limit sample to event window
. keep if inrange(time_foreign, -10, 5)
(7,644 observations deleted)

. 
. egen exporter_pre = max(exporter & (time_foreign < 0)), by(frame_id_numeric)

. 
. compress
  variable year was float now int
  variable minyear was float now int
  variable maxyear was float now int
  variable exporter_5 was float now byte
  variable age was float now byte
  variable owner_spell was float now byte
  variable industry_year was float now int
  variable foreign_hire was float now byte
  variable ceo_foreign_spell was float now byte
  variable ever_expat was float now byte
  variable ever_local was float now byte
  variable local_ceo was float now byte
  variable first_year_foreign was float now int
  variable time_foreign was float now byte
  variable exporter_pre was float now byte
  variable originalid was double now long
  variable sales was double now long
  variable tanass was double now long
  variable jetok was double now long
  variable export was double now long
  variable ranyag was double now long
  variable immat was double now long
  variable final_netgep was double now long
  variable tanass_18 was double now long
  (865,108 bytes saved)

. save "`here'/temp/analysis_sample.dta", replace
(file /srv/sandbox/expat/miklos//temp/analysis_sample.dta not found)
file /srv/sandbox/expat/miklos//temp/analysis_sample.dta saved

. log close
      name:  <unnamed>
       log:  /srv/sandbox/expat/miklos//output/analysis_sample.log
  log type:  text
 closed on:   1 Mar 2024, 15:20:09
-------------------------------------------------------------------------------
