-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/analysis_sample.l
> og
  log type:  text
 opened on:   6 May 2024, 18:59:19

. 
. use "`here'/temp/balance-small-clean.dta"

. drop foreign

. 
. merge 1:1 frame_id_numeric year using "`here'/temp/firm_events.dta", keep(mat
> ch) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           615,886  
    -----------------------------------------

. 
. * many foreign changes deleted
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric (year): egen owner_spell_total = total(foreign != foreig
> n[_n-1])

. tabulate owner_spell_total

owner_spell |
     _total |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    543,332       88.22       88.22
          2 |     45,651        7.41       95.63
          3 |     18,509        3.01       98.64
          4 |      5,117        0.83       99.47
          5 |      2,131        0.35       99.81
          6 |        786        0.13       99.94
          7 |        255        0.04       99.98
          8 |         55        0.01       99.99
          9 |         50        0.01      100.00
------------+-----------------------------------
      Total |    615,886      100.00

. 
. drop if owner_spell_total > 3 
(8,394 observations deleted)

. 
. * divestment
. bys frame_id_numeric (year): gen divest = sum(owner_spell != owner_spell[_n-1
> ] & foreign == 0 & _n != 1)

. replace divest = 1 if divest > 0
(0 real changes made)

. 
. * only D, D-F F owner spells
. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (fore
> ign == 0))

. tabulate start_as_domestic

start_as_do |
     mestic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     79,652       13.11       13.11
          1 |    527,840       86.89      100.00
------------+-----------------------------------
      Total |    607,492      100.00

. keep if start_as_domestic
(79,652 observations deleted)

. keep if owner_spell <= 2
(5,426 observations deleted)

. drop if divest == 1
(0 observations deleted)

. 
. drop owner_spell_total divest start_as_domestic

. 
. * check foreign and expat numbers
. egen firm_tag = tag(frame_id_numeric)

. 
. count if ever_foreign
  32,950

. count if ever_foreign & firm_tag
  2,481

. count if ever_expat & firm_tag
  883

. 
. count if has_expat_ceo == 1
  6,348

. count if has_expat_ceo == 1 & foreign == 0 
  16

. count if ever_expat == 1 & ever_foreign == 0
  0

. 
. egen industry_year = group(teaor08_1d year)

. 
. *for descriptives (number of firms and firm-years in final data)
. codebook frame_id_numeric

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [10000049,74849574]           Units: 1
         Unique values: 41,872                    Missing .: 0/522,414

                  Mean: 1.4e+07
             Std. dev.: 6.9e+06

           Percentiles:     10%       25%       50%       75%       90%
                        1.0e+07   1.1e+07   1.1e+07   1.3e+07   2.3e+07

. count if firm_tag
  41,872

. count
  522,414

. 
. count if ever_foreign
  32,950

. count if ever_foreign & firm_tag
  2,481

. count if ever_expat & firm_tag
  883

. count if has_expat_ceo
  6,348

. 
. drop ever_expat ever_foreign

. egen ever_foreign = max(foreign), by(frame_id_numeric)

. * did new foreign owner hire any ceos?
. egen ever_foreign_hire = max((hire_ceo == 1) & (foreign == 1) * (owner_spell 
> == 2)), by(frame_id_numeric)

. generate foreign_hire = ever_foreign_hire & foreign

. 
. * check the patterns of expat - local transitions. 
. local ceo has_expat_ceo

. bys frame_id_numeric (year): generate ceo_foreign_spell = sum(`ceo' != `ceo'[
> _n-1])

. 
. * drop after first expat leaves
. drop if ceo_foreign_spell > 2
(2,256 observations deleted)

. drop if ceo_foreign_spell == 2 & has_expat_ceo == 0
(0 observations deleted)

. 
. keep if ever_foreign == 1
(489,464 observations deleted)

. 
. generate foreign_only = foreign & !foreign_hire

. generate local_ceo = foreign_hire & !has_expat_ceo

. egen ever_local_ceo = max(local_ceo), by(frame_id_numeric)

. 
. * drop if local hires are much later replaced by expats
. drop if ever_local_ceo & has_expat_ceo
(1,564 observations deleted)

. * sometimes we refer to the short name
. clonevar ever_local = ever_local_ceo

. 
. tabulate foreign_only foreign_hire

foreign_on |     foreign_hire
        ly |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,201     12,469 |    27,670 
         1 |     1,460          0 |     1,460 
-----------+----------------------+----------
     Total |    16,661     12,469 |    29,130 

. tabulate local_ceo has_expat_ceo

           |     has_expat_ceo
 local_ceo |         0          1 |     Total
-----------+----------------------+----------
         0 |    16,629      4,199 |    20,828 
         1 |     8,302          0 |     8,302 
-----------+----------------------+----------
     Total |    24,931      4,199 |    29,130 

. 
. keep if ever_foreign_hire
(4,941 observations deleted)

. * no variation in these, drop
. drop ever_foreign ever_foreign_hire

. 
. egen first_year_foreign = min(cond(foreign==1, year, .)), by(frame_id_numeric
> ) 
(2 missing values generated)

. generate time_foreign = year - first_year_foreign
(2 missing values generated)

. 
. egen ever_expat = max(has_expat_ceo), by(frame_id_numeric)

. 
. * limit sample to event window
. keep if inrange(time_foreign, -6, 4)
(9,679 observations deleted)

. 
. egen exporter_pre = max(exporter & inrange(time_foreign, -3, -1)), by(frame_i
> d_numeric)

. * different ways of measuring export orientation
. clonevar export_entry = exporter

. replace export_entry = . if exporter_pre == 1
(7,780 real changes made, 7,780 to missing)

. 
. *Create teaor in year -1, drop agriculture
. 
. egen teaor08_1d_num = group(teaor08_1d)

. tempvar last_year_before 

. egen `last_year_before' = max(cond(time_foreign < 0, year,.)), by(frame_id_nu
> meric)
(19 missing values generated)

. drop if missing(`last_year_before')
(19 observations deleted)

. 
. egen teaor08_2d_pre = max(cond(year==`last_year_before', teaor08_2d, .)), by(
> frame_id_numeric)

. egen teaor08_1d_pre = max(cond(year==`last_year_before', teaor08_1d_num, .)),
>  by(frame_id_numeric)

. assert !missing(teaor08_2d_pre)

. drop `last_year_before'

. 
. * compute TFP
. 
. local agriculture 1 3

. local industry 5 39

. local services 40 75

. 
. generate TFP = .
(14,491 missing values generated)

. tempvar TFP

. foreach sector in agriculture industry services {
  2.     local from : word 1 of ``sector''
  3.     local to : word 2 of ``sector''
  4.     quietly regress lnQ lnK lnL lnM i.teaor08_2d##year if inrange(industry
> _mode, `from', `to')
  5.     predict `TFP' if e(sample), resid
  6.     replace TFP = `TFP' if inrange(industry_mode, `from', `to')
  7.     drop `TFP'
  8. }
(13,756 missing values generated)
(735 real changes made)
(8,808 missing values generated)
(5,683 real changes made)
(6,418 missing values generated)
(8,073 real changes made)

. 
. tabulate foreignness has_expat_ceo

                      |     has_expat_ceo
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |    12,297          0 |    12,297 
Hungarian name, neigh |         0         54 |        54 
Foreign name, Hungari |         0        140 |       140 
Hungarian name, other |         0          6 |         6 
Foreign name, non-Wes |         0        289 |       289 
Foreign name, Western |         0      1,705 |     1,705 
----------------------+----------------------+----------
                Total |    12,297      2,194 |    14,491 

. tabulate time_foreign foreignness if inrange(time_foreign, -2, 2) & ever_expa
> t 

time_forei |                   (max) foreignness
        gn | Hungarian  Hungarian  Foreign n  Hungarian  Foreign n |     Total
-----------+-------------------------------------------------------+----------
        -2 |       356          0          1          0          0 |       357 
        -1 |       582          0          1          0          0 |       592 
         0 |         0         21         37          2         95 |       618 
         1 |         0         15         31          1         61 |       492 
         2 |         0         10         25          1         54 |       415 
-----------+-------------------------------------------------------+----------
     Total |       938         46         95          4        210 |     2,474 


           |   (max)
           | foreignnes
time_forei |     s
        gn | Foreign n |     Total
-----------+-----------+----------
        -2 |         0 |       357 
        -1 |         9 |       592 
         0 |       463 |       618 
         1 |       384 |       492 
         2 |       325 |       415 
-----------+-----------+----------
     Total |     1,181 |     2,474 

. 
. * keep only western foreigners and locals with Hungarian names
. egen always0 = min(foreignness == 0), by(frame_id_numeric )

. egen ever5 = max(foreignness == 5), by(frame_id_numeric )

. tab always0 ever5 

           |         ever5
   always0 |         0          1 |     Total
-----------+----------------------+----------
         0 |       906      3,208 |     4,114 
         1 |    10,377          0 |    10,377 
-----------+----------------------+----------
     Total |    11,283      3,208 |    14,491 

. keep if always0 | ever5 
(906 observations deleted)

. drop always0 ever5

. 
. tabulate time_foreign has_expat_ceo 

time_forei |     has_expat_ceo
        gn |         0          1 |     Total
-----------+----------------------+----------
        -6 |       719          0 |       719 
        -5 |       824          0 |       824 
        -4 |       966          0 |       966 
        -3 |     1,141          0 |     1,141 
        -2 |     1,360          0 |     1,360 
        -1 |     1,828          9 |     1,837 
         0 |     1,436        472 |     1,908 
         1 |     1,223        393 |     1,616 
         2 |       945        337 |     1,282 
         3 |       758        297 |     1,055 
         4 |       619        258 |       877 
-----------+----------------------+----------
     Total |    11,819      1,766 |    13,585 

. 
. compress
  variable year was float now int
  variable minyear was float now int
  variable maxyear was float now int
  variable exporter_5 was float now byte
  variable age was float now byte
  variable owner_spell was float now byte
  variable industry_year was float now int
  variable foreign_hire was float now byte
  variable ceo_foreign_spell was float now byte
  variable foreign_only was float now byte
  variable local_ceo was float now byte
  variable ever_local_ceo was float now byte
  variable ever_local was float now byte
  variable first_year_foreign was float now int
  variable time_foreign was float now byte
  variable ever_expat was float now byte
  variable exporter_pre was float now byte
  variable teaor08_1d_num was float now byte
  variable teaor08_2d_pre was float now byte
  variable teaor08_1d_pre was float now byte
  variable originalid was double now long
  variable sales was double now long
  variable tanass was double now long
  variable jetok was double now long
  variable export was double now long
  variable ranyag was double now long
  variable immat was double now long
  variable final_netgep was double now long
  variable tanass_18 was double now long
  (1,236,235 bytes saved)

. save "`here'/temp/analysis_sample.dta", replace
file /Users/koren/Tresorit/Mac/projects/expat//temp/analysis_sample.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/analysis_sample.l
> og
  log type:  text
 closed on:   6 May 2024, 18:59:44
-------------------------------------------------------------------------------
