-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/analysis_sample.l
> og
  log type:  text
 opened on:  28 Mar 2024, 12:17:16

. 
. use "`here'/temp/balance-small-clean.dta"

. drop foreign

. 
. merge 1:1 frame_id_numeric year using "`here'/temp/firm_events.dta", keep(mat
> ch) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           325,881  
    -----------------------------------------

. 
. * many foreign changes deleted
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric (year): egen owner_spell_total = total(foreign != foreig
> n[_n-1])

. tabulate owner_spell_total

owner_spell |
     _total |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    281,764       86.46       86.46
          2 |     27,701        8.50       94.96
          3 |     11,515        3.53       98.50
          4 |      3,013        0.92       99.42
          5 |      1,330        0.41       99.83
          6 |        379        0.12       99.95
          7 |        128        0.04       99.98
          8 |         26        0.01       99.99
          9 |         25        0.01      100.00
------------+-----------------------------------
      Total |    325,881      100.00

. 
. drop if owner_spell_total > 3 
(4,901 observations deleted)

. 
. * divestment
. bys frame_id_numeric (year): gen divest = sum(owner_spell != owner_spell[_n-1
> ] & foreign == 0 & _n != 1)

. replace divest = 1 if divest > 0
(0 real changes made)

. 
. * only D, D-F F owner spells
. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (fore
> ign == 0))

. tabulate start_as_domestic

start_as_do |
     mestic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     51,428       16.02       16.02
          1 |    269,552       83.98      100.00
------------+-----------------------------------
      Total |    320,980      100.00

. keep if start_as_domestic
(51,428 observations deleted)

. keep if owner_spell <= 2
(3,367 observations deleted)

. drop if divest == 1
(0 observations deleted)

. 
. drop owner_spell_total divest start_as_domestic

. 
. * check foreign and expat numbers
. egen firm_tag = tag(frame_id_numeric)

. 
. count if ever_foreign
  22,785

. count if ever_foreign & firm_tag
  1,584

. count if ever_expat & firm_tag
  624

. 
. count if has_expat_ceo == 1
  4,787

. count if has_expat_ceo == 1 & foreign == 0 
  8

. count if ever_expat == 1 & ever_foreign == 0
  0

. 
. egen industry_year = group(teaor08_1d year)

. 
. *for descriptives (number of firms and firm-years in final data)
. codebook frame_id_numeric

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [10000049,74849574]           Units: 1
         Unique values: 20,253                    Missing .: 0/266,185

                  Mean: 1.3e+07
             Std. dev.: 6.1e+06

           Percentiles:     10%       25%       50%       75%       90%
                        1.0e+07   1.0e+07   1.1e+07   1.2e+07   1.9e+07

. count if firm_tag
  20,253

. count
  266,185

. 
. count if ever_foreign
  22,785

. count if ever_foreign & firm_tag
  1,584

. count if ever_expat & firm_tag
  624

. count if has_expat_ceo
  4,787

. 
. drop ever_expat ever_foreign

. egen ever_foreign = max(foreign), by(frame_id_numeric)

. * did new foreign owner hire any ceos?
. egen ever_foreign_hire = max((hire_ceo == 1) & (foreign == 1) * (owner_spell 
> == 2)), by(frame_id_numeric)

. generate foreign_hire = ever_foreign_hire & foreign

. 
. * check the patterns of expat - local transitions. 
. local ceo has_expat_ceo

. bys frame_id_numeric (year): generate ceo_foreign_spell = sum(`ceo' != `ceo'[
> _n-1])

. 
. * drop after first expat leaves
. drop if ceo_foreign_spell > 2
(1,734 observations deleted)

. drop if ceo_foreign_spell == 2 & has_expat_ceo == 0
(0 observations deleted)

. 
. keep if ever_foreign == 1
(243,400 observations deleted)

. 
. generate foreign_only = foreign & !foreign_hire

. generate local_ceo = foreign_hire & !has_expat_ceo

. egen ever_local_ceo = max(local_ceo), by(frame_id_numeric)

. 
. * drop if local hires are much later replaced by expats
. drop if ever_local_ceo & has_expat_ceo
(1,193 observations deleted)

. * sometimes we refer to the short name
. clonevar ever_local = ever_local_ceo

. 
. tabulate foreign_only foreign_hire

foreign_on |     foreign_hire
        ly |         0          1 |     Total
-----------+----------------------+----------
         0 |    10,230      7,734 |    17,964 
         1 |     1,894          0 |     1,894 
-----------+----------------------+----------
     Total |    12,124      7,734 |    19,858 

. tabulate local_ceo has_expat_ceo

           |     has_expat_ceo
 local_ceo |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,105      3,114 |    15,219 
         1 |     4,639          0 |     4,639 
-----------+----------------------+----------
     Total |    16,744      3,114 |    19,858 

. 
. keep if ever_foreign_hire
(5,430 observations deleted)

. * no variation in these, drop
. drop ever_foreign ever_foreign_hire

. 
. egen first_year_foreign = min(cond(foreign==1, year, .)), by(frame_id_numeric
> ) 

. generate time_foreign = year - first_year_foreign

. 
. egen ever_expat = max(has_expat_ceo), by(frame_id_numeric)

. 
. * limit sample to event window
. keep if inrange(time_foreign, -6, 4)
(6,340 observations deleted)

. 
. egen exporter_pre = max(exporter & inrange(time_foreign, -3, -1)), by(frame_i
> d_numeric)

. * different ways of measuring export orientation
. clonevar export_entry = exporter

. replace export_entry = . if exporter_pre == 1
(4,836 real changes made, 4,836 to missing)

. 
. *Create teaor in year -1, drop agriculture
. 
. egen teaor08_1d_num = group(teaor08_1d)

. tempvar last_year_before 

. egen `last_year_before' = max(cond(time_foreign < 0, year,.)), by(frame_id_nu
> meric)
(9 missing values generated)

. drop if missing(`last_year_before')
(9 observations deleted)

. 
. egen teaor08_2d_pre = max(cond(year==`last_year_before', teaor08_2d, .)), by(
> frame_id_numeric)

. egen teaor08_1d_pre = max(cond(year==`last_year_before', teaor08_1d_num, .)),
>  by(frame_id_numeric)

. assert !missing(teaor08_2d_pre)

. drop `last_year_before'

. 
. * compute TFP
. 
. local agriculture 1 3

. local industry 5 39

. local services 40 75

. 
. generate TFP = .
(8,079 missing values generated)

. tempvar TFP

. foreach sector in agriculture industry services {
  2.     local from : word 1 of ``sector''
  3.     local to : word 2 of ``sector''
  4.     quietly regress lnQ lnK lnL lnM i.teaor08_2d##year if inrange(industry
> _mode, `from', `to')
  5.     predict `TFP' if e(sample), resid
  6.     replace TFP = `TFP' if inrange(industry_mode, `from', `to')
  7.     drop `TFP'
  8. }
(7,638 missing values generated)
(441 real changes made)
(4,244 missing values generated)
(3,835 real changes made)
(4,276 missing values generated)
(3,803 real changes made)

. 
. tabulate foreignness has_expat_ceo

                      |     has_expat_ceo
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |     6,526          0 |     6,526 
Hungarian name, neigh |         0         23 |        23 
Foreign name, Hungari |         0        135 |       135 
Hungarian name, other |         0          4 |         4 
Foreign name, non-Wes |         0        200 |       200 
Foreign name, Western |         0      1,191 |     1,191 
----------------------+----------------------+----------
                Total |     6,526      1,553 |     8,079 

. tabulate time_foreign foreignness if inrange(time_foreign, -2, 2) & ever_expa
> t 

time_forei |                   (max) foreignness
        gn | Hungarian  Hungarian  Foreign n  Hungarian  Foreign n |     Total
-----------+-------------------------------------------------------+----------
        -2 |       237          0          0          0          0 |       237 
        -1 |       390          0          0          0          0 |       394 
         0 |         0         11         36          1         60 |       415 
         1 |         0          7         32          1         41 |       345 
         2 |         0          3         26          1         40 |       300 
-----------+-------------------------------------------------------+----------
     Total |       627         21         94          3        141 |     1,691 


           |   (max)
           | foreignnes
time_forei |     s
        gn | Foreign n |     Total
-----------+-----------+----------
        -2 |         0 |       237 
        -1 |         4 |       394 
         0 |       307 |       415 
         1 |       264 |       345 
         2 |       230 |       300 
-----------+-----------+----------
     Total |       805 |     1,691 

. 
. compress
  variable year was float now int
  variable minyear was float now int
  variable maxyear was float now int
  variable exporter_5 was float now byte
  variable age was float now byte
  variable owner_spell was float now byte
  variable industry_year was float now int
  variable foreign_hire was float now byte
  variable ceo_foreign_spell was float now byte
  variable foreign_only was float now byte
  variable local_ceo was float now byte
  variable ever_local_ceo was float now byte
  variable ever_local was float now byte
  variable first_year_foreign was float now int
  variable time_foreign was float now byte
  variable ever_expat was float now byte
  variable exporter_pre was float now byte
  variable teaor08_1d_num was float now byte
  variable teaor08_2d_pre was float now byte
  variable teaor08_1d_pre was float now byte
  variable originalid was double now long
  variable sales was double now long
  variable tanass was double now long
  variable jetok was double now long
  variable export was double now long
  variable ranyag was double now long
  variable immat was double now long
  variable final_netgep was double now long
  variable tanass_18 was double now long
  (735,189 bytes saved)

. save "`here'/temp/analysis_sample.dta", replace
file /Users/koren/Tresorit/Mac/projects/expat//temp/analysis_sample.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/analysis_sample.l
> og
  log type:  text
 closed on:  28 Mar 2024, 12:17:32
-------------------------------------------------------------------------------
