-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Documents/workspace/expat//output/analysis_sample.log
  log type:  text
 opened on:   8 Jul 2021, 09:04:04

. 
. use "`here'/temp/balance-small-clean.dta"

. drop foreign

. 
. sort frame_id_numeric year

. gen x_before = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1
> ]
(25,470 missing values generated)

. gen hole10_before = (x_before > 10 & x_before != .)

. gen hole2_before = (x_before > 2 & x_before != .)

. gen hole1_before = (x_before > 1 & x_before != .)

. 
. foreach var of varlist hole* {
  2.         tab `var'
  3. }

hole10_befo |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    349,366       99.99       99.99
          1 |         30        0.01      100.00
------------+-----------------------------------
      Total |    349,396      100.00

hole2_befor |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    348,231       99.67       99.67
          1 |      1,165        0.33      100.00
------------+-----------------------------------
      Total |    349,396      100.00

hole1_befor |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    344,886       98.71       98.71
          1 |      4,510        1.29      100.00
------------+-----------------------------------
      Total |    349,396      100.00

. 
. drop x_before hole*

. 
. merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(match) noge
> n

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           303,979  
    -----------------------------------------

. *merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(1 3) //nog
> en
. *merge 1:1 frame_id year using "`here'/temp/firm_events.dta"
. 
. sort frame_id_numeric year

. gen x_after = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(24,115 missing values generated)

. gen hole10_after_m = (x_after > 10 & x_after != .)

. gen hole2_after_m = (x_after > 2 & x_after != .)

. gen hole1_after_m = (x_after > 1 & x_after != .)

. 
. foreach var of varlist hole* {
  2.         tab `var'
  3. }

hole10_afte |
        r_m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    303,934       99.99       99.99
          1 |         45        0.01      100.00
------------+-----------------------------------
      Total |    303,979      100.00

hole2_after |
         _m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    302,794       99.61       99.61
          1 |      1,185        0.39      100.00
------------+-----------------------------------
      Total |    303,979      100.00

hole1_after |
         _m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    299,890       98.65       98.65
          1 |      4,089        1.35      100.00
------------+-----------------------------------
      Total |    303,979      100.00

. 
. *tab _merge
. 
. drop x_after hole*

. 
. preserve

. use "`here'/temp/balance-small-clean.dta", clear

.         drop foreign

.         merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(1 3
> )

    Result                           # of obs.
    -----------------------------------------
    not matched                        45,417
        from master                    45,417  (_merge==1)
        from using                          0  (_merge==2)

    matched                           303,979  (_merge==3)
    -----------------------------------------

.         sort frame_id_numeric year

.         gen x_after = year - year[_n-1] if frame_id_numeric == frame_id_numer
> ic[_n-1]
(25,470 missing values generated)

.         gen hole10_after_mm = (x_after > 10 & x_after != .)

.         gen hole2_after_mm = (x_after > 2 & x_after != .)

.         gen hole1_after_mm = (x_after > 1 & x_after != .)

. 
.         foreach var of varlist hole* {
  2.                 tab `var'
  3.         }

hole10_afte |
       r_mm |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    349,366       99.99       99.99
          1 |         30        0.01      100.00
------------+-----------------------------------
      Total |    349,396      100.00

hole2_after |
        _mm |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    348,231       99.67       99.67
          1 |      1,165        0.33      100.00
------------+-----------------------------------
      Total |    349,396      100.00

hole1_after |
        _mm |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    344,886       98.71       98.71
          1 |      4,510        1.29      100.00
------------+-----------------------------------
      Total |    349,396      100.00

.         drop x_after hole*

. restore

. 
. preserve

.         use "`here'/temp/balance-small-clean.dta", clear

.         merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(2 3
> )

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,257
        from master                         0  (_merge==1)
        from using                      2,257  (_merge==2)

    matched                           303,979  (_merge==3)
    -----------------------------------------

.         sort frame_id_numeric year

.         gen x_after = year - year[_n-1] if frame_id_numeric == frame_id_numer
> ic[_n-1]
(24,115 missing values generated)

.         gen hole10_after_um = (x_after > 10 & x_after != .)

.         gen hole2_after_um = (x_after > 2 & x_after != .)

.         gen hole1_after_um = (x_after > 1 & x_after != .)

. 
.         foreach var of varlist hole* {
  2.                 tab `var'
  3.         }

hole10_afte |
       r_um |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    306,191       99.99       99.99
          1 |         45        0.01      100.00
------------+-----------------------------------
      Total |    306,236      100.00

hole2_after |
        _um |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    305,051       99.61       99.61
          1 |      1,185        0.39      100.00
------------+-----------------------------------
      Total |    306,236      100.00

hole1_after |
        _um |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    304,404       99.40       99.40
          1 |      1,832        0.60      100.00
------------+-----------------------------------
      Total |    306,236      100.00

.         drop x_after hole*

. restore

. 
. rename foreign_ceo foreign

. rename ever_foreign_ceo ever_foreign

. drop foreign_nceo ever_foreign_nceo

. 
. *nceo overriden to have zeros
. mvencode *_nceo, mv(0) override
n_found~nceo: 275851 missing values recoded
n_insid~nceo: 275851 missing values recoded
n_outsi~nceo: 275851 missing values recoded
n_expat_nceo: 275851 missing values recoded
n_local_nceo: 275851 missing values recoded
ever_ex~nceo: 275851 missing values recoded
      n_nceo: 275851 missing values recoded
   hire_nceo: 275851 missing values recoded
   fire_nceo: 275851 missing values recoded
hire_ex~nceo: 275851 missing values recoded
fire_ex~nceo: 275851 missing values recoded
ceo_spe~nceo: 275851 missing values recoded
has_exp~nceo: 275851 missing values recoded
has_loc~nceo: 275851 missing values recoded
has_fou~nceo: 275851 missing values recoded
has_ins~nceo: 275851 missing values recoded
has_out~nceo: 275851 missing values recoded

. 
. * many foreign changes deleted
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric (year): egen owner_spell_total = total(foreign != foreig
> n[_n-1])

. 
. drop if owner_spell_total > 3 // FIXME: doublecheck the length of spells
(3,795 observations deleted)

. scalar dropped_too_many_foreign_change = r(N_drop)

. display dropped_too_many_foreign_change
3795

. 
. * divestiture
. bys frame_id_numeric (year): gen divest = sum(cond(owner_spell != owner_spell
> [_n-1] & foreign == 0 & _n != 1, 1, 0))

. replace divest = 1 if divest > 0
(0 real changes made)

. 
. * only keep D, D-F owner spells
. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (fore
> ign == 0))

. *keep if start_as_domestic & owner_spell <= 2
. keep if start_as_domestic
(18,225 observations deleted)

. keep if owner_spell <= 2
(3,420 observations deleted)

. 
. * check foreign end expat numbers
. egen firm_tag = tag(frame_id_numeric)

. 
. count if ever_foreign
  21,868

. count if ever_foreign & firm_tag
  1,573

. count if ever_expat_ceo & firm_tag
  560

. count if ever_expat_nceo & firm_tag
  9

. 
. count if has_expat_nceo == 1
  302

. count if has_expat_nceo == 1 & foreign == 0
  10

. count if has_expat_ceo == 1
  4,072

. count if has_expat_ceo == 1 & foreign == 0 // FIXME - should be 0
  0

. count if ever_expat_nceo == 1 & ever_foreign == 0
  1

. count if ever_expat_ceo == 1 & ever_foreign == 0
  0

. 
. *do "`here'/code/create/event_dummies_firmlevel.do"
. 
. *merge 1:1 originalid year using "input/fo3-owner-names/country_codes.dta", k
> eep(match master) nogen
. * "same country" only applies to expats at foreign firms
. *replace country_same = 0 if (has_expat == 0) | (foreign == 0)
. 
. egen industry_year = group(teaor08_1d year)

. *egen last_before_acquisition = max(cond(time_foreign<0, time_foreign, .)), b
> y(originalid)
. *egen ever_same_country = max(country_same), by(originalid)
. 
. *do "`here'/code/create/countries.do"
. 
. *for descriptives (number of firms and firm-years in final data)
. codebook frame_id_numeric

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [10000049,90620052]          units:  1
         unique values:  22,469                   missing .:  0/278,539

                  mean:   1.3e+07
              std. dev:   6.5e+06

           percentiles:        10%       25%       50%       75%       90%
                           1.0e+07   1.0e+07   1.1e+07   1.2e+07   2.2e+07

. count if firm_tag
  22,469

. count
  278,539

. 
. drop first_year_foreign time_foreign foreign_* foreign? count

. 
. bys frame_id_numeric: egen first_year_foreign_new = min(cond(foreign == 1, ye
> ar,.))
(256671 missing values generated)

. generate time_foreign_new = year - first_year_foreign_new
(256,671 missing values generated)

. gen foreign0_new = (time_foreign_new == 0)

. count if foreign0_new == 1
  1,573

. drop *new

. 
. do "`here'/code/create/event_dummies_firmlevel"

. *cd C:\Users\Almos\Documents\Research\Expat\Expat_git\expat-analysis
. *clear all
. *here
. *local here = r(here)
. 
. *use "`here'/temp/analysis_sample.dta", clear
. 
. tsset frame_id_numeric year
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit

. 
. *******Check number of ceos******************
. bys frame_id_numeric: egen max_n_ceo = max(n_ceo)

. bys frame_id_numeric: egen min_n_ceo = min(n_ceo)

. gen diff = max_n_ceo-min_n_ceo

. 
. reghdfe n_ceo foreign has_expat_ceo lnL, a(teaor08_2d##year) cluster(frame_id
> _numeric)
(dropped 92 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    278,447
Absorbing 1 HDFE group                            F(   3,  22466) =      87.23
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0629
                                                  Adj R-squared   =     0.0550
                                                  Within R-sq.    =     0.0087
Number of clusters (frame_id_numeric) =     22,467Root MSE        =     0.6997

                  (Std. Err. adjusted for 22,467 clusters in frame_id_numeric)
------------------------------------------------------------------------------
             |               Robust
       n_ceo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     foreign |  -.1512669   .0168022    -9.00   0.000    -.1842003   -.1183335
has_exp~_ceo |   .6533704   .0419135    15.59   0.000      .571217    .7355238
         lnL |   .0033601   .0031615     1.06   0.288    -.0028367    .0095569
       _cons |   1.362393     .01224   111.31   0.000     1.338402    1.386384
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------+
       Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------+---------------------------------------|
   teaor08_2d#year |      2313           0        2313     |
-----------------------------------------------------------+

. 
. ******Event-time variable foreign**************
. sort frame_id_numeric year

. tempvar t_year

. gen `t_year' = year if foreign==1 & foreign[_n-1]==0 
(276,966 missing values generated)

. bys frame_id_numeric: egen first_year_foreign=max(`t_year')
(256671 missing values generated)

. gen time_foreign = year-first_year_foreign
(256,671 missing values generated)

. replace time_foreign=. if foreign==0 & time_foreign>0
(0 real changes made)

. 
. forval i=0/5 {
  2.         
.         gen foreign_e`i'=(time_foreign==-`i')
  3.         gen foreigne`i'=(time_foreign==`i')
  4. 
.         }

. 
. replace foreigne5=1 if time_foreign>5 & time_foreign<.
(5,560 real changes made)

. drop foreign_e0

. 
. order foreign_e5 foreign_e4 foreign_e3 foreign_e2 foreign_e1 foreigne0 foreig
> ne1 foreigne2 foreigne3 foreigne4 foreigne5, a(time_foreign) 

. 
. **Recompute spell using only hires
. bys frame_id_numeric: egen first_year_firm = min(year)

. tempvar t_hire

. gen `t_hire'=hire_ceo

. replace `t_hire' = 1 if first_year_firm==year 
(22,469 real changes made)

. bys frame_id_numeric: gen ceo_spell_hire=sum(`t_hire')

. 
. 
. ******Foreign-hired ceo***********
. tempvar t_ceo

. bys frame_id_numeric: egen `t_ceo'= max(ceo_spell_hire) if !foreign
(12050 missing values generated)

. bys frame_id_numeric: egen last_ceo_spell_do = max(`t_ceo')

. gen foreign_hire = (ceo_spell_hire > last_ceo_spell_do)

. replace foreign_hire = . if last_ceo_spell_do == .
(0 real changes made)

. 
. bys frame_id_numeric: egen ever_foreign_hire = max(foreign_hire)

. 
. 
. **********Insider vs. outsider local CEO***************
. tempvar fh_ins

. gen `fh_ins'=(foreign_hire==1 & has_insider_ceo==1 & hire_ceo==1)

. bysort frame_id_numeric ceo_spell_hire: egen foreign_hire_insider=max(`fh_ins
> ') 

. 
. 
. *****expat alone
. gen expat_alone = (has_expat_ceo & !has_local_ceo)

. 
. *******First, second etc ceos************
. 
. gen ceo_spell_foreign = ceo_spell_hire - last_ceo_spell_do

. replace ceo_spell_foreign = 0 if ceo_spell_foreign<0
(119,188 real changes made)

. 
. tempvar t_expat

. bys frame_id_numeric ceo_spell_foreign: egen `t_expat' = max(hire_expat_ceo)

. 
. forval i=1/11 {
  2.         gen foreign_hire_local_`i' = (ceo_spell_foreign == `i' & `t_expat'
> ==0)
  3.         gen foreign_hire_expat_`i' = (ceo_spell_foreign == `i' & `t_expat'
> ==1)  
  4.         }

. 
. gen foreign_hire_local_3plus = (ceo_spell_foreign > 2 & `t_expat'==0)

. gen foreign_hire_expat_3plus = (ceo_spell_foreign > 2 & `t_expat'==1)

. 
. 
. **********Sequence of hires*********
. tempvar t_LL 

. tempvar t_LE

. tempvar t_EL

. tempvar t_EE

. 
. tsset frame_id_numeric year
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit

. gen `t_LL' = (foreign_hire_local_2==1 & l.foreign_hire_local_1==1)

. bys frame_id_numeric foreign_hire_local_2: egen foreign_hire_LL_2 = max(`t_LL
> ') 

. tsset frame_id_numeric year
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit

. gen `t_LE' = (foreign_hire_expat_2==1 & l.foreign_hire_local_1==1)

. bys frame_id_numeric foreign_hire_expat_2: egen foreign_hire_LE_2 = max(`t_LE
> ') 

. tsset frame_id_numeric year
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit

. gen `t_EL' = (foreign_hire_local_2==1 & l.foreign_hire_expat_1==1)

. bys frame_id_numeric foreign_hire_local_2: egen foreign_hire_EL_2 = max(`t_EL
> ')

. tsset frame_id_numeric year
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit

. gen `t_EE' = (foreign_hire_expat_2==1 & l.foreign_hire_expat_1==1)

. bys frame_id_numeric foreign_hire_expat_2: egen foreign_hire_EE_2 = max(`t_EE
> ')

. 
. 
. ***********Event time dummies for foreign_hire, expat************
. sort frame_id_numeric year

. foreach mantype in hire_local hire_expat `X' {
  2.         
.         tempvar t_year
  3.         tempvar t_year_max
  4.         gen `t_year' = year if foreign_`mantype'_1==1 & foreign_`mantype'_
> 1[_n-1]==0 
  5.         bys frame_id_numeric: egen `t_year_max'=max(`t_year')
  6.         gen time_foreign_`mantype' = year-`t_year_max'
  7.         *Make the variable 0 when the manager leaves
.         replace time_foreign_`mantype'=. if foreign_`mantype'_1==0 & time_for
> eign_`mantype'>0
  8. 
. 
. forval i=0/5 {
  9.         
.         gen foreign_`mantype'_1_e`i'=(time_foreign_`mantype'==-`i')
 10.         gen foreign_`mantype'_1e`i'=(time_foreign_`mantype'==`i')
 11. 
.         }
 12. 
. replace foreign_`mantype'_1e5=1 if time_foreign_`mantype'>5 & time_foreign_`m
> antype'<.
 13. drop foreign_`mantype'_1_e0
 14. }
(277,926 missing values generated)
(269691 missing values generated)
(269,691 missing values generated)
(1,882 real changes made, 1,882 to missing)
(314 real changes made)
(278,067 missing values generated)
(270754 missing values generated)
(270,754 missing values generated)
(2,996 real changes made, 2,996 to missing)
(335 real changes made)

. 
. order foreign_hire_local_1_e5 foreign_hire_local_1_e4 foreign_hire_local_1_e3
>  foreign_hire_local_1_e2 foreign_hire_local_1_e1 foreign_hire_local_1e0 forei
> gn_hire_local_1e1 foreign_hire_local_1e2 foreign_hire_local_1e3 foreign_hire_
> local_1e4 foreign_hire_local_1e5 foreign_hire_expat_1_e5 foreign_hire_expat_1
> _e4 foreign_hire_expat_1_e3 foreign_hire_expat_1_e2 foreign_hire_expat_1_e1 f
> oreign_hire_expat_1e0 foreign_hire_expat_1e1 foreign_hire_expat_1e2 foreign_h
> ire_expat_1e3 foreign_hire_expat_1e4 foreign_hire_expat_1e5, a(time_foreign_h
> ire_expat)

. 
. *save, replace
. 
end of do-file

. 
. compress
  variable minyear was float now int
  variable maxyear was float now int
  variable exporter_5 was float now byte
  variable age was float now int
  variable owner_spell was float now byte
  variable owner_spell_total was float now byte
  variable divest was float now byte
  variable start_as_domestic was float now byte
  variable industry_year was float now int
  variable max_n_ceo was float now byte
  variable min_n_ceo was float now byte
  variable diff was float now byte
  variable first_year_foreign was float now int
  variable time_foreign was float now byte
  variable foreign_e5 was float now byte
  variable foreign_e4 was float now byte
  variable foreign_e3 was float now byte
  variable foreign_e2 was float now byte
  variable foreign_e1 was float now byte
  variable foreigne0 was float now byte
  variable foreigne1 was float now byte
  variable foreigne2 was float now byte
  variable foreigne3 was float now byte
  variable foreigne4 was float now byte
  variable foreigne5 was float now byte
  variable first_year_firm was float now int
  variable ceo_spell_hire was float now byte
  variable last_ceo_spell_do was float now byte
  variable foreign_hire was float now byte
  variable ever_foreign_hire was float now byte
  variable foreign_hire_insider was float now byte
  variable expat_alone was float now byte
  variable ceo_spell_foreign was float now byte
  variable foreign_hire_local_1 was float now byte
  variable foreign_hire_expat_1 was float now byte
  variable foreign_hire_local_2 was float now byte
  variable foreign_hire_expat_2 was float now byte
  variable foreign_hire_local_3 was float now byte
  variable foreign_hire_expat_3 was float now byte
  variable foreign_hire_local_4 was float now byte
  variable foreign_hire_expat_4 was float now byte
  variable foreign_hire_local_5 was float now byte
  variable foreign_hire_expat_5 was float now byte
  variable foreign_hire_local_6 was float now byte
  variable foreign_hire_expat_6 was float now byte
  variable foreign_hire_local_7 was float now byte
  variable foreign_hire_expat_7 was float now byte
  variable foreign_hire_local_8 was float now byte
  variable foreign_hire_expat_8 was float now byte
  variable foreign_hire_local_9 was float now byte
  variable foreign_hire_expat_9 was float now byte
  variable foreign_hire_local_10 was float now byte
  variable foreign_hire_expat_10 was float now byte
  variable foreign_hire_local_11 was float now byte
  variable foreign_hire_expat_11 was float now byte
  variable foreign_hire_local_3plus was float now byte
  variable foreign_hire_expat_3plus was float now byte
  variable foreign_hire_LL_2 was float now byte
  variable foreign_hire_LE_2 was float now byte
  variable foreign_hire_EL_2 was float now byte
  variable foreign_hire_EE_2 was float now byte
  variable time_foreign_hire_local was float now byte
  variable time_foreign_hire_expat was float now byte
  variable foreign_hire_local_1_e5 was float now byte
  variable foreign_hire_local_1_e4 was float now byte
  variable foreign_hire_local_1_e3 was float now byte
  variable foreign_hire_local_1_e2 was float now byte
  variable foreign_hire_local_1_e1 was float now byte
  variable foreign_hire_local_1e0 was float now byte
  variable foreign_hire_local_1e1 was float now byte
  variable foreign_hire_local_1e2 was float now byte
  variable foreign_hire_local_1e3 was float now byte
  variable foreign_hire_local_1e4 was float now byte
  variable foreign_hire_local_1e5 was float now byte
  variable foreign_hire_expat_1_e5 was float now byte
  variable foreign_hire_expat_1_e4 was float now byte
  variable foreign_hire_expat_1_e3 was float now byte
  variable foreign_hire_expat_1_e2 was float now byte
  variable foreign_hire_expat_1_e1 was float now byte
  variable foreign_hire_expat_1e0 was float now byte
  variable foreign_hire_expat_1e1 was float now byte
  variable foreign_hire_expat_1e2 was float now byte
  variable foreign_hire_expat_1e3 was float now byte
  variable foreign_hire_expat_1e4 was float now byte
  variable foreign_hire_expat_1e5 was float now byte
  variable jetok was double now long
  variable export was double now long
  variable immat was double now long
  variable final_netgep was double now long
  variable ranyag8091_18 was double now long
  (74,926,991 bytes saved)

. save "`here'/temp/analysis_sample.dta", replace
(note: file /Users/koren/Documents/workspace/expat//temp/analysis_sample.dta no
> t found)
file /Users/koren/Documents/workspace/expat//temp/analysis_sample.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Documents/workspace/expat//output/analysis_sample.log
  log type:  text
 closed on:   8 Jul 2021, 09:04:28
-------------------------------------------------------------------------------
