--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/analysis_sample.log
  log type:  text
 opened on:  23 Apr 2021, 00:14:04

. 
. use "`here'/temp/balance-small-clean.dta"

. drop foreign

. 
. sort frame_id_numeric year

. gen x_before = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(25,486 missing values generated)

. gen hole2_before = (x_before > 2 & x_before != .)

. gen hole1_before = (x_before > 1 & x_before != .)

. 
. merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           287,315  
    -----------------------------------------

. *merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(1 3) //nogen
. *merge 1:1 frame_id year using "`here'/temp/firm_events.dta"
. 
. sort frame_id_numeric year

. gen x_after = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(24,114 missing values generated)

. gen hole2_after = (x_after > 2 & x_after != .)

. gen hole1_after = (x_after > 1 & x_after != .)

. 
. foreach var of varlist hole* {
  2.         tab `var'
  3.         *tab `var' _merge
. }

hole2_befor |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    286,194       99.61       99.61
          1 |      1,121        0.39      100.00
------------+-----------------------------------
      Total |    287,315      100.00

hole1_befor |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    283,548       98.69       98.69
          1 |      3,767        1.31      100.00
------------+-----------------------------------
      Total |    287,315      100.00

hole2_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    285,287       99.29       99.29
          1 |      2,028        0.71      100.00
------------+-----------------------------------
      Total |    287,315      100.00

hole1_after |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    282,456       98.31       98.31
          1 |      4,859        1.69      100.00
------------+-----------------------------------
      Total |    287,315      100.00

. 
. *tab _merge
. 
. drop x_after x_before hole*

. 
. * not so elegant
. merge m:1 frame_id_numeric year using "`here'/temp/ever_foreign.dta", keepusing(ever_foreign) keep(1 3) gen(filter)

    Result                           # of obs.
    -----------------------------------------
    not matched                       264,263
        from master                   264,263  (filter==1)
        from using                          0  (filter==2)

    matched                            23,052  (filter==3)
    -----------------------------------------

. drop ever_foreign

. 
. rename foreign_ceo foreign

. rename ever_foreign_ceo ever_foreign

. drop foreign_nceo ever_foreign_nceo

. 
. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count
---------+------------------------------------------------------------------------------------------
     sum |     29043      1113      1313      1593      1998      2728      2643      2455    287315
----------------------------------------------------------------------------------------------------

. mat total = r(StatTotal)

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count if filter == 3, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count
---------+------------------------------------------------------------------------------------------
     sum |     10713       972      1124      1363      1456      1275      1151      1039     23052
----------------------------------------------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. 
. *nceo overriden to have zeros
. mvencode *_nceo, mv(0) override
n_found~nceo: 262738 missing values recoded
n_insid~nceo: 262738 missing values recoded
n_outsi~nceo: 262738 missing values recoded
n_expat_nceo: 262738 missing values recoded
n_local_nceo: 262738 missing values recoded
ever_ex~nceo: 262738 missing values recoded
      n_nceo: 262738 missing values recoded
   hire_nceo: 262738 missing values recoded
   fire_nceo: 262738 missing values recoded
hire_ex~nceo: 262738 missing values recoded
fire_ex~nceo: 262738 missing values recoded
ceo_spe~nceo: 262738 missing values recoded
has_exp~nceo: 262738 missing values recoded
has_loc~nceo: 262738 missing values recoded
has_fou~nceo: 262738 missing values recoded
has_ins~nceo: 262738 missing values recoded
has_out~nceo: 262738 missing values recoded

. 
. * many foreign changes deleted
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric (year): egen owner_spell_total = total(foreign != foreign[_n-1])

. 
. drop if owner_spell_total > 3 // FIXME: doublecheck the length of spells
(3,386 observations deleted)

. scalar dropped_too_many_foreign_change = r(N_drop)

. display dropped_too_many_foreign_change
3386

. 
. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count
---------+------------------------------------------------------------------------------------------
     sum |     27246      1042      1224      1473      1852      2561      2476      2295    283929
----------------------------------------------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count if filter == 3, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count
---------+------------------------------------------------------------------------------------------
     sum |     10713       972      1124      1363      1456      1275      1151      1039     23052
----------------------------------------------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. 
. * divestiture
. bys frame_id_numeric (year): gen divest = sum(cond(owner_spell != owner_spell[_n-1] & foreign == 0 & _n != 1, 1, 0))

. replace divest = 1 if divest > 0
(0 real changes made)

. 
. * only keep D, D-F owner spells
. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (foreign == 0))

. *keep if start_as_domestic & owner_spell <= 2
. keep if start_as_domestic
(18,378 observations deleted)

. keep if owner_spell <= 2
(3,118 observations deleted)

. 
. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count
---------+------------------------------------------------------------------------------------------
     sum |     10754      1042      1198      1421      1459      1262      1040       873    262433
----------------------------------------------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count if filter == 3, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count
---------+------------------------------------------------------------------------------------------
     sum |     10682       972      1123      1362      1455      1262      1033       861     19905
----------------------------------------------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. 
. mat list total

total[6,9]
       foreign  foreign_3  foreign_2  foreign_1   foreign0   foreign1   foreign2   foreign3      count
sum      29043       1113       1313       1593       1998       2728       2643       2455     287315
sum      10713        972       1124       1363       1456       1275       1151       1039      23052
sum      27246       1042       1224       1473       1852       2561       2476       2295     283929
sum      10713        972       1124       1363       1456       1275       1151       1039      23052
sum      10754       1042       1198       1421       1459       1262       1040        873     262433
sum      10682        972       1123       1362       1455       1262       1033        861      19905

. 
. * check foreign end expat numbers
. egen firm_tag = tag(frame_id_numeric)

. count if ever_foreign & firm_tag
  1,505

. count if ever_expat_ceo & firm_tag
  535

. count if ever_expat_nceo & firm_tag
  9

. 
. count if has_expat_nceo == 1
  176

. count if has_expat_nceo == 1 & foreign == 0
  4

. count if has_expat_ceo == 1
  3,627

. count if has_expat_ceo == 1 & foreign == 0 // FIXME - should be 0
  0

. count if ever_expat_nceo == 1 & ever_foreign == 0
  5

. count if ever_expat_ceo == 1 & ever_foreign == 0
  0

. 
. *do "`here'/code/create/event_dummies_firmlevel.do"
. 
. *merge 1:1 originalid year using "input/fo3-owner-names/country_codes.dta", keep(match master) nogen
. * "same country" only applies to expats at foreign firms
. *replace country_same = 0 if (has_expat == 0) | (foreign == 0)
. 
. egen industry_year = group(teaor08_1d year)

. *egen last_before_acquisition = max(cond(time_foreign<0, time_foreign, .)), by(originalid)
. *egen ever_same_country = max(country_same), by(originalid)
. 
. *do "`here'/code/create/countries.do"
. 
. *for descriptives (number of firms and firm-years in final data)
. codebook frame_id_numeric

--------------------------------------------------------------------------------------------------------------------------------------------------------------
frame_id_numeric                                                                                                                                   (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [10000049,90620052]          units:  1
         unique values:  22,435                   missing .:  0/262,433

                  mean:   1.3e+07
              std. dev:   6.6e+06

           percentiles:        10%       25%       50%       75%       90%
                           1.0e+07   1.0e+07   1.1e+07   1.3e+07   2.2e+07

. count if firm_tag
  22,435

. count
  262,433

. 
. mata : mat_total_analysis = st_matrix("total")

. mata: mata matsave "temp/matrix-analysis" mat_total_analysis, replace
(saving mat_total_analysis[6,9])
file temp/matrix-analysis.mmat saved

. 
. drop first_year_foreign time_foreign foreign_* foreign? count

. 
. bys frame_id_numeric: egen first_year_foreign_new = min(cond(foreign == 1, year,.))
(242,678 missing values generated)

. generate time_foreign_new = year - first_year_foreign_new
(242,678 missing values generated)

. gen foreign0_new = (time_foreign_new == 0)

. count if foreign0_new == 1
  1,505

. drop *new

. 
. compress
  variable minyear was float now int
  variable maxyear was float now int
  variable exporter_5 was float now byte
  variable age was float now int
  variable owner_spell was float now byte
  variable owner_spell_total was float now byte
  variable divest was float now byte
  variable start_as_domestic was float now byte
  variable industry_year was float now int
  variable jetok was double now long
  variable export was double now long
  variable immat was double now long
  variable final_netgep was double now long
  variable ranyag8091_18 was double now long
  variable country_all_ceo was str12 now str9
  (12,071,918 bytes saved)

. save "`here'/temp/analysis_sample.dta", replace
file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//temp/analysis_sample.dta saved

. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/analysis_sample.log
  log type:  text
 closed on:  23 Apr 2021, 00:14:14
--------------------------------------------------------------------------------------------------------------------------------------------------------------
