-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/analysis_samp
> le.log
  log type:  text
 opened on:  19 Mar 2024, 16:38:31

. 
. use "`here'/temp/balance-small-clean.dta"

. drop foreign

. 
. merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(match) noge
> n

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           290,077  
    -----------------------------------------

. 
. * many foreign changes deleted
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric (year): egen owner_spell_total = total(foreign != foreig
> n[_n-1])

. tabulate owner_spell_total

owner_spell |
     _total |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    259,099       89.32       89.32
          2 |     18,155        6.26       95.58
          3 |      9,226        3.18       98.76
          4 |      2,252        0.78       99.54
          5 |      1,024        0.35       99.89
          6 |        216        0.07       99.96
          7 |         64        0.02       99.99
          8 |         41        0.01      100.00
------------+-----------------------------------
      Total |    290,077      100.00

. 
. drop if owner_spell_total > 3 
(3,597 observations deleted)

. 
. * divestment
. bys frame_id_numeric (year): gen divest = sum(owner_spell != owner_spell[_n-1
> ] & foreign == 0 & _n != 1)

. replace divest = 1 if divest > 0
(0 real changes made)

. 
. * only D, D-F F owner spells
. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (fore
> ign == 0))

. tabulate start_as_domestic

start_as_do |
     mestic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,160        7.04        7.04
          1 |    266,320       92.96      100.00
------------+-----------------------------------
      Total |    286,480      100.00

. keep if start_as_domestic
(20,160 observations deleted)

. keep if owner_spell <= 2
(3,028 observations deleted)

. drop if divest == 1
(0 observations deleted)

. 
. drop owner_spell_total divest start_as_domestic

. 
. * check foreign and expat numbers
. egen firm_tag = tag(frame_id_numeric)

. 
. count if ever_foreign
  19,765

. count if ever_foreign & firm_tag
  1,424

. count if ever_expat & firm_tag
  550

. 
. count if has_expat_ceo == 1
  3,932

. count if has_expat_ceo == 1 & foreign == 0 
  4

. count if ever_expat == 1 & ever_foreign == 0
  0

. 
. egen industry_year = group(teaor08_1d year)

. 
. *for descriptives (number of firms and firm-years in final data)
. codebook frame_id_numeric

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [10000063,74849574]           Units: 1
         Unique values: 28,403                    Missing .: 0/263,292

                  Mean: 1.4e+07
             Std. dev.: 6.8e+06

           Percentiles:     10%       25%       50%       75%       90%
                        1.0e+07   1.0e+07   1.1e+07   1.3e+07   2.5e+07

. count if firm_tag
  28,403

. count
  263,292

. 
. drop first_year_foreign time_foreign 

. 
. count
  263,292

. count if ever_foreign
  19,765

. count if ever_foreign & firm_tag
  1,424

. count if ever_expat & firm_tag
  550

. count if has_expat_ceo
  3,932

. 
. drop ever_expat ever_foreign

. egen ever_foreign = max(foreign), by(frame_id_numeric)

. * did new foreign owner hire any ceos?
. egen ever_foreign_hire = max((hire_ceo == 1) & (foreign == 1) * (owner_spell 
> == 2)), by(frame_id_numeric)

. generate foreign_hire = ever_foreign_hire & foreign

. 
. * check the patterns of expat - local transitions. 
. local ceo has_expat_ceo

. bys frame_id_numeric (year): generate ceo_foreign_spell = sum(`ceo' != `ceo'[
> _n-1])

. 
. * drop after first expat leaves
. drop if ceo_foreign_spell > 2
(1,650 observations deleted)

. drop if ceo_foreign_spell == 2 & has_expat_ceo == 0
(0 observations deleted)

. 
. keep if ever_foreign == 1
(243,533 observations deleted)

. 
. generate foreign_only = foreign & !foreign_hire

. generate local_ceo = foreign_hire & !has_expat_ceo

. egen ever_local_ceo = max(local_ceo), by(frame_id_numeric)

. 
. * drop if local hires are much later replaced by expats
. drop if ever_local_ceo & has_expat_ceo
(1,007 observations deleted)

. 
. tabulate foreign_only foreign_hire

foreign_on |     foreign_hire
        ly |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,834      6,546 |    15,380 
         1 |     1,722          0 |     1,722 
-----------+----------------------+----------
     Total |    10,556      6,546 |    17,102 

. tabulate local_ceo has_expat_ceo

           |     has_expat_ceo
 local_ceo |         0          1 |     Total
-----------+----------------------+----------
         0 |    10,555      2,506 |    13,061 
         1 |     4,041          0 |     4,041 
-----------+----------------------+----------
     Total |    14,596      2,506 |    17,102 

. 
. keep if ever_foreign_hire
(4,644 observations deleted)

. * no variation in these, drop
. drop ever_foreign ever_foreign_hire

. 
. egen first_year_foreign = min(cond(foreign==1, year, .)), by(frame_id_numeric
> ) 

. generate time_foreign = year - first_year_foreign

. 
. egen ever_expat = max(has_expat_ceo), by(frame_id_numeric)

. 
. * limit sample to event window
. keep if inrange(time_foreign, -7, 5)
(4,578 observations deleted)

. 
. egen exporter_pre = max(exporter & inrange(time_foreign, -3, -1)), by(frame_i
> d_numeric)

. * different ways of measuring export orientation
. clonevar export_entry = exporter

. replace export_entry = . if exporter_pre == 1
(4,409 real changes made, 4,409 to missing)

. 
. *Create teaor in year -1, drop agriculture
. 
. egen teaor08_1d_num = group(teaor08_1d)

. tempvar last_year_before 

. egen `last_year_before' = max(cond(time_foreign < 0, year,.)), by(frame_id_nu
> meric)
(5 missing values generated)

. drop if missing(`last_year_before')
(5 observations deleted)

. 
. egen teaor08_2d_pre = max(cond(year==`last_year_before', teaor08_2d, .)), by(
> frame_id_numeric)

. egen teaor08_1d_pre = max(cond(year==`last_year_before', teaor08_1d_num, .)),
>  by(frame_id_numeric)

. assert !missing(teaor08_2d_pre)

. drop `last_year_before'

. 
. * drop agriculture and mining firms
. drop if teaor08_2d_pre < 5 
(411 observations deleted)

. generate industrial_pre = (teaor08_2d_pre < 40)

. 
. * compute TFP
. 
. quietly regress lnQ lnK lnL lnM i.teaor08_2d##year if industrial_firm==1

. predict TFP if e(sample), resid
(4,227 missing values generated)

. 
. quietly regress lnQ lnK lnL lnM i.teaor08_2d##year if industrial_firm==0

. predict TFP_temp if e(sample), resid
(3,237 missing values generated)

. 
. replace TFP = TFP_temp if missing(TFP)
(4,227 real changes made)

. drop TFP_temp

. 
. compress
  variable year was float now int
  variable minyear was float now int
  variable maxyear was float now int
  variable exporter_5 was float now byte
  variable age was float now byte
  variable owner_spell was float now byte
  variable industry_year was float now int
  variable foreign_hire was float now byte
  variable ceo_foreign_spell was float now byte
  variable foreign_only was float now byte
  variable local_ceo was float now byte
  variable ever_local_ceo was float now byte
  variable first_year_foreign was float now int
  variable time_foreign was float now byte
  variable ever_expat was float now byte
  variable exporter_pre was float now byte
  variable teaor08_1d_num was float now byte
  variable teaor08_2d_pre was float now byte
  variable teaor08_1d_pre was float now byte
  variable industrial_pre was float now byte
  variable originalid was double now long
  variable sales was double now long
  variable tanass was double now long
  variable jetok was double now long
  variable export was double now long
  variable ranyag was double now long
  variable immat was double now long
  variable final_netgep was double now long
  variable tanass_18 was double now long
  (679,224 bytes saved)

. save "`here'/temp/analysis_sample.dta", replace
file /Users/koren/Tresorit/Mac2Mac/projects/expat//temp/analysis_sample.dta
    saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/analysis_samp
> le.log
  log type:  text
 closed on:  19 Mar 2024, 16:38:40
-------------------------------------------------------------------------------
