-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/analysis_sample.l
> og
  log type:  text
 opened on:  26 Jan 2024, 16:01:52

. 
. use "`here'/temp/balance-small-clean.dta"

. drop foreign

. 
. merge 1:1 frame_id year using "`here'/temp/firm_events.dta", keep(match) noge
> n

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           343,019  
    -----------------------------------------

. 
. * many foreign changes deleted
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric (year): egen owner_spell_total = total(foreign != foreig
> n[_n-1])

. tabulate owner_spell_total

owner_spell |
     _total |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    306,418       89.33       89.33
          2 |     21,544        6.28       95.61
          3 |     11,149        3.25       98.86
          4 |      2,276        0.66       99.52
          5 |      1,253        0.37       99.89
          6 |        222        0.06       99.95
          7 |        131        0.04       99.99
          8 |         26        0.01      100.00
------------+-----------------------------------
      Total |    343,019      100.00

. 
. drop if owner_spell_total > 3 
(3,908 observations deleted)

. 
. * divestment
. bys frame_id_numeric (year): gen divest = sum(owner_spell != owner_spell[_n-1
> ] & foreign == 0 & _n != 1)

. replace divest = 1 if divest > 0
(0 real changes made)

. 
. * only D, D-F F owner spells
. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (fore
> ign == 0))

. tabulate start_as_domestic

start_as_do |
     mestic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,981        5.30        5.30
          1 |    321,130       94.70      100.00
------------+-----------------------------------
      Total |    339,111      100.00

. keep if start_as_domestic
(17,981 observations deleted)

. keep if owner_spell <= 2
(3,726 observations deleted)

. drop if divest == 1
(0 observations deleted)

. 
. drop owner_spell_total divest start_as_domestic

. 
. * check foreign and expat numbers
. egen firm_tag = tag(frame_id_numeric)

. 
. count if ever_foreign
  24,745

. count if ever_foreign & firm_tag
  1,745

. count if ever_expat & firm_tag
  705

. 
. count if has_expat_ceo == 1
  5,346

. count if has_expat_ceo == 1 & foreign == 0 
  0

. count if ever_expat == 1 & ever_foreign == 0
  0

. 
. egen industry_year = group(teaor08_1d year)

. 
. *for descriptives (number of firms and firm-years in final data)
. codebook frame_id_numeric

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [10000049,74849574]           Units: 1
         Unique values: 33,685                    Missing .: 0/317,404

                  Mean: 1.4e+07
             Std. dev.: 6.6e+06

           Percentiles:     10%       25%       50%       75%       90%
                        1.0e+07   1.0e+07   1.1e+07   1.3e+07   2.4e+07

. count if firm_tag
  33,685

. count
  317,404

. 
. drop first_year_foreign time_foreign 

. 
. count
  317,404

. count if ever_foreign
  24,745

. count if ever_foreign & firm_tag
  1,745

. count if ever_expat & firm_tag
  705

. count if has_expat_ceo
  5,346

. 
. drop ever_expat ever_foreign

. egen ever_foreign = max(foreign), by(frame_id_numeric)

. * did new foreign owner hire any ceos?
. egen ever_foreign_hire = max((hire_ceo == 1) & (foreign == 1) * (owner_spell 
> == 2)), by(frame_id_numeric)

. generate foreign_hire = ever_foreign_hire & foreign

. 
. * check the patterns of expat - local transitions. 
. local ceo has_expat_ceo

. bys frame_id_numeric (year): generate ceo_foreign_spell = sum(`ceo' != `ceo'[
> _n-1])

. 
. * drop after first expat leaves
. drop if ceo_foreign_spell > 2
(2,015 observations deleted)

. drop if ceo_foreign_spell == 2 & has_expat_ceo == 0
(0 observations deleted)

. 
. keep if ever_foreign == 1
(292,659 observations deleted)

. 
. generate foreign_only = foreign & !foreign_hire

. generate local_ceo = foreign_hire & !has_expat_ceo

. egen ever_local_ceo = max(local_ceo), by(frame_id_numeric)

. 
. * drop if local hires are much later replaced by expats
. drop if ever_local_ceo & has_expat_ceo
(1,288 observations deleted)

. 
. tabulate foreign_only foreign_hire

foreign_on |     foreign_hire
        ly |         0          1 |     Total
-----------+----------------------+----------
         0 |    10,695      8,666 |    19,361 
         1 |     2,081          0 |     2,081 
-----------+----------------------+----------
     Total |    12,776      8,666 |    21,442 

. tabulate local_ceo has_expat_ceo

           |     has_expat_ceo
 local_ceo |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,776      3,507 |    16,283 
         1 |     5,159          0 |     5,159 
-----------+----------------------+----------
     Total |    17,935      3,507 |    21,442 

. 
. keep if ever_foreign_hire
(5,486 observations deleted)

. * no variation in these, drop
. drop ever_foreign ever_foreign_hire

. 
. egen first_year_foreign = min(cond(foreign==1, year, .)), by(frame_id_numeric
> ) 

. generate time_foreign = year - first_year_foreign

. 
. egen ever_expat = max(has_expat_ceo), by(frame_id_numeric)

. 
. * limit sample to event window
. keep if inrange(time_foreign, -10, 5)
(4,920 observations deleted)

. 
. egen exporter_pre = max(exporter & (time_foreign < 0)), by(frame_id_numeric)

. 
. compress
  variable year was float now int
  variable minyear was float now int
  variable maxyear was float now int
  variable exporter_5 was float now byte
  variable age was float now byte
  variable owner_spell was float now byte
  variable industry_year was float now int
  variable foreign_hire was float now byte
  variable ceo_foreign_spell was float now byte
  variable foreign_only was float now byte
  variable local_ceo was float now byte
  variable ever_local_ceo was float now byte
  variable first_year_foreign was float now int
  variable time_foreign was float now byte
  variable ever_expat was float now byte
  variable exporter_pre was float now byte
  variable originalid was double now long
  variable sales was double now long
  variable tanass was double now long
  variable jetok was double now long
  variable export was double now long
  variable ranyag was double now long
  variable immat was double now long
  variable final_netgep was double now long
  variable tanass_18 was double now long
  (871,844 bytes saved)

. save "`here'/temp/analysis_sample.dta", replace
file /Users/koren/Tresorit/Mac/projects/expat//temp/analysis_sample.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/analysis_sample.l
> og
  log type:  text
 closed on:  26 Jan 2024, 16:01:53
-------------------------------------------------------------------------------
