-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/analysis_sample.l
> og
  log type:  text
 opened on:   6 May 2024, 19:29:36

. 
. use "`here'/temp/balance-small-clean.dta"

. drop foreign

. 
. merge 1:1 frame_id_numeric year using "`here'/temp/firm_events.dta", keep(mat
> ch) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           614,307  
    -----------------------------------------

. 
. * many foreign changes deleted
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric (year): egen owner_spell_total = total(foreign != foreig
> n[_n-1])

. tabulate owner_spell_total

owner_spell |
     _total |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    542,597       88.33       88.33
          2 |     45,137        7.35       95.67
          3 |     18,290        2.98       98.65
          4 |      5,023        0.82       99.47
          5 |      2,131        0.35       99.82
          6 |        769        0.13       99.94
          7 |        255        0.04       99.98
          8 |         55        0.01       99.99
          9 |         50        0.01      100.00
------------+-----------------------------------
      Total |    614,307      100.00

. 
. drop if owner_spell_total > 3 
(8,283 observations deleted)

. 
. * divestment
. bys frame_id_numeric (year): gen divest = sum(owner_spell != owner_spell[_n-1
> ] & foreign == 0 & _n != 1)

. replace divest = 1 if divest > 0
(0 real changes made)

. 
. * only D, D-F F owner spells
. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (fore
> ign == 0))

. tabulate start_as_domestic

start_as_do |
     mestic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,577       12.97       12.97
          1 |    527,447       87.03      100.00
------------+-----------------------------------
      Total |    606,024      100.00

. keep if start_as_domestic
(78,577 observations deleted)

. keep if owner_spell <= 2
(5,381 observations deleted)

. drop if divest == 1
(0 observations deleted)

. 
. drop owner_spell_total divest start_as_domestic

. 
. * check foreign and expat numbers
. egen firm_tag = tag(frame_id_numeric)

. 
. count if ever_foreign
  32,602

. count if ever_foreign & firm_tag
  2,456

. count if ever_expat & firm_tag
  858

. 
. count if has_expat_ceo == 1
  6,206

. count if has_expat_ceo == 1 & foreign == 0 
  16

. count if ever_expat == 1 & ever_foreign == 0
  0

. 
. egen industry_year = group(teaor08_1d year)

. 
. *for descriptives (number of firms and firm-years in final data)
. codebook frame_id_numeric

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [10000049,74849574]           Units: 1
         Unique values: 41,847                    Missing .: 0/522,066

                  Mean: 1.4e+07
             Std. dev.: 6.9e+06

           Percentiles:     10%       25%       50%       75%       90%
                        1.0e+07   1.1e+07   1.1e+07   1.3e+07   2.3e+07

. count if firm_tag
  41,847

. count
  522,066

. 
. count if ever_foreign
  32,602

. count if ever_foreign & firm_tag
  2,456

. count if ever_expat & firm_tag
  858

. count if has_expat_ceo
  6,206

. 
. drop ever_expat ever_foreign

. egen ever_foreign = max(foreign), by(frame_id_numeric)

. * did new foreign owner hire any ceos?
. egen ever_foreign_hire = max((hire_ceo == 1) & (foreign == 1) * (owner_spell 
> == 2)), by(frame_id_numeric)

. generate foreign_hire = ever_foreign_hire & foreign

. 
. * check the patterns of expat - local transitions. 
. local ceo has_expat_ceo

. bys frame_id_numeric (year): generate ceo_foreign_spell = sum(`ceo' != `ceo'[
> _n-1])

. 
. * drop after first expat leaves
. drop if ceo_foreign_spell > 2
(2,210 observations deleted)

. drop if ceo_foreign_spell == 2 & has_expat_ceo == 0
(0 observations deleted)

. 
. keep if ever_foreign == 1
(489,464 observations deleted)

. 
. generate foreign_only = foreign & !foreign_hire

. generate local_ceo = foreign_hire & !has_expat_ceo

. egen ever_local_ceo = max(local_ceo), by(frame_id_numeric)

. 
. * drop if local hires are much later replaced by expats
. drop if ever_local_ceo & has_expat_ceo
(1,564 observations deleted)

. * sometimes we refer to the short name
. clonevar ever_local = ever_local_ceo

. 
. tabulate foreign_only foreign_hire

foreign_on |     foreign_hire
        ly |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,041     12,327 |    27,368 
         1 |     1,460          0 |     1,460 
-----------+----------------------+----------
     Total |    16,501     12,327 |    28,828 

. tabulate local_ceo has_expat_ceo

           |     has_expat_ceo
 local_ceo |         0          1 |     Total
-----------+----------------------+----------
         0 |    16,469      4,057 |    20,526 
         1 |     8,302          0 |     8,302 
-----------+----------------------+----------
     Total |    24,771      4,057 |    28,828 

. 
. keep if ever_foreign_hire
(4,941 observations deleted)

. * no variation in these, drop
. drop ever_foreign ever_foreign_hire

. 
. egen first_year_foreign = min(cond(foreign==1, year, .)), by(frame_id_numeric
> ) 
(2 missing values generated)

. generate time_foreign = year - first_year_foreign
(2 missing values generated)

. 
. egen ever_expat = max(has_expat_ceo), by(frame_id_numeric)

. 
. * limit sample to event window
. keep if inrange(time_foreign, -6, 4)
(9,557 observations deleted)

. 
. egen exporter_pre = max(exporter & inrange(time_foreign, -3, -1)), by(frame_i
> d_numeric)

. * different ways of measuring export orientation
. clonevar export_entry = exporter

. replace export_entry = . if exporter_pre == 1
(7,704 real changes made, 7,704 to missing)

. 
. *Create teaor in year -1, drop agriculture
. 
. egen teaor08_1d_num = group(teaor08_1d)

. tempvar last_year_before 

. egen `last_year_before' = max(cond(time_foreign < 0, year,.)), by(frame_id_nu
> meric)
(19 missing values generated)

. drop if missing(`last_year_before')
(19 observations deleted)

. 
. egen teaor08_2d_pre = max(cond(year==`last_year_before', teaor08_2d, .)), by(
> frame_id_numeric)

. egen teaor08_1d_pre = max(cond(year==`last_year_before', teaor08_1d_num, .)),
>  by(frame_id_numeric)

. assert !missing(teaor08_2d_pre)

. drop `last_year_before'

. 
. * compute TFP
. 
. local agriculture 1 3

. local industry 5 39

. local services 40 75

. 
. generate TFP = .
(14,311 missing values generated)

. tempvar TFP

. foreach sector in agriculture industry services {
  2.     local from : word 1 of ``sector''
  3.     local to : word 2 of ``sector''
  4.     quietly regress lnQ lnK lnL lnM i.teaor08_2d##year if inrange(industry
> _mode, `from', `to')
  5.     predict `TFP' if e(sample), resid
  6.     replace TFP = `TFP' if inrange(industry_mode, `from', `to')
  7.     drop `TFP'
  8. }
(13,634 missing values generated)
(677 real changes made)
(8,677 missing values generated)
(5,634 real changes made)
(6,311 missing values generated)
(8,000 real changes made)

. 
. tabulate foreignness has_expat_ceo

                      |     has_expat_ceo
    (max) foreignness |         0          1 |     Total
----------------------+----------------------+----------
Hungarian name and ad |    12,212          0 |    12,212 
Hungarian name, neigh |         0         49 |        49 
Foreign name, Hungari |         0        123 |       123 
Hungarian name, other |         0          6 |         6 
Foreign name, non-Wes |         0        282 |       282 
Foreign name, Western |         0      1,639 |     1,639 
----------------------+----------------------+----------
                Total |    12,212      2,099 |    14,311 

. tabulate time_foreign foreignness if inrange(time_foreign, -2, 2) & ever_expa
> t 

time_forei |                   (max) foreignness
        gn | Hungarian  Hungarian  Foreign n  Hungarian  Foreign n |     Total
-----------+-------------------------------------------------------+----------
        -2 |       339          0          1          0          0 |       340 
        -1 |       560          0          1          0          0 |       570 
         0 |         0         19         32          2         93 |       593 
         1 |         0         14         27          1         59 |       469 
         2 |         0          9         22          1         53 |       395 
-----------+-------------------------------------------------------+----------
     Total |       899         42         83          4        205 |     2,367 


           |   (max)
           | foreignnes
time_forei |     s
        gn | Foreign n |     Total
-----------+-----------+----------
        -2 |         0 |       340 
        -1 |         9 |       570 
         0 |       447 |       593 
         1 |       368 |       469 
         2 |       310 |       395 
-----------+-----------+----------
     Total |     1,134 |     2,367 

. 
. * keep only western foreigners and locals with Hungarian names
. egen always0 = min(foreignness == 0), by(frame_id_numeric )

. egen ever5 = max(foreignness == 5), by(frame_id_numeric )

. tab always0 ever5 

           |         ever5
   always0 |         0          1 |     Total
-----------+----------------------+----------
         0 |       853      3,081 |     3,934 
         1 |    10,377          0 |    10,377 
-----------+----------------------+----------
     Total |    11,230      3,081 |    14,311 

. keep if always0 | ever5 
(853 observations deleted)

. drop always0 ever5

. 
. tabulate time_foreign has_expat_ceo 

time_forei |     has_expat_ceo
        gn |         0          1 |     Total
-----------+----------------------+----------
        -6 |       712          0 |       712 
        -5 |       816          0 |       816 
        -4 |       959          0 |       959 
        -3 |     1,132          0 |     1,132 
        -2 |     1,348          0 |     1,348 
        -1 |     1,812          9 |     1,821 
         0 |     1,436        455 |     1,891 
         1 |     1,223        376 |     1,599 
         2 |       945        322 |     1,267 
         3 |       758        286 |     1,044 
         4 |       619        250 |       869 
-----------+----------------------+----------
     Total |    11,760      1,698 |    13,458 

. 
. compress
  variable year was float now int
  variable minyear was float now int
  variable maxyear was float now int
  variable exporter_5 was float now byte
  variable age was float now byte
  variable owner_spell was float now byte
  variable industry_year was float now int
  variable foreign_hire was float now byte
  variable ceo_foreign_spell was float now byte
  variable foreign_only was float now byte
  variable local_ceo was float now byte
  variable ever_local_ceo was float now byte
  variable ever_local was float now byte
  variable first_year_foreign was float now int
  variable time_foreign was float now byte
  variable ever_expat was float now byte
  variable exporter_pre was float now byte
  variable teaor08_1d_num was float now byte
  variable teaor08_2d_pre was float now byte
  variable teaor08_1d_pre was float now byte
  variable originalid was double now long
  variable sales was double now long
  variable tanass was double now long
  variable jetok was double now long
  variable export was double now long
  variable ranyag was double now long
  variable immat was double now long
  variable final_netgep was double now long
  variable tanass_18 was double now long
  (1,224,678 bytes saved)

. save "`here'/temp/analysis_sample.dta", replace
file /Users/koren/Tresorit/Mac/projects/expat//temp/analysis_sample.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/analysis_sample.l
> og
  log type:  text
 closed on:   6 May 2024, 19:30:01
-------------------------------------------------------------------------------
