--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/attgt_att_split.log
  log type:  text
 opened on:   3 Apr 2022, 15:41:36

. 
. local pre 5

. local post 10

. local vars lnL lnQL lnK exporter RperK TFP_cd

. local controls lnQ lnK lnL lnM exporter

. 
. use "`here'/temp/analysis_sample.dta", clear

. keep if ever_foreign
(0 observations deleted)

. 
. count
  11,501

. 
. rename has_expat_ceo expat_hire

. generate local_hire = foreign_hire & !expat_hire

. generate no_hire = foreign & !foreign_hire

. 
. foreach treatment in no_hire local_hire expat_hire {
  2.     attgt `vars' if year <= 2003, treatment(`treatment') aggregate(att) pre(`pre') post(`post') notyet limitcontrol(foreign == 0) ipw(`controls')
  3.     count if e(sample) == 1
  4.     eststo m`var', title("before 2004 `var'")
  5. }

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1985 to 2018, but with gaps
         Delta: 1 unit
Generating weights...

                          __000001
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%     .0025686              0       Obs              11,501
25%      .041807              0       Sum of wgt.      11,501

50%            1                      Mean           .6666879
                        Largest       Std. dev.      .5289346
75%            1       8.999998
90%            1       8.999998       Variance       .2797718
95%            1       8.999998       Skewness       3.294092
99%            1       8.999998       Kurtosis       59.78337
Estimating lnL: att
Estimating lnQL: att
Estimating lnK: att
Estimating exporter: att
Estimating RperK: att
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                             Number of obs = 0

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
lnL          |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
lnQL         |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
lnK          |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
exporter     |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
RperK        |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
TFP_cd       |
         att |          0  (omitted)
------------------------------------------------------------------------------
  0

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1985 to 2018, but with gaps
         Delta: 1 unit
Generating weights...

                          __000001
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%     .0015064              0       Obs              11,501
25%     .0377296              0       Sum of wgt.      11,501

50%            1                      Mean           1.015729
                        Largest       Std. dev.      1.706547
75%            1       8.999998
90%            1       8.999998       Variance       2.912303
95%            1       8.999998       Skewness       4.114572
99%     8.999998       8.999998       Kurtosis        19.5788
Estimating lnL: att
Estimating lnQL: att
Estimating lnK: att
Estimating exporter: att
Estimating RperK: att
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                             Number of obs = 0

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
lnL          |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
lnQL         |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
lnK          |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
exporter     |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
RperK        |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
TFP_cd       |
         att |          0  (omitted)
------------------------------------------------------------------------------
  0

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1985 to 2018, but with gaps
         Delta: 1 unit
Generating weights...

                          __000001
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%     .0111176              0       Obs              11,501
25%     .0536876              0       Sum of wgt.      11,501

50%            1                      Mean           .6634212
                        Largest       Std. dev.      .4570641
75%            1       1.097771
90%            1       1.173349       Variance       .2089076
95%            1       1.173349       Skewness      -.5466315
99%            1       5.018028       Kurtosis       2.115168
Estimating lnL: att
Estimating lnQL: att
Estimating lnK: att
Estimating exporter: att
Estimating RperK: att
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                             Number of obs = 0

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
lnL          |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
lnQL         |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
lnK          |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
exporter     |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
RperK        |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
TFP_cd       |
         att |          0  (omitted)
------------------------------------------------------------------------------
  0

. 
. foreach treatment in no_hire local_hire expat_hire {
  2.     attgt `vars' if year >= 2004, treatment(`treatment') aggregate(att) pre(`pre') post(`post') notyet limitcontrol(foreign == 0) ipw(`controls')
  3.     count if e(sample) == 1
  4.     eststo m`var', title("after 2003 `var'")
  5. }

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1985 to 2018, but with gaps
         Delta: 1 unit
Generating weights...

                          __000001
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     .0601277              0
10%      .329548              0       Obs              11,501
25%            1              0       Sum of wgt.      11,501

50%            1                      Mean           .9562211
                        Largest       Std. dev.      .7121531
75%            1       8.999998
90%            1       8.999998       Variance        .507162
95%            1       8.999998       Skewness        9.24963
99%            1       8.999998       Kurtosis       106.6446
Estimating lnL: att
Estimating lnQL: att
Estimating lnK: att
Estimating exporter: att
Estimating RperK: att
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                             Number of obs = 0

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
lnL          |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
lnQL         |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
lnK          |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
exporter     |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
RperK        |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
TFP_cd       |
         att |          0  (omitted)
------------------------------------------------------------------------------
  0

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1985 to 2018, but with gaps
         Delta: 1 unit
Generating weights...

                          __000001
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     .0286801              0
10%     .1530884              0       Obs              11,501
25%            1              0       Sum of wgt.      11,501

50%            1                      Mean            .893261
                        Largest       Std. dev.      .3715478
75%            1       8.999998
90%            1       8.999998       Variance       .1380477
95%            1       8.999998       Skewness       5.933069
99%            1       8.999998       Kurtosis       160.7554
Estimating lnL: att
Estimating lnQL: att
Estimating lnK: att
Estimating exporter: att
Estimating RperK: att
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                             Number of obs = 0

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
lnL          |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
lnQL         |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
lnK          |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
exporter     |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
RperK        |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
TFP_cd       |
         att |          0  (omitted)
------------------------------------------------------------------------------
  0

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1985 to 2018, but with gaps
         Delta: 1 unit
Generating weights...

                          __000001
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     .0427503              0
10%     .1685459              0       Obs              11,501
25%            1              0       Sum of wgt.      11,501

50%            1                      Mean            .890414
                        Largest       Std. dev.      .2991333
75%            1       1.376646
90%            1       1.556365       Variance       .0894807
95%            1        1.58483       Skewness      -2.319837
99%            1       3.195764       Kurtosis       7.014142
Estimating lnL: att
Estimating lnQL: att
Estimating lnK: att
Estimating exporter: att
Estimating RperK: att
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                             Number of obs = 0

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
lnL          |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
lnQL         |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
lnK          |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
exporter     |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
RperK        |
         att |          0  (omitted)
-------------+----------------------------------------------------------------
TFP_cd       |
         att |          0  (omitted)
------------------------------------------------------------------------------
  0

. 
. esttab m* using "`here'/output/table_attgt_att_split.tex", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_att_split.tex)

. esttab m* using "`here'/output/table_attgt_att_split.txt", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_att_split.txt)

. 
. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/attgt_att_split.log
  log type:  text
 closed on:   3 Apr 2022, 15:43:09
--------------------------------------------------------------------------------------------------------------------------------------------------------------
