--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/attgt_att_split.log
  log type:  text
 opened on:   4 Apr 2022, 15:03:34

. 
. local pre 2

. local post 5

. local vars lnL lnQL lnK exporter RperK TFP_cd

. local controls lnQ lnK lnL lnM exporter

. 
. use "`here'/temp/analysis_sample.dta", clear

. keep if ever_foreign
(0 observations deleted)

. 
. count
  11,501

. 
. rename has_expat_ceo expat_hire

. generate local_hire = foreign_hire & !expat_hire

. generate no_hire = foreign & !foreign_hire

. 
. foreach treatment in no_hire local_hire expat_hire {
  2.     attgt `vars' if year <= 2003, treatment(`treatment') aggregate(att) pre(`pre') post(`post') notyet limitcontrol(foreign == 0) //ipw(`controls')
  3.     count if e(sample) == 1
  4.     eststo m`var', title("before 2004 `var'")
  5. }

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1985 to 2018, but with gaps
         Delta: 1 unit
Generating weights...

                          __000001
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs              11,501
25%            1              1       Sum of wgt.      11,501

50%            1                      Mean                  1
                        Largest       Std. dev.             0
75%            1              1
90%            1              1       Variance              0
95%            1              1       Skewness              .
99%            1              1       Kurtosis              .
Estimating lnL: att
Estimating lnQL: att
Estimating lnK: att
Estimating exporter: att
Estimating RperK: att
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                         Number of obs = 5,001

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
lnL          |
         att |   .2108464   .0930164     2.27   0.023     .0285375    .3931553
-------------+----------------------------------------------------------------
lnQL         |
         att |   .1146673   .1244382     0.92   0.357    -.1292271    .3585618
-------------+----------------------------------------------------------------
lnK          |
         att |   .1996361   .1613562     1.24   0.216    -.1166163    .5158885
-------------+----------------------------------------------------------------
exporter     |
         att |   .0023419   .0270977     0.09   0.931    -.0507686    .0554524
-------------+----------------------------------------------------------------
RperK        |
         att |   .0048462   .0050334     0.96   0.336     -.005019    .0147115
-------------+----------------------------------------------------------------
TFP_cd       |
         att |   .0126196   .0438557     0.29   0.774    -.0733359    .0985751
------------------------------------------------------------------------------
  5,001

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1985 to 2018, but with gaps
         Delta: 1 unit
Generating weights...

                          __000001
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs              11,501
25%            1              1       Sum of wgt.      11,501

50%            1                      Mean                  1
                        Largest       Std. dev.             0
75%            1              1
90%            1              1       Variance              0
95%            1              1       Skewness              .
99%            1              1       Kurtosis              .
Estimating lnL: att
Estimating lnQL: att
Estimating lnK: att
Estimating exporter: att
Estimating RperK: att
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                         Number of obs = 4,811

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
lnL          |
         att |   .1460675   .1129908     1.29   0.196    -.0753903    .3675254
-------------+----------------------------------------------------------------
lnQL         |
         att |  -.1130773   .1182201    -0.96   0.339    -.3447844    .1186298
-------------+----------------------------------------------------------------
lnK          |
         att |  -.2499075   .1407962    -1.77   0.076     -.525863    .0260479
-------------+----------------------------------------------------------------
exporter     |
         att |   .0380568   .0356733     1.07   0.286    -.0318615    .1079752
-------------+----------------------------------------------------------------
RperK        |
         att |   .0026969   .0060161     0.45   0.654    -.0090945    .0144884
-------------+----------------------------------------------------------------
TFP_cd       |
         att |   .0013795   .0549026     0.03   0.980    -.1062276    .1089866
------------------------------------------------------------------------------
  4,811

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1985 to 2018, but with gaps
         Delta: 1 unit
Generating weights...

                          __000001
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs              11,501
25%            1              1       Sum of wgt.      11,501

50%            1                      Mean                  1
                        Largest       Std. dev.             0
75%            1              1
90%            1              1       Variance              0
95%            1              1       Skewness              .
99%            1              1       Kurtosis              .
Estimating lnL: att
Estimating lnQL: att
Estimating lnK: att
Estimating exporter: att
Estimating RperK: att
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                         Number of obs = 5,354

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
lnL          |
         att |   .2012541    .076248     2.64   0.008     .0518109    .3506974
-------------+----------------------------------------------------------------
lnQL         |
         att |   .3680477   .1096122     3.36   0.001     .1532116    .5828837
-------------+----------------------------------------------------------------
lnK          |
         att |     .24554   .1153288     2.13   0.033     .0194998    .4715803
-------------+----------------------------------------------------------------
exporter     |
         att |   .0606744   .0285844     2.12   0.034     .0046499    .1166988
-------------+----------------------------------------------------------------
RperK        |
         att |  -.0005504   .0062316    -0.09   0.930    -.0127641    .0116632
-------------+----------------------------------------------------------------
TFP_cd       |
         att |   .1441596   .0467455     3.08   0.002     .0525401    .2357791
------------------------------------------------------------------------------
  5,354

. 
. foreach treatment in no_hire local_hire expat_hire {
  2.     attgt `vars' if year >= 2004, treatment(`treatment') aggregate(att) pre(`pre') post(`post') notyet limitcontrol(foreign == 0) //ipw(`controls')
  3.     count if e(sample) == 1
  4.     eststo m`var', title("after 2003 `var'")
  5. }

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1985 to 2018, but with gaps
         Delta: 1 unit
Generating weights...

                          __000001
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs              11,501
25%            1              1       Sum of wgt.      11,501

50%            1                      Mean                  1
                        Largest       Std. dev.             0
75%            1              1
90%            1              1       Variance              0
95%            1              1       Skewness              .
99%            1              1       Kurtosis              .
Estimating lnL: att
Estimating lnQL: att
Estimating lnK: att
Estimating exporter: att
Estimating RperK: att
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                         Number of obs = 1,995

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
lnL          |
         att |  -.0362782   .0875924    -0.41   0.679    -.2079561    .1353998
-------------+----------------------------------------------------------------
lnQL         |
         att |   .0341146   .1249507     0.27   0.785    -.2107843    .2790135
-------------+----------------------------------------------------------------
lnK          |
         att |  -.1209637   .1025575    -1.18   0.238    -.3219728    .0800453
-------------+----------------------------------------------------------------
exporter     |
         att |  -.0123528   .0335677    -0.37   0.713    -.0781443    .0534386
-------------+----------------------------------------------------------------
RperK        |
         att |   .0117654   .0132602     0.89   0.375     -.014224    .0377549
-------------+----------------------------------------------------------------
TFP_cd       |
         att |  -.0105852   .0453137    -0.23   0.815    -.0993985     .078228
------------------------------------------------------------------------------
  1,995

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1985 to 2018, but with gaps
         Delta: 1 unit
Generating weights...

                          __000001
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs              11,501
25%            1              1       Sum of wgt.      11,501

50%            1                      Mean                  1
                        Largest       Std. dev.             0
75%            1              1
90%            1              1       Variance              0
95%            1              1       Skewness              .
99%            1              1       Kurtosis              .
Estimating lnL: att
Estimating lnQL: att
Estimating lnK: att
Estimating exporter: att
Estimating RperK: att
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                         Number of obs = 1,927

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
lnL          |
         att |   .2543518   .1314162     1.94   0.053    -.0032193    .5119229
-------------+----------------------------------------------------------------
lnQL         |
         att |   .1073104   .1876237     0.57   0.567    -.2604253    .4750461
-------------+----------------------------------------------------------------
lnK          |
         att |   .2973865   .2171833     1.37   0.171    -.1282849    .7230579
-------------+----------------------------------------------------------------
exporter     |
         att |   .0003962   .0334304     0.01   0.991    -.0651263    .0659186
-------------+----------------------------------------------------------------
RperK        |
         att |   .0070542   .0133261     0.53   0.597    -.0190644    .0331728
-------------+----------------------------------------------------------------
TFP_cd       |
         att |   -.003934   .0373489    -0.11   0.916    -.0771366    .0692685
------------------------------------------------------------------------------
  1,927

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1985 to 2018, but with gaps
         Delta: 1 unit
Generating weights...

                          __000001
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs              11,501
25%            1              1       Sum of wgt.      11,501

50%            1                      Mean                  1
                        Largest       Std. dev.             0
75%            1              1
90%            1              1       Variance              0
95%            1              1       Skewness              .
99%            1              1       Kurtosis              .
Estimating lnL: att
Estimating lnQL: att
Estimating lnK: att
Estimating exporter: att
Estimating RperK: att
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                         Number of obs = 1,992

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
lnL          |
         att |   .1451078   .1212051     1.20   0.231    -.0924498    .3826655
-------------+----------------------------------------------------------------
lnQL         |
         att |   .4580027   .2170862     2.11   0.035     .0325216    .8834838
-------------+----------------------------------------------------------------
lnK          |
         att |   .2109867   .1747232     1.21   0.227    -.1314644    .5534378
-------------+----------------------------------------------------------------
exporter     |
         att |   .0725848   .0493133     1.47   0.141    -.0240675     .169237
-------------+----------------------------------------------------------------
RperK        |
         att |   .0350309   .0210282     1.67   0.096    -.0061837    .0762455
-------------+----------------------------------------------------------------
TFP_cd       |
         att |   .1321085    .063994     2.06   0.039     .0066825    .2575344
------------------------------------------------------------------------------
  1,992

. 
. esttab m* using "`here'/output/table_attgt_att_split.tex", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_att_split.tex)

. esttab m* using "`here'/output/table_attgt_att_split.txt", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_att_split.txt)

. 
. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/attgt_att_split.log
  log type:  text
 closed on:   4 Apr 2022, 15:04:12
--------------------------------------------------------------------------------------------------------------------------------------------------------------
