-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Documents/expat-geneva//output/balance.log
  log type:  text
 opened on:   6 May 2022, 19:19:47

. 
. use "`here'/input/merleg-expat/balance-small.dta"

. 
. * keep only numeric part of frame_id
. keep if substr(frame_id, 1, 2) == "ft"
(214,062 observations deleted)

. generate long frame_id_numeric = real(substr(frame_id, 3, 8))

. codebook frame_id*

-------------------------------------------------------------------------------
frame_id               Frame_id identify one firm. Only_originalid if not valid
-------------------------------------------------------------------------------

                  Type: String (str15), but longest is str10

         Unique values: 918,978                   Missing "": 0/8,122,237

              Examples: "ft11653592"
                        "ft13650485"
                        "ft21145467"
                        "ft24151038"

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [10000049,77902216]           Units: 1
         Unique values: 918,978                   Missing .: 0/8,122,237

                  Mean: 1.8e+07
             Std. dev.: 6.6e+06

           Percentiles:     10%       25%       50%       75%       90%
                        1.1e+07   1.2e+07   2.0e+07   2.3e+07   2.7e+07

. drop frame_id

. xtset frame_id_numeric year

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. 
. do "code/create/emp_clean"

. cap drop emp_cl

. clonevar emp_cl=emp
(831,002 missing values generated)

. 
. xtset frame_id_numeric year

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. 
. replace emp_cl=l.emp_cl if 8*emp_cl<l.emp_cl & 8*emp_cl<f.emp_cl & f.emp_cl!=
> . & l.emp_cl!=. & l.emp_cl>0 & emp_cl>0 & f.emp_cl>0 & 1.1*f.emp_cl>l.emp_cl 
> & f.emp_cl>50 & l.emp_cl>50 /*29*/
(1 real change made)

. replace emp_cl=l.emp_cl if emp_cl>8*l.emp_cl & emp_cl>8*f.emp_cl & f.emp_cl!=
> . & l.emp_cl!=. & emp_cl!=. & l.emp_cl>0 & f.emp_cl>0 & 1.1*l.emp_cl>f.emp_cl
>  & f.emp_cl>50 & l.emp_cl>50 /*20*/
(3 real changes made)

. 
. replace emp_cl=. if 8*emp_cl<l.emp_cl & 8*emp_cl<f.emp_cl & f.emp_cl!=. & l.e
> mp_cl!=. & l.emp_cl>0 & emp_cl>0 & f.emp_cl>0 /*& 1.1*f.emp_cl<l.emp_cl 73*/
(1 real change made, 1 to missing)

. replace emp_cl=. if emp_cl>8*l.emp_cl & emp_cl>8*f.emp_cl & f.emp_cl!=. & l.e
> mp_cl!=. & emp_cl!=. & l.emp_cl>0 & f.emp_cl>0 /*& 1.1*l.emp_cl<f.emp_cl 114*
> /
(3 real changes made, 3 to missing)

. 
. 
. * if emp<6
. replace emp_cl=0 if emp_cl>6 & l.emp_cl==0 & f.emp_cl==0 & emp_cl!=. /*418*/
(0 real changes made)

. replace emp_cl=l.emp_cl if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. 
> & f.emp_cl!=. & l.emp_cl+5>f.emp_cl /*1630*/
(0 real changes made)

. replace emp_cl=l.emp_cl if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. 
> & f.emp_cl!=. & l.emp_cl<f.emp_cl+5 /*532*/
(0 real changes made)

. 
. replace emp_cl=. if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. & f.emp
> _cl!=. & l.emp_cl+5<f.emp_cl /*0*/
(0 real changes made)

. replace emp_cl=. if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. & f.emp
> _cl!=. & l.emp_cl>f.emp_cl+5 /*0*/
(0 real changes made)

. 
. ***** Last year
. bysort frame_id_numeric: egen lastyear=max(year)

. foreach i of numlist 1980/2018 {
  2. 
.     local j=`i'+1
  3. 
.     gen j1=emp_cl if year == `i'
  4.     gen j2=emp_cl if year == `j'
  5.    
.     bysort frame_id_numeric: egen v=mean(j1)
  6.     bysort frame_id_numeric: egen w=mean(j2)
  7.    
.     sort frame_id_numeric year
  8.    
.     replace emp_cl=. if 8*v<w & v>0 & w!=. & lastyear==`j' & year==`j'
  9.     replace emp_cl=. if 8*w<v & w>0 & v!=. & lastyear==`j' & year==`j'
 10.    
.     replace emp_cl=. if v>5 & w==0 & v!=. & lastyear==`j' & year==`j'
 11.     replace emp_cl=. if w>5 & v==0 & w!=. & lastyear==`j' & year==`j'
 12.    
.     drop j1 j2 v w      
 13. }
(8,119,007 missing values generated)
(8,118,973 missing values generated)
(8,043,649 missing values generated)
(8,042,916 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,973 missing values generated)
(8,118,968 missing values generated)
(8,042,916 missing values generated)
(8,042,872 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,968 missing values generated)
(8,118,952 missing values generated)
(8,042,872 missing values generated)
(8,042,676 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,952 missing values generated)
(8,118,935 missing values generated)
(8,042,676 missing values generated)
(8,042,455 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,935 missing values generated)
(8,118,396 missing values generated)
(8,042,455 missing values generated)
(8,035,110 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,396 missing values generated)
(8,118,023 missing values generated)
(8,035,110 missing values generated)
(8,031,369 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,023 missing values generated)
(8,117,556 missing values generated)
(8,031,369 missing values generated)
(8,027,046 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,117,556 missing values generated)
(8,117,199 missing values generated)
(8,027,046 missing values generated)
(8,023,304 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,117,199 missing values generated)
(8,114,932 missing values generated)
(8,023,304 missing values generated)
(7,991,929 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,114,932 missing values generated)
(8,099,603 missing values generated)
(7,991,929 missing values generated)
(7,781,163 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,099,603 missing values generated)
(8,083,067 missing values generated)
(7,781,163 missing values generated)
(7,533,878 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,083,067 missing values generated)
(8,030,023 missing values generated)
(7,533,878 missing values generated)
(6,818,421 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,030,023 missing values generated)
(8,006,112 missing values generated)
(6,818,421 missing values generated)
(6,432,340 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,006,112 missing values generated)
(7,976,485 missing values generated)
(6,432,340 missing values generated)
(5,983,120 missing values generated)
(0 real changes made)
(0 real changes made)
(2 real changes made, 2 to missing)
(0 real changes made)
(7,976,487 missing values generated)
(7,959,384 missing values generated)
(5,983,128 missing values generated)
(5,659,002 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,959,384 missing values generated)
(7,934,466 missing values generated)
(5,659,002 missing values generated)
(5,241,341 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,934,466 missing values generated)
(7,914,304 missing values generated)
(5,241,341 missing values generated)
(4,882,443 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,914,305 missing values generated)
(7,889,092 missing values generated)
(4,882,448 missing values generated)
(4,504,892 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(4 real changes made, 4 to missing)
(7,889,098 missing values generated)
(7,880,300 missing values generated)
(4,504,923 missing values generated)
(4,319,657 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,880,301 missing values generated)
(7,858,664 missing values generated)
(4,319,665 missing values generated)
(4,006,429 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,858,664 missing values generated)
(7,838,120 missing values generated)
(4,006,429 missing values generated)
(3,733,130 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,838,120 missing values generated)
(7,838,103 missing values generated)
(3,733,130 missing values generated)
(3,655,597 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(7,838,106 missing values generated)
(7,833,013 missing values generated)
(3,655,615 missing values generated)
(3,554,256 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,833,014 missing values generated)
(7,819,534 missing values generated)
(3,554,259 missing values generated)
(3,371,669 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,819,536 missing values generated)
(7,868,099 missing values generated)
(3,371,680 missing values generated)
(4,020,193 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,868,100 missing values generated)
(7,856,206 missing values generated)
(4,020,200 missing values generated)
(3,853,389 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,856,206 missing values generated)
(7,845,401 missing values generated)
(3,853,389 missing values generated)
(3,742,290 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,845,403 missing values generated)
(7,802,241 missing values generated)
(3,742,303 missing values generated)
(3,258,442 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,802,242 missing values generated)
(7,799,936 missing values generated)
(3,258,445 missing values generated)
(3,272,886 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,799,936 missing values generated)
(7,788,455 missing values generated)
(3,272,886 missing values generated)
(3,185,303 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,788,455 missing values generated)
(7,788,116 missing values generated)
(3,185,303 missing values generated)
(3,270,591 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,788,117 missing values generated)
(7,792,943 missing values generated)
(3,270,595 missing values generated)
(3,406,140 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,792,945 missing values generated)
(7,796,323 missing values generated)
(3,406,152 missing values generated)
(3,522,940 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,796,323 missing values generated)
(7,798,550 missing values generated)
(3,522,940 missing values generated)
(3,598,562 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,798,550 missing values generated)
(7,899,704 missing values generated)
(3,598,562 missing values generated)
(5,006,992 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(2 real changes made, 2 to missing)
(7,899,707 missing values generated)
(7,756,790 missing values generated)
(5,007,006 missing values generated)
(3,149,539 missing values generated)
(0 real changes made)
(2 real changes made, 2 to missing)
(0 real changes made)
(0 real changes made)
(7,756,792 missing values generated)
(7,764,331 missing values generated)
(3,149,562 missing values generated)
(3,303,951 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,764,332 missing values generated)
(7,777,706 missing values generated)
(3,303,959 missing values generated)
(3,566,063 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,777,706 missing values generated)
(8,122,237 missing values generated)
(3,566,063 missing values generated)
(8,122,237 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. ***** First year 
. bysort frame_id_numeric: egen firstyear=min(year)

. foreach i of numlist 1981/2019 {
  2. 
.     local j=`i'-1
  3. 
.     gen j1=emp if year == `i'
  4.     gen j2=emp if year == `j'
  5.    
.     bysort frame_id_numeric: egen v=mean(j1)
  6.     bysort frame_id_numeric: egen w=mean(j2)
  7.    
.     sort frame_id_numeric year
  8.    
.     replace emp_cl=. if 8*v<w & v>0 & w!=. & firstyear==`j' & year==`j'
  9.     replace emp_cl=. if 8*w<v & w>0 & v!=. & firstyear==`j' & year==`j'
 10.    
.     replace emp_cl=. if v>5 & w==0 & v!=. & firstyear==`j' & year==`j'
 11.     replace emp_cl=. if w>5 & v==0 & w!=. & firstyear==`j' & year==`j'
 12.    
.     drop j1 j2 v w
 13. }
(8,118,973 missing values generated)
(8,119,007 missing values generated)
(8,042,916 missing values generated)
(8,043,649 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,968 missing values generated)
(8,118,973 missing values generated)
(8,042,872 missing values generated)
(8,042,916 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,952 missing values generated)
(8,118,968 missing values generated)
(8,042,676 missing values generated)
(8,042,872 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,935 missing values generated)
(8,118,952 missing values generated)
(8,042,455 missing values generated)
(8,042,676 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,396 missing values generated)
(8,118,935 missing values generated)
(8,035,110 missing values generated)
(8,042,455 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,023 missing values generated)
(8,118,396 missing values generated)
(8,031,369 missing values generated)
(8,035,110 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,117,556 missing values generated)
(8,118,023 missing values generated)
(8,027,046 missing values generated)
(8,031,369 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,117,199 missing values generated)
(8,117,556 missing values generated)
(8,023,304 missing values generated)
(8,027,046 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,114,932 missing values generated)
(8,117,199 missing values generated)
(7,991,929 missing values generated)
(8,023,304 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,099,600 missing values generated)
(8,114,932 missing values generated)
(7,781,104 missing values generated)
(7,991,929 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,083,067 missing values generated)
(8,099,600 missing values generated)
(7,533,878 missing values generated)
(7,781,104 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,030,023 missing values generated)
(8,083,067 missing values generated)
(6,818,421 missing values generated)
(7,533,878 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made, 2 to missing)
(8,006,112 missing values generated)
(8,030,023 missing values generated)
(6,432,340 missing values generated)
(6,818,421 missing values generated)
(2 real changes made, 2 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,976,485 missing values generated)
(8,006,112 missing values generated)
(5,983,120 missing values generated)
(6,432,340 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,959,384 missing values generated)
(7,976,485 missing values generated)
(5,659,002 missing values generated)
(5,983,120 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,934,466 missing values generated)
(7,959,384 missing values generated)
(5,241,341 missing values generated)
(5,659,002 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,914,304 missing values generated)
(7,934,466 missing values generated)
(4,882,443 missing values generated)
(5,241,341 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,889,092 missing values generated)
(7,914,304 missing values generated)
(4,504,892 missing values generated)
(4,882,443 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,880,300 missing values generated)
(7,889,092 missing values generated)
(4,319,657 missing values generated)
(4,504,892 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,858,664 missing values generated)
(7,880,300 missing values generated)
(4,006,429 missing values generated)
(4,319,657 missing values generated)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,838,120 missing values generated)
(7,858,664 missing values generated)
(3,733,130 missing values generated)
(4,006,429 missing values generated)
(0 real changes made)
(0 real changes made)
(2 real changes made, 2 to missing)
(5 real changes made, 5 to missing)
(7,838,103 missing values generated)
(7,838,120 missing values generated)
(3,655,597 missing values generated)
(3,733,130 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(2 real changes made, 2 to missing)
(7,833,013 missing values generated)
(7,838,103 missing values generated)
(3,554,256 missing values generated)
(3,655,597 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,819,534 missing values generated)
(7,833,013 missing values generated)
(3,371,669 missing values generated)
(3,554,256 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(7,868,099 missing values generated)
(7,819,534 missing values generated)
(4,020,193 missing values generated)
(3,371,669 missing values generated)
(0 real changes made)
(0 real changes made)
(4 real changes made, 4 to missing)
(0 real changes made)
(7,856,206 missing values generated)
(7,868,099 missing values generated)
(3,853,389 missing values generated)
(4,020,193 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,845,401 missing values generated)
(7,856,206 missing values generated)
(3,742,290 missing values generated)
(3,853,389 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,802,240 missing values generated)
(7,845,401 missing values generated)
(3,258,431 missing values generated)
(3,742,290 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(7,799,936 missing values generated)
(7,802,240 missing values generated)
(3,272,886 missing values generated)
(3,258,431 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(7,788,455 missing values generated)
(7,799,936 missing values generated)
(3,185,303 missing values generated)
(3,272,886 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(7,788,116 missing values generated)
(7,788,455 missing values generated)
(3,270,591 missing values generated)
(3,185,303 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,792,943 missing values generated)
(7,788,116 missing values generated)
(3,406,140 missing values generated)
(3,270,591 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,796,323 missing values generated)
(7,792,943 missing values generated)
(3,522,940 missing values generated)
(3,406,140 missing values generated)
(0 real changes made)
(0 real changes made)
(3 real changes made, 3 to missing)
(0 real changes made)
(7,798,550 missing values generated)
(7,796,323 missing values generated)
(3,598,562 missing values generated)
(3,522,940 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,899,704 missing values generated)
(7,798,550 missing values generated)
(5,006,992 missing values generated)
(3,598,562 missing values generated)
(0 real changes made)
(2 real changes made, 2 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,756,790 missing values generated)
(7,899,704 missing values generated)
(3,149,539 missing values generated)
(5,006,992 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,764,331 missing values generated)
(7,756,790 missing values generated)
(3,303,951 missing values generated)
(3,149,539 missing values generated)
(1 real change made, 1 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(0 real changes made)
(7,777,706 missing values generated)
(7,764,331 missing values generated)
(3,566,063 missing values generated)
(3,303,951 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,122,237 missing values generated)
(7,777,706 missing values generated)
(8,122,237 missing values generated)
(3,566,063 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. drop firstyear lastyear

. 
end of do-file

. count
  8,122,237

. count if emp == emp_cl & emp != .
  7,291,148

. count if emp != emp_cl & emp != . & emp_cl != .
  4

. count if emp != emp_cl & emp != .
  87

. count if emp != emp_cl & emp_cl != .
  4

. gen emp_add = emp_cl + 1
(831,085 missing values generated)

. corr emp emp_cl emp_add
(obs=7,291,152)

             |      emp   emp_cl  emp_add
-------------+---------------------------
         emp |   1.0000
      emp_cl |   0.9995   1.0000
     emp_add |   0.9995   1.0000   1.0000


. 
. * use fo2 instead of fo3
. merge 1:1 originalid year using "input/balance-sheet-80-19-plus-vars/balance-
> 80-19-plus-vars.dta", keep(1 3) nogen
(variable originalid was long, now double to accommodate using data's values)
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           212
        from master                       212  
        from using                          0  

    Matched                         8,122,025  
    -----------------------------------------

. tab fo2 fo3, missing
variable fo2 not found
r(111);

end of do-file
r(111);
