-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Documents/workspace/expat//output/balance.log
  log type:  text
 opened on:   6 May 2022, 15:23:59

. 
. use "`here'/input/merleg-expat/balance-small.dta"

. 
. * keep only numeric part of frame_id
. keep if substr(frame_id, 1, 2) == "ft"
(214,062 observations deleted)

. generate long frame_id_numeric = real(substr(frame_id, 3, 8))

. codebook frame_id*

-------------------------------------------------------------------------------
frame_id               Frame_id identify one firm. Only_originalid if not valid
-------------------------------------------------------------------------------

                  Type: String (str15), but longest is str10

         Unique values: 918,978                   Missing "": 0/8,122,237

              Examples: "ft11653592"
                        "ft13650485"
                        "ft21145467"
                        "ft24151038"

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [10000049,77902216]           Units: 1
         Unique values: 918,978                   Missing .: 0/8,122,237

                  Mean: 1.8e+07
             Std. dev.: 6.6e+06

           Percentiles:     10%       25%       50%       75%       90%
                        1.1e+07   1.2e+07   2.0e+07   2.3e+07   2.7e+07

. drop frame_id

. xtset frame_id_numeric year

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. 
. do "code/create/emp_clean"

. cap drop emp_cl

. clonevar emp_cl=emp
(831,002 missing values generated)

. 
. xtset frame_id_numeric year

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. 
. replace emp_cl=l.emp_cl if 8*emp_cl<l.emp_cl & 8*emp_cl<f.emp_cl & f.emp_cl!=
> . & l.emp_cl!=. & l.emp_cl>0 & emp_cl>0 & f.emp_cl>0 & 1.1*f.emp_cl>l.emp_cl 
> & f.emp_cl>50 & l.emp_cl>50 /*29*/
(1 real change made)

. replace emp_cl=l.emp_cl if emp_cl>8*l.emp_cl & emp_cl>8*f.emp_cl & f.emp_cl!=
> . & l.emp_cl!=. & emp_cl!=. & l.emp_cl>0 & f.emp_cl>0 & 1.1*l.emp_cl>f.emp_cl
>  & f.emp_cl>50 & l.emp_cl>50 /*20*/
(3 real changes made)

. 
. replace emp_cl=. if 8*emp_cl<l.emp_cl & 8*emp_cl<f.emp_cl & f.emp_cl!=. & l.e
> mp_cl!=. & l.emp_cl>0 & emp_cl>0 & f.emp_cl>0 /*& 1.1*f.emp_cl<l.emp_cl 73*/
(1 real change made, 1 to missing)

. replace emp_cl=. if emp_cl>8*l.emp_cl & emp_cl>8*f.emp_cl & f.emp_cl!=. & l.e
> mp_cl!=. & emp_cl!=. & l.emp_cl>0 & f.emp_cl>0 /*& 1.1*l.emp_cl<f.emp_cl 114*
> /
(3 real changes made, 3 to missing)

. 
. 
. * if emp<6
. replace emp_cl=0 if emp_cl>6 & l.emp_cl==0 & f.emp_cl==0 & emp_cl!=. /*418*/
(0 real changes made)

. replace emp_cl=l.emp_cl if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. 
> & f.emp_cl!=. & l.emp_cl+5>f.emp_cl /*1630*/
(0 real changes made)

. replace emp_cl=l.emp_cl if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. 
> & f.emp_cl!=. & l.emp_cl<f.emp_cl+5 /*532*/
(0 real changes made)

. 
. replace emp_cl=. if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. & f.emp
> _cl!=. & l.emp_cl+5<f.emp_cl /*0*/
(0 real changes made)

. replace emp_cl=. if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. & f.emp
> _cl!=. & l.emp_cl>f.emp_cl+5 /*0*/
(0 real changes made)

. 
. ***** Last year
. bysort frame_id_numeric: egen lastyear=max(year)

. foreach i of numlist 1980/2018 {
  2. 
.     local j=`i'+1
  3. 
.     gen j1=emp_cl if year == `i'
  4.     gen j2=emp_cl if year == `j'
  5.    
.     bysort frame_id_numeric: egen v=mean(j1)
  6.     bysort frame_id_numeric: egen w=mean(j2)
  7.    
.     sort frame_id_numeric year
  8.    
.     replace emp_cl=. if 8*v<w & v>0 & w!=. & lastyear==`j' & year==`j'
  9.     replace emp_cl=. if 8*w<v & w>0 & v!=. & lastyear==`j' & year==`j'
 10.    
.     replace emp_cl=. if v>5 & w==0 & v!=. & lastyear==`j' & year==`j'
 11.     replace emp_cl=. if w>5 & v==0 & w!=. & lastyear==`j' & year==`j'
 12.    
.     drop j1 j2 v w      
 13. }
(8,119,007 missing values generated)
(8,118,973 missing values generated)
(8,043,649 missing values generated)
(8,042,916 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,973 missing values generated)
(8,118,968 missing values generated)
(8,042,916 missing values generated)
(8,042,872 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,968 missing values generated)
(8,118,952 missing values generated)
(8,042,872 missing values generated)
(8,042,676 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,952 missing values generated)
(8,118,935 missing values generated)
(8,042,676 missing values generated)
(8,042,455 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,935 missing values generated)
(8,118,396 missing values generated)
(8,042,455 missing values generated)
(8,035,110 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,396 missing values generated)
(8,118,023 missing values generated)
(8,035,110 missing values generated)
(8,031,369 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,023 missing values generated)
(8,117,556 missing values generated)
(8,031,369 missing values generated)
(8,027,046 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,117,556 missing values generated)
(8,117,199 missing values generated)
(8,027,046 missing values generated)
(8,023,304 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,117,199 missing values generated)
(8,114,932 missing values generated)
(8,023,304 missing values generated)
(7,991,929 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,114,932 missing values generated)
(8,099,603 missing values generated)
(7,991,929 missing values generated)
(7,781,163 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,099,603 missing values generated)
(8,083,067 missing values generated)
(7,781,163 missing values generated)
(7,533,878 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,083,067 missing values generated)
(8,030,023 missing values generated)
(7,533,878 missing values generated)
(6,818,421 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,030,023 missing values generated)
(8,006,112 missing values generated)
(6,818,421 missing values generated)
(6,432,340 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,006,112 missing values generated)
(7,976,485 missing values generated)
(6,432,340 missing values generated)
(5,983,120 missing values generated)
(0 real changes made)
(0 real changes made)
(2 real changes made, 2 to missing)
(0 real changes made)
(7,976,487 missing values generated)
(7,959,384 missing values generated)
(5,983,128 missing values generated)
(5,659,002 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,959,384 missing values generated)
(7,934,466 missing values generated)
(5,659,002 missing values generated)
(5,241,341 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,934,466 missing values generated)
(7,914,304 missing values generated)
(5,241,341 missing values generated)
(4,882,443 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,914,305 missing values generated)
(7,889,092 missing values generated)
(4,882,448 missing values generated)
(4,504,892 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(4 real changes made, 4 to missing)
(7,889,098 missing values generated)
(7,880,300 missing values generated)
(4,504,923 missing values generated)
(4,319,657 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,880,301 missing values generated)
(7,858,664 missing values generated)
(4,319,665 missing values generated)
(4,006,429 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,858,664 missing values generated)
(7,838,120 missing values generated)
(4,006,429 missing values generated)
(3,733,130 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,838,120 missing values generated)
(7,838,103 missing values generated)
(3,733,130 missing values generated)
(3,655,597 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(7,838,106 missing values generated)
(7,833,013 missing values generated)
(3,655,615 missing values generated)
(3,554,256 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,833,014 missing values generated)
(7,819,534 missing values generated)
(3,554,259 missing values generated)
(3,371,669 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,819,536 missing values generated)
(7,868,099 missing values generated)
(3,371,680 missing values generated)
(4,020,193 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,868,100 missing values generated)
(7,856,206 missing values generated)
(4,020,200 missing values generated)
(3,853,389 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,856,206 missing values generated)
(7,845,401 missing values generated)
(3,853,389 missing values generated)
(3,742,290 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,845,403 missing values generated)
(7,802,241 missing values generated)
(3,742,303 missing values generated)
(3,258,442 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,802,242 missing values generated)
(7,799,936 missing values generated)
(3,258,445 missing values generated)
(3,272,886 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,799,936 missing values generated)
(7,788,455 missing values generated)
(3,272,886 missing values generated)
(3,185,303 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,788,455 missing values generated)
(7,788,116 missing values generated)
(3,185,303 missing values generated)
(3,270,591 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,788,117 missing values generated)
(7,792,943 missing values generated)
(3,270,595 missing values generated)
(3,406,140 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,792,945 missing values generated)
(7,796,323 missing values generated)
(3,406,152 missing values generated)
(3,522,940 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,796,323 missing values generated)
(7,798,550 missing values generated)
(3,522,940 missing values generated)
(3,598,562 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,798,550 missing values generated)
(7,899,704 missing values generated)
(3,598,562 missing values generated)
(5,006,992 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(2 real changes made, 2 to missing)
(7,899,707 missing values generated)
(7,756,790 missing values generated)
(5,007,006 missing values generated)
(3,149,539 missing values generated)
(0 real changes made)
(2 real changes made, 2 to missing)
(0 real changes made)
(0 real changes made)
(7,756,792 missing values generated)
(7,764,331 missing values generated)
(3,149,562 missing values generated)
(3,303,951 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,764,332 missing values generated)
(7,777,706 missing values generated)
(3,303,959 missing values generated)
(3,566,063 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,777,706 missing values generated)
(8,122,237 missing values generated)
(3,566,063 missing values generated)
(8,122,237 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. ***** First year 
. bysort frame_id_numeric: egen firstyear=min(year)

. foreach i of numlist 1981/2019 {
  2. 
.     local j=`i'-1
  3. 
.     gen j1=emp if year == `i'
  4.     gen j2=emp if year == `j'
  5.    
.     bysort frame_id_numeric: egen v=mean(j1)
  6.     bysort frame_id_numeric: egen w=mean(j2)
  7.    
.     sort frame_id_numeric year
  8.    
.     replace emp_cl=. if 8*v<w & v>0 & w!=. & firstyear==`j' & year==`j'
  9.     replace emp_cl=. if 8*w<v & w>0 & v!=. & firstyear==`j' & year==`j'
 10.    
.     replace emp_cl=. if v>5 & w==0 & v!=. & firstyear==`j' & year==`j'
 11.     replace emp_cl=. if w>5 & v==0 & w!=. & firstyear==`j' & year==`j'
 12.    
.     drop j1 j2 v w
 13. }
(8,118,973 missing values generated)
(8,119,007 missing values generated)
(8,042,916 missing values generated)
(8,043,649 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,968 missing values generated)
(8,118,973 missing values generated)
(8,042,872 missing values generated)
(8,042,916 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,952 missing values generated)
(8,118,968 missing values generated)
(8,042,676 missing values generated)
(8,042,872 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,935 missing values generated)
(8,118,952 missing values generated)
(8,042,455 missing values generated)
(8,042,676 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,396 missing values generated)
(8,118,935 missing values generated)
(8,035,110 missing values generated)
(8,042,455 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,023 missing values generated)
(8,118,396 missing values generated)
(8,031,369 missing values generated)
(8,035,110 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,117,556 missing values generated)
(8,118,023 missing values generated)
(8,027,046 missing values generated)
(8,031,369 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,117,199 missing values generated)
(8,117,556 missing values generated)
(8,023,304 missing values generated)
(8,027,046 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,114,932 missing values generated)
(8,117,199 missing values generated)
(7,991,929 missing values generated)
(8,023,304 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,099,600 missing values generated)
(8,114,932 missing values generated)
(7,781,104 missing values generated)
(7,991,929 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,083,067 missing values generated)
(8,099,600 missing values generated)
(7,533,878 missing values generated)
(7,781,104 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,030,023 missing values generated)
(8,083,067 missing values generated)
(6,818,421 missing values generated)
(7,533,878 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made, 2 to missing)
(8,006,112 missing values generated)
(8,030,023 missing values generated)
(6,432,340 missing values generated)
(6,818,421 missing values generated)
(2 real changes made, 2 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,976,485 missing values generated)
(8,006,112 missing values generated)
(5,983,120 missing values generated)
(6,432,340 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,959,384 missing values generated)
(7,976,485 missing values generated)
(5,659,002 missing values generated)
(5,983,120 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,934,466 missing values generated)
(7,959,384 missing values generated)
(5,241,341 missing values generated)
(5,659,002 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,914,304 missing values generated)
(7,934,466 missing values generated)
(4,882,443 missing values generated)
(5,241,341 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,889,092 missing values generated)
(7,914,304 missing values generated)
(4,504,892 missing values generated)
(4,882,443 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,880,300 missing values generated)
(7,889,092 missing values generated)
(4,319,657 missing values generated)
(4,504,892 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,858,664 missing values generated)
(7,880,300 missing values generated)
(4,006,429 missing values generated)
(4,319,657 missing values generated)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,838,120 missing values generated)
(7,858,664 missing values generated)
(3,733,130 missing values generated)
(4,006,429 missing values generated)
(0 real changes made)
(0 real changes made)
(2 real changes made, 2 to missing)
(5 real changes made, 5 to missing)
(7,838,103 missing values generated)
(7,838,120 missing values generated)
(3,655,597 missing values generated)
(3,733,130 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(2 real changes made, 2 to missing)
(7,833,013 missing values generated)
(7,838,103 missing values generated)
(3,554,256 missing values generated)
(3,655,597 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,819,534 missing values generated)
(7,833,013 missing values generated)
(3,371,669 missing values generated)
(3,554,256 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(7,868,099 missing values generated)
(7,819,534 missing values generated)
(4,020,193 missing values generated)
(3,371,669 missing values generated)
(0 real changes made)
(0 real changes made)
(4 real changes made, 4 to missing)
(0 real changes made)
(7,856,206 missing values generated)
(7,868,099 missing values generated)
(3,853,389 missing values generated)
(4,020,193 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,845,401 missing values generated)
(7,856,206 missing values generated)
(3,742,290 missing values generated)
(3,853,389 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,802,240 missing values generated)
(7,845,401 missing values generated)
(3,258,431 missing values generated)
(3,742,290 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(7,799,936 missing values generated)
(7,802,240 missing values generated)
(3,272,886 missing values generated)
(3,258,431 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(7,788,455 missing values generated)
(7,799,936 missing values generated)
(3,185,303 missing values generated)
(3,272,886 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(7,788,116 missing values generated)
(7,788,455 missing values generated)
(3,270,591 missing values generated)
(3,185,303 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,792,943 missing values generated)
(7,788,116 missing values generated)
(3,406,140 missing values generated)
(3,270,591 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,796,323 missing values generated)
(7,792,943 missing values generated)
(3,522,940 missing values generated)
(3,406,140 missing values generated)
(0 real changes made)
(0 real changes made)
(3 real changes made, 3 to missing)
(0 real changes made)
(7,798,550 missing values generated)
(7,796,323 missing values generated)
(3,598,562 missing values generated)
(3,522,940 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,899,704 missing values generated)
(7,798,550 missing values generated)
(5,006,992 missing values generated)
(3,598,562 missing values generated)
(0 real changes made)
(2 real changes made, 2 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,756,790 missing values generated)
(7,899,704 missing values generated)
(3,149,539 missing values generated)
(5,006,992 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,764,331 missing values generated)
(7,756,790 missing values generated)
(3,303,951 missing values generated)
(3,149,539 missing values generated)
(1 real change made, 1 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(0 real changes made)
(7,777,706 missing values generated)
(7,764,331 missing values generated)
(3,566,063 missing values generated)
(3,303,951 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,122,237 missing values generated)
(7,777,706 missing values generated)
(8,122,237 missing values generated)
(3,566,063 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. drop firstyear lastyear

. 
end of do-file

. count
  8,122,237

. count if emp == emp_cl & emp != .
  7,291,148

. count if emp != emp_cl & emp != . & emp_cl != .
  4

. count if emp != emp_cl & emp != .
  87

. count if emp != emp_cl & emp_cl != .
  4

. gen emp_add = emp_cl + 1
(831,085 missing values generated)

. corr emp emp_cl emp_add
(obs=7,291,152)

             |      emp   emp_cl  emp_add
-------------+---------------------------
         emp |   1.0000
      emp_cl |   0.9995   1.0000
     emp_add |   0.9995   1.0000   1.0000


. 
. * use fo2 instead of fo3
. merge 1:1 originalid year using "input/balance-sheet-80-19-plus-vars/balance-
> 80-19-plus-vars.dta", keep(1 3) nogen
(variable originalid was long, now double to accommodate using data's values)
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           211
        from master                       211  
        from using                          0  

    Matched                         8,122,026  
    -----------------------------------------

. tab fo2 fo3, missing

   Foreign |
     owned |
     dummy |
share>=50% |  Foreign owned dummy
 1=foreign | with ultimate owners
     0=not |     from Complex
   foreign |         0          1 |     Total
-----------+----------------------+----------
         0 | 7,433,718     66,089 | 7,499,807 
         1 |       562    621,657 |   622,219 
         . |       155         56 |       211 
-----------+----------------------+----------
     Total | 7,434,435    687,802 | 8,122,237 

. 
. * foreign fill 
. rename fo2 foreign

. *rename fo3 foreign
. tab year foreign, missing

           |  Foreign owned dummy share>=50%
      Year |     1=foreign 0=not foreign
 1980-2018 |         0          1          . |     Total
-----------+---------------------------------+----------
      1980 |     3,231          0          0 |     3,231 
      1981 |     3,265          0          0 |     3,265 
      1982 |     3,269          0          0 |     3,269 
      1983 |     3,288          0          0 |     3,288 
      1984 |     3,303          0          0 |     3,303 
      1985 |     3,868          0          0 |     3,868 
      1986 |     4,244          0          0 |     4,244 
      1987 |     4,763          0          0 |     4,763 
      1988 |     5,494          0          0 |     5,494 
      1989 |    11,073          0          0 |    11,073 
      1990 |    21,550      2,318          0 |    23,868 
      1991 |    35,976      4,790          0 |    40,766 
      1992 |    84,747     10,181          0 |    94,928 
      1993 |   103,858     13,865          1 |   117,724 
      1994 |   129,089     17,973          0 |   147,062 
      1995 |   144,443     19,660          1 |   164,104 
      1996 |   168,412     20,738          4 |   189,154 
      1997 |   187,530     21,465          7 |   209,002 
      1998 |   211,029     22,872          2 |   233,903 
      1999 |   220,774     22,409          8 |   243,191 
      2000 |   241,126     23,314          8 |   264,448 
      2001 |   260,979     23,984          6 |   284,969 
      2002 |   260,343     24,591          4 |   284,938 
      2003 |   265,304     24,832         13 |   290,149 
      2004 |   278,348     25,212         12 |   303,572 
      2005 |   286,024     24,500          3 |   310,527 
      2006 |   293,561     24,326         13 |   317,900 
      2007 |   302,533     25,606         15 |   328,154 
      2008 |   317,369     27,304         17 |   344,690 
      2009 |   324,703     27,381         13 |   352,097 
      2010 |   337,465     27,402          7 |   364,874 
      2011 |   354,468     27,282          4 |   381,754 
      2012 |   350,601     25,522          3 |   376,126 
      2013 |   387,720     24,801         19 |   412,540 
      2014 |   378,335     23,569         11 |   401,915 
      2015 |   383,683     23,650          5 |   407,338 
      2016 |   382,488     22,473         12 |   404,973 
      2017 |   376,457     21,427         10 |   397,894 
      2018 |   365,094     18,772         13 |   383,879 
-----------+---------------------------------+----------
     Total | 7,499,807    622,219        211 | 8,122,237 

. inspect foreign

foreign:  Foreign owned dummy share>=50%        Number of observations
-------------------------------------------------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero        7,499,807     7,499,807             -
|  #                         Positive      622,219       622,219             -
|  #                                   -----------   -----------   -----------
|  #                         Total       8,122,026     8,122,026             -
|  #   .                     Missing           211
+----------------------                -----------
0                     1                  8,122,237
   (2 unique values)

. *inspect jetok_18 if missing(foreign)
. recode foreign (.=0)
(211 changes made to foreign)

. 
. * interpolate small holes
. tab foreign

    Foreign |
owned dummy |
 share>=50% |
  1=foreign |
      0=not |
    foreign |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  7,500,018       92.34       92.34
          1 |    622,219        7.66      100.00
------------+-----------------------------------
      Total |  8,122,237      100.00

. tempvar before

. bys foreign: egen `before' = count(1)

. sort frame_id_numeric year

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & f2
> .foreign == 1
(311 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & f2
> .foreign == 0
(204 real changes made)

. bys frame_id_numeric (year): egen minyear = min(year)

. bys frame_id_numeric (year): egen maxyear = max(year)

. replace foreign = 1 if l.foreign == 1 & f.foreign == 1 & f2.foreign == 1 & ye
> ar == (minyear + 1)
(47 real changes made)

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & ye
> ar == (minyear + 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & f.foreign == 0 & f2.foreign == 0 & ye
> ar == (maxyear - 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & ye
> ar == (maxyear - 1)
(451 real changes made)

. tempvar after

. bys foreign: egen `after' = count(1)

. scalar foreign_interpolate = `before'-`after'

. display foreign_interpolate
-297

. 
. * foreign change
. preserve

. use "`here'/input/ceo-panel/ceo-panel.dta", clear

. * expat is changed if job_begin < 1990 in firm_panel.do, not here
. bys frame_id_numeric: egen first_year_expat = min(cond(expat == 1, year,.))
(11,659,587 missing values generated)

. duplicates drop frame_id_numeric, force

Duplicates in terms of frame_id_numeric

(12,609,931 observations deleted)

. tempfile expat

. save `expat'
file /var/folders/f4/7drmhl1d5kj3wp1r33jvx32m0000gn/T//St02488.000002 saved
    as .dta format

. restore

. 
. merge m:1 frame_id_numeric using `expat', keepusing(first_year_expat) keep(1 
> 3) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                        20,291
        from master                    20,291  
        from using                          0  

    Matched                         8,101,946  
    -----------------------------------------

. 
. bys frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.
> ))
(7,156,823 missing values generated)

.         
. generate manager_after_owner = first_year_expat - first_year_foreign
(7,440,905 missing values generated)

. generate event_time = year - first_year_expat
(7,145,545 missing values generated)

. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(2,427 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(2,894 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(30,289 real changes made)

. 
. drop manager_after_owner event_time first_year_expat

. 
. generate time_foreign = year - first_year_foreign
(7,156,823 missing values generated)

. forval i = 0/3 {
  2.         gen foreign`i' = (time_foreign == `i')
  3. }

. forval i = 1/3 {
  2.         gen foreign_`i' = (time_foreign == -`i')
  3. }

. gen count = 1

. 
. * drop greenfield
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (fore
> ign == 0))

. keep if start_as_domestic
(505,302 observations deleted)

. drop owner_spell start_as_domestic

. 
. * limit sample before large merge - sampling based on firm-level variables, f
> irm-year done later
. * average employment and financial firms deleted
. * break the tie when mode is not unique
. 
. bys frame_id_numeric: egen avg_emp = mean(emp)
(92,650 missing values generated)

. bys frame_id_numeric: egen industry_mode = mode(teaor08_2d), minmode
warning: For at least one group, teaor08_2d contains all missing values.
         Generating missing values for the modes in these groups. Use option
         missing to treat missing values as a category.
(1,279 missing values generated)

. local sample ((avg_emp >= 20) & (industry_mode != 64 & industry_mode != 65 & 
> industry_mode != 66))

. drop if !`sample'
(7,131,223 observations deleted)

. scalar dropped_size_or_finance = r(N_drop)

. display dropped_size_or_finance
7131223

. 
. * proxy firm founding date with first balance sheet filed
. tempvar foundyear

. bys frame_id_numeric: egen `foundyear' = min(year)

. replace foundyear = `foundyear' if missing(foundyear)
(0 real changes made)

. drop `foundyear'

. 
. * deflate nominal values - FIXME: add ppi before 1992
. foreach x in sales export tanass jetok ranyag ranyag8091 immat {
  2.         cap drop `x'_18
  3.         gen double `x'_18 = `x' / ppi18
  4.         replace `x'_18 = `x' if year < 1992 // FIXME: till ppi before 1992
>  is not filled up - just to not delete those rows because of missing ln depen
> dent variables
  5. }
(30,686 missing values generated)
(56,610 real changes made)
(211,130 missing values generated)
(32,097 real changes made)
(38,601 missing values generated)
(54,504 real changes made)
(30,401 missing values generated)
(55,436 real changes made)
(64,358 missing values generated)
(0 real changes made)
(24,823 missing values generated)
(56,766 real changes made)
(168,377 missing values generated)
(0 real changes made)

. 
. * change emp
. *sort frame_id_numeric year
. 
. *clonevar emp_clean = emp
. *replace emp_clean = . if (emp[_n-1] > 5 | emp[_n +1] > 5) & emp == 0
. *corr emp emp_clean
. 
. *gen emp_add = emp_clean + 1
. 
. * creating dependent variables
. gen lnL = ln(emp_add)
(101,157 missing values generated)

. *gen lnL_add = ln(emp_add)
. gen lnM = ln(ranyag_18)
(80,400 missing values generated)

. replace lnM = ln(ranyag8091_18) if year <= 1991
(56,620 real changes made)

. gen lnQ = ln(sales_18)
(54,706 missing values generated)

. gen lnQL = lnQ-lnL
(108,506 missing values generated)

. gen lnMQ = lnM - lnQ
(58,939 missing values generated)

. gen byte exporter = export_18 > 0 & export_18 != .

. gen export_share = export_18 / sales
(194,802 missing values generated)

. gen exporter_5 = (export_share > .05 & export_share != .)

. replace exporter_5 = . if export_share == .
(194,802 real changes made, 194,802 to missing)

. 
. * extrapolate capital stock
. inspect tanass_18

tanass_18:                                      Number of observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            4             1             3
|  #                         Zero           69,272        69,272             -
|  #                         Positive      401,686        75,599       326,087
|  #                                   -----------   -----------   -----------
|  #                         Total         470,962       144,872       326,090
|  #   .   .   .   .         Missing        14,750
+----------------------                -----------
-800.3072      6.09e+09                    485,712
(More than 99 unique values)

. tempvar gap 

. generate `gap' = missing(tanass_18) | (tanass_18 <= 0)

. bysort frame_id_numeric (year): generate spell = sum(`gap' != `gap'[_n-1])

. 
. egen gap_length = count(1), by(frame_id_numeric spell)

. egen max_spell = max(spell), by(frame_id_numeric)

. * if gap_length <= 2, interpolate tanass with geometric average
. bysort frame_id_numeric (year): replace tanass_18 = sqrt(tanass_18[_n-1] * ta
> nass_18[_n+1]) if gap_length==1 & `gap'==1
(22666 real changes made, 21307 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1]^0.67 * ta
> nass_18[_n+2]^0.33 if gap_length==2 & `gap'==1 & `gap'[_n-1]==0
(819 real changes made, 617 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-2]^0.33 * ta
> nass_18[_n+1]^0.67 if gap_length==2 & `gap'==1 & `gap'[_n+1]==0
(1614 real changes made, 1412 to missing)

. * at either end, extrapolate for 1 year
. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n+1] if spell=
> =1 & `gap'==1 & `gap'[_n+1]==0
(9933 real changes made)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1] if spell=
> =max_spell & `gap'==1 & `gap'[_n-1]==0
(3914 real changes made)

. 
. drop spell gap_length max_spell

. replace tanass_18 = round(tanass_18)
(338,780 real changes made)

. inspect tanass_18

tanass_18:                                      Number of observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            2             2             -
|  #                         Zero           43,571        43,571             -
|  #                         Positive      417,296       417,286            10
|  #                                   -----------   -----------   -----------
|  #                         Total         460,869       460,859            10
|  #   .   .   .   .         Missing        24,843
+----------------------                -----------
-60            6.09e+09                    485,712
(More than 99 unique values)

. 
. gen lnK = ln(tanass_18)
(68,416 missing values generated)

. gen lnKL = lnK - lnL
(110,394 missing values generated)

. generate RperK = immat / (immat + tanass)
(229,496 missing values generated)

. replace RperK = 0 if RperK < 0 | missing(immat)
(167,416 real changes made)

. label variable RperK "Share of immaterial assets [0,1]"

. 
. * firm-year deletions
. count if missing(lnK, lnQ, lnL, lnM, foreign) & year > 1991
  113,862

. count if missing(lnK, lnQ, lnL, lnM, foreign)
  117,958

. *drop if missing(lnK, lnQ, lnL, lnM, foreign) // ASK: whether year condition 
> needed
. *count
. 
. foreach var in lnK lnQ lnL lnM {
  2.         drop if missing(`var')
  3. }
(68,416 observations deleted)
(17,796 observations deleted)
(28,920 observations deleted)
(2,826 observations deleted)

. 
. *drop if missing(foreign)
. *tabstat foreign foreign_0 foreign_1 count, stat(sum) save
. *mat total = (total \ r(StatTotal))
. 
. *drop hole* x
. count
  367,754

. 
. * TFP (Cobb-Douglas)
. * FIXME: Replace CD with something fancy
. recode industry_mode (6 75 7 66 84 19 51 = .)
(531 changes made to industry_mode)

. 
. levelsof industry_mode, local(levels)
1 2 3 5 8 9 10 11 12 13 14 15 16 17 18 20 21 22 23 24 25 26 27 28 29 30 31 32 3
> 3 35 36 37 38 39 41 42 43 45 46 47 49 50 52 53 55 56 68 69 70 71 72 73 74 77 
> 78 79 80 81 82 85 86 87 88 90 91 92 93 94 95 96

.         foreach l of local levels {
  2.         disp `l'
  3.         qui reghdfe lnQ lnL lnK lnM if industry_mode == `l', a(frame_id_nu
> meric year foundyear) resid
  4.         predict tfp_cd_`l', res
  5.         }
1
(318,001 missing values generated)
2
(366,751 missing values generated)
3
(367,023 missing values generated)
5
(367,429 missing values generated)
8
(366,693 missing values generated)
9
(367,620 missing values generated)
10
(348,753 missing values generated)
11
(365,448 missing values generated)
12
(367,689 missing values generated)
13
(363,683 missing values generated)
14
(357,669 missing values generated)
15
(363,932 missing values generated)
16
(362,729 missing values generated)
17
(365,615 missing values generated)
18
(364,092 missing values generated)
20
(364,987 missing values generated)
21
(366,802 missing values generated)
22
(360,659 missing values generated)
23
(363,094 missing values generated)
24
(365,568 missing values generated)
25
(348,919 missing values generated)
26
(362,126 missing values generated)
27
(363,775 missing values generated)
28
(357,544 missing values generated)
29
(365,202 missing values generated)
30
(367,128 missing values generated)
31
(362,782 missing values generated)
32
(365,728 missing values generated)
33
(366,625 missing values generated)
35
(364,876 missing values generated)
36
(364,852 missing values generated)
37
(367,297 missing values generated)
38
(364,428 missing values generated)
39
(366,934 missing values generated)
41
(355,712 missing values generated)
42
(354,272 missing values generated)
43
(355,807 missing values generated)
45
(356,539 missing values generated)
46
(340,916 missing values generated)
47
(341,529 missing values generated)
49
(357,613 missing values generated)
50
(367,481 missing values generated)
52
(363,313 missing values generated)
53
(367,277 missing values generated)
55
(363,339 missing values generated)
56
(359,211 missing values generated)
68
(358,134 missing values generated)
69
(366,474 missing values generated)
70
(365,129 missing values generated)
71
(361,652 missing values generated)
72
(366,072 missing values generated)
73
(366,568 missing values generated)
74
(366,931 missing values generated)
77
(366,591 missing values generated)
78
(364,472 missing values generated)
79
(366,659 missing values generated)
80
(364,098 missing values generated)
81
(361,834 missing values generated)
82
(364,686 missing values generated)
85
(366,075 missing values generated)
86
(365,305 missing values generated)
87
(366,983 missing values generated)
88
(366,941 missing values generated)
90
(366,992 missing values generated)
91
(367,370 missing values generated)
92
(367,338 missing values generated)
93
(366,242 missing values generated)
94
(367,453 missing values generated)
95
(366,710 missing values generated)
96
(364,548 missing values generated)

. 
. gen  TFP_cd =  .
(367,754 missing values generated)

. levelsof industry_mode, local(levels)
1 2 3 5 8 9 10 11 12 13 14 15 16 17 18 20 21 22 23 24 25 26 27 28 29 30 31 32 3
> 3 35 36 37 38 39 41 42 43 45 46 47 49 50 52 53 55 56 68 69 70 71 72 73 74 77 
> 78 79 80 81 82 85 86 87 88 90 91 92 93 94 95 96

. foreach l of local levels {
  2. 
.                 qui replace TFP_cd = tfp_cd_`l' if TFP_cd == .
  3. }

. 
. drop tfp_cd_*

. 
. * industry dummy and age
. gen byte industrial_firm = inlist(teaor08_1d,"B","C","D","E")

. gen age = year - foundyear

. 
. * missing export means 0 export
. mvencode export exporter exporter_5, mv(0) override
      export: 90368 missing values recoded
  exporter_5: 90368 missing values recoded

. generate domestic_sales = sales - export

. replace domestic_sales = 0 if domestic_sales < 0 | missing(domestic_sales)
(10 real changes made)

. 
. count
  367,754

. 
. *save_all_to_json
. cap drop __*

. save "`here'/temp/balance-small-clean.dta", replace
file /Users/koren/Documents/workspace/expat//temp/balance-small-clean.dta
    saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Documents/workspace/expat//output/balance.log
  log type:  text
 closed on:   6 May 2022, 15:33:23
-------------------------------------------------------------------------------
