--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/balance.log
  log type:  text
 opened on:   8 Apr 2021, 15:00:03

. 
. use "`here'/input/merleg-expat/balance-small.dta"

. 
. * keep only numeric part of frame_id
. keep if substr(frame_id, 1, 2) == "ft"
(223,690 observations deleted)

. generate long frame_id_numeric = real(substr(frame_id, 3, 8))

. codebook frame_id*

--------------------------------------------------------------------------------------------------------------------------------------------------------------
frame_id                                                                                              Frame_id identify one firm. Only_originalid if not valid
--------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  string (str15), but longest is str10

         unique values:  912,852                  missing "":  0/8,091,096

              examples:  "ft11712107"
                         "ft13692957"
                         "ft21175000"
                         "ft24181664"

--------------------------------------------------------------------------------------------------------------------------------------------------------------
frame_id_numeric                                                                                                                                   (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [10000049,90620052]          units:  1
         unique values:  912,852                  missing .:  0/8,091,096

                  mean:   1.8e+07
              std. dev:   6.6e+06

           percentiles:        10%       25%       50%       75%       90%
                           1.1e+07   1.2e+07   2.0e+07   2.3e+07   2.7e+07

. drop frame_id

. xtset frame_id_numeric year
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1980 to 2018, but with gaps
                delta:  1 unit

. 
. merge m:1 frame_id_numeric year using "`here'/temp/ever_foreign.dta", keepusing(ever_foreign) keep(1 3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                     8,067,086
        from master                 8,067,086  
        from using                          0  

    matched                            24,010  
    -----------------------------------------

. 
. * calculating time_foreign - part I
. count
  8,091,096

. 
. preserve

. sort frame_id_numeric year

. merge m:1 frame_id_numeric year using "`here'/temp/ever_foreign.dta", keepusing(ever_foreign)

    Result                           # of obs.
    -----------------------------------------
    not matched                     8,067,086
        from master                 8,067,086  (_merge==1)
        from using                          0  (_merge==2)

    matched                            24,010  (_merge==3)
    -----------------------------------------

. *clonevar foreign_check = fo3
. *recode foreign_check (. = 0)
. *tempvar t_year
. *gen `t_year' = year if foreign_check == 1 & foreign_check[_n-1] == 0 
. *bys frame_id_numeric: egen first_year_foreign = max(`t_year')
. *gen time_foreign = year - first_year_foreign
. *replace time_foreign = . if foreign_check == 0 & time_foreign > 0
. egen first_year_foreign = min(cond(fo3==1, year, .)), by(frame_id_numeric)
(7,034,606 missing values generated)

. generate time_foreign = year - first_year_foreign
(7,034,606 missing values generated)

. *egen there_in_1995 = min(cond(year==1995, year, .)), by(frame_id_numeric )
. *generate time_foreign = year - there_in_1995
. contract time_foreign if _merge == 3

. gen type = "balance"

. save "`here'/temp/event_time_foreign_balance.dta", replace
file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//temp/event_time_foreign_balance.dta saved

. restore

. 
. preserve

. sort frame_id_numeric year

. egen first_year_foreign = min(cond(fo3==1, year, .)), by(frame_id_numeric)
(7,034,606 missing values generated)

. generate time_foreign = year - first_year_foreign
(7,034,606 missing values generated)

. contract time_foreign

. gen type = "balance-all"

. save "`here'/temp/event_time_all_balance.dta", replace
file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//temp/event_time_all_balance.dta saved

. restore

. 
. * limit sample before large merge - sampling based on firm-level variables, firm-year done later
. * average employment and financial firms deleted
. * break the tie when mode is not unique
. 
. egen first_year_foreign = min(cond(fo3==1, year, .)), by(frame_id_numeric)
(7,034,606 missing values generated)

. generate time_foreign = year - first_year_foreign
(7,034,606 missing values generated)

. forval i = 0/3 {
  2.         gen foreign`i' = (time_foreign == `i')
  3. }

. forval i = 1/3 {
  2.         gen foreign_`i' = (time_foreign == -`i')
  3. }

. gen count = 1

. 
. sort frame_id_numeric year

. gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(912,852 missing values generated)

. gen hole2 = (x > 2 & x != .)

. gen hole1 = (x > 1 & x != .)

. 
. tabstat fo3 foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2, stat(sum) save

   stats |       fo3  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |    674158     13658     18219     26753    120823    100633     86713     75521   8091096    150760     75217
------------------------------------------------------------------------------------------------------------------------

. mat total = r(StatTotal)

. tabstat fo3 foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2 if ever_foreign == 1, stat(sum) save

   stats |       fo3  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     11559       958      1119      1363      1459      1334      1229      1119     24010       155        28
------------------------------------------------------------------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. 
. bys frame_id_numeric: egen avg_emp = mean(emp)
(97,361 missing values generated)

. bys frame_id_numeric: egen industry_mode = mode(teaor08_2d), minmode
Warning: at least one group contains all missing values or contains multiple modes.  Generating missing values for the mode of these groups.  Use the missing,
maxmode, minmode, or nummode() options to control this behavior.
(1,375 missing values generated)

. local sample ((avg_emp >= 20) & (industry_mode != 64 & industry_mode != 65 & industry_mode != 66))

. drop if !`sample'
(7,574,213 observations deleted)

. scalar dropped_size_or_finance = r(N_drop)

. display dropped_size_or_finance
7574213

. 
. drop first_year_foreign time_foreign foreign_* foreign?

. egen first_year_foreign = min(cond(fo3==1, year, .)), by(frame_id_numeric)
(395,940 missing values generated)

. generate time_foreign = year - first_year_foreign
(395,940 missing values generated)

. forval i = 0/3 {
  2.         gen foreign`i' = (time_foreign == `i')
  3. }

. forval i = 1/3 {
  2.         gen foreign_`i' = (time_foreign == -`i')
  3. }

. 
. drop hole* x

. sort frame_id_numeric year

. gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(77,906 missing values generated)

. gen hole2 = (x > 2 & x != .)

. gen hole1 = (x > 1 & x != .)

. 
. tabstat fo3 foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2, stat(sum) save

   stats |       fo3  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     86160      1686      2138      3065     12903      9777      7668      6403    516883      3887      1326
------------------------------------------------------------------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. tabstat fo3 foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2 if ever_foreign == 1, stat(sum) save

   stats |       fo3  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     11559       958      1119      1363      1459      1334      1229      1119     24010       155        28
------------------------------------------------------------------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. 
. * proxy firm founding date with first balance sheet filed
. tempvar foundyear

. bys frame_id_numeric: egen `foundyear' = min(year)

. replace foundyear = `foundyear' if missing(foundyear)
(0 real changes made)

. drop `foundyear'

. 
. * deflate nominal values - FIXME: add ppi before 1992
. foreach x in sales export tanass jetok ranyag ranyag8091 immat {
  2.         cap drop `x'_18
  3.         gen double `x'_18 = `x' / ppi18
  4.         replace `x'_18 = `x' if year < 1992 // FIXME: till ppi before 1992 is not filled up - just to not delete those rows because of missing ln depende
> nt variables
  5.         }
(51,011 missing values generated)
(43,392 real changes made)
(240,752 missing values generated)
(43,392 real changes made)
(59,523 missing values generated)
(43,392 real changes made)
(44,975 missing values generated)
(43,392 real changes made)
(51,103 missing values generated)
(0 real changes made)
(516,883 missing values generated)
(43,392 real changes made)
(163,145 missing values generated)
(0 real changes made)

. 
. * creating dependent variables
. gen lnL = ln(emp)
(119,068 missing values generated)

. gen lnM = ln(ranyag_18)
(67,936 missing values generated)

. replace lnM = ln(ranyag8091_18) if year <= 1991
(43,064 real changes made)

. gen lnQ = ln(sales_18)
(58,755 missing values generated)

. gen lnQL = lnQ-lnL
(122,110 missing values generated)

. gen lnMQ = lnM - lnQ
(63,048 missing values generated)

. gen byte exporter = export_18 > 0 & export_18 != .

. gen export_share = export_18 / sales
(205,502 missing values generated)

. gen exporter_5 = (export_share > .05 & export_share != .)

. replace exporter_5 = . if export_share == .
(205,502 real changes made, 205,502 to missing)

. 
. * foreign fill 
. rename fo3 foreign

. tab year foreign, missing

           |     Foreign owned dummy with
      Year |   ultimate owners from Complex
 1992-2018 |         0          1          . |     Total
-----------+---------------------------------+----------
      1980 |         0          0      2,635 |     2,635 
      1981 |         0          0      2,660 |     2,660 
      1982 |         0          0      2,660 |     2,660 
      1983 |         0          0      2,667 |     2,667 
      1984 |         0          0      2,669 |     2,669 
      1985 |         0          0      2,902 |     2,902 
      1986 |         0          0      2,994 |     2,994 
      1987 |         0          0      3,124 |     3,124 
      1988 |         0          0      3,300 |     3,300 
      1989 |         0          0      4,077 |     4,077 
      1990 |         0        355      5,444 |     5,799 
      1991 |         0        704      7,201 |     7,905 
      1992 |    10,872      1,295          0 |    12,167 
      1993 |    11,095      1,755          0 |    12,850 
      1994 |    11,187      1,992          0 |    13,179 
      1995 |    11,082      2,184          0 |    13,266 
      1996 |    11,190      2,297          0 |    13,487 
      1997 |    11,334      2,457          0 |    13,791 
      1998 |    11,569      2,625          0 |    14,194 
      1999 |    11,579      2,777          0 |    14,356 
      2000 |    11,711      2,878          0 |    14,589 
      2001 |    11,869      2,946          0 |    14,815 
      2002 |    11,983      2,971          0 |    14,954 
      2003 |    12,022      2,925          0 |    14,947 
      2004 |    12,111      2,967          0 |    15,078 
      2005 |    13,076      3,305          0 |    16,381 
      2006 |    13,166      3,302          0 |    16,468 
      2007 |    12,931      3,454          0 |    16,385 
      2008 |    12,169      3,463          0 |    15,632 
      2009 |    11,964      3,477          0 |    15,441 
      2010 |    11,786      3,412          0 |    15,198 
      2011 |    11,990      3,492          0 |    15,482 
      2012 |    11,525      3,417          0 |    14,942 
      2013 |    16,333      3,412          0 |    19,745 
      2014 |    14,368      3,019          0 |    17,387 
      2015 |    18,983      4,146          0 |    23,129 
      2016 |    23,962      4,697          0 |    28,659 
      2017 |    29,948      5,461          0 |    35,409 
      2018 |    36,585      4,975          0 |    41,560 
-----------+---------------------------------+----------
     Total |   388,390     86,160     42,333 |   516,883 

. inspect foreign

foreign:  Foreign owned dummy with ultim        Number of Observations
-------------------------------------------------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero          388,390       388,390             -
|  #                         Positive       86,160        86,160             -
|  #                                   -----------   -----------   -----------
|  #                         Total         474,550       474,550             -
|  #   #                     Missing        42,333
+----------------------                -----------
0                     1                    516,883
   (2 unique values)

. inspect jetok_18 if missing(foreign)

jetok_18:                                       Number of Observations
-----------                            ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero              945           945             -
|  #                         Positive       41,388        41,388             -
|  #                                   -----------   -----------   -----------
|  #                         Total          42,333        42,333             -
|  #   .   .   .   .         Missing             -
+----------------------                -----------
0              9.76e+07                     42,333
(More than 99 unique values)

. recode foreign (.=0)
(foreign: 42333 changes made)

. 
. *tabstat foreign foreign_0 foreign_1 count, stat(sum) save
. *mat total = (total \ r(StatTotal))
. 
. * interpolate small holes
. tab foreign

    Foreign |
owned dummy |
       with |
   ultimate |
owners from |
    Complex |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    430,723       83.33       83.33
          1 |     86,160       16.67      100.00
------------+-----------------------------------
      Total |    516,883      100.00

. tempvar before

. bys foreign: egen `before' = count(1)

. sort frame_id_numeric year

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & f2.foreign == 1
(210 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & f2.foreign == 0
(149 real changes made)

. bys frame_id_numeric (year): egen minyear = min(year)

. bys frame_id_numeric (year): egen maxyear = max(year)

. replace foreign = 1 if l.foreign == 1 & f.foreign == 1 & f2.foreign == 1 & year == (minyear + 1)
(31 real changes made)

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & year == (minyear + 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & f.foreign == 0 & f2.foreign == 0 & year == (maxyear - 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & year == (maxyear - 1)
(30 real changes made)

. tempvar after

. bys foreign: egen `after' = count(1)

. scalar foreign_interpolate = `before'-`after'

. display foreign_interpolate
62

. 
. drop first_year_foreign time_foreign foreign_* foreign?

. egen first_year_foreign = min(cond(foreign==1, year, .)), by(frame_id_numeric)
(397,762 missing values generated)

. generate time_foreign = year - first_year_foreign
(397,762 missing values generated)

. forval i = 0/3 {
  2.         gen foreign`i' = (time_foreign == `i')
  3. }

. forval i = 1/3 {
  2.         gen foreign_`i' = (time_foreign == -`i')
  3. }

. 
. drop hole* x

. sort frame_id_numeric year

. gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(77,906 missing values generated)

. gen hole2 = (x > 2 & x != .)

. gen hole1 = (x > 1 & x != .)

. 
. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     86222      1600      2023      2950     12788      9656      7570      6319    516883      3887      1326
------------------------------------------------------------------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2 if ever_foreign == 1, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     11574       973      1126      1365      1459      1328      1219      1106     24010       155        28
------------------------------------------------------------------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. 
. * extrapolate capital stock
. inspect tanass_18

tanass_18:                                      Number of Observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            4             1             3
|  #                         Zero           71,901        71,901             -
|  #                         Positive      428,847        65,036       363,811
|  #                                   -----------   -----------   -----------
|  #                         Total         500,752       136,938       363,814
|  #   .   .   .   .         Missing        16,131
+----------------------                -----------
-800.3072      6.09e+09                    516,883
(More than 99 unique values)

. tempvar gap 

. generate `gap' = missing(tanass_18) | (tanass_18 <= 0)

. bysort frame_id_numeric (year): generate spell = sum(`gap' != `gap'[_n-1])

. 
. egen gap_length = count(1), by(frame_id_numeric spell)

. egen max_spell = max(spell), by(frame_id_numeric)

. * if gap_length <= 2, interpolate tanass with geometric average
. bysort frame_id_numeric (year): replace tanass_18 = sqrt(tanass_18[_n-1] * tanass_18[_n+1]) if gap_length==1 & `gap'==1
(23516 real changes made, 22025 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1]^0.67 * tanass_18[_n+2]^0.33 if gap_length==2 & `gap'==1 & `gap'[_n-1]==0
(860 real changes made, 638 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-2]^0.33 * tanass_18[_n+1]^0.67 if gap_length==2 & `gap'==1 & `gap'[_n+1]==0
(1618 real changes made, 1396 to missing)

. * at either end, extrapolate for 1 year
. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n+1] if spell==1 & `gap'==1 & `gap'[_n+1]==0
(10041 real changes made)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1] if spell==max_spell & `gap'==1 & `gap'[_n-1]==0
(4038 real changes made)

. 
. drop spell gap_length max_spell

. replace tanass_18 = round(tanass_18)
(377,373 real changes made)

. inspect tanass_18

tanass_18:                                      Number of Observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            2             2             -
|  #                         Zero           45,373        45,373             -
|  #                         Positive      444,861       444,851            10
|  #                                   -----------   -----------   -----------
|  #                         Total         490,236       490,226            10
|  #   .   .   .   .         Missing        26,647
+----------------------                -----------
-60            6.09e+09                    516,883
(More than 99 unique values)

. 
. gen lnK = ln(tanass_18)
(72,022 missing values generated)

. gen lnKL = lnK - lnL
(125,488 missing values generated)

. generate RperK = immat / (immat + tanass)
(227,902 missing values generated)

. replace RperK = 0 if RperK < 0 | missing(immat)
(162,147 real changes made)

. label variable RperK "Share of immaterial assets [0,1]"

. 
. * firm-year deletions
. count if missing(lnK, lnQ, lnL, lnM, foreign) & year > 1991
  127,828

. count if missing(lnK, lnQ, lnL, lnM, foreign)
  130,470

. *drop if missing(lnK, lnQ, lnL, lnM, foreign) // ASK: whether year condition needed
. *count
. 
. foreach var in lnK lnQ lnL lnM {
  2. 
.         drop if missing(`var')
  3. 
.         drop first_year_foreign time_foreign foreign_* foreign?
  4.         egen first_year_foreign = min(cond(foreign==1, year, .)), by(frame_id_numeric)
  5.         generate time_foreign = year - first_year_foreign
  6.         forval i = 0/3 {
  7.                 gen foreign`i' = (time_foreign == `i')
  8.         }
  9.         forval i = 1/3 {
 10.                 gen foreign_`i' = (time_foreign == -`i')
 11.         }
 12. 
.         drop hole* x
 13.         sort frame_id_numeric year
 14.         gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
 15.         gen hole2 = (x > 2 & x != .)
 16.         gen hole1 = (x > 1 & x != .)
 17. 
.         tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2, stat(sum) save
 18.         mat total = (total \ r(StatTotal))
 19.         tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2 if ever_foreign == 1, stat(sum) save
 20.         mat total = (total \ r(StatTotal))
 21. }
(72,022 observations deleted)
(336,965 missing values generated)
(336,965 missing values generated)
(44,049 missing values generated)

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     77068      1528      1865      2560      8297      7457      6510      5806    444861      3321      1073
------------------------------------------------------------------------------------------------------------------------

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     11574       973      1127      1369      1467      1342      1221      1104     24010       172        46
------------------------------------------------------------------------------------------------------------------------
(19,160 observations deleted)
(322,737 missing values generated)
(322,737 missing values generated)
(40,858 missing values generated)

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     73786      1480      1773      2289      7741      6780      6055      5538    425701      3859      1183
------------------------------------------------------------------------------------------------------------------------

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     11574       977      1130      1365      1496      1348      1211      1099     24010       227        66
------------------------------------------------------------------------------------------------------------------------
(36,561 observations deleted)
(292,260 missing values generated)
(292,260 missing values generated)
(28,705 missing values generated)

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     69710      1404      1649      1999      6599      6040      5648      5314    389140      4734      1390
------------------------------------------------------------------------------------------------------------------------

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     11574       982      1133      1369      1548      1357      1211      1093     24010       350       111
------------------------------------------------------------------------------------------------------------------------
(2,727 observations deleted)
(290,013 missing values generated)
(290,013 missing values generated)
(28,692 missing values generated)

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     69468      1399      1640      1988      6591      6028      5635      5302    386413      4927      1444
------------------------------------------------------------------------------------------------------------------------

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     11574       983      1132      1368      1550      1357      1210      1093     24010       364       115
------------------------------------------------------------------------------------------------------------------------

. 
. *drop if missing(foreign)
. *tabstat foreign foreign_0 foreign_1 count, stat(sum) save
. *mat total = (total \ r(StatTotal))
. 
. drop first_year_foreign time_foreign foreign_* foreign? count hole* x

. mat list total

total[14,11]
           fo3  foreign_3  foreign_2  foreign_1   foreign0   foreign1   foreign2   foreign3      count      hole1      hole2
sum     674158      13658      18219      26753     120823     100633      86713      75521    8091096     150760      75217
sum      11559        958       1119       1363       1459       1334       1229       1119      24010        155         28
sum      86160       1686       2138       3065      12903       9777       7668       6403     516883       3887       1326
sum      11559        958       1119       1363       1459       1334       1229       1119      24010        155         28
sum      86222       1600       2023       2950      12788       9656       7570       6319     516883       3887       1326
sum      11574        973       1126       1365       1459       1328       1219       1106      24010        155         28
sum      77068       1528       1865       2560       8297       7457       6510       5806     444861       3321       1073
sum      11574        973       1127       1369       1467       1342       1221       1104      24010        172         46
sum      73786       1480       1773       2289       7741       6780       6055       5538     425701       3859       1183
sum      11574        977       1130       1365       1496       1348       1211       1099      24010        227         66
sum      69710       1404       1649       1999       6599       6040       5648       5314     389140       4734       1390
sum      11574        982       1133       1369       1548       1357       1211       1093      24010        350        111
sum      69468       1399       1640       1988       6591       6028       5635       5302     386413       4927       1444
sum      11574        983       1132       1368       1550       1357       1210       1093      24010        364        115

. count
  386,413

. 
. * TFP (Cobb-Douglas)
. * FIXME: Replace CD with something fancy
. recode industry_mode (6 75 7 66 84 19 51 = .)
(industry_mode: 595 changes made)

. 
. levelsof industry_mode, local(levels)
1 2 3 5 8 9 10 11 12 13 14 15 16 17 18 20 21 22 23 24 25 26 27 28 29 30 31 32 33 35 36 37 38 39 41 42 43 45 46 47 49 50 52 53 55 56 68 69 70 71 72 73 74 77 78
>  79 80 81 82 85 86 87 88 90 91 92 93 94 95 96

.         foreach l of local levels {
  2.         disp `l'
  3.         qui reghdfe lnQ lnL lnK lnM if industry_mode == `l', a(frame_id_numeric year foundyear) resid
  4.         predict tfp_cd_`l', res
  5.         }
1
(340,173 missing values generated)
2
(385,385 missing values generated)
3
(385,712 missing values generated)
5
(386,147 missing values generated)
8
(385,171 missing values generated)
9
(386,280 missing values generated)
10
(366,510 missing values generated)
11
(383,978 missing values generated)
12
(386,263 missing values generated)
13
(381,766 missing values generated)
14
(375,824 missing values generated)
15
(382,063 missing values generated)
16
(380,949 missing values generated)
17
(383,900 missing values generated)
18
(382,602 missing values generated)
20
(383,391 missing values generated)
21
(385,403 missing values generated)
22
(377,347 missing values generated)
23
(381,160 missing values generated)
24
(384,024 missing values generated)
25
(365,920 missing values generated)
26
(379,706 missing values generated)
27
(381,555 missing values generated)
28
(375,206 missing values generated)
29
(382,708 missing values generated)
30
(385,718 missing values generated)
31
(381,423 missing values generated)
32
(384,276 missing values generated)
33
(385,192 missing values generated)
35
(383,598 missing values generated)
36
(383,576 missing values generated)
37
(385,967 missing values generated)
38
(382,856 missing values generated)
39
(385,558 missing values generated)
41
(374,694 missing values generated)
42
(374,174 missing values generated)
43
(374,608 missing values generated)
45
(374,532 missing values generated)
46
(353,783 missing values generated)
47
(359,312 missing values generated)
49
(375,847 missing values generated)
50
(386,143 missing values generated)
52
(381,212 missing values generated)
53
(385,887 missing values generated)
55
(381,710 missing values generated)
56
(377,513 missing values generated)
68
(376,909 missing values generated)
69
(384,955 missing values generated)
70
(383,294 missing values generated)
71
(380,331 missing values generated)
72
(384,692 missing values generated)
73
(384,806 missing values generated)
74
(385,510 missing values generated)
77
(385,094 missing values generated)
78
(382,993 missing values generated)
79
(385,293 missing values generated)
80
(382,647 missing values generated)
81
(380,526 missing values generated)
82
(383,058 missing values generated)
85
(384,853 missing values generated)
86
(383,810 missing values generated)
87
(385,659 missing values generated)
88
(385,635 missing values generated)
90
(385,638 missing values generated)
91
(386,035 missing values generated)
92
(385,957 missing values generated)
93
(384,898 missing values generated)
94
(386,118 missing values generated)
95
(385,366 missing values generated)
96
(383,619 missing values generated)

. 
. gen  TFP_cd =  .
(386,413 missing values generated)

. levelsof industry_mode, local(levels)
1 2 3 5 8 9 10 11 12 13 14 15 16 17 18 20 21 22 23 24 25 26 27 28 29 30 31 32 33 35 36 37 38 39 41 42 43 45 46 47 49 50 52 53 55 56 68 69 70 71 72 73 74 77 78
>  79 80 81 82 85 86 87 88 90 91 92 93 94 95 96

. foreach l of local levels {
  2. 
.                 qui replace TFP_cd = tfp_cd_`l' if TFP_cd == .
  3. }

. 
. drop tfp_cd_*

. 
. * industry dummy and age
. gen byte industrial_firm = inlist(teaor08_1d,"B","C","D","E")

. gen age = year - foundyear

. count
  386,413

. 
. * missing export means 0 export
. mvencode export exporter exporter_5, mv(0) override
      export: 92993 missing values recoded
  exporter_5: 92993 missing values recoded

. generate domestic_sales = sales - export

. replace domestic_sales = 0 if domestic_sales < 0 | missing(domestic_sales)
(8 real changes made)

. 
. * calculating time_foreign - part II
. count
  386,413

. 
. preserve

. sort frame_id_numeric year

. merge m:1 frame_id_numeric year using "`here'/temp/ever_foreign.dta", keepusing(ever_foreign)

    Result                           # of obs.
    -----------------------------------------
    not matched                       362,403
        from master                   362,403  (_merge==1)
        from using                          0  (_merge==2)

    matched                            24,010  (_merge==3)
    -----------------------------------------

. egen first_year_foreign = min(cond(foreign==1, year, .)), by(frame_id_numeric)
(290,013 missing values generated)

. generate time_foreign = year - first_year_foreign
(290,013 missing values generated)

. contract time_foreign if _merge == 3

. gen type = "clean"

. save "`here'/temp/event_time_foreign_clean.dta", replace
file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//temp/event_time_foreign_clean.dta saved

. restore

. 
. preserve

. sort frame_id_numeric year

. egen first_year_foreign = min(cond(foreign==1, year, .)), by(frame_id_numeric)
(290,013 missing values generated)

. generate time_foreign = year - first_year_foreign
(290,013 missing values generated)

. contract time_foreign

. gen type = "clean-all"

. save "`here'/temp/event_time_all_clean.dta", replace
file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//temp/event_time_all_clean.dta saved

. restore

. 
. count
  386,413

. 
. matrix rownames total = "beginning" "sampling" "interpolating fo3 holes" "missing lnK" "missing lnQ" "missing lnL" "missing lnM"

. mata : mat_total_balance = st_matrix("total")

. mata: mata matsave "temp/matrix-balance" mat_total_balance, replace
(saving mat_total_balance[14,11])
file temp/matrix-balance.mmat saved

. 
. save_all_to_json

. cap drop __*

. save "`here'/temp/balance-small-clean.dta", replace
file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//temp/balance-small-clean.dta saved

. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/balance.log
  log type:  text
 closed on:   8 Apr 2021, 15:03:05
--------------------------------------------------------------------------------------------------------------------------------------------------------------
