-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/balance.log
  log type:  text
 opened on:  27 May 2024, 16:37:47

. 
. use "`here'/input/merleg-LTS-MVP/balance.dta" 

. 
. xtset originalid year

Panel variable: originalid (unbalanced)
 Time variable: year, 1980 to 2019, but with gaps
         Delta: 1 unit

. 
. * foreign fill 
. rename fo3 foreign

. tab year foreign, missing

           |  Foreign owned dummy
           | with ultimate owners
      Year |     from Complex
 1980-2019 |         0          1 |     Total
-----------+----------------------+----------
      1980 |     4,738          0 |     4,738 
      1981 |     4,710          0 |     4,710 
      1982 |     4,629          0 |     4,629 
      1983 |     4,609          0 |     4,609 
      1984 |     4,511          0 |     4,511 
      1985 |     5,412          0 |     5,412 
      1986 |     5,998          0 |     5,998 
      1987 |     6,785          0 |     6,785 
      1988 |     7,628          0 |     7,628 
      1989 |    14,455          0 |    14,455 
      1990 |    25,331      2,506 |    27,837 
      1991 |    39,725      5,101 |    44,826 
      1992 |    94,953     10,982 |   105,935 
      1993 |   114,413     15,050 |   129,463 
      1994 |   141,635     19,344 |   160,979 
      1995 |   158,099     21,077 |   179,176 
      1996 |   183,966     22,249 |   206,215 
      1997 |   204,010     22,970 |   226,980 
      1998 |   230,932     24,494 |   255,426 
      1999 |   239,750     24,260 |   264,010 
      2000 |   261,713     25,620 |   287,333 
      2001 |   283,730     26,520 |   310,250 
      2002 |   280,917     27,365 |   308,282 
      2003 |   285,250     27,704 |   312,954 
      2004 |   294,353     28,242 |   322,595 
      2005 |   303,217     27,885 |   331,102 
      2006 |   312,899     27,904 |   340,803 
      2007 |   320,555     29,819 |   350,374 
      2008 |   336,521     32,193 |   368,714 
      2009 |   346,306     32,532 |   378,838 
      2010 |   357,201     32,588 |   389,789 
      2011 |   374,567     32,971 |   407,538 
      2012 |   370,650     31,114 |   401,764 
      2013 |   410,987     30,979 |   441,966 
      2014 |   402,050     29,366 |   431,416 
      2015 |   404,330     28,885 |   433,215 
      2016 |   403,125     27,623 |   430,748 
      2017 |   397,400     26,214 |   423,614 
      2018 |   396,560     24,132 |   420,692 
      2019 |   382,956     21,959 |   404,915 
-----------+----------------------+----------
     Total | 8,421,576    739,648 | 9,161,224 

. inspect foreign

foreign:  Foreign owned dummy with ultim        Number of observations
-------------------------------------------------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero        8,421,576     8,421,576             -
|  #                         Positive      739,648       739,648             -
|  #                                   -----------   -----------   -----------
|  #                         Total       9,161,224     9,161,224             -
|  #   .                     Missing             -
+----------------------                -----------
0                     1                  9,161,224
   (2 unique values)

. *inspect jetok_18 if missing(foreign)
. recode foreign (.=0)
(0 changes made to foreign)

. 
. * interpolate small holes
. tab foreign

    Foreign |
owned dummy |
       with |
   ultimate |
owners from |
    Complex |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  8,421,576       91.93       91.93
          1 |    739,648        8.07      100.00
------------+-----------------------------------
      Total |  9,161,224      100.00

. tempvar before

. bys foreign: egen `before' = count(1)

. xtset originalid year

Panel variable: originalid (unbalanced)
 Time variable: year, 1980 to 2019, but with gaps
         Delta: 1 unit

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & f2
> .foreign == 1
(1,042 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & f2
> .foreign == 0
(1,110 real changes made)

. bys originalid (year): egen minyear = min(year)

. bys originalid (year): egen maxyear = max(year)

. replace foreign = 1 if l.foreign == 1 & f.foreign == 1 & f2.foreign == 1 & ye
> ar == (minyear + 1)
(199 real changes made)

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & ye
> ar == (minyear + 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & f.foreign == 0 & f2.foreign == 0 & ye
> ar == (maxyear - 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & ye
> ar == (maxyear - 1)
(508 real changes made)

. tempvar after

. bys foreign: egen `after' = count(1)

. scalar foreign_interpolate = `before'-`after'

. display foreign_interpolate
-377

. 
. 
. * limit sample before large merge - sampling based on firm-level variables, f
> irm-year done later
. * average employment and financial firms deleted
. * break the tie when mode is not unique
. 
. * minimal employment cleaning
. replace emp = 1 if emp <= 0 | missing(emp)
(3,277,579 real changes made)

. bys originalid: egen avg_emp = mean(emp)

. bys originalid: egen industry_mode = mode(teaor08_2d), minmode
warning: For at least one group, teaor08_2d contains all missing values.
         Generating missing values for the modes in these groups. Use option
         missing to treat missing values as a category.
(1,409 missing values generated)

. 
. * drop small firms
. drop if (avg_emp < 10)
(8,286,643 observations deleted)

. 
. * proxy firm founding date with first balance sheet filed
. tempvar foundyear

. bys originalid: egen `foundyear' = min(year)

. replace foundyear = `foundyear' if missing(foundyear)
(0 real changes made)

. drop `foundyear'

. 
. * deflate nominal values - FIXME: add ppi before 1992
. foreach x in sales export tanass jetok ranyag immat {
  2.         cap drop `x'_18
  3.         gen double `x'_18 = `x' / ppi
  4.         replace `x'_18 = `x' if year < 1987 // FIXME: till ppi before 1987
>  is not filled up - just to not delete those rows because of missing ln depen
> dent variables
  5. }
(39,276 missing values generated)
(31,532 real changes made)
(337,240 missing values generated)
(31,532 real changes made)
(48,401 missing values generated)
(31,532 real changes made)
(38,499 missing values generated)
(31,531 real changes made)
(38,846 missing values generated)
(31,532 real changes made)
(316,467 missing values generated)
(0 real changes made)

. 
. mvencode export_18, mv(0) override
   export_18: 305708 missing values recoded

. 
. * creating dependent variables
. gen lnL = ln(emp)

. gen lnM = ln(ranyag_18)
(15,496 missing values generated)

. gen lnQ = ln(sales_18)
(31,744 missing values generated)

. gen lnQL = lnQ - lnL
(31,744 missing values generated)

. gen lnMQ = lnM - lnQ
(37,259 missing values generated)

. generate lnEx = ln(export_18)
(637,492 missing values generated)

. generate lnQd = ln(sales_18 - export_18)
(37,524 missing values generated)

. 
. gen byte exporter = export_18 > 0 & export_18 != .

. gen export_share = export_18 / sales_18
(31,744 missing values generated)

. gen exporter_5 = (export_share > .05 & export_share != .)

. replace exporter_5 = . if export_share == .
(31,744 real changes made, 31,744 to missing)

. 
. * extrapolate capital stock
. inspect tanass_18

tanass_18:                                      Number of observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero           36,323        36,323             -
|  #                         Positive      821,389        59,069       762,320
|  #                                   -----------   -----------   -----------
|  #                         Total         857,712        95,392       762,320
|  #   .   .   .   .         Missing        16,869
+----------------------                -----------
0              1.04e+10                    874,581
(More than 99 unique values)

. tempvar gap 

. generate `gap' = missing(tanass_18) | (tanass_18 <= 0)

. bysort originalid (year): generate spell = sum(`gap' != `gap'[_n-1])

. 
. egen gap_length = count(1), by(originalid spell)

. egen max_spell = max(spell), by(originalid)

. * if gap_length <= 2, interpolate tanass with geometric average
. bysort originalid (year): replace tanass_18 = sqrt(tanass_18[_n-1] * tanass_1
> 8[_n+1]) if gap_length==1 & `gap'==1
(14326 real changes made, 11014 to missing)

. bysort originalid (year): replace tanass_18 = tanass_18[_n-1]^0.67 * tanass_1
> 8[_n+2]^0.33 if gap_length==2 & `gap'==1 & `gap'[_n-1]==0
(1521 real changes made, 1003 to missing)

. bysort originalid (year): replace tanass_18 = tanass_18[_n-2]^0.33 * tanass_1
> 8[_n+1]^0.67 if gap_length==2 & `gap'==1 & `gap'[_n+1]==0
(2077 real changes made, 1559 to missing)

. * at either end, extrapolate for 1 year
. bysort originalid (year): replace tanass_18 = tanass_18[_n+1] if spell==1 & `
> gap'==1 & `gap'[_n+1]==0
(13575 real changes made)

. bysort originalid (year): replace tanass_18 = tanass_18[_n-1] if spell==max_s
> pell & `gap'==1 & `gap'[_n-1]==0
(6664 real changes made)

. 
. drop spell gap_length max_spell

. replace tanass_18 = round(tanass_18)
(786,659 real changes made)

. inspect tanass_18

tanass_18:                                      Number of observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero           17,951        17,951             -
|  #                         Positive      845,976       845,954            22
|  #                                   -----------   -----------   -----------
|  #                         Total         863,927       863,905            22
|  #   .   .   .   .         Missing        10,654
+----------------------                -----------
0              1.04e+10                    874,581
(More than 99 unique values)

. 
. gen lnK = ln(tanass_18)
(28,605 missing values generated)

. gen lnKL = lnK - lnL
(28,605 missing values generated)

. generate RperK = immat / (immat + tanass)
(337,912 missing values generated)

. replace RperK = 0 if RperK < 0 | missing(immat)
(316,440 real changes made)

. label variable RperK "Share of immaterial assets [0,1]"

. 
. * firm-year deletions
. count if missing(lnK, lnQ, lnL, lnM, foreign) & year > 1991
  51,292

. count if missing(lnK, lnQ, lnL, lnM, foreign)
  55,203

. 
. foreach var in lnK lnQ lnL lnM {
  2.         drop if missing(`var')
  3. }
(28,605 observations deleted)
(21,920 observations deleted)
(0 observations deleted)
(4,678 observations deleted)

. 
. count
  819,378

. 
. gen age = year - foundyear

. 
. * missing export means 0 export
. mvencode export exporter exporter_5, mv(0) override
      export: 278372 missing values recoded

. generate domestic_sales = sales - export

. replace domestic_sales = 0 if domestic_sales < 0 | missing(domestic_sales)
(39 real changes made)

. 
. count
  819,378

. 
. cap drop __*

. save "`here'/temp/balance-small-clean.dta", replace
(file /Users/koren/Tresorit/Mac/projects/expat//temp/balance-small-clean.dta
    not found)
file /Users/koren/Tresorit/Mac/projects/expat//temp/balance-small-clean.dta
    saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/balance.log
  log type:  text
 closed on:  27 May 2024, 16:39:05
-------------------------------------------------------------------------------
