-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Documents/workspace/expat//output/balance.log
  log type:  text
 opened on:   6 May 2022, 17:03:45

. 
. use "`here'/input/merleg-expat/balance-small.dta"

. 
. * keep only numeric part of frame_id
. keep if substr(frame_id, 1, 2) == "ft"
(223,690 observations deleted)

. generate long frame_id_numeric = real(substr(frame_id, 3, 8))

. codebook frame_id*

-------------------------------------------------------------------------------
frame_id               Frame_id identify one firm. Only_originalid if not valid
-------------------------------------------------------------------------------

                  Type: String (str15), but longest is str10

         Unique values: 912,852                   Missing "": 0/8,091,096

              Examples: "ft11712107"
                        "ft13692957"
                        "ft21175000"
                        "ft24181664"

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [10000049,90620052]           Units: 1
         Unique values: 912,852                   Missing .: 0/8,091,096

                  Mean: 1.8e+07
             Std. dev.: 6.6e+06

           Percentiles:     10%       25%       50%       75%       90%
                        1.1e+07   1.2e+07   2.0e+07   2.3e+07   2.7e+07

. drop frame_id

. xtset frame_id_numeric year

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. 
. do "code/create/emp_clean"

. cap drop emp_cl

. clonevar emp_cl=emp
(827,103 missing values generated)

. 
. xtset frame_id_numeric year

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. 
. replace emp_cl=l.emp_cl if 8*emp_cl<l.emp_cl & 8*emp_cl<f.emp_cl & f.emp_cl!=
> . & l.emp_cl!=. & l.emp_cl>0 & emp_cl>0 & f.emp_cl>0 & 1.1*f.emp_cl>l.emp_cl 
> & f.emp_cl>50 & l.emp_cl>50 /*29*/
(1 real change made)

. replace emp_cl=l.emp_cl if emp_cl>8*l.emp_cl & emp_cl>8*f.emp_cl & f.emp_cl!=
> . & l.emp_cl!=. & emp_cl!=. & l.emp_cl>0 & f.emp_cl>0 & 1.1*l.emp_cl>f.emp_cl
>  & f.emp_cl>50 & l.emp_cl>50 /*20*/
(3 real changes made)

. 
. replace emp_cl=. if 8*emp_cl<l.emp_cl & 8*emp_cl<f.emp_cl & f.emp_cl!=. & l.e
> mp_cl!=. & l.emp_cl>0 & emp_cl>0 & f.emp_cl>0 /*& 1.1*f.emp_cl<l.emp_cl 73*/
(1 real change made, 1 to missing)

. replace emp_cl=. if emp_cl>8*l.emp_cl & emp_cl>8*f.emp_cl & f.emp_cl!=. & l.e
> mp_cl!=. & emp_cl!=. & l.emp_cl>0 & f.emp_cl>0 /*& 1.1*l.emp_cl<f.emp_cl 114*
> /
(3 real changes made, 3 to missing)

. 
. 
. * if emp<6
. replace emp_cl=0 if emp_cl>6 & l.emp_cl==0 & f.emp_cl==0 & emp_cl!=. /*418*/
(0 real changes made)

. replace emp_cl=l.emp_cl if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. 
> & f.emp_cl!=. & l.emp_cl+5>f.emp_cl /*1630*/
(0 real changes made)

. replace emp_cl=l.emp_cl if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. 
> & f.emp_cl!=. & l.emp_cl<f.emp_cl+5 /*532*/
(0 real changes made)

. 
. replace emp_cl=. if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. & f.emp
> _cl!=. & l.emp_cl+5<f.emp_cl /*0*/
(0 real changes made)

. replace emp_cl=. if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. & f.emp
> _cl!=. & l.emp_cl>f.emp_cl+5 /*0*/
(0 real changes made)

. 
. ***** Last year
. bysort frame_id_numeric: egen lastyear=max(year)

. foreach i of numlist 1980/2018 {
  2. 
.     local j=`i'+1
  3. 
.     gen j1=emp_cl if year == `i'
  4.     gen j2=emp_cl if year == `j'
  5.    
.     bysort frame_id_numeric: egen v=mean(j1)
  6.     bysort frame_id_numeric: egen w=mean(j2)
  7.    
.     sort frame_id_numeric year
  8.    
.     replace emp_cl=. if 8*v<w & v>0 & w!=. & lastyear==`j' & year==`j'
  9.     replace emp_cl=. if 8*w<v & w>0 & v!=. & lastyear==`j' & year==`j'
 10.    
.     replace emp_cl=. if v>5 & w==0 & v!=. & lastyear==`j' & year==`j'
 11.     replace emp_cl=. if w>5 & v==0 & w!=. & lastyear==`j' & year==`j'
 12.    
.     drop j1 j2 v w      
 13. }
(8,088,431 missing values generated)
(8,088,402 missing values generated)
(8,020,623 missing values generated)
(8,019,958 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,088,402 missing values generated)
(8,088,401 missing values generated)
(8,019,958 missing values generated)
(8,019,929 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,088,401 missing values generated)
(8,088,393 missing values generated)
(8,019,929 missing values generated)
(8,019,812 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,088,393 missing values generated)
(8,088,386 missing values generated)
(8,019,812 missing values generated)
(8,019,704 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,088,386 missing values generated)
(8,088,086 missing values generated)
(8,019,704 missing values generated)
(8,014,186 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,088,086 missing values generated)
(8,087,934 missing values generated)
(8,014,186 missing values generated)
(8,011,679 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,087,934 missing values generated)
(8,087,732 missing values generated)
(8,011,679 missing values generated)
(8,008,621 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,087,732 missing values generated)
(8,087,520 missing values generated)
(8,008,621 missing values generated)
(8,005,276 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,087,520 missing values generated)
(8,086,028 missing values generated)
(8,005,276 missing values generated)
(7,980,457 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,086,028 missing values generated)
(8,075,843 missing values generated)
(7,980,457 missing values generated)
(7,819,778 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,075,843 missing values generated)
(8,062,623 missing values generated)
(7,819,778 missing values generated)
(7,615,565 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,062,623 missing values generated)
(8,000,272 missing values generated)
(7,615,565 missing values generated)
(6,821,690 missing values generated)
(2 real changes made, 2 to missing)
(40 real changes made, 40 to missing)
(103 real changes made, 103 to missing)
(7 real changes made, 7 to missing)
(8,000,424 missing values generated)
(7,975,028 missing values generated)
(6,822,486 missing values generated)
(6,406,936 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,975,028 missing values generated)
(7,945,340 missing values generated)
(6,406,936 missing values generated)
(5,955,568 missing values generated)
(0 real changes made)
(0 real changes made)
(2 real changes made, 2 to missing)
(0 real changes made)
(7,945,342 missing values generated)
(7,928,245 missing values generated)
(5,955,576 missing values generated)
(5,631,483 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,928,245 missing values generated)
(7,903,325 missing values generated)
(5,631,483 missing values generated)
(5,214,787 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,903,325 missing values generated)
(7,883,163 missing values generated)
(5,214,787 missing values generated)
(4,856,246 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,883,164 missing values generated)
(7,857,954 missing values generated)
(4,856,251 missing values generated)
(4,478,434 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(4 real changes made, 4 to missing)
(7,857,960 missing values generated)
(7,849,175 missing values generated)
(4,478,465 missing values generated)
(4,293,033 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,849,176 missing values generated)
(7,827,545 missing values generated)
(4,293,041 missing values generated)
(3,979,507 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,827,545 missing values generated)
(7,807,002 missing values generated)
(3,979,507 missing values generated)
(3,706,038 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,807,002 missing values generated)
(7,806,987 missing values generated)
(3,706,038 missing values generated)
(3,628,128 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(7,806,990 missing values generated)
(7,801,891 missing values generated)
(3,628,146 missing values generated)
(3,526,513 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,801,892 missing values generated)
(7,788,407 missing values generated)
(3,526,516 missing values generated)
(3,343,694 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,788,409 missing values generated)
(7,836,967 missing values generated)
(3,343,705 missing values generated)
(3,991,760 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,836,968 missing values generated)
(7,825,074 missing values generated)
(3,991,767 missing values generated)
(3,824,829 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,825,074 missing values generated)
(7,814,264 missing values generated)
(3,824,829 missing values generated)
(3,713,518 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,814,266 missing values generated)
(7,771,101 missing values generated)
(3,713,531 missing values generated)
(3,229,628 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,771,102 missing values generated)
(7,768,799 missing values generated)
(3,229,631 missing values generated)
(3,244,062 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,768,799 missing values generated)
(7,757,321 missing values generated)
(3,244,062 missing values generated)
(3,156,488 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,757,321 missing values generated)
(7,756,980 missing values generated)
(3,156,488 missing values generated)
(3,241,577 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,756,981 missing values generated)
(7,761,809 missing values generated)
(3,241,581 missing values generated)
(3,376,996 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,761,811 missing values generated)
(7,765,189 missing values generated)
(3,377,008 missing values generated)
(3,493,759 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,765,189 missing values generated)
(7,767,417 missing values generated)
(3,493,759 missing values generated)
(3,569,214 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,767,417 missing values generated)
(7,868,561 missing values generated)
(3,569,214 missing values generated)
(4,977,195 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(2 real changes made, 2 to missing)
(7,868,564 missing values generated)
(7,725,651 missing values generated)
(4,977,209 missing values generated)
(3,120,140 missing values generated)
(0 real changes made)
(2 real changes made, 2 to missing)
(0 real changes made)
(0 real changes made)
(7,725,653 missing values generated)
(7,733,067 missing values generated)
(3,120,163 missing values generated)
(3,274,217 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,733,068 missing values generated)
(7,744,442 missing values generated)
(3,274,225 missing values generated)
(3,514,325 missing values generated)
(349 real changes made, 349 to missing)
(364 real changes made, 364 to missing)
(760 real changes made, 760 to missing)
(634 real changes made, 634 to missing)
(7,746,549 missing values generated)
(8,091,096 missing values generated)
(3,536,118 missing values generated)
(8,091,096 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. ***** First year 
. bysort frame_id_numeric: egen firstyear=min(year)

. foreach i of numlist 1981/2019 {
  2. 
.     local j=`i'-1
  3. 
.     gen j1=emp if year == `i'
  4.     gen j2=emp if year == `j'
  5.    
.     bysort frame_id_numeric: egen v=mean(j1)
  6.     bysort frame_id_numeric: egen w=mean(j2)
  7.    
.     sort frame_id_numeric year
  8.    
.     replace emp_cl=. if 8*v<w & v>0 & w!=. & firstyear==`j' & year==`j'
  9.     replace emp_cl=. if 8*w<v & w>0 & v!=. & firstyear==`j' & year==`j'
 10.    
.     replace emp_cl=. if v>5 & w==0 & v!=. & firstyear==`j' & year==`j'
 11.     replace emp_cl=. if w>5 & v==0 & w!=. & firstyear==`j' & year==`j'
 12.    
.     drop j1 j2 v w
 13. }
(8,088,402 missing values generated)
(8,088,431 missing values generated)
(8,019,958 missing values generated)
(8,020,623 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,088,401 missing values generated)
(8,088,402 missing values generated)
(8,019,929 missing values generated)
(8,019,958 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,088,393 missing values generated)
(8,088,401 missing values generated)
(8,019,812 missing values generated)
(8,019,929 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,088,386 missing values generated)
(8,088,393 missing values generated)
(8,019,704 missing values generated)
(8,019,812 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,088,086 missing values generated)
(8,088,386 missing values generated)
(8,014,186 missing values generated)
(8,019,704 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,087,934 missing values generated)
(8,088,086 missing values generated)
(8,011,679 missing values generated)
(8,014,186 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,087,732 missing values generated)
(8,087,934 missing values generated)
(8,008,621 missing values generated)
(8,011,679 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,087,520 missing values generated)
(8,087,732 missing values generated)
(8,005,276 missing values generated)
(8,008,621 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,086,028 missing values generated)
(8,087,520 missing values generated)
(7,980,457 missing values generated)
(8,005,276 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,075,840 missing values generated)
(8,086,028 missing values generated)
(7,819,719 missing values generated)
(7,980,457 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,062,623 missing values generated)
(8,075,840 missing values generated)
(7,615,565 missing values generated)
(7,819,719 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,000,272 missing values generated)
(8,062,623 missing values generated)
(6,821,690 missing values generated)
(7,615,565 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(2 real changes made, 2 to missing)
(7,975,028 missing values generated)
(8,000,272 missing values generated)
(6,406,936 missing values generated)
(6,821,690 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,945,340 missing values generated)
(7,975,028 missing values generated)
(5,955,568 missing values generated)
(6,406,936 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,928,245 missing values generated)
(7,945,340 missing values generated)
(5,631,483 missing values generated)
(5,955,568 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,903,325 missing values generated)
(7,928,245 missing values generated)
(5,214,787 missing values generated)
(5,631,483 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,883,163 missing values generated)
(7,903,325 missing values generated)
(4,856,246 missing values generated)
(5,214,787 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,857,954 missing values generated)
(7,883,163 missing values generated)
(4,478,434 missing values generated)
(4,856,246 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,849,175 missing values generated)
(7,857,954 missing values generated)
(4,293,033 missing values generated)
(4,478,434 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,827,545 missing values generated)
(7,849,175 missing values generated)
(3,979,507 missing values generated)
(4,293,033 missing values generated)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,807,002 missing values generated)
(7,827,545 missing values generated)
(3,706,038 missing values generated)
(3,979,507 missing values generated)
(0 real changes made)
(0 real changes made)
(2 real changes made, 2 to missing)
(5 real changes made, 5 to missing)
(7,806,987 missing values generated)
(7,807,002 missing values generated)
(3,628,128 missing values generated)
(3,706,038 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(2 real changes made, 2 to missing)
(7,801,891 missing values generated)
(7,806,987 missing values generated)
(3,526,513 missing values generated)
(3,628,128 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,788,407 missing values generated)
(7,801,891 missing values generated)
(3,343,694 missing values generated)
(3,526,513 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(7,836,967 missing values generated)
(7,788,407 missing values generated)
(3,991,760 missing values generated)
(3,343,694 missing values generated)
(0 real changes made)
(0 real changes made)
(4 real changes made, 4 to missing)
(0 real changes made)
(7,825,074 missing values generated)
(7,836,967 missing values generated)
(3,824,829 missing values generated)
(3,991,760 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,814,264 missing values generated)
(7,825,074 missing values generated)
(3,713,518 missing values generated)
(3,824,829 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,771,100 missing values generated)
(7,814,264 missing values generated)
(3,229,617 missing values generated)
(3,713,518 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(7,768,799 missing values generated)
(7,771,100 missing values generated)
(3,244,062 missing values generated)
(3,229,617 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(7,757,321 missing values generated)
(7,768,799 missing values generated)
(3,156,488 missing values generated)
(3,244,062 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(7,756,980 missing values generated)
(7,757,321 missing values generated)
(3,241,577 missing values generated)
(3,156,488 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,761,809 missing values generated)
(7,756,980 missing values generated)
(3,376,996 missing values generated)
(3,241,577 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,765,189 missing values generated)
(7,761,809 missing values generated)
(3,493,759 missing values generated)
(3,376,996 missing values generated)
(0 real changes made)
(0 real changes made)
(3 real changes made, 3 to missing)
(0 real changes made)
(7,767,417 missing values generated)
(7,765,189 missing values generated)
(3,569,214 missing values generated)
(3,493,759 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,868,561 missing values generated)
(7,767,417 missing values generated)
(4,977,195 missing values generated)
(3,569,214 missing values generated)
(0 real changes made)
(2 real changes made, 2 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,725,651 missing values generated)
(7,868,561 missing values generated)
(3,120,140 missing values generated)
(4,977,195 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,733,067 missing values generated)
(7,725,651 missing values generated)
(3,274,217 missing values generated)
(3,120,140 missing values generated)
(1 real change made, 1 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(0 real changes made)
(7,744,442 missing values generated)
(7,733,067 missing values generated)
(3,514,325 missing values generated)
(3,274,217 missing values generated)
(9 real changes made, 9 to missing)
(73 real changes made, 73 to missing)
(18 real changes made, 18 to missing)
(27 real changes made, 27 to missing)
(8,091,096 missing values generated)
(7,744,442 missing values generated)
(8,091,096 missing values generated)
(3,514,325 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. drop firstyear lastyear

. 
end of do-file

. count
  8,091,096

. count if emp == emp_cl & emp != .
  7,261,521

. count if emp != emp_cl & emp != . & emp_cl != .
  4

. count if emp != emp_cl & emp != .
  2,472

. count if emp != emp_cl & emp_cl != .
  4

. gen emp_add = emp_cl + 1
(829,571 missing values generated)

. corr emp emp_cl emp_add
(obs=7,261,525)

             |      emp   emp_cl  emp_add
-------------+---------------------------
         emp |   1.0000
      emp_cl |   0.9994   1.0000
     emp_add |   0.9994   1.0000   1.0000


. 
. * use fo2 instead of fo3
. merge 1:1 originalid year using "input/balance-sheet-80-19-plus-vars/balance-
> 80-19-plus-vars.dta", keep(1 3) nogen
(variable originalid was long, now double to accommodate using data's values)
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           330
        from master                       330  
        from using                          0  

    Matched                         8,090,766  
    -----------------------------------------

. tab fo2 fo3, missing

   Foreign |
     owned |
     dummy |
share>=50% |
 1=foreign |     Foreign owned dummy with
     0=not |   ultimate owners from Complex
   foreign |         0          1          . |     Total
-----------+---------------------------------+----------
         0 | 7,325,562     70,734     74,114 | 7,470,410 
         1 |    16,990    603,360          6 |   620,356 
         . |       265         64          1 |       330 
-----------+---------------------------------+----------
     Total | 7,342,817    674,158     74,121 | 8,091,096 

. 
. * foreign fill 
. rename fo2 foreign

. *rename fo3 foreign
. tab year foreign, missing

           |  Foreign owned dummy share>=50%
      Year |     1=foreign 0=not foreign
 1992-2018 |         0          1          . |     Total
-----------+---------------------------------+----------
      1980 |     2,666          0          0 |     2,666 
      1981 |     2,695          0          0 |     2,695 
      1982 |     2,695          0          0 |     2,695 
      1983 |     2,705          0          0 |     2,705 
      1984 |     2,711          0          0 |     2,711 
      1985 |     3,025          0          0 |     3,025 
      1986 |     3,178          0          0 |     3,178 
      1987 |     3,402          0          0 |     3,402 
      1988 |     3,806          0          0 |     3,806 
      1989 |     6,891          0          0 |     6,891 
      1990 |    14,422      1,635          0 |    16,057 
      1991 |    26,065      3,631          1 |    29,697 
      1992 |    84,722     10,185          3 |    94,910 
      1993 |   103,840     13,867          2 |   117,709 
      1994 |   129,086     17,973          2 |   147,061 
      1995 |   144,441     19,660          2 |   164,103 
      1996 |   168,408     20,737          5 |   189,150 
      1997 |   187,530     21,463          8 |   209,001 
      1998 |   211,028     22,870          2 |   233,900 
      1999 |   220,755     22,406         11 |   243,172 
      2000 |   241,067     23,313         44 |   264,424 
      2001 |   260,941     23,981         21 |   284,943 
      2002 |   260,302     24,590         20 |   284,912 
      2003 |   265,284     24,830         16 |   290,130 
      2004 |   278,333     25,212         12 |   303,557 
      2005 |   286,011     24,499          4 |   310,514 
      2006 |   293,550     24,326         13 |   317,889 
      2007 |   302,524     25,605         19 |   328,148 
      2008 |   317,360     27,303         26 |   344,689 
      2009 |   324,696     27,380         16 |   352,092 
      2010 |   337,458     27,401          6 |   364,865 
      2011 |   354,463     27,281          4 |   381,748 
      2012 |   350,594     25,521          3 |   376,118 
      2013 |   387,712     24,800         19 |   412,531 
      2014 |   378,324     23,568         25 |   401,917 
      2015 |   383,680     23,649          7 |   407,336 
      2016 |   382,487     22,472         14 |   404,973 
      2017 |   376,456     21,426         11 |   397,893 
      2018 |   365,097     18,772         14 |   383,883 
-----------+---------------------------------+----------
     Total | 7,470,410    620,356        330 | 8,091,096 

. inspect foreign

foreign:  Foreign owned dummy share>=50%        Number of observations
-------------------------------------------------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero        7,470,410     7,470,410             -
|  #                         Positive      620,356       620,356             -
|  #                                   -----------   -----------   -----------
|  #                         Total       8,090,766     8,090,766             -
|  #   .                     Missing           330
+----------------------                -----------
0                     1                  8,091,096
   (2 unique values)

. *inspect jetok_18 if missing(foreign)
. recode foreign (.=0)
(330 changes made to foreign)

. 
. * interpolate small holes
. tab foreign

    Foreign |
owned dummy |
 share>=50% |
  1=foreign |
      0=not |
    foreign |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  7,470,740       92.33       92.33
          1 |    620,356        7.67      100.00
------------+-----------------------------------
      Total |  8,091,096      100.00

. tempvar before

. bys foreign: egen `before' = count(1)

. sort frame_id_numeric year

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & f2
> .foreign == 1
(313 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & f2
> .foreign == 0
(206 real changes made)

. bys frame_id_numeric (year): egen minyear = min(year)

. bys frame_id_numeric (year): egen maxyear = max(year)

. replace foreign = 1 if l.foreign == 1 & f.foreign == 1 & f2.foreign == 1 & ye
> ar == (minyear + 1)
(53 real changes made)

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & ye
> ar == (minyear + 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & f.foreign == 0 & f2.foreign == 0 & ye
> ar == (maxyear - 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & ye
> ar == (maxyear - 1)
(449 real changes made)

. tempvar after

. bys foreign: egen `after' = count(1)

. scalar foreign_interpolate = `before'-`after'

. display foreign_interpolate
-289

. 
. * foreign change
. preserve

. use "`here'/input/ceo-panel/ceo-panel.dta", clear

. * expat is changed if job_begin < 1990 in firm_panel.do, not here
. bys frame_id_numeric: egen first_year_expat = min(cond(expat == 1, year,.))
(11,083,558 missing values generated)

. duplicates drop frame_id_numeric, force

Duplicates in terms of frame_id_numeric

(11,838,988 observations deleted)

. tempfile expat

. save `expat'
file /var/folders/f4/7drmhl1d5kj3wp1r33jvx32m0000gn/T//St03407.000002 saved
    as .dta format

. restore

. 
. merge m:1 frame_id_numeric using `expat', keepusing(first_year_expat) keep(1 
> 3) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                        26,513
        from master                    26,513  
        from using                          0  

    Matched                         8,064,583  
    -----------------------------------------

. 
. bys frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.
> ))
(7,129,445 missing values generated)

.         
. generate manager_after_owner = first_year_expat - first_year_foreign
(7,435,665 missing values generated)

. generate event_time = year - first_year_expat
(7,175,006 missing values generated)

. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(2,276 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(2,654 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(28,441 real changes made)

. 
. drop manager_after_owner event_time first_year_expat

. 
. generate time_foreign = year - first_year_foreign
(7,129,445 missing values generated)

. forval i = 0/3 {
  2.         gen foreign`i' = (time_foreign == `i')
  3. }

. forval i = 1/3 {
  2.         gen foreign_`i' = (time_foreign == -`i')
  3. }

. gen count = 1

. 
. * drop greenfield
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (fore
> ign == 0))

. keep if start_as_domestic
(512,573 observations deleted)

. drop owner_spell start_as_domestic

. 
. * limit sample before large merge - sampling based on firm-level variables, f
> irm-year done later
. * average employment and financial firms deleted
. * break the tie when mode is not unique
. 
. bys frame_id_numeric: egen avg_emp = mean(emp)
(91,090 missing values generated)

. bys frame_id_numeric: egen industry_mode = mode(teaor08_2d), minmode
warning: For at least one group, teaor08_2d contains all missing values.
         Generating missing values for the modes in these groups. Use option
         missing to treat missing values as a category.
(1,360 missing values generated)

. local sample ((avg_emp >= 20) & (industry_mode != 64 & industry_mode != 65 & 
> industry_mode != 66))

. drop if !`sample'
(7,111,080 observations deleted)

. scalar dropped_size_or_finance = r(N_drop)

. display dropped_size_or_finance
7111080

. 
. * proxy firm founding date with first balance sheet filed
. tempvar foundyear

. bys frame_id_numeric: egen `foundyear' = min(year)

. replace foundyear = `foundyear' if missing(foundyear)
(0 real changes made)

. drop `foundyear'

. 
. * deflate nominal values - FIXME: add ppi before 1992
. foreach x in sales export tanass jetok ranyag ranyag8091 immat {
  2.         cap drop `x'_18
  3.         gen double `x'_18 = `x' / ppi18
  4.         replace `x'_18 = `x' if year < 1992 // FIXME: till ppi before 1992
>  is not filled up - just to not delete those rows because of missing ln depen
> dent variables
  5. }
(49,482 missing values generated)
(42,662 real changes made)
(228,574 missing values generated)
(42,662 real changes made)
(57,389 missing values generated)
(42,662 real changes made)
(44,177 missing values generated)
(42,662 real changes made)
(49,890 missing values generated)
(0 real changes made)
(467,443 missing values generated)
(42,662 real changes made)
(152,743 missing values generated)
(0 real changes made)

. 
. * change emp
. *sort frame_id_numeric year
. 
. *clonevar emp_clean = emp
. *replace emp_clean = . if (emp[_n-1] > 5 | emp[_n +1] > 5) & emp == 0
. *corr emp emp_clean
. 
. *gen emp_add = emp_clean + 1
. 
. * creating dependent variables
. gen lnL = ln(emp_add)
(99,320 missing values generated)

. *gen lnL_add = ln(emp_add)
. gen lnM = ln(ranyag_18)
(65,690 missing values generated)

. replace lnM = ln(ranyag8091_18) if year <= 1991
(42,345 real changes made)

. gen lnQ = ln(sales_18)
(53,845 missing values generated)

. gen lnQL = lnQ-lnL
(106,468 missing values generated)

. gen lnMQ = lnM - lnQ
(57,957 missing values generated)

. gen byte exporter = export_18 > 0 & export_18 != .

. gen export_share = export_18 / sales
(193,121 missing values generated)

. gen exporter_5 = (export_share > .05 & export_share != .)

. replace exporter_5 = . if export_share == .
(193,121 real changes made, 193,121 to missing)

. 
. * extrapolate capital stock
. inspect tanass_18

tanass_18:                                      Number of observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            4             1             3
|  #                         Zero           67,051        67,051             -
|  #                         Positive      385,661        62,303       323,358
|  #                                   -----------   -----------   -----------
|  #                         Total         452,716       129,355       323,361
|  #   .   .   .   .         Missing        14,727
+----------------------                -----------
-800.3072      6.09e+09                    467,443
(More than 99 unique values)

. tempvar gap 

. generate `gap' = missing(tanass_18) | (tanass_18 <= 0)

. bysort frame_id_numeric (year): generate spell = sum(`gap' != `gap'[_n-1])

. 
. egen gap_length = count(1), by(frame_id_numeric spell)

. egen max_spell = max(spell), by(frame_id_numeric)

. * if gap_length <= 2, interpolate tanass with geometric average
. bysort frame_id_numeric (year): replace tanass_18 = sqrt(tanass_18[_n-1] * ta
> nass_18[_n+1]) if gap_length==1 & `gap'==1
(21506 real changes made, 20183 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1]^0.67 * ta
> nass_18[_n+2]^0.33 if gap_length==2 & `gap'==1 & `gap'[_n-1]==0
(789 real changes made, 587 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-2]^0.33 * ta
> nass_18[_n+1]^0.67 if gap_length==2 & `gap'==1 & `gap'[_n+1]==0
(1533 real changes made, 1331 to missing)

. * at either end, extrapolate for 1 year
. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n+1] if spell=
> =1 & `gap'==1 & `gap'[_n+1]==0
(9419 real changes made)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1] if spell=
> =max_spell & `gap'==1 & `gap'[_n-1]==0
(3686 real changes made)

. 
. drop spell gap_length max_spell

. replace tanass_18 = round(tanass_18)
(335,858 real changes made)

. inspect tanass_18

tanass_18:                                      Number of observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            2             2             -
|  #                         Zero           42,693        42,693             -
|  #                         Positive      400,493       400,483            10
|  #                                   -----------   -----------   -----------
|  #                         Total         443,188       443,178            10
|  #   .   .   .   .         Missing        24,255
+----------------------                -----------
-60            6.09e+09                    467,443
(More than 99 unique values)

. 
. gen lnK = ln(tanass_18)
(66,950 missing values generated)

. gen lnKL = lnK - lnL
(107,945 missing values generated)

. generate RperK = immat / (immat + tanass)
(213,087 missing values generated)

. replace RperK = 0 if RperK < 0 | missing(immat)
(151,748 real changes made)

. label variable RperK "Share of immaterial assets [0,1]"

. 
. * firm-year deletions
. count if missing(lnK, lnQ, lnL, lnM, foreign) & year > 1991
  113,250

. count if missing(lnK, lnQ, lnL, lnM, foreign)
  115,269

. *drop if missing(lnK, lnQ, lnL, lnM, foreign) // ASK: whether year condition 
> needed
. *count
. 
. foreach var in lnK lnQ lnL lnM {
  2.         drop if missing(`var')
  3. }
(66,950 observations deleted)
(17,459 observations deleted)
(28,125 observations deleted)
(2,735 observations deleted)

. 
. *drop if missing(foreign)
. *tabstat foreign foreign_0 foreign_1 count, stat(sum) save
. *mat total = (total \ r(StatTotal))
. 
. *drop hole* x
. count
  352,174

. 
. * TFP (Cobb-Douglas)
. * FIXME: Replace CD with something fancy
. recode industry_mode (6 75 7 66 84 19 51 = .)
(466 changes made to industry_mode)

. 
. levelsof industry_mode, local(levels)
1 2 3 5 8 9 10 11 12 13 14 15 16 17 18 20 21 22 23 24 25 26 27 28 29 30 31 32 3
> 3 35 36 37 38 39 41 42 43 45 46 47 49 50 52 53 55 56 68 69 70 71 72 73 74 77 
> 78 79 80 81 82 85 86 87 88 90 91 92 93 94 95 96

.         foreach l of local levels {
  2.         disp `l'
  3.         qui reghdfe lnQ lnL lnK lnM if industry_mode == `l', a(frame_id_nu
> meric year foundyear) resid
  4.         predict tfp_cd_`l', res
  5.         }
1
(305,930 missing values generated)
2
(351,145 missing values generated)
3
(351,471 missing values generated)
5
(351,926 missing values generated)
8
(351,158 missing values generated)
9
(352,040 missing values generated)
10
(333,549 missing values generated)
11
(350,005 missing values generated)
12
(352,061 missing values generated)
13
(348,318 missing values generated)
14
(342,588 missing values generated)
15
(348,604 missing values generated)
16
(347,209 missing values generated)
17
(350,048 missing values generated)
18
(348,743 missing values generated)
20
(349,529 missing values generated)
21
(351,205 missing values generated)
22
(345,197 missing values generated)
23
(347,723 missing values generated)
24
(350,192 missing values generated)
25
(334,092 missing values generated)
26
(346,938 missing values generated)
27
(348,398 missing values generated)
28
(342,680 missing values generated)
29
(349,677 missing values generated)
30
(351,589 missing values generated)
31
(347,471 missing values generated)
32
(350,436 missing values generated)
33
(351,069 missing values generated)
35
(349,430 missing values generated)
36
(349,316 missing values generated)
37
(351,760 missing values generated)
38
(348,875 missing values generated)
39
(351,380 missing values generated)
41
(340,756 missing values generated)
42
(340,192 missing values generated)
43
(340,682 missing values generated)
45
(341,204 missing values generated)
46
(325,331 missing values generated)
47
(326,265 missing values generated)
49
(342,127 missing values generated)
50
(351,901 missing values generated)
52
(347,815 missing values generated)
53
(351,697 missing values generated)
55
(347,851 missing values generated)
56
(343,842 missing values generated)
68
(342,969 missing values generated)
69
(351,061 missing values generated)
70
(349,635 missing values generated)
71
(346,689 missing values generated)
72
(350,658 missing values generated)
73
(351,100 missing values generated)
74
(351,428 missing values generated)
77
(351,030 missing values generated)
78
(348,961 missing values generated)
79
(351,146 missing values generated)
80
(348,545 missing values generated)
81
(346,497 missing values generated)
82
(349,139 missing values generated)
85
(350,656 missing values generated)
86
(349,745 missing values generated)
87
(351,403 missing values generated)
88
(351,387 missing values generated)
90
(351,389 missing values generated)
91
(351,790 missing values generated)
92
(351,723 missing values generated)
93
(350,706 missing values generated)
94
(351,864 missing values generated)
95
(351,210 missing values generated)
96
(349,539 missing values generated)

. 
. gen  TFP_cd =  .
(352,174 missing values generated)

. levelsof industry_mode, local(levels)
1 2 3 5 8 9 10 11 12 13 14 15 16 17 18 20 21 22 23 24 25 26 27 28 29 30 31 32 3
> 3 35 36 37 38 39 41 42 43 45 46 47 49 50 52 53 55 56 68 69 70 71 72 73 74 77 
> 78 79 80 81 82 85 86 87 88 90 91 92 93 94 95 96

. foreach l of local levels {
  2. 
.                 qui replace TFP_cd = tfp_cd_`l' if TFP_cd == .
  3. }

. 
. drop tfp_cd_*

. 
. * industry dummy and age
. gen byte industrial_firm = inlist(teaor08_1d,"B","C","D","E")

. gen age = year - foundyear

. 
. * missing export means 0 export
. mvencode export exporter exporter_5, mv(0) override
      export: 89911 missing values recoded
  exporter_5: 89911 missing values recoded

. generate domestic_sales = sales - export

. replace domestic_sales = 0 if domestic_sales < 0 | missing(domestic_sales)
(10 real changes made)

. 
. count
  352,174

. 
. *save_all_to_json
. cap drop __*

. save "`here'/temp/balance-small-clean.dta", replace
file /Users/koren/Documents/workspace/expat//temp/balance-small-clean.dta
    saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Documents/workspace/expat//output/balance.log
  log type:  text
 closed on:   6 May 2022, 17:12:32
-------------------------------------------------------------------------------
