--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/balance.log
  log type:  text
 opened on:  31 May 2021, 10:28:43

. 
. use "`here'/input/merleg-expat/balance-small.dta"

. 
. * keep only numeric part of frame_id
. keep if substr(frame_id, 1, 2) == "ft"
(214,062 observations deleted)

. generate long frame_id_numeric = real(substr(frame_id, 3, 8))

. codebook frame_id*

--------------------------------------------------------------------------------------------------------------------------------------------------------------
frame_id                                                                                              Frame_id identify one firm. Only_originalid if not valid
--------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  string (str15), but longest is str10

         unique values:  918,978                  missing "":  0/8,122,237

              examples:  "ft11653592"
                         "ft13650485"
                         "ft21145467"
                         "ft24151038"

--------------------------------------------------------------------------------------------------------------------------------------------------------------
frame_id_numeric                                                                                                                                   (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [10000049,77902216]          units:  1
         unique values:  918,978                  missing .:  0/8,122,237

                  mean:   1.8e+07
              std. dev:   6.6e+06

           percentiles:        10%       25%       50%       75%       90%
                           1.1e+07   1.2e+07   2.0e+07   2.3e+07   2.7e+07

. drop frame_id

. xtset frame_id_numeric year
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1980 to 2018, but with gaps
                delta:  1 unit

. 
. merge m:1 frame_id_numeric year using "`here'/temp/ever_foreign.dta", keepusing(ever_foreign) keep(1 3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                     8,100,531
        from master                 8,100,531  
        from using                          0  

    matched                            21,706  
    -----------------------------------------

. 
. * foreign fill 
. rename fo3 foreign

. tab year foreign, missing

           |  Foreign owned dummy
           | with ultimate owners
      Year |     from Complex
 1980-2018 |         0          1 |     Total
-----------+----------------------+----------
      1980 |     3,231          0 |     3,231 
      1981 |     3,265          0 |     3,265 
      1982 |     3,269          0 |     3,269 
      1983 |     3,288          0 |     3,288 
      1984 |     3,303          0 |     3,303 
      1985 |     3,868          0 |     3,868 
      1986 |     4,244          0 |     4,244 
      1987 |     4,763          0 |     4,763 
      1988 |     5,494          0 |     5,494 
      1989 |    11,073          0 |    11,073 
      1990 |    21,514      2,354 |    23,868 
      1991 |    35,927      4,839 |    40,766 
      1992 |    84,610     10,318 |    94,928 
      1993 |   103,640     14,084 |   117,724 
      1994 |   128,805     18,257 |   147,062 
      1995 |   144,116     19,988 |   164,104 
      1996 |   168,004     21,150 |   189,154 
      1997 |   186,989     22,013 |   209,002 
      1998 |   210,235     23,668 |   233,903 
      1999 |   219,742     23,449 |   243,191 
      2000 |   239,734     24,714 |   264,448 
      2001 |   259,405     25,564 |   284,969 
      2002 |   258,525     26,413 |   284,938 
      2003 |   263,358     26,791 |   290,149 
      2004 |   276,196     27,376 |   303,572 
      2005 |   283,497     27,030 |   310,527 
      2006 |   290,856     27,044 |   317,900 
      2007 |   299,289     28,865 |   328,154 
      2008 |   313,628     31,062 |   344,690 
      2009 |   320,715     31,382 |   352,097 
      2010 |   333,496     31,378 |   364,874 
      2011 |   350,073     31,681 |   381,754 
      2012 |   346,205     29,921 |   376,126 
      2013 |   382,724     29,816 |   412,540 
      2014 |   373,712     28,203 |   401,915 
      2015 |   379,617     27,721 |   407,338 
      2016 |   378,513     26,460 |   404,973 
      2017 |   372,898     24,996 |   397,894 
      2018 |   362,614     21,265 |   383,879 
-----------+----------------------+----------
     Total | 7,434,435    687,802 | 8,122,237 

. inspect foreign

foreign:  Foreign owned dummy with ultim        Number of Observations
-------------------------------------------------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero        7,434,435     7,434,435             -
|  #                         Positive      687,802       687,802             -
|  #                                   -----------   -----------   -----------
|  #                         Total       8,122,237     8,122,237             -
|  #   .                     Missing             -
+----------------------                -----------
0                     1                  8,122,237
   (2 unique values)

. *inspect jetok_18 if missing(foreign)
. recode foreign (.=0)
(foreign: 0 changes made)

. 
. * interpolate small holes
. tab foreign

    Foreign |
owned dummy |
       with |
   ultimate |
owners from |
    Complex |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  7,434,435       91.53       91.53
          1 |    687,802        8.47      100.00
------------+-----------------------------------
      Total |  8,122,237      100.00

. tempvar before

. bys foreign: egen `before' = count(1)

. sort frame_id_numeric year

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & f2.foreign == 1
(800 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & f2.foreign == 0
(770 real changes made)

. bys frame_id_numeric (year): egen minyear = min(year)

. bys frame_id_numeric (year): egen maxyear = max(year)

. replace foreign = 1 if l.foreign == 1 & f.foreign == 1 & f2.foreign == 1 & year == (minyear + 1)
(164 real changes made)

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & year == (minyear + 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & f.foreign == 0 & f2.foreign == 0 & year == (maxyear - 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & year == (maxyear - 1)
(558 real changes made)

. tempvar after

. bys foreign: egen `after' = count(1)

. scalar foreign_interpolate = `before'-`after'

. display foreign_interpolate
-364

. 
. * foreign change
. preserve

. use "`here'/input/ceo-panel/ceo-panel.dta", clear

. * expat is changed if job_begin < 1990 in firm_panel.do, not here
. bys frame_id_numeric: egen first_year_expat = min(cond(expat == 1, year,.))
(11,083,558 missing values generated)

. duplicates drop frame_id_numeric, force

Duplicates in terms of frame_id_numeric

(11,838,988 observations deleted)

. tempfile expat

. save `expat'
file /srv/sandbox/zavecz/St1249358.000002 saved

. restore

. 
. merge m:1 frame_id_numeric using `expat', keepusing(first_year_expat) keep(1 3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                        47,014
        from master                    47,014  
        from using                          0  

    matched                         8,075,223  
    -----------------------------------------

. 
. bys frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.))
(7,066,682 missing values generated)

.         
. generate manager_after_owner = first_year_expat - first_year_foreign
(7,430,121 missing values generated)

. generate event_time = year - first_year_expat
(7,205,766 missing values generated)

. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(2,005 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(2,357 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(31,657 real changes made)

. 
. drop manager_after_owner event_time first_year_expat

. 
. generate time_foreign = year - first_year_foreign
(7,066,682 missing values generated)

. forval i = 0/3 {
  2.         gen foreign`i' = (time_foreign == `i')
  3. }

. forval i = 1/3 {
  2.         gen foreign_`i' = (time_foreign == -`i')
  3. }

. gen count = 1

. 
. do "code/create/calc_hole.do"

. cap drop hole* x

. sort frame_id_numeric year

. gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(918,978 missing values generated)

. forval i = 1(1)10 {
  2.         gen hole`i' = (x > `i' & x != .)
  3. }

. 
end of do-file

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole*, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2     hole3     hole4     hole5
---------+--------------------------------------------------------------------------------------------------------------------------------------------
     sum |    660143     13505     17922     26714    122818    100456     86391     75047   8122237    151035     75330     54102     42482     33985
------------------------------------------------------------------------------------------------------------------------------------------------------

   stats |     hole6     hole7     hole8     hole9    hole10
---------+--------------------------------------------------
     sum |     27923     23339     19628     15908     11840
------------------------------------------------------------

. mat total = r(StatTotal)

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole* if ever_foreign == 1, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2     hole3     hole4     hole5
---------+--------------------------------------------------------------------------------------------------------------------------------------------
     sum |     11895      1022      1156      1399      1498      1310      1085       919     21706       135        24        12         9         4
------------------------------------------------------------------------------------------------------------------------------------------------------

   stats |     hole6     hole7     hole8     hole9    hole10
---------+--------------------------------------------------
     sum |         3         3         2         2         1
------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. 
. * drop greenfield
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (foreign == 0))

. keep if start_as_domestic
(541,862 observations deleted)

. drop owner_spell start_as_domestic

. 
. do "code/create/calc_hole.do"

. cap drop hole* x

. sort frame_id_numeric year

. gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(850,787 missing values generated)

. forval i = 1(1)10 {
  2.         gen hole`i' = (x > `i' & x != .)
  3. }

. 
end of do-file

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole*, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2     hole3     hole4     hole5
---------+--------------------------------------------------------------------------------------------------------------------------------------------
     sum |    271063     13505     17326     24516     54627     44009     37466     32416   7580375    141372     71791     52109     41234     33144
------------------------------------------------------------------------------------------------------------------------------------------------------

   stats |     hole6     hole7     hole8     hole9    hole10
---------+--------------------------------------------------
     sum |     27336     22906     19290     15635     11635
------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole* if ever_foreign == 1, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2     hole3     hole4     hole5
---------+--------------------------------------------------------------------------------------------------------------------------------------------
     sum |     11895      1022      1156      1399      1498      1310      1085       919     21706       135        24        12         9         4
------------------------------------------------------------------------------------------------------------------------------------------------------

   stats |     hole6     hole7     hole8     hole9    hole10
---------+--------------------------------------------------
     sum |         3         3         2         2         1
------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. 
. * limit sample before large merge - sampling based on firm-level variables, firm-year done later
. * average employment and financial firms deleted
. * break the tie when mode is not unique
. 
. bys frame_id_numeric: egen avg_emp = mean(emp)
(90,525 missing values generated)

. bys frame_id_numeric: egen industry_mode = mode(teaor08_2d), minmode
Warning: at least one group contains all missing values or contains multiple modes.  Generating missing values for the mode of these groups.  Use the missing,
maxmode, minmode, or nummode() options to control this behavior.
(1,189 missing values generated)

. local sample ((avg_emp >= 20) & (industry_mode != 64 & industry_mode != 65 & industry_mode != 66))

. drop if !`sample'
(7,100,771 observations deleted)

. scalar dropped_size_or_finance = r(N_drop)

. display dropped_size_or_finance
7100771

. 
. do "code/create/calc_hole.do"

. cap drop hole* x

. sort frame_id_numeric year

. gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(72,938 missing values generated)

. forval i = 1(1)10 {
  2.         gen hole`i' = (x > `i' & x != .)
  3. }

. 
end of do-file

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole*, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2     hole3     hole4     hole5
---------+--------------------------------------------------------------------------------------------------------------------------------------------
     sum |     39066      1704      2124      3024      6425      4777      3771      3199    479604      3507      1239       836       588       442
------------------------------------------------------------------------------------------------------------------------------------------------------

   stats |     hole6     hole7     hole8     hole9    hole10
---------+--------------------------------------------------
     sum |       262       152        54        34        26
------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole* if ever_foreign == 1, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2     hole3     hole4     hole5
---------+--------------------------------------------------------------------------------------------------------------------------------------------
     sum |     11895      1022      1156      1399      1498      1310      1085       919     21706       135        24        12         9         4
------------------------------------------------------------------------------------------------------------------------------------------------------

   stats |     hole6     hole7     hole8     hole9    hole10
---------+--------------------------------------------------
     sum |         3         3         2         2         1
------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. 
. * proxy firm founding date with first balance sheet filed
. tempvar foundyear

. bys frame_id_numeric: egen `foundyear' = min(year)

. replace foundyear = `foundyear' if missing(foundyear)
(0 real changes made)

. drop `foundyear'

. 
. * deflate nominal values - FIXME: add ppi before 1992
. foreach x in sales export tanass jetok ranyag ranyag8091 immat {
  2.         cap drop `x'_18
  3.         gen double `x'_18 = `x' / ppi18
  4.         replace `x'_18 = `x' if year < 1992 // FIXME: till ppi before 1992 is not filled up - just to not delete those rows because of missing ln depende
> nt variables
  5. }
(30,488 missing values generated)
(56,581 real changes made)
(208,162 missing values generated)
(32,078 real changes made)
(38,256 missing values generated)
(54,477 real changes made)
(30,278 missing values generated)
(55,400 real changes made)
(64,183 missing values generated)
(0 real changes made)
(24,745 missing values generated)
(56,733 real changes made)
(167,374 missing values generated)
(0 real changes made)

. 
. * change emp
. sort frame_id_numeric year

. 
. clonevar emp_clean = emp
(98,939 missing values generated)

. replace emp_clean = . if (emp[_n-1] > 5 | emp[_n +1] > 5) & emp == 0
(6,920 real changes made, 6,920 to missing)

. corr emp emp_clean
(obs=373,745)

             |      emp emp_cl~n
-------------+------------------
         emp |   1.0000
   emp_clean |   1.0000   1.0000


. 
. gen emp_add = emp_clean + 1
(105,859 missing values generated)

. 
. * creating dependent variables
. gen lnL = ln(emp)
(110,753 missing values generated)

. gen lnL_add = ln(emp_add)
(105,859 missing values generated)

. gen lnM = ln(ranyag_18)
(79,817 missing values generated)

. replace lnM = ln(ranyag8091_18) if year <= 1991
(56,587 real changes made)

. gen lnQ = ln(sales_18)
(53,107 missing values generated)

. gen lnQL = lnQ-lnL
(113,471 missing values generated)

. gen lnMQ = lnM - lnQ
(57,303 missing values generated)

. gen byte exporter = export_18 > 0 & export_18 != .

. gen export_share = export_18 / sales
(191,583 missing values generated)

. gen exporter_5 = (export_share > .05 & export_share != .)

. replace exporter_5 = . if export_share == .
(191,583 real changes made, 191,583 to missing)

. 
. * extrapolate capital stock
. inspect tanass_18

tanass_18:                                      Number of Observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            4             1             3
|  #                         Zero           67,537        67,537             -
|  #                         Positive      397,658        75,200       322,458
|  #                                   -----------   -----------   -----------
|  #                         Total         465,199       142,738       322,461
|  #   .   .   .   .         Missing        14,405
+----------------------                -----------
-800.3072      6.09e+09                    479,604
(More than 99 unique values)

. tempvar gap 

. generate `gap' = missing(tanass_18) | (tanass_18 <= 0)

. bysort frame_id_numeric (year): generate spell = sum(`gap' != `gap'[_n-1])

. 
. egen gap_length = count(1), by(frame_id_numeric spell)

. egen max_spell = max(spell), by(frame_id_numeric)

. * if gap_length <= 2, interpolate tanass with geometric average
. bysort frame_id_numeric (year): replace tanass_18 = sqrt(tanass_18[_n-1] * tanass_18[_n+1]) if gap_length==1 & `gap'==1
(21828 real changes made, 20486 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1]^0.67 * tanass_18[_n+2]^0.33 if gap_length==2 & `gap'==1 & `gap'[_n-1]==0
(805 real changes made, 605 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-2]^0.33 * tanass_18[_n+1]^0.67 if gap_length==2 & `gap'==1 & `gap'[_n+1]==0
(1599 real changes made, 1399 to missing)

. * at either end, extrapolate for 1 year
. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n+1] if spell==1 & `gap'==1 & `gap'[_n+1]==0
(9755 real changes made)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1] if spell==max_spell & `gap'==1 & `gap'[_n-1]==0
(3841 real changes made)

. 
. drop spell gap_length max_spell

. replace tanass_18 = round(tanass_18)
(334,901 real changes made)

. inspect tanass_18

tanass_18:                                      Number of Observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            2             2             -
|  #                         Zero           42,729        42,729             -
|  #                         Positive      412,996       412,986            10
|  #                                   -----------   -----------   -----------
|  #                         Total         455,727       455,717            10
|  #   .   .   .   .         Missing        23,877
+----------------------                -----------
-60            6.09e+09                    479,604
(More than 99 unique values)

. 
. gen lnK = ln(tanass_18)
(66,608 missing values generated)

. gen lnKL = lnK - lnL
(116,904 missing values generated)

. generate RperK = immat / (immat + tanass)
(226,938 missing values generated)

. replace RperK = 0 if RperK < 0 | missing(immat)
(166,489 real changes made)

. label variable RperK "Share of immaterial assets [0,1]"

. 
. * firm-year deletions
. count if missing(lnK, lnQ, lnL, lnM, foreign) & year > 1991
  116,970

. count if missing(lnK, lnQ, lnL, lnM, foreign)
  121,620

. *drop if missing(lnK, lnQ, lnL, lnM, foreign) // ASK: whether year condition needed
. *count
. 
. foreach var in lnK lnQ lnL lnM {
  2. 
.         drop if missing(`var')
  3.         
.         do "code/create/calc_hole.do"
  4.         tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole*, stat(sum) save
  5.         mat total = (total \ r(StatTotal))
  6.         tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole* if ever_foreign == 1, stat(sum) save
  7.         mat total = (total \ r(StatTotal))
  8. }
(66,608 observations deleted)

. cap drop hole* x

. sort frame_id_numeric year

. gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(41,984 missing values generated)

. forval i = 1(1)10 {
  2.         gen hole`i' = (x > `i' & x != .)
  3. }

. 
end of do-file

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2     hole3     hole4     hole5
---------+--------------------------------------------------------------------------------------------------------------------------------------------
     sum |     36716      1626      1956      2615      4252      3759      3337      3009    412996      2966       989       687       449       309
------------------------------------------------------------------------------------------------------------------------------------------------------

   stats |     hole6     hole7     hole8     hole9    hole10
---------+--------------------------------------------------
     sum |       207       120        67        45        34
------------------------------------------------------------

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2     hole3     hole4     hole5
---------+--------------------------------------------------------------------------------------------------------------------------------------------
     sum |     11895      1022      1156      1399      1498      1310      1085       919     21706       148        38        26        19        10
------------------------------------------------------------------------------------------------------------------------------------------------------

   stats |     hole6     hole7     hole8     hole9    hole10
---------+--------------------------------------------------
     sum |         6         5         4         4         2
------------------------------------------------------------
(17,323 observations deleted)

. cap drop hole* x

. sort frame_id_numeric year

. gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(39,146 missing values generated)

. forval i = 1(1)10 {
  2.         gen hole`i' = (x > `i' & x != .)
  3. }

. 
end of do-file

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2     hole3     hole4     hole5
---------+--------------------------------------------------------------------------------------------------------------------------------------------
     sum |     35865      1581      1844      2334      3310      3508      3232      2937    395673      3453      1080       667       429       289
------------------------------------------------------------------------------------------------------------------------------------------------------

   stats |     hole6     hole7     hole8     hole9    hole10
---------+--------------------------------------------------
     sum |       198       124        77        51        33
------------------------------------------------------------

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2     hole3     hole4     hole5
---------+--------------------------------------------------------------------------------------------------------------------------------------------
     sum |     11895      1022      1156      1399      1498      1310      1085       919     21706       192        53        31        20        10
------------------------------------------------------------------------------------------------------------------------------------------------------

   stats |     hole6     hole7     hole8     hole9    hole10
---------+--------------------------------------------------
     sum |         6         5         4         4         2
------------------------------------------------------------
(35,023 observations deleted)

. cap drop hole* x

. sort frame_id_numeric year

. gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(27,403 missing values generated)

. forval i = 1(1)10 {
  2.         gen hole`i' = (x > `i' & x != .)
  3. }

. 
end of do-file

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2     hole3     hole4     hole5
---------+--------------------------------------------------------------------------------------------------------------------------------------------
     sum |     34413      1505      1728      2048      2768      3102      2984      2795    360650      3970      1254       684       419       268
------------------------------------------------------------------------------------------------------------------------------------------------------

   stats |     hole6     hole7     hole8     hole9    hole10
---------+--------------------------------------------------
     sum |       193       137       101        75        59
------------------------------------------------------------

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2     hole3     hole4     hole5
---------+--------------------------------------------------------------------------------------------------------------------------------------------
     sum |     11895      1022      1156      1399      1498      1310      1085       919     21706       291        96        53        34        21
------------------------------------------------------------------------------------------------------------------------------------------------------

   stats |     hole6     hole7     hole8     hole9    hole10
---------+--------------------------------------------------
     sum |        14        10         7         5         3
------------------------------------------------------------
(2,666 observations deleted)

. cap drop hole* x

. sort frame_id_numeric year

. gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(27,387 missing values generated)

. forval i = 1(1)10 {
  2.         gen hole`i' = (x > `i' & x != .)
  3. }

. 
end of do-file

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2     hole3     hole4     hole5
---------+--------------------------------------------------------------------------------------------------------------------------------------------
     sum |     34247      1503      1724      2040      2760      3092      2982      2791    357984      4163      1303       694       421       267
------------------------------------------------------------------------------------------------------------------------------------------------------

   stats |     hole6     hole7     hole8     hole9    hole10
---------+--------------------------------------------------
     sum |       190       133        97        72        56
------------------------------------------------------------

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2     hole3     hole4     hole5
---------+--------------------------------------------------------------------------------------------------------------------------------------------
     sum |     11895      1022      1156      1399      1498      1310      1085       919     21706       305       100        55        35        22
------------------------------------------------------------------------------------------------------------------------------------------------------

   stats |     hole6     hole7     hole8     hole9    hole10
---------+--------------------------------------------------
     sum |        15        11         8         6         3
------------------------------------------------------------

. 
. *drop if missing(foreign)
. *tabstat foreign foreign_0 foreign_1 count, stat(sum) save
. *mat total = (total \ r(StatTotal))
. 
. *drop hole* x
. mat list total

total[14,19]
       foreign  foreign_3  foreign_2  foreign_1   foreign0   foreign1   foreign2   foreign3      count      hole1      hole2      hole3      hole4      hole5
sum     660143      13505      17922      26714     122818     100456      86391      75047    8122237     151035      75330      54102      42482      33985
sum      11895       1022       1156       1399       1498       1310       1085        919      21706        135         24         12          9          4
sum     271063      13505      17326      24516      54627      44009      37466      32416    7580375     141372      71791      52109      41234      33144
sum      11895       1022       1156       1399       1498       1310       1085        919      21706        135         24         12          9          4
sum      39066       1704       2124       3024       6425       4777       3771       3199     479604       3507       1239        836        588        442
sum      11895       1022       1156       1399       1498       1310       1085        919      21706        135         24         12          9          4
sum      36716       1626       1956       2615       4252       3759       3337       3009     412996       2966        989        687        449        309
sum      11895       1022       1156       1399       1498       1310       1085        919      21706        148         38         26         19         10
sum      35865       1581       1844       2334       3310       3508       3232       2937     395673       3453       1080        667        429        289
sum      11895       1022       1156       1399       1498       1310       1085        919      21706        192         53         31         20         10
sum      34413       1505       1728       2048       2768       3102       2984       2795     360650       3970       1254        684        419        268
sum      11895       1022       1156       1399       1498       1310       1085        919      21706        291         96         53         34         21
sum      34247       1503       1724       2040       2760       3092       2982       2791     357984       4163       1303        694        421        267
sum      11895       1022       1156       1399       1498       1310       1085        919      21706        305        100         55         35         22

         hole6      hole7      hole8      hole9     hole10
sum      27923      23339      19628      15908      11840
sum          3          3          2          2          1
sum      27336      22906      19290      15635      11635
sum          3          3          2          2          1
sum        262        152         54         34         26
sum          3          3          2          2          1
sum        207        120         67         45         34
sum          6          5          4          4          2
sum        198        124         77         51         33
sum          6          5          4          4          2
sum        193        137        101         75         59
sum         14         10          7          5          3
sum        190        133         97         72         56
sum         15         11          8          6          3

. count
  357,984

. 
. * TFP (Cobb-Douglas)
. * FIXME: Replace CD with something fancy
. recode industry_mode (6 75 7 66 84 19 51 = .)
(industry_mode: 505 changes made)

. 
. levelsof industry_mode, local(levels)
1 2 3 5 8 9 10 11 12 13 14 15 16 17 18 20 21 22 23 24 25 26 27 28 29 30 31 32 33 35 36 37 38 39 41 42 43 45 46 47 49 50 52 53 55 56 68 69 70 71 72 73 74 77 78
>  79 80 81 82 85 86 87 88 90 91 92 93 94 95 96

.         foreach l of local levels {
  2.         disp `l'
  3.         qui reghdfe lnQ lnL lnK lnM if industry_mode == `l', a(frame_id_numeric year foundyear) resid
  4.         predict tfp_cd_`l', res
  5.         }
1
(309,177 missing values generated)
2
(356,988 missing values generated)
3
(357,256 missing values generated)
5
(357,671 missing values generated)
8
(356,939 missing values generated)
9
(357,868 missing values generated)
10
(339,460 missing values generated)
11
(355,791 missing values generated)
12
(357,919 missing values generated)
13
(353,971 missing values generated)
14
(348,175 missing values generated)
15
(354,262 missing values generated)
16
(353,059 missing values generated)
17
(355,979 missing values generated)
18
(354,416 missing values generated)
20
(355,253 missing values generated)
21
(357,104 missing values generated)
22
(351,041 missing values generated)
23
(353,447 missing values generated)
24
(355,832 missing values generated)
25
(339,548 missing values generated)
26
(352,513 missing values generated)
27
(354,028 missing values generated)
28
(348,040 missing values generated)
29
(355,473 missing values generated)
30
(357,340 missing values generated)
31
(353,070 missing values generated)
32
(356,026 missing values generated)
33
(356,904 missing values generated)
35
(355,237 missing values generated)
36
(355,118 missing values generated)
37
(357,536 missing values generated)
38
(354,779 missing values generated)
39
(357,175 missing values generated)
41
(346,168 missing values generated)
42
(344,818 missing values generated)
43
(346,300 missing values generated)
45
(347,053 missing values generated)
46
(331,834 missing values generated)
47
(332,886 missing values generated)
49
(348,030 missing values generated)
50
(357,722 missing values generated)
52
(353,774 missing values generated)
53
(357,519 missing values generated)
55
(353,741 missing values generated)
56
(349,572 missing values generated)
68
(348,956 missing values generated)
69
(356,762 missing values generated)
70
(355,563 missing values generated)
71
(352,071 missing values generated)
72
(356,345 missing values generated)
73
(356,809 missing values generated)
74
(357,167 missing values generated)
77
(356,888 missing values generated)
78
(354,816 missing values generated)
79
(356,894 missing values generated)
80
(354,402 missing values generated)
81
(352,237 missing values generated)
82
(355,014 missing values generated)
85
(356,331 missing values generated)
86
(355,570 missing values generated)
87
(357,230 missing values generated)
88
(357,183 missing values generated)
90
(357,234 missing values generated)
91
(357,606 missing values generated)
92
(357,649 missing values generated)
93
(356,492 missing values generated)
94
(357,688 missing values generated)
95
(356,969 missing values generated)
96
(354,876 missing values generated)

. 
. gen  TFP_cd =  .
(357,984 missing values generated)

. levelsof industry_mode, local(levels)
1 2 3 5 8 9 10 11 12 13 14 15 16 17 18 20 21 22 23 24 25 26 27 28 29 30 31 32 33 35 36 37 38 39 41 42 43 45 46 47 49 50 52 53 55 56 68 69 70 71 72 73 74 77 78
>  79 80 81 82 85 86 87 88 90 91 92 93 94 95 96

. foreach l of local levels {
  2. 
.                 qui replace TFP_cd = tfp_cd_`l' if TFP_cd == .
  3. }

. 
. drop tfp_cd_*

. 
. * industry dummy and age
. gen byte industrial_firm = inlist(teaor08_1d,"B","C","D","E")

. gen age = year - foundyear

. 
. * missing export means 0 export
. mvencode export exporter exporter_5, mv(0) override
      export: 87662 missing values recoded
  exporter_5: 87662 missing values recoded

. generate domestic_sales = sales - export

. replace domestic_sales = 0 if domestic_sales < 0 | missing(domestic_sales)
(8 real changes made)

. 
. count
  357,984

. 
. matrix rownames total = "beginning" "greenfield dropped" "sampling" "missing lnK" "missing lnQ" "missing lnL" "missing lnM"

. mata : mat_total_balance = st_matrix("total")

. mata: mata matsave "temp/matrix-balance" mat_total_balance, replace
(saving mat_total_balance[14,19])
file temp/matrix-balance.mmat saved

. drop hole* x

. 
. save_all_to_json

. cap drop __*

. save "`here'/temp/balance-small-clean.dta", replace
file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//temp/balance-small-clean.dta saved

. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/balance.log
  log type:  text
 closed on:  31 May 2021, 10:32:52
--------------------------------------------------------------------------------------------------------------------------------------------------------------
