-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Documents/workspace/expat//output/balance.log
  log type:  text
 opened on:   7 Jul 2021, 23:34:49

. 
. use "`here'/input/merleg-expat/balance-small.dta"

. 
. * keep only numeric part of frame_id
. keep if substr(frame_id, 1, 2) == "ft"
(223,690 observations deleted)

. generate long frame_id_numeric = real(substr(frame_id, 3, 8))

. codebook frame_id*

-------------------------------------------------------------------------------
frame_id               Frame_id identify one firm. Only_originalid if not valid
-------------------------------------------------------------------------------

                  type:  string (str15), but longest is str10

         unique values:  912,852                  missing "":  0/8,091,096

              examples:  "ft11712107"
                         "ft13692957"
                         "ft21175000"
                         "ft24181664"

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [10000049,90620052]          units:  1
         unique values:  912,852                  missing .:  0/8,091,096

                  mean:   1.8e+07
              std. dev:   6.6e+06

           percentiles:        10%       25%       50%       75%       90%
                           1.1e+07   1.2e+07   2.0e+07   2.3e+07   2.7e+07

. drop frame_id

. xtset frame_id_numeric year
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1980 to 2018, but with gaps
                delta:  1 unit

. 
. do "code/create/emp_clean"

. cap drop emp_cl

. clonevar emp_cl=emp
(827,103 missing values generated)

. 
. xtset frame_id_numeric year
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1980 to 2018, but with gaps
                delta:  1 unit

. 
. replace emp_cl=l.emp_cl if 8*emp_cl<l.emp_cl & 8*emp_cl<f.emp_cl & f.emp_cl!=
> . & l.emp_cl!=. & l.emp_cl>0 & emp_cl>0 & f.emp_cl>0 & 1.1*f.emp_cl>l.emp_cl 
> & f.emp_cl>50 & l.emp_cl>50 /*29*/
(1 real change made)

. replace emp_cl=l.emp_cl if emp_cl>8*l.emp_cl & emp_cl>8*f.emp_cl & f.emp_cl!=
> . & l.emp_cl!=. & emp_cl!=. & l.emp_cl>0 & f.emp_cl>0 & 1.1*l.emp_cl>f.emp_cl
>  & f.emp_cl>50 & l.emp_cl>50 /*20*/
(3 real changes made)

. 
. replace emp_cl=. if 8*emp_cl<l.emp_cl & 8*emp_cl<f.emp_cl & f.emp_cl!=. & l.e
> mp_cl!=. & l.emp_cl>0 & emp_cl>0 & f.emp_cl>0 /*& 1.1*f.emp_cl<l.emp_cl 73*/
(1 real change made, 1 to missing)

. replace emp_cl=. if emp_cl>8*l.emp_cl & emp_cl>8*f.emp_cl & f.emp_cl!=. & l.e
> mp_cl!=. & emp_cl!=. & l.emp_cl>0 & f.emp_cl>0 /*& 1.1*l.emp_cl<f.emp_cl 114*
> /
(3 real changes made, 3 to missing)

. 
. 
. * if emp<6
. replace emp_cl=0 if emp_cl>6 & l.emp_cl==0 & f.emp_cl==0 & emp_cl!=. /*418*/
(0 real changes made)

. replace emp_cl=l.emp_cl if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. 
> & f.emp_cl!=. & l.emp_cl+5>f.emp_cl /*1630*/
(0 real changes made)

. replace emp_cl=l.emp_cl if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. 
> & f.emp_cl!=. & l.emp_cl<f.emp_cl+5 /*532*/
(0 real changes made)

. 
. replace emp_cl=. if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. & f.emp
> _cl!=. & l.emp_cl+5<f.emp_cl /*0*/
(0 real changes made)

. replace emp_cl=. if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. & f.emp
> _cl!=. & l.emp_cl>f.emp_cl+5 /*0*/
(0 real changes made)

. 
. ***** Last year
. bysort frame_id_numeric: egen lastyear=max(year)

. foreach i of numlist 1980/2018 {
  2. 
.     local j=`i'+1
  3. 
.     gen j1=emp_cl if year == `i'
  4.     gen j2=emp_cl if year == `j'
  5.    
.     bysort frame_id_numeric: egen v=mean(j1)
  6.     bysort frame_id_numeric: egen w=mean(j2)
  7.    
.     sort frame_id_numeric year
  8.    
.     replace emp_cl=. if 8*v<w & v>0 & w!=. & lastyear==`j' & year==`j'
  9.     replace emp_cl=. if 8*w<v & w>0 & v!=. & lastyear==`j' & year==`j'
 10.    
.     replace emp_cl=. if v>5 & w==0 & v!=. & lastyear==`j' & year==`j'
 11.     replace emp_cl=. if w>5 & v==0 & w!=. & lastyear==`j' & year==`j'
 12.    
.     drop j1 j2 v w      
 13. }
(8,088,431 missing values generated)
(8,088,402 missing values generated)
(8020623 missing values generated)
(8019958 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,088,402 missing values generated)
(8,088,401 missing values generated)
(8019958 missing values generated)
(8019929 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,088,401 missing values generated)
(8,088,393 missing values generated)
(8019929 missing values generated)
(8019812 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,088,393 missing values generated)
(8,088,386 missing values generated)
(8019812 missing values generated)
(8019704 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,088,386 missing values generated)
(8,088,086 missing values generated)
(8019704 missing values generated)
(8014186 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,088,086 missing values generated)
(8,087,934 missing values generated)
(8014186 missing values generated)
(8011679 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,087,934 missing values generated)
(8,087,732 missing values generated)
(8011679 missing values generated)
(8008621 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,087,732 missing values generated)
(8,087,520 missing values generated)
(8008621 missing values generated)
(8005276 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,087,520 missing values generated)
(8,086,028 missing values generated)
(8005276 missing values generated)
(7980457 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,086,028 missing values generated)
(8,075,843 missing values generated)
(7980457 missing values generated)
(7819778 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,075,843 missing values generated)
(8,062,623 missing values generated)
(7819778 missing values generated)
(7615565 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,062,623 missing values generated)
(8,000,272 missing values generated)
(7615565 missing values generated)
(6821690 missing values generated)
(2 real changes made, 2 to missing)
(40 real changes made, 40 to missing)
(103 real changes made, 103 to missing)
(7 real changes made, 7 to missing)
(8,000,424 missing values generated)
(7,975,028 missing values generated)
(6822486 missing values generated)
(6406936 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,975,028 missing values generated)
(7,945,340 missing values generated)
(6406936 missing values generated)
(5955568 missing values generated)
(0 real changes made)
(0 real changes made)
(2 real changes made, 2 to missing)
(0 real changes made)
(7,945,342 missing values generated)
(7,928,245 missing values generated)
(5955576 missing values generated)
(5631483 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,928,245 missing values generated)
(7,903,325 missing values generated)
(5631483 missing values generated)
(5214787 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,903,325 missing values generated)
(7,883,163 missing values generated)
(5214787 missing values generated)
(4856246 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,883,164 missing values generated)
(7,857,954 missing values generated)
(4856251 missing values generated)
(4478434 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(4 real changes made, 4 to missing)
(7,857,960 missing values generated)
(7,849,175 missing values generated)
(4478465 missing values generated)
(4293033 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,849,176 missing values generated)
(7,827,545 missing values generated)
(4293041 missing values generated)
(3979507 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,827,545 missing values generated)
(7,807,002 missing values generated)
(3979507 missing values generated)
(3706038 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,807,002 missing values generated)
(7,806,987 missing values generated)
(3706038 missing values generated)
(3628128 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(7,806,990 missing values generated)
(7,801,891 missing values generated)
(3628146 missing values generated)
(3526513 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,801,892 missing values generated)
(7,788,407 missing values generated)
(3526516 missing values generated)
(3343694 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,788,409 missing values generated)
(7,836,967 missing values generated)
(3343705 missing values generated)
(3991760 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,836,968 missing values generated)
(7,825,074 missing values generated)
(3991767 missing values generated)
(3824829 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,825,074 missing values generated)
(7,814,264 missing values generated)
(3824829 missing values generated)
(3713518 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,814,266 missing values generated)
(7,771,101 missing values generated)
(3713531 missing values generated)
(3229628 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,771,102 missing values generated)
(7,768,799 missing values generated)
(3229631 missing values generated)
(3244062 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,768,799 missing values generated)
(7,757,321 missing values generated)
(3244062 missing values generated)
(3156488 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,757,321 missing values generated)
(7,756,980 missing values generated)
(3156488 missing values generated)
(3241577 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,756,981 missing values generated)
(7,761,809 missing values generated)
(3241581 missing values generated)
(3376996 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,761,811 missing values generated)
(7,765,189 missing values generated)
(3377008 missing values generated)
(3493759 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,765,189 missing values generated)
(7,767,417 missing values generated)
(3493759 missing values generated)
(3569214 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,767,417 missing values generated)
(7,868,561 missing values generated)
(3569214 missing values generated)
(4977195 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(2 real changes made, 2 to missing)
(7,868,564 missing values generated)
(7,725,651 missing values generated)
(4977209 missing values generated)
(3120140 missing values generated)
(0 real changes made)
(2 real changes made, 2 to missing)
(0 real changes made)
(0 real changes made)
(7,725,653 missing values generated)
(7,733,067 missing values generated)
(3120163 missing values generated)
(3274217 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,733,068 missing values generated)
(7,744,442 missing values generated)
(3274225 missing values generated)
(3514325 missing values generated)
(349 real changes made, 349 to missing)
(364 real changes made, 364 to missing)
(760 real changes made, 760 to missing)
(634 real changes made, 634 to missing)
(7,746,549 missing values generated)
(8,091,096 missing values generated)
(3536118 missing values generated)
(8091096 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. ***** First year 
. bysort frame_id_numeric: egen firstyear=min(year)

. foreach i of numlist 1981/2019 {
  2. 
.     local j=`i'-1
  3. 
.     gen j1=emp if year == `i'
  4.     gen j2=emp if year == `j'
  5.    
.     bysort frame_id_numeric: egen v=mean(j1)
  6.     bysort frame_id_numeric: egen w=mean(j2)
  7.    
.     sort frame_id_numeric year
  8.    
.     replace emp_cl=. if 8*v<w & v>0 & w!=. & firstyear==`j' & year==`j'
  9.     replace emp_cl=. if 8*w<v & w>0 & v!=. & firstyear==`j' & year==`j'
 10.    
.     replace emp_cl=. if v>5 & w==0 & v!=. & firstyear==`j' & year==`j'
 11.     replace emp_cl=. if w>5 & v==0 & w!=. & firstyear==`j' & year==`j'
 12.    
.     drop j1 j2 v w
 13. }
(8,088,402 missing values generated)
(8,088,431 missing values generated)
(8019958 missing values generated)
(8020623 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,088,401 missing values generated)
(8,088,402 missing values generated)
(8019929 missing values generated)
(8019958 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,088,393 missing values generated)
(8,088,401 missing values generated)
(8019812 missing values generated)
(8019929 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,088,386 missing values generated)
(8,088,393 missing values generated)
(8019704 missing values generated)
(8019812 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,088,086 missing values generated)
(8,088,386 missing values generated)
(8014186 missing values generated)
(8019704 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,087,934 missing values generated)
(8,088,086 missing values generated)
(8011679 missing values generated)
(8014186 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,087,732 missing values generated)
(8,087,934 missing values generated)
(8008621 missing values generated)
(8011679 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,087,520 missing values generated)
(8,087,732 missing values generated)
(8005276 missing values generated)
(8008621 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,086,028 missing values generated)
(8,087,520 missing values generated)
(7980457 missing values generated)
(8005276 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,075,840 missing values generated)
(8,086,028 missing values generated)
(7819719 missing values generated)
(7980457 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,062,623 missing values generated)
(8,075,840 missing values generated)
(7615565 missing values generated)
(7819719 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,000,272 missing values generated)
(8,062,623 missing values generated)
(6821690 missing values generated)
(7615565 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(2 real changes made, 2 to missing)
(7,975,028 missing values generated)
(8,000,272 missing values generated)
(6406936 missing values generated)
(6821690 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,945,340 missing values generated)
(7,975,028 missing values generated)
(5955568 missing values generated)
(6406936 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,928,245 missing values generated)
(7,945,340 missing values generated)
(5631483 missing values generated)
(5955568 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,903,325 missing values generated)
(7,928,245 missing values generated)
(5214787 missing values generated)
(5631483 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,883,163 missing values generated)
(7,903,325 missing values generated)
(4856246 missing values generated)
(5214787 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,857,954 missing values generated)
(7,883,163 missing values generated)
(4478434 missing values generated)
(4856246 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,849,175 missing values generated)
(7,857,954 missing values generated)
(4293033 missing values generated)
(4478434 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,827,545 missing values generated)
(7,849,175 missing values generated)
(3979507 missing values generated)
(4293033 missing values generated)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,807,002 missing values generated)
(7,827,545 missing values generated)
(3706038 missing values generated)
(3979507 missing values generated)
(0 real changes made)
(0 real changes made)
(2 real changes made, 2 to missing)
(5 real changes made, 5 to missing)
(7,806,987 missing values generated)
(7,807,002 missing values generated)
(3628128 missing values generated)
(3706038 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(2 real changes made, 2 to missing)
(7,801,891 missing values generated)
(7,806,987 missing values generated)
(3526513 missing values generated)
(3628128 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,788,407 missing values generated)
(7,801,891 missing values generated)
(3343694 missing values generated)
(3526513 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(7,836,967 missing values generated)
(7,788,407 missing values generated)
(3991760 missing values generated)
(3343694 missing values generated)
(0 real changes made)
(0 real changes made)
(4 real changes made, 4 to missing)
(0 real changes made)
(7,825,074 missing values generated)
(7,836,967 missing values generated)
(3824829 missing values generated)
(3991760 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,814,264 missing values generated)
(7,825,074 missing values generated)
(3713518 missing values generated)
(3824829 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,771,100 missing values generated)
(7,814,264 missing values generated)
(3229617 missing values generated)
(3713518 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(7,768,799 missing values generated)
(7,771,100 missing values generated)
(3244062 missing values generated)
(3229617 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(7,757,321 missing values generated)
(7,768,799 missing values generated)
(3156488 missing values generated)
(3244062 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(7,756,980 missing values generated)
(7,757,321 missing values generated)
(3241577 missing values generated)
(3156488 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,761,809 missing values generated)
(7,756,980 missing values generated)
(3376996 missing values generated)
(3241577 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,765,189 missing values generated)
(7,761,809 missing values generated)
(3493759 missing values generated)
(3376996 missing values generated)
(0 real changes made)
(0 real changes made)
(3 real changes made, 3 to missing)
(0 real changes made)
(7,767,417 missing values generated)
(7,765,189 missing values generated)
(3569214 missing values generated)
(3493759 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,868,561 missing values generated)
(7,767,417 missing values generated)
(4977195 missing values generated)
(3569214 missing values generated)
(0 real changes made)
(2 real changes made, 2 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,725,651 missing values generated)
(7,868,561 missing values generated)
(3120140 missing values generated)
(4977195 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,733,067 missing values generated)
(7,725,651 missing values generated)
(3274217 missing values generated)
(3120140 missing values generated)
(1 real change made, 1 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(0 real changes made)
(7,744,442 missing values generated)
(7,733,067 missing values generated)
(3514325 missing values generated)
(3274217 missing values generated)
(9 real changes made, 9 to missing)
(73 real changes made, 73 to missing)
(18 real changes made, 18 to missing)
(27 real changes made, 27 to missing)
(8,091,096 missing values generated)
(7,744,442 missing values generated)
(8091096 missing values generated)
(3514325 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. drop firstyear lastyear

. 
end of do-file

. count
  8,091,096

. count if emp == emp_cl & emp != .
  7,261,521

. count if emp != emp_cl & emp != . & emp_cl != .
  4

. count if emp != emp_cl & emp != .
  2,472

. count if emp != emp_cl & emp_cl != .
  4

. gen emp_add = emp_cl + 1
(829,571 missing values generated)

. corr emp emp_cl emp_add
(obs=7,261,525)

             |      emp   emp_cl  emp_add
-------------+---------------------------
         emp |   1.0000
      emp_cl |   0.9994   1.0000
     emp_add |   0.9994   1.0000   1.0000


. 
. * foreign fill 
. rename fo3 foreign

. tab year foreign, missing

           |     Foreign owned dummy with
      Year |   ultimate owners from Complex
 1992-2018 |         0          1          . |     Total
-----------+---------------------------------+----------
      1980 |         0          0      2,666 |     2,666 
      1981 |         0          0      2,695 |     2,695 
      1982 |         0          0      2,695 |     2,695 
      1983 |         0          0      2,705 |     2,705 
      1984 |         0          0      2,711 |     2,711 
      1985 |         0          0      3,025 |     3,025 
      1986 |         0          0      3,178 |     3,178 
      1987 |         0          0      3,402 |     3,402 
      1988 |         0          0      3,806 |     3,806 
      1989 |         0          0      6,891 |     6,891 
      1990 |         0      1,679     14,378 |    16,057 
      1991 |         0      3,728     25,969 |    29,697 
      1992 |    84,899     10,011          0 |    94,910 
      1993 |   103,631     14,078          0 |   117,709 
      1994 |   128,807     18,254          0 |   147,061 
      1995 |   144,108     19,995          0 |   164,103 
      1996 |   167,988     21,162          0 |   189,150 
      1997 |   186,967     22,034          0 |   209,001 
      1998 |   210,212     23,688          0 |   233,900 
      1999 |   219,705     23,467          0 |   243,172 
      2000 |   239,695     24,729          0 |   264,424 
      2001 |   259,359     25,584          0 |   284,943 
      2002 |   258,488     26,424          0 |   284,912 
      2003 |   263,329     26,801          0 |   290,130 
      2004 |   276,167     27,390          0 |   303,557 
      2005 |   283,478     27,036          0 |   310,514 
      2006 |   290,840     27,049          0 |   317,889 
      2007 |   299,264     28,884          0 |   328,148 
      2008 |   313,604     31,085          0 |   344,689 
      2009 |   320,696     31,396          0 |   352,092 
      2010 |   333,480     31,385          0 |   364,865 
      2011 |   350,082     31,666          0 |   381,748 
      2012 |   346,207     29,911          0 |   376,118 
      2013 |   383,551     28,980          0 |   412,531 
      2014 |   375,024     26,893          0 |   401,917 
      2015 |   382,703     24,633          0 |   407,336 
      2016 |   381,180     23,793          0 |   404,973 
      2017 |   375,365     22,528          0 |   397,893 
      2018 |   363,988     19,895          0 |   383,883 
-----------+---------------------------------+----------
     Total | 7,342,817    674,158     74,121 | 8,091,096 

. inspect foreign

foreign:  Foreign owned dummy with ultim        Number of Observations
-------------------------------------------------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero        7,342,817     7,342,817             -
|  #                         Positive      674,158       674,158             -
|  #                                   -----------   -----------   -----------
|  #                         Total       8,016,975     8,016,975             -
|  #   .                     Missing        74,121
+----------------------                -----------
0                     1                  8,091,096
   (2 unique values)

. *inspect jetok_18 if missing(foreign)
. recode foreign (.=0)
(foreign: 74121 changes made)

. 
. * interpolate small holes
. tab foreign

    Foreign |
owned dummy |
       with |
   ultimate |
owners from |
    Complex |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  7,416,938       91.67       91.67
          1 |    674,158        8.33      100.00
------------+-----------------------------------
      Total |  8,091,096      100.00

. tempvar before

. bys foreign: egen `before' = count(1)

. sort frame_id_numeric year

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & f2
> .foreign == 1
(1,292 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & f2
> .foreign == 0
(1,225 real changes made)

. bys frame_id_numeric (year): egen minyear = min(year)

. bys frame_id_numeric (year): egen maxyear = max(year)

. replace foreign = 1 if l.foreign == 1 & f.foreign == 1 & f2.foreign == 1 & ye
> ar == (minyear + 1)
(308 real changes made)

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & ye
> ar == (minyear + 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & f.foreign == 0 & f2.foreign == 0 & ye
> ar == (maxyear - 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & ye
> ar == (maxyear - 1)
(296 real changes made)

. tempvar after

. bys foreign: egen `after' = count(1)

. scalar foreign_interpolate = `before'-`after'

. display foreign_interpolate
79

. 
. * foreign change
. preserve

. use "`here'/input/ceo-panel/ceo-panel.dta", clear

. * expat is changed if job_begin < 1990 in firm_panel.do, not here
. bys frame_id_numeric: egen first_year_expat = min(cond(expat == 1, year,.))
(10971357 missing values generated)

. duplicates drop frame_id_numeric, force

Duplicates in terms of frame_id_numeric

(11,707,264 observations deleted)

. tempfile expat

. save `expat'
file /var/folders/f4/7drmhl1d5kj3wp1r33jvx32m0000gn/T//St03539.000002 saved

. restore

. 
. merge m:1 frame_id_numeric using `expat', keepusing(first_year_expat) keep(1 
> 3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                        26,534
        from master                    26,534  
        from using                          0  

    matched                         8,064,562  
    -----------------------------------------

. 
. bys frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.
> ))
(7048084 missing values generated)

.         
. generate manager_after_owner = first_year_expat - first_year_foreign
(7,401,617 missing values generated)

. generate event_time = year - first_year_expat
(7,175,061 missing values generated)

. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(1,969 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(2,286 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(31,408 real changes made)

. 
. drop manager_after_owner event_time first_year_expat

. 
. generate time_foreign = year - first_year_foreign
(7,048,084 missing values generated)

. forval i = 0/3 {
  2.         gen foreign`i' = (time_foreign == `i')
  3. }

. forval i = 1/3 {
  2.         gen foreign_`i' = (time_foreign == -`i')
  3. }

. gen count = 1

. 
. * drop greenfield
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (fore
> ign == 0))

. keep if start_as_domestic
(540,720 observations deleted)

. drop owner_spell start_as_domestic

. 
. * limit sample before large merge - sampling based on firm-level variables, f
> irm-year done later
. * average employment and financial firms deleted
. * break the tie when mode is not unique
. 
. bys frame_id_numeric: egen avg_emp = mean(emp)
(90642 missing values generated)

. bys frame_id_numeric: egen industry_mode = mode(teaor08_2d), minmode
Warning: at least one group contains all missing values or contains multiple
modes.  Generating missing values for the mode of these groups.  Use the
missing, maxmode, minmode, or nummode() options to control this behavior.
(1268 missing values generated)

. local sample ((avg_emp >= 20) & (industry_mode != 64 & industry_mode != 65 & 
> industry_mode != 66))

. drop if !`sample'
(7,086,758 observations deleted)

. scalar dropped_size_or_finance = r(N_drop)

. display dropped_size_or_finance
7086758

. 
. * proxy firm founding date with first balance sheet filed
. tempvar foundyear

. bys frame_id_numeric: egen `foundyear' = min(year)

. replace foundyear = `foundyear' if missing(foundyear)
(0 real changes made)

. drop `foundyear'

. 
. * deflate nominal values - FIXME: add ppi before 1992
. foreach x in sales export tanass jetok ranyag ranyag8091 immat {
  2.         cap drop `x'_18
  3.         gen double `x'_18 = `x' / ppi18
  4.         replace `x'_18 = `x' if year < 1992 // FIXME: till ppi before 1992
>  is not filled up - just to not delete those rows because of missing ln depen
> dent variables
  5. }
(49,293 missing values generated)
(42,648 real changes made)
(227,217 missing values generated)
(42,648 real changes made)
(57,043 missing values generated)
(42,648 real changes made)
(44,079 missing values generated)
(42,648 real changes made)
(49,753 missing values generated)
(0 real changes made)
(463,618 missing values generated)
(42,648 real changes made)
(151,971 missing values generated)
(0 real changes made)

. 
. * change emp
. *sort frame_id_numeric year
. 
. *clonevar emp_clean = emp
. *replace emp_clean = . if (emp[_n-1] > 5 | emp[_n +1] > 5) & emp == 0
. *corr emp emp_clean
. 
. *gen emp_add = emp_clean + 1
. 
. * creating dependent variables
. gen lnL = ln(emp_add)
(98,708 missing values generated)

. *gen lnL_add = ln(emp_add)
. gen lnM = ln(ranyag_18)
(65,506 missing values generated)

. replace lnM = ln(ranyag8091_18) if year <= 1991
(42,332 real changes made)

. gen lnQ = ln(sales_18)
(53,377 missing values generated)

. gen lnQL = lnQ-lnL
(105,709 missing values generated)

. gen lnMQ = lnM - lnQ
(57,466 missing values generated)

. gen byte exporter = export_18 > 0 & export_18 != .

. gen export_share = export_18 / sales
(191,575 missing values generated)

. gen exporter_5 = (export_share > .05 & export_share != .)

. replace exporter_5 = . if export_share == .
(191,575 real changes made, 191,575 to missing)

. 
. * extrapolate capital stock
. inspect tanass_18

tanass_18:                                      Number of Observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            4             1             3
|  #                         Zero           66,629        66,629             -
|  #                         Positive      382,590        62,181       320,409
|  #                                   -----------   -----------   -----------
|  #                         Total         449,223       128,811       320,412
|  #   .   .   .   .         Missing        14,395
+----------------------                -----------
-800.3072      6.09e+09                    463,618
(More than 99 unique values)

. tempvar gap 

. generate `gap' = missing(tanass_18) | (tanass_18 <= 0)

. bysort frame_id_numeric (year): generate spell = sum(`gap' != `gap'[_n-1])

. 
. egen gap_length = count(1), by(frame_id_numeric spell)

. egen max_spell = max(spell), by(frame_id_numeric)

. * if gap_length <= 2, interpolate tanass with geometric average
. bysort frame_id_numeric (year): replace tanass_18 = sqrt(tanass_18[_n-1] * ta
> nass_18[_n+1]) if gap_length==1 & `gap'==1
(21877 real changes made, 20571 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1]^0.67 * ta
> nass_18[_n+2]^0.33 if gap_length==2 & `gap'==1 & `gap'[_n-1]==0
(782 real changes made, 582 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-2]^0.33 * ta
> nass_18[_n+1]^0.67 if gap_length==2 & `gap'==1 & `gap'[_n+1]==0
(1521 real changes made, 1321 to missing)

. * at either end, extrapolate for 1 year
. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n+1] if spell=
> =1 & `gap'==1 & `gap'[_n+1]==0
(9267 real changes made)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1] if spell=
> =max_spell & `gap'==1 & `gap'[_n-1]==0
(3627 real changes made)

. 
. drop spell gap_length max_spell

. replace tanass_18 = round(tanass_18)
(332,694 real changes made)

. inspect tanass_18

tanass_18:                                      Number of Observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            2             2             -
|  #                         Zero           41,948        41,948             -
|  #                         Positive      397,190       397,180            10
|  #                                   -----------   -----------   -----------
|  #                         Total         439,140       439,130            10
|  #   .   .   .   .         Missing        24,478
+----------------------                -----------
-60            6.09e+09                    463,618
(More than 99 unique values)

. 
. gen lnK = ln(tanass_18)
(66,428 missing values generated)

. gen lnKL = lnK - lnL
(106,965 missing values generated)

. generate RperK = immat / (immat + tanass)
(212,030 missing values generated)

. replace RperK = 0 if RperK < 0 | missing(immat)
(151,053 real changes made)

. label variable RperK "Share of immaterial assets [0,1]"

. 
. * firm-year deletions
. count if missing(lnK, lnQ, lnL, lnM, foreign) & year > 1991
  112,205

. count if missing(lnK, lnQ, lnL, lnM, foreign)
  114,222

. *drop if missing(lnK, lnQ, lnL, lnM, foreign) // ASK: whether year condition 
> needed
. *count
. 
. foreach var in lnK lnQ lnL lnM {
  2.         drop if missing(`var')
  3. }
(66,428 observations deleted)
(17,176 observations deleted)
(27,890 observations deleted)
(2,728 observations deleted)

. 
. *drop if missing(foreign)
. *tabstat foreign foreign_0 foreign_1 count, stat(sum) save
. *mat total = (total \ r(StatTotal))
. 
. *drop hole* x
. count
  349,396

. 
. * TFP (Cobb-Douglas)
. * FIXME: Replace CD with something fancy
. recode industry_mode (6 75 7 66 84 19 51 = .)
(industry_mode: 449 changes made)

. 
. levelsof industry_mode, local(levels)
1 2 3 5 8 9 10 11 12 13 14 15 16 17 18 20 21 22 23 24 25 26 27 28 29 30 31 32 3
> 3 35 36 37 38 39 41 42 43 45 46 47 49 50 52 53 55 56 68 69 70 71 72 73 74 77 
> 78 79 80 81 82 85 86 87 88 90 91 92 93 94 95 96

.         foreach l of local levels {
  2.         disp `l'
  3.         qui reghdfe lnQ lnL lnK lnM if industry_mode == `l', a(frame_id_nu
> meric year foundyear) resid
  4.         predict tfp_cd_`l', res
  5.         }
1
(303,185 missing values generated)
2
(348,367 missing values generated)
3
(348,693 missing values generated)
5
(349,159 missing values generated)
8
(348,380 missing values generated)
9
(349,279 missing values generated)
10
(330,946 missing values generated)
11
(347,245 missing values generated)
12
(349,283 missing values generated)
13
(345,554 missing values generated)
14
(339,829 missing values generated)
15
(345,828 missing values generated)
16
(344,431 missing values generated)
17
(347,351 missing values generated)
18
(345,978 missing values generated)
20
(346,781 missing values generated)
21
(348,493 missing values generated)
22
(342,475 missing values generated)
23
(345,003 missing values generated)
24
(347,452 missing values generated)
25
(331,398 missing values generated)
26
(344,183 missing values generated)
27
(345,627 missing values generated)
28
(340,001 missing values generated)
29
(346,927 missing values generated)
30
(348,785 missing values generated)
31
(344,696 missing values generated)
32
(347,671 missing values generated)
33
(348,316 missing values generated)
35
(346,780 missing values generated)
36
(346,538 missing values generated)
37
(348,982 missing values generated)
38
(346,155 missing values generated)
39
(348,602 missing values generated)
41
(338,029 missing values generated)
42
(337,436 missing values generated)
43
(338,050 missing values generated)
45
(338,566 missing values generated)
46
(322,674 missing values generated)
47
(323,766 missing values generated)
49
(339,439 missing values generated)
50
(349,130 missing values generated)
52
(345,182 missing values generated)
53
(348,930 missing values generated)
55
(345,130 missing values generated)
56
(341,108 missing values generated)
68
(340,304 missing values generated)
69
(348,330 missing values generated)
70
(346,933 missing values generated)
71
(343,965 missing values generated)
72
(347,901 missing values generated)
73
(348,349 missing values generated)
74
(348,648 missing values generated)
77
(348,274 missing values generated)
78
(346,198 missing values generated)
79
(348,368 missing values generated)
80
(345,756 missing values generated)
81
(343,765 missing values generated)
82
(346,386 missing values generated)
85
(347,873 missing values generated)
86
(346,986 missing values generated)
87
(348,625 missing values generated)
88
(348,609 missing values generated)
90
(348,611 missing values generated)
91
(349,012 missing values generated)
92
(349,028 missing values generated)
93
(347,936 missing values generated)
94
(349,086 missing values generated)
95
(348,445 missing values generated)
96
(346,773 missing values generated)

. 
. gen  TFP_cd =  .
(349,396 missing values generated)

. levelsof industry_mode, local(levels)
1 2 3 5 8 9 10 11 12 13 14 15 16 17 18 20 21 22 23 24 25 26 27 28 29 30 31 32 3
> 3 35 36 37 38 39 41 42 43 45 46 47 49 50 52 53 55 56 68 69 70 71 72 73 74 77 
> 78 79 80 81 82 85 86 87 88 90 91 92 93 94 95 96

. foreach l of local levels {
  2. 
.                 qui replace TFP_cd = tfp_cd_`l' if TFP_cd == .
  3. }

. 
. drop tfp_cd_*

. 
. * industry dummy and age
. gen byte industrial_firm = inlist(teaor08_1d,"B","C","D","E")

. gen age = year - foundyear

. 
. * missing export means 0 export
. mvencode export exporter exporter_5, mv(0) override
      export: 89071 missing values recoded
  exporter_5: 89071 missing values recoded

. generate domestic_sales = sales - export

. replace domestic_sales = 0 if domestic_sales < 0 | missing(domestic_sales)
(10 real changes made)

. 
. count
  349,396

. 
. *save_all_to_json
. cap drop __*

. save "`here'/temp/balance-small-clean.dta", replace
file /Users/koren/Documents/workspace/expat//temp/balance-small-clean.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Documents/workspace/expat//output/balance.log
  log type:  text
 closed on:   7 Jul 2021, 23:47:18
-------------------------------------------------------------------------------
