--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/balance.log
  log type:  text
 opened on:  22 Apr 2021, 20:29:48

. 
. use "`here'/input/merleg-expat/balance-small.dta"

. 
. * keep only numeric part of frame_id
. keep if substr(frame_id, 1, 2) == "ft"
(223,690 observations deleted)

. generate long frame_id_numeric = real(substr(frame_id, 3, 8))

. codebook frame_id*

--------------------------------------------------------------------------------------------------------------------------------------------------------------
frame_id                                                                                              Frame_id identify one firm. Only_originalid if not valid
--------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  string (str15), but longest is str10

         unique values:  912,852                  missing "":  0/8,091,096

              examples:  "ft11712107"
                         "ft13692957"
                         "ft21175000"
                         "ft24181664"

--------------------------------------------------------------------------------------------------------------------------------------------------------------
frame_id_numeric                                                                                                                                   (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [10000049,90620052]          units:  1
         unique values:  912,852                  missing .:  0/8,091,096

                  mean:   1.8e+07
              std. dev:   6.6e+06

           percentiles:        10%       25%       50%       75%       90%
                           1.1e+07   1.2e+07   2.0e+07   2.3e+07   2.7e+07

. drop frame_id

. xtset frame_id_numeric year
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1980 to 2018, but with gaps
                delta:  1 unit

. 
. merge m:1 frame_id_numeric year using "`here'/temp/ever_foreign.dta", keepusing(ever_foreign) keep(1 3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                     8,067,086
        from master                 8,067,086  
        from using                          0  

    matched                            24,010  
    -----------------------------------------

. 
. * calculating time_foreign - part I
. count
  8,091,096

. 
. preserve

. sort frame_id_numeric year

. merge m:1 frame_id_numeric year using "`here'/temp/ever_foreign.dta", keepusing(ever_foreign)

    Result                           # of obs.
    -----------------------------------------
    not matched                     8,067,086
        from master                 8,067,086  (_merge==1)
        from using                          0  (_merge==2)

    matched                            24,010  (_merge==3)
    -----------------------------------------

. *clonevar foreign_check = fo3
. *recode foreign_check (. = 0)
. *tempvar t_year
. *gen `t_year' = year if foreign_check == 1 & foreign_check[_n-1] == 0 
. *bys frame_id_numeric: egen first_year_foreign = max(`t_year')
. *gen time_foreign = year - first_year_foreign
. *replace time_foreign = . if foreign_check == 0 & time_foreign > 0
. egen first_year_foreign = min(cond(fo3==1, year, .)), by(frame_id_numeric)
(7,034,606 missing values generated)

. generate time_foreign = year - first_year_foreign
(7,034,606 missing values generated)

. *egen there_in_1995 = min(cond(year==1995, year, .)), by(frame_id_numeric )
. *generate time_foreign = year - there_in_1995
. contract time_foreign if _merge == 3

. gen type = "balance"

. save "`here'/temp/event_time_foreign_balance.dta", replace
file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//temp/event_time_foreign_balance.dta saved

. restore

. 
. preserve

. sort frame_id_numeric year

. egen first_year_foreign = min(cond(fo3==1, year, .)), by(frame_id_numeric)
(7,034,606 missing values generated)

. generate time_foreign = year - first_year_foreign
(7,034,606 missing values generated)

. contract time_foreign

. gen type = "balance-all"

. save "`here'/temp/event_time_all_balance.dta", replace
file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//temp/event_time_all_balance.dta saved

. restore

. 
. * foreign fill 
. rename fo3 foreign

. tab year foreign, missing

           |     Foreign owned dummy with
      Year |   ultimate owners from Complex
 1992-2018 |         0          1          . |     Total
-----------+---------------------------------+----------
      1980 |         0          0      2,666 |     2,666 
      1981 |         0          0      2,695 |     2,695 
      1982 |         0          0      2,695 |     2,695 
      1983 |         0          0      2,705 |     2,705 
      1984 |         0          0      2,711 |     2,711 
      1985 |         0          0      3,025 |     3,025 
      1986 |         0          0      3,178 |     3,178 
      1987 |         0          0      3,402 |     3,402 
      1988 |         0          0      3,806 |     3,806 
      1989 |         0          0      6,891 |     6,891 
      1990 |         0      1,679     14,378 |    16,057 
      1991 |         0      3,728     25,969 |    29,697 
      1992 |    84,899     10,011          0 |    94,910 
      1993 |   103,631     14,078          0 |   117,709 
      1994 |   128,807     18,254          0 |   147,061 
      1995 |   144,108     19,995          0 |   164,103 
      1996 |   167,988     21,162          0 |   189,150 
      1997 |   186,967     22,034          0 |   209,001 
      1998 |   210,212     23,688          0 |   233,900 
      1999 |   219,705     23,467          0 |   243,172 
      2000 |   239,695     24,729          0 |   264,424 
      2001 |   259,359     25,584          0 |   284,943 
      2002 |   258,488     26,424          0 |   284,912 
      2003 |   263,329     26,801          0 |   290,130 
      2004 |   276,167     27,390          0 |   303,557 
      2005 |   283,478     27,036          0 |   310,514 
      2006 |   290,840     27,049          0 |   317,889 
      2007 |   299,264     28,884          0 |   328,148 
      2008 |   313,604     31,085          0 |   344,689 
      2009 |   320,696     31,396          0 |   352,092 
      2010 |   333,480     31,385          0 |   364,865 
      2011 |   350,082     31,666          0 |   381,748 
      2012 |   346,207     29,911          0 |   376,118 
      2013 |   383,551     28,980          0 |   412,531 
      2014 |   375,024     26,893          0 |   401,917 
      2015 |   382,703     24,633          0 |   407,336 
      2016 |   381,180     23,793          0 |   404,973 
      2017 |   375,365     22,528          0 |   397,893 
      2018 |   363,988     19,895          0 |   383,883 
-----------+---------------------------------+----------
     Total | 7,342,817    674,158     74,121 | 8,091,096 

. inspect foreign

foreign:  Foreign owned dummy with ultim        Number of Observations
-------------------------------------------------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero        7,342,817     7,342,817             -
|  #                         Positive      674,158       674,158             -
|  #                                   -----------   -----------   -----------
|  #                         Total       8,016,975     8,016,975             -
|  #   .                     Missing        74,121
+----------------------                -----------
0                     1                  8,091,096
   (2 unique values)

. *inspect jetok_18 if missing(foreign)
. recode foreign (.=0)
(foreign: 74121 changes made)

. 
. * drop greenfield
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (foreign == 0))

. keep if start_as_domestic
(733,042 observations deleted)

. drop owner_spell start_as_domestic

. 
. * limit sample before large merge - sampling based on firm-level variables, firm-year done later
. * average employment and financial firms deleted
. * break the tie when mode is not unique
. 
. egen first_year_foreign = min(cond(foreign==1, year, .)), by(frame_id_numeric)
(7,034,606 missing values generated)

. generate time_foreign = year - first_year_foreign
(7,034,606 missing values generated)

. forval i = 0/3 {
  2.         gen foreign`i' = (time_foreign == `i')
  3. }

. forval i = 1/3 {
  2.         gen foreign_`i' = (time_foreign == -`i')
  3. }

. gen count = 1

. 
. sort frame_id_numeric year

. gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(820,227 missing values generated)

. gen hole2 = (x > 2 & x != .)

. gen hole1 = (x > 1 & x != .)

. 
. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |    136193     13658     18219     26753     28198     22552     19529     17135   7358054    137796     70466
------------------------------------------------------------------------------------------------------------------------

. mat total = r(StatTotal)

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2 if ever_foreign == 1, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     10225       958      1119      1363      1404      1228      1112      1004     22297       145        27
------------------------------------------------------------------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. 
. bys frame_id_numeric: egen avg_emp = mean(emp)
(86,354 missing values generated)

. bys frame_id_numeric: egen industry_mode = mode(teaor08_2d), minmode
Warning: at least one group contains all missing values or contains multiple modes.  Generating missing values for the mode of these groups.  Use the missing,
maxmode, minmode, or nummode() options to control this behavior.
(1,251 missing values generated)

. local sample ((avg_emp >= 20) & (industry_mode != 64 & industry_mode != 65 & industry_mode != 66))

. drop if !`sample'
(6,913,440 observations deleted)

. scalar dropped_size_or_finance = r(N_drop)

. display dropped_size_or_finance
6913440

. 
. drop hole* x

. sort frame_id_numeric year

. gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(68,151 missing values generated)

. gen hole2 = (x > 2 & x != .)

. gen hole1 = (x > 1 & x != .)

. 
. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     23664      1686      2138      3065      3148      2612      2278      2069    444614      3361      1214
------------------------------------------------------------------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2 if ever_foreign == 1, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     10225       958      1119      1363      1404      1228      1112      1004     22297       145        27
------------------------------------------------------------------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. 
. * proxy firm founding date with first balance sheet filed
. tempvar foundyear

. bys frame_id_numeric: egen `foundyear' = min(year)

. replace foundyear = `foundyear' if missing(foundyear)
(0 real changes made)

. drop `foundyear'

. 
. * deflate nominal values - FIXME: add ppi before 1992
. foreach x in sales export tanass jetok ranyag ranyag8091 immat {
  2.         cap drop `x'_18
  3.         gen double `x'_18 = `x' / ppi18
  4.         replace `x'_18 = `x' if year < 1992 // FIXME: till ppi before 1992 is not filled up - just to not delete those rows because of missing ln depende
> nt variables
  5.         }
(48,800 missing values generated)
(42,628 real changes made)
(220,980 missing values generated)
(42,628 real changes made)
(56,219 missing values generated)
(42,628 real changes made)
(44,015 missing values generated)
(42,628 real changes made)
(49,488 missing values generated)
(0 real changes made)
(444,614 missing values generated)
(42,628 real changes made)
(148,680 missing values generated)
(0 real changes made)

. 
. * creating dependent variables
. gen lnL = ln(emp)
(104,600 missing values generated)

. gen lnM = ln(ranyag_18)
(64,354 missing values generated)

. replace lnM = ln(ranyag8091_18) if year <= 1991
(42,323 real changes made)

. gen lnQ = ln(sales_18)
(50,006 missing values generated)

. gen lnQL = lnQ-lnL
(107,107 missing values generated)

. gen lnMQ = lnM - lnQ
(54,010 missing values generated)

. gen byte exporter = export_18 > 0 & export_18 != .

. gen export_share = export_18 / sales
(184,722 missing values generated)

. gen exporter_5 = (export_share > .05 & export_share != .)

. replace exporter_5 = . if export_share == .
(184,722 real changes made, 184,722 to missing)

. 
. *tabstat foreign foreign_0 foreign_1 count, stat(sum) save
. *mat total = (total \ r(StatTotal))
. 
. * interpolate small holes
. tab foreign

    Foreign |
owned dummy |
       with |
   ultimate |
owners from |
    Complex |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    420,950       94.68       94.68
          1 |     23,664        5.32      100.00
------------+-----------------------------------
      Total |    444,614      100.00

. tempvar before

. bys foreign: egen `before' = count(1)

. sort frame_id_numeric year

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & f2.foreign == 1
(80 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & f2.foreign == 0
(138 real changes made)

. bys frame_id_numeric (year): egen minyear = min(year)

. bys frame_id_numeric (year): egen maxyear = max(year)

. replace foreign = 1 if l.foreign == 1 & f.foreign == 1 & f2.foreign == 1 & year == (minyear + 1)
(0 real changes made)

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & year == (minyear + 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & f.foreign == 0 & f2.foreign == 0 & year == (maxyear - 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & year == (maxyear - 1)
(29 real changes made)

. tempvar after

. bys foreign: egen `after' = count(1)

. scalar foreign_interpolate = `before'-`after'

. display foreign_interpolate
-87

. 
. drop hole* x

. sort frame_id_numeric year

. gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(68,151 missing values generated)

. gen hole2 = (x > 2 & x != .)

. gen hole1 = (x > 1 & x != .)

. 
. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     23577      1686      2138      3065      3148      2612      2278      2069    444614      3361      1214
------------------------------------------------------------------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2 if ever_foreign == 1, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     10236       958      1119      1363      1404      1228      1112      1004     22297       145        27
------------------------------------------------------------------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. 
. * extrapolate capital stock
. inspect tanass_18

tanass_18:                                      Number of Observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            4             1             3
|  #                         Zero           63,442        63,442             -
|  #                         Positive      367,577        61,316       306,261
|  #                                   -----------   -----------   -----------
|  #                         Total         431,023       124,759       306,264
|  #   .   .   .   .         Missing        13,591
+----------------------                -----------
-800.3072      6.09e+09                    444,614
(More than 99 unique values)

. tempvar gap 

. generate `gap' = missing(tanass_18) | (tanass_18 <= 0)

. bysort frame_id_numeric (year): generate spell = sum(`gap' != `gap'[_n-1])

. 
. egen gap_length = count(1), by(frame_id_numeric spell)

. egen max_spell = max(spell), by(frame_id_numeric)

. * if gap_length <= 2, interpolate tanass with geometric average
. bysort frame_id_numeric (year): replace tanass_18 = sqrt(tanass_18[_n-1] * tanass_18[_n+1]) if gap_length==1 & `gap'==1
(20856 real changes made, 19586 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1]^0.67 * tanass_18[_n+2]^0.33 if gap_length==2 & `gap'==1 & `gap'[_n-1]==0
(748 real changes made, 555 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-2]^0.33 * tanass_18[_n+1]^0.67 if gap_length==2 & `gap'==1 & `gap'[_n+1]==0
(1481 real changes made, 1288 to missing)

. * at either end, extrapolate for 1 year
. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n+1] if spell==1 & `gap'==1 & `gap'[_n+1]==0
(8774 real changes made)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1] if spell==max_spell & `gap'==1 & `gap'[_n-1]==0
(3491 real changes made)

. 
. drop spell gap_length max_spell

. replace tanass_18 = round(tanass_18)
(317,926 real changes made)

. inspect tanass_18

tanass_18:                                      Number of Observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            2             2             -
|  #                         Zero           39,869        39,869             -
|  #                         Positive      381,498       381,488            10
|  #                                   -----------   -----------   -----------
|  #                         Total         421,369       421,359            10
|  #   .   .   .   .         Missing        23,245
+----------------------                -----------
-60            6.09e+09                    444,614
(More than 99 unique values)

. 
. gen lnK = ln(tanass_18)
(63,116 missing values generated)

. gen lnKL = lnK - lnL
(110,095 missing values generated)

. generate RperK = immat / (immat + tanass)
(205,766 missing values generated)

. replace RperK = 0 if RperK < 0 | missing(immat)
(147,777 real changes made)

. label variable RperK "Share of immaterial assets [0,1]"

. 
. * firm-year deletions
. count if missing(lnK, lnQ, lnL, lnM, foreign) & year > 1991
  112,025

. count if missing(lnK, lnQ, lnL, lnM, foreign)
  114,497

. *drop if missing(lnK, lnQ, lnL, lnM, foreign) // ASK: whether year condition needed
. *count
. 
. foreach var in lnK lnQ lnL lnM {
  2. 
.         drop if missing(`var')
  3. 
.         drop hole* x
  4.         sort frame_id_numeric year
  5.         gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
  6.         gen hole2 = (x > 2 & x != .)
  7.         gen hole1 = (x > 1 & x != .)
  8. 
.         tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2, stat(sum) save
  9.         mat total = (total \ r(StatTotal))
 10.         tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2 if ever_foreign == 1, stat(sum) save
 11.         mat total = (total \ r(StatTotal))
 12. }
(63,116 observations deleted)
(38,402 missing values generated)

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     22685      1626      1987      2678      2771      2447      2199      2020    381498      2843       959
------------------------------------------------------------------------------------------------------------------------

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     10236       958      1119      1363      1404      1228      1112      1004     22297       162        45
------------------------------------------------------------------------------------------------------------------------
(15,998 observations deleted)
(35,610 missing values generated)

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     22258      1580      1895      2417      2628      2364      2161      1985    365500      3306      1047
------------------------------------------------------------------------------------------------------------------------

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     10236       958      1119      1363      1404      1228      1112      1004     22297       216        65
------------------------------------------------------------------------------------------------------------------------
(32,836 observations deleted)
(24,457 missing values generated)

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     21549      1501      1776      2136      2447      2256      2086      1940    332664      4046      1215
------------------------------------------------------------------------------------------------------------------------

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     10236       958      1119      1363      1404      1228      1112      1004     22297       333       108
------------------------------------------------------------------------------------------------------------------------
(2,547 observations deleted)
(24,445 missing values generated)

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     21435      1499      1772      2125      2437      2247      2083      1935    330117      4222      1265
------------------------------------------------------------------------------------------------------------------------

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     10236       958      1119      1363      1404      1228      1112      1004     22297       347       112
------------------------------------------------------------------------------------------------------------------------

. 
. *drop if missing(foreign)
. *tabstat foreign foreign_0 foreign_1 count, stat(sum) save
. *mat total = (total \ r(StatTotal))
. 
. drop count hole* x

. mat list total

total[14,11]
       foreign  foreign_3  foreign_2  foreign_1   foreign0   foreign1   foreign2   foreign3      count      hole1      hole2
sum     136193      13658      18219      26753      28198      22552      19529      17135    7358054     137796      70466
sum      10225        958       1119       1363       1404       1228       1112       1004      22297        145         27
sum      23664       1686       2138       3065       3148       2612       2278       2069     444614       3361       1214
sum      10225        958       1119       1363       1404       1228       1112       1004      22297        145         27
sum      23577       1686       2138       3065       3148       2612       2278       2069     444614       3361       1214
sum      10236        958       1119       1363       1404       1228       1112       1004      22297        145         27
sum      22685       1626       1987       2678       2771       2447       2199       2020     381498       2843        959
sum      10236        958       1119       1363       1404       1228       1112       1004      22297        162         45
sum      22258       1580       1895       2417       2628       2364       2161       1985     365500       3306       1047
sum      10236        958       1119       1363       1404       1228       1112       1004      22297        216         65
sum      21549       1501       1776       2136       2447       2256       2086       1940     332664       4046       1215
sum      10236        958       1119       1363       1404       1228       1112       1004      22297        333        108
sum      21435       1499       1772       2125       2437       2247       2083       1935     330117       4222       1265
sum      10236        958       1119       1363       1404       1228       1112       1004      22297        347        112

. count
  330,117

. 
. * TFP (Cobb-Douglas)
. * FIXME: Replace CD with something fancy
. recode industry_mode (6 75 7 66 84 19 51 = .)
(industry_mode: 417 changes made)

. 
. levelsof industry_mode, local(levels)
1 2 3 5 8 9 10 11 12 13 14 15 16 17 18 20 21 22 23 24 25 26 27 28 29 30 31 32 33 35 36 37 38 39 41 42 43 45 46 47 49 50 52 53 55 56 68 69 70 71 72 73 74 77 78
>  79 80 81 82 85 86 87 88 90 91 92 93 94 95 96

.         foreach l of local levels {
  2.         disp `l'
  3.         qui reghdfe lnQ lnL lnK lnM if industry_mode == `l', a(frame_id_numeric year foundyear) resid
  4.         predict tfp_cd_`l', res
  5.         }
1
(285,074 missing values generated)
2
(329,095 missing values generated)
3
(329,416 missing values generated)
5
(329,881 missing values generated)
8
(329,112 missing values generated)
9
(330,019 missing values generated)
10
(312,582 missing values generated)
11
(328,198 missing values generated)
12
(330,031 missing values generated)
13
(326,665 missing values generated)
14
(320,997 missing values generated)
15
(326,916 missing values generated)
16
(325,475 missing values generated)
17
(328,280 missing values generated)
18
(326,796 missing values generated)
20
(327,689 missing values generated)
21
(329,332 missing values generated)
22
(324,091 missing values generated)
23
(326,107 missing values generated)
24
(328,308 missing values generated)
25
(313,568 missing values generated)
26
(325,797 missing values generated)
27
(326,877 missing values generated)
28
(321,440 missing values generated)
29
(328,235 missing values generated)
30
(329,584 missing values generated)
31
(325,563 missing values generated)
32
(328,557 missing values generated)
33
(329,072 missing values generated)
35
(327,565 missing values generated)
36
(327,294 missing values generated)
37
(329,707 missing values generated)
38
(327,002 missing values generated)
39
(329,360 missing values generated)
41
(318,972 missing values generated)
42
(318,484 missing values generated)
43
(318,989 missing values generated)
45
(319,634 missing values generated)
46
(305,588 missing values generated)
47
(305,629 missing values generated)
49
(320,537 missing values generated)
50
(329,854 missing values generated)
52
(326,335 missing values generated)
53
(329,651 missing values generated)
55
(326,100 missing values generated)
56
(322,047 missing values generated)
68
(321,644 missing values generated)
69
(329,182 missing values generated)
70
(327,903 missing values generated)
71
(324,948 missing values generated)
72
(328,752 missing values generated)
73
(329,171 missing values generated)
74
(329,396 missing values generated)
77
(329,049 missing values generated)
78
(327,054 missing values generated)
79
(329,151 missing values generated)
80
(326,547 missing values generated)
81
(324,654 missing values generated)
82
(327,375 missing values generated)
85
(328,648 missing values generated)
86
(327,779 missing values generated)
87
(329,375 missing values generated)
88
(329,339 missing values generated)
90
(329,350 missing values generated)
91
(329,752 missing values generated)
92
(329,790 missing values generated)
93
(328,678 missing values generated)
94
(329,822 missing values generated)
95
(329,164 missing values generated)
96
(327,650 missing values generated)

. 
. gen  TFP_cd =  .
(330,117 missing values generated)

. levelsof industry_mode, local(levels)
1 2 3 5 8 9 10 11 12 13 14 15 16 17 18 20 21 22 23 24 25 26 27 28 29 30 31 32 33 35 36 37 38 39 41 42 43 45 46 47 49 50 52 53 55 56 68 69 70 71 72 73 74 77 78
>  79 80 81 82 85 86 87 88 90 91 92 93 94 95 96

. foreach l of local levels {
  2. 
.                 qui replace TFP_cd = tfp_cd_`l' if TFP_cd == .
  3. }

. 
. drop tfp_cd_*

. 
. * industry dummy and age
. gen byte industrial_firm = inlist(teaor08_1d,"B","C","D","E")

. gen age = year - foundyear

. count
  330,117

. 
. * missing export means 0 export
. mvencode export exporter exporter_5, mv(0) override
      export: 85593 missing values recoded
  exporter_5: 85593 missing values recoded

. generate domestic_sales = sales - export

. replace domestic_sales = 0 if domestic_sales < 0 | missing(domestic_sales)
(8 real changes made)

. 
. * calculating time_foreign - part II
. count
  330,117

. 
. preserve

. sort frame_id_numeric year

. merge m:1 frame_id_numeric year using "`here'/temp/ever_foreign.dta", keepusing(ever_foreign)

    Result                           # of obs.
    -----------------------------------------
    not matched                       309,533
        from master                   307,820  (_merge==1)
        from using                      1,713  (_merge==2)

    matched                            22,297  (_merge==3)
    -----------------------------------------

. drop first_year_foreign time_foreign

. egen first_year_foreign = min(cond(foreign==1, year, .)), by(frame_id_numeric)
(290,824 missing values generated)

. generate time_foreign = year - first_year_foreign
(290,824 missing values generated)

. contract time_foreign if _merge == 3

. gen type = "clean"

. save "`here'/temp/event_time_foreign_clean.dta", replace
file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//temp/event_time_foreign_clean.dta saved

. restore

. 
. preserve

. sort frame_id_numeric year

. drop first_year_foreign time_foreign

. egen first_year_foreign = min(cond(foreign==1, year, .)), by(frame_id_numeric)
(289,111 missing values generated)

. generate time_foreign = year - first_year_foreign
(289,111 missing values generated)

. contract time_foreign

. gen type = "clean-all"

. save "`here'/temp/event_time_all_clean.dta", replace
file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//temp/event_time_all_clean.dta saved

. restore

. 
. count
  330,117

. 
. matrix rownames total = "beginning" "sampling" "interpolating fo3 holes" "missing lnK" "missing lnQ" "missing lnL" "missing lnM"

. mata : mat_total_balance = st_matrix("total")

. mata: mata matsave "temp/matrix-balance" mat_total_balance, replace
(saving mat_total_balance[14,11])
file temp/matrix-balance.mmat saved

. 
. save_all_to_json

. cap drop __*

. save "`here'/temp/balance-small-clean.dta", replace
file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//temp/balance-small-clean.dta saved

. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/balance.log
  log type:  text
 closed on:  22 Apr 2021, 20:32:23
--------------------------------------------------------------------------------------------------------------------------------------------------------------
