--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/balance.log
  log type:  text
 opened on:  25 May 2021, 17:37:58

. 
. use "`here'/input/merleg-expat/balance-small.dta"

. 
. * keep only numeric part of frame_id
. keep if substr(frame_id, 1, 2) == "ft"
(223,690 observations deleted)

. generate long frame_id_numeric = real(substr(frame_id, 3, 8))

. codebook frame_id*

--------------------------------------------------------------------------------------------------------------------------------------------------------------
frame_id                                                                                              Frame_id identify one firm. Only_originalid if not valid
--------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  string (str15), but longest is str10

         unique values:  912,852                  missing "":  0/8,091,096

              examples:  "ft11712107"
                         "ft13692957"
                         "ft21175000"
                         "ft24181664"

--------------------------------------------------------------------------------------------------------------------------------------------------------------
frame_id_numeric                                                                                                                                   (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [10000049,90620052]          units:  1
         unique values:  912,852                  missing .:  0/8,091,096

                  mean:   1.8e+07
              std. dev:   6.6e+06

           percentiles:        10%       25%       50%       75%       90%
                           1.1e+07   1.2e+07   2.0e+07   2.3e+07   2.7e+07

. drop frame_id

. xtset frame_id_numeric year
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1980 to 2018, but with gaps
                delta:  1 unit

. 
. merge m:1 frame_id_numeric year using "`here'/temp/ever_foreign.dta", keepusing(ever_foreign) keep(1 3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                     8,070,034
        from master                 8,070,034  
        from using                          0  

    matched                            21,062  
    -----------------------------------------

. 
. * foreign fill 
. rename fo3 foreign

. tab year foreign, missing

           |     Foreign owned dummy with
      Year |   ultimate owners from Complex
 1992-2018 |         0          1          . |     Total
-----------+---------------------------------+----------
      1980 |         0          0      2,666 |     2,666 
      1981 |         0          0      2,695 |     2,695 
      1982 |         0          0      2,695 |     2,695 
      1983 |         0          0      2,705 |     2,705 
      1984 |         0          0      2,711 |     2,711 
      1985 |         0          0      3,025 |     3,025 
      1986 |         0          0      3,178 |     3,178 
      1987 |         0          0      3,402 |     3,402 
      1988 |         0          0      3,806 |     3,806 
      1989 |         0          0      6,891 |     6,891 
      1990 |         0      1,679     14,378 |    16,057 
      1991 |         0      3,728     25,969 |    29,697 
      1992 |    84,899     10,011          0 |    94,910 
      1993 |   103,631     14,078          0 |   117,709 
      1994 |   128,807     18,254          0 |   147,061 
      1995 |   144,108     19,995          0 |   164,103 
      1996 |   167,988     21,162          0 |   189,150 
      1997 |   186,967     22,034          0 |   209,001 
      1998 |   210,212     23,688          0 |   233,900 
      1999 |   219,705     23,467          0 |   243,172 
      2000 |   239,695     24,729          0 |   264,424 
      2001 |   259,359     25,584          0 |   284,943 
      2002 |   258,488     26,424          0 |   284,912 
      2003 |   263,329     26,801          0 |   290,130 
      2004 |   276,167     27,390          0 |   303,557 
      2005 |   283,478     27,036          0 |   310,514 
      2006 |   290,840     27,049          0 |   317,889 
      2007 |   299,264     28,884          0 |   328,148 
      2008 |   313,604     31,085          0 |   344,689 
      2009 |   320,696     31,396          0 |   352,092 
      2010 |   333,480     31,385          0 |   364,865 
      2011 |   350,082     31,666          0 |   381,748 
      2012 |   346,207     29,911          0 |   376,118 
      2013 |   383,551     28,980          0 |   412,531 
      2014 |   375,024     26,893          0 |   401,917 
      2015 |   382,703     24,633          0 |   407,336 
      2016 |   381,180     23,793          0 |   404,973 
      2017 |   375,365     22,528          0 |   397,893 
      2018 |   363,988     19,895          0 |   383,883 
-----------+---------------------------------+----------
     Total | 7,342,817    674,158     74,121 | 8,091,096 

. inspect foreign

foreign:  Foreign owned dummy with ultim        Number of Observations
-------------------------------------------------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero        7,342,817     7,342,817             -
|  #                         Positive      674,158       674,158             -
|  #                                   -----------   -----------   -----------
|  #                         Total       8,016,975     8,016,975             -
|  #   .                     Missing        74,121
+----------------------                -----------
0                     1                  8,091,096
   (2 unique values)

. *inspect jetok_18 if missing(foreign)
. recode foreign (.=0)
(foreign: 74121 changes made)

. 
. * interpolate small holes
. tab foreign

    Foreign |
owned dummy |
       with |
   ultimate |
owners from |
    Complex |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  7,416,938       91.67       91.67
          1 |    674,158        8.33      100.00
------------+-----------------------------------
      Total |  8,091,096      100.00

. tempvar before

. bys foreign: egen `before' = count(1)

. sort frame_id_numeric year

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & f2.foreign == 1
(1,292 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & f2.foreign == 0
(1,225 real changes made)

. bys frame_id_numeric (year): egen minyear = min(year)

. bys frame_id_numeric (year): egen maxyear = max(year)

. replace foreign = 1 if l.foreign == 1 & f.foreign == 1 & f2.foreign == 1 & year == (minyear + 1)
(308 real changes made)

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & year == (minyear + 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & f.foreign == 0 & f2.foreign == 0 & year == (maxyear - 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & year == (maxyear - 1)
(296 real changes made)

. tempvar after

. bys foreign: egen `after' = count(1)

. scalar foreign_interpolate = `before'-`after'

. display foreign_interpolate
79

. 
. * foreign change
. preserve

. use "`here'/input/ceo-panel/ceo-panel.dta", clear

. * expat is changed if job_begin < 1990 in firm_panel.do, not here
. bys frame_id_numeric: egen first_year_expat = min(cond(expat == 1, year,.))
(11,083,558 missing values generated)

. duplicates drop frame_id_numeric, force

Duplicates in terms of frame_id_numeric

(11,838,988 observations deleted)

. tempfile expat

. save `expat'
file /srv/sandbox/zavecz/St3906394.000002 saved

. restore

. 
. merge m:1 frame_id_numeric using `expat', keepusing(first_year_expat) keep(1 3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                        26,513
        from master                    26,513  
        from using                          0  

    matched                         8,064,583  
    -----------------------------------------

. 
. bys frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.))
(7,048,084 missing values generated)

.         
. generate manager_after_owner = first_year_expat - first_year_foreign
(7,401,562 missing values generated)

. generate event_time = year - first_year_expat
(7,175,006 missing values generated)

. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(1,961 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(2,286 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(31,408 real changes made)

. 
. drop manager_after_owner event_time first_year_expat

. 
. generate time_foreign = year - first_year_foreign
(7,048,084 missing values generated)

. forval i = 0/3 {
  2.         gen foreign`i' = (time_foreign == `i')
  3. }

. forval i = 1/3 {
  2.         gen foreign_`i' = (time_foreign == -`i')
  3. }

. gen count = 1

. 
. do "code/create/calc_hole.do"

. cap drop hole* x

. sort frame_id_numeric year

. gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(912,852 missing values generated)

. gen hole2 = (x > 2 & x != .)

. gen hole1 = (x > 1 & x != .)

. 
end of do-file

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |    647076     12859     17142     25675    119746     99537     85840     74805   8091096    150760     75217
------------------------------------------------------------------------------------------------------------------------

. mat total = r(StatTotal)

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2 if ever_foreign == 1, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     11553      1000      1140      1378      1483      1324      1087       913     21062       137        24
------------------------------------------------------------------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. 
. * drop greenfield
. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (foreign == 0))

. keep if start_as_domestic
(540,629 observations deleted)

. drop owner_spell start_as_domestic

. 
. do "code/create/calc_hole.do"

. cap drop hole* x

. sort frame_id_numeric year

. gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(846,479 missing values generated)

. gen hole2 = (x > 2 & x != .)

. gen hole1 = (x > 1 & x != .)

. 
end of do-file

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |    264681     12859     16564     23518     53373     43753     37290     32332   7550467    141086     71680
------------------------------------------------------------------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2 if ever_foreign == 1, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     11553      1000      1140      1378      1483      1324      1087       913     21062       137        24
------------------------------------------------------------------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. 
. * limit sample before large merge - sampling based on firm-level variables, firm-year done later
. * average employment and financial firms deleted
. * break the tie when mode is not unique
. 
. bys frame_id_numeric: egen avg_emp = mean(emp)
(90,642 missing values generated)

. bys frame_id_numeric: egen industry_mode = mode(teaor08_2d), minmode
Warning: at least one group contains all missing values or contains multiple modes.  Generating missing values for the mode of these groups.  Use the missing,
maxmode, minmode, or nummode() options to control this behavior.
(1,268 missing values generated)

. local sample ((avg_emp >= 20) & (industry_mode != 64 & industry_mode != 65 & industry_mode != 66))

. drop if !`sample'
(7,086,788 observations deleted)

. scalar dropped_size_or_finance = r(N_drop)

. display dropped_size_or_finance
7086788

. 
. do "code/create/calc_hole.do"

. cap drop hole* x

. sort frame_id_numeric year

. gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(71,304 missing values generated)

. gen hole2 = (x > 2 & x != .)

. gen hole1 = (x > 1 & x != .)

. 
end of do-file

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     37745      1600      1995      2818      6186      4729      3734      3161    463679      3486      1246
------------------------------------------------------------------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2 if ever_foreign == 1, stat(sum) save

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     11553      1000      1140      1378      1483      1324      1087       913     21062       137        24
------------------------------------------------------------------------------------------------------------------------

. mat total = (total \ r(StatTotal))

. 
. * proxy firm founding date with first balance sheet filed
. tempvar foundyear

. bys frame_id_numeric: egen `foundyear' = min(year)

. replace foundyear = `foundyear' if missing(foundyear)
(0 real changes made)

. drop `foundyear'

. 
. * deflate nominal values - FIXME: add ppi before 1992
. foreach x in sales export tanass jetok ranyag ranyag8091 immat {
  2.         cap drop `x'_18
  3.         gen double `x'_18 = `x' / ppi18
  4.         replace `x'_18 = `x' if year < 1992 // FIXME: till ppi before 1992 is not filled up - just to not delete those rows because of missing ln depende
> nt variables
  5. }
(49,300 missing values generated)
(42,655 real changes made)
(227,224 missing values generated)
(42,655 real changes made)
(57,050 missing values generated)
(42,655 real changes made)
(44,086 missing values generated)
(42,655 real changes made)
(49,760 missing values generated)
(0 real changes made)
(463,679 missing values generated)
(42,655 real changes made)
(151,988 missing values generated)
(0 real changes made)

. 
. * change emp
. sort frame_id_numeric year

. 
. clonevar emp_clean = emp
(98,332 missing values generated)

. replace emp_clean = . if (emp[_n-1] > 5 | emp[_n +1] > 5) & emp == 0
(6,807 real changes made, 6,807 to missing)

. corr emp emp_clean
(obs=358,540)

             |      emp emp_cl~n
-------------+------------------
         emp |   1.0000
   emp_clean |   1.0000   1.0000


. 
. gen emp_add = emp_clean + 1
(105,139 missing values generated)

. 
. * creating dependent variables
. gen lnL = ln(emp)
(109,898 missing values generated)

. gen lnL_add = ln(emp_add)
(105,139 missing values generated)

. gen lnM = ln(ranyag_18)
(65,513 missing values generated)

. replace lnM = ln(ranyag8091_18) if year <= 1991
(42,338 real changes made)

. gen lnQ = ln(sales_18)
(53,378 missing values generated)

. gen lnQL = lnQ-lnL
(112,569 missing values generated)

. gen lnMQ = lnM - lnQ
(57,467 missing values generated)

. gen byte exporter = export_18 > 0 & export_18 != .

. gen export_share = export_18 / sales
(191,576 missing values generated)

. gen exporter_5 = (export_share > .05 & export_share != .)

. replace exporter_5 = . if export_share == .
(191,576 real changes made, 191,576 to missing)

. 
. * extrapolate capital stock
. inspect tanass_18

tanass_18:                                      Number of Observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            4             1             3
|  #                         Zero           66,629        66,629             -
|  #                         Positive      382,651        62,190       320,461
|  #                                   -----------   -----------   -----------
|  #                         Total         449,284       128,820       320,464
|  #   .   .   .   .         Missing        14,395
+----------------------                -----------
-800.3072      6.09e+09                    463,679
(More than 99 unique values)

. tempvar gap 

. generate `gap' = missing(tanass_18) | (tanass_18 <= 0)

. bysort frame_id_numeric (year): generate spell = sum(`gap' != `gap'[_n-1])

. 
. egen gap_length = count(1), by(frame_id_numeric spell)

. egen max_spell = max(spell), by(frame_id_numeric)

. * if gap_length <= 2, interpolate tanass with geometric average
. bysort frame_id_numeric (year): replace tanass_18 = sqrt(tanass_18[_n-1] * tanass_18[_n+1]) if gap_length==1 & `gap'==1
(21877 real changes made, 20571 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1]^0.67 * tanass_18[_n+2]^0.33 if gap_length==2 & `gap'==1 & `gap'[_n-1]==0
(782 real changes made, 582 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-2]^0.33 * tanass_18[_n+1]^0.67 if gap_length==2 & `gap'==1 & `gap'[_n+1]==0
(1521 real changes made, 1321 to missing)

. * at either end, extrapolate for 1 year
. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n+1] if spell==1 & `gap'==1 & `gap'[_n+1]==0
(9267 real changes made)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1] if spell==max_spell & `gap'==1 & `gap'[_n-1]==0
(3627 real changes made)

. 
. drop spell gap_length max_spell

. replace tanass_18 = round(tanass_18)
(332,746 real changes made)

. inspect tanass_18

tanass_18:                                      Number of Observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            2             2             -
|  #                         Zero           41,948        41,948             -
|  #                         Positive      397,251       397,241            10
|  #                                   -----------   -----------   -----------
|  #                         Total         439,201       439,191            10
|  #   .   .   .   .         Missing        24,478
+----------------------                -----------
-60            6.09e+09                    463,679
(More than 99 unique values)

. 
. gen lnK = ln(tanass_18)
(66,428 missing values generated)

. gen lnKL = lnK - lnL
(115,554 missing values generated)

. generate RperK = immat / (immat + tanass)
(212,047 missing values generated)

. replace RperK = 0 if RperK < 0 | missing(immat)
(151,070 real changes made)

. label variable RperK "Share of immaterial assets [0,1]"

. 
. * firm-year deletions
. count if missing(lnK, lnQ, lnL, lnM, foreign) & year > 1991
  117,649

. count if missing(lnK, lnQ, lnL, lnM, foreign)
  120,147

. *drop if missing(lnK, lnQ, lnL, lnM, foreign) // ASK: whether year condition needed
. *count
. 
. foreach var in lnK lnQ lnL lnM {
  2. 
.         drop if missing(`var')
  3.         
.         do "code/create/calc_hole.do"
  4.         tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2, stat(sum) save
  5.         mat total = (total \ r(StatTotal))
  6.         tabstat foreign foreign_3 foreign_2 foreign_1 foreign0 foreign1 foreign2 foreign3 count hole1 hole2 if ever_foreign == 1, stat(sum) save
  7.         mat total = (total \ r(StatTotal))
  8. }
(66,428 observations deleted)

. cap drop hole* x

. sort frame_id_numeric year

. gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(39,897 missing values generated)

. gen hole2 = (x > 2 & x != .)

. gen hole1 = (x > 1 & x != .)

. 
end of do-file

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     35478      1544      1863      2473      4083      3708      3299      2967    397251      2954       992
------------------------------------------------------------------------------------------------------------------------

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     11553      1000      1140      1378      1483      1324      1087       913     21062       149        37
------------------------------------------------------------------------------------------------------------------------
(17,177 observations deleted)

. cap drop hole* x

. sort frame_id_numeric year

. gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(36,993 missing values generated)

. gen hole2 = (x > 2 & x != .)

. gen hole1 = (x > 1 & x != .)

. 
end of do-file

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     34688      1504      1781      2236      3200      3459      3191      2896    380074      3436      1085
------------------------------------------------------------------------------------------------------------------------

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     11553      1000      1140      1378      1483      1324      1087       913     21062       193        54
------------------------------------------------------------------------------------------------------------------------
(33,944 observations deleted)

. cap drop hole* x

. sort frame_id_numeric year

. gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(25,501 missing values generated)

. gen hole2 = (x > 2 & x != .)

. gen hole1 = (x > 1 & x != .)

. 
end of do-file

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     33286      1439      1677      1990      2674      3058      2944      2757    346130      4197      1261
------------------------------------------------------------------------------------------------------------------------

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     11553      1000      1140      1378      1483      1324      1087       913     21062       307        96
------------------------------------------------------------------------------------------------------------------------
(2,598 observations deleted)

. cap drop hole* x

. sort frame_id_numeric year

. gen x = year - year[_n-1] if frame_id_numeric == frame_id_numeric[_n-1]
(25,488 missing values generated)

. gen hole2 = (x > 2 & x != .)

. gen hole1 = (x > 1 & x != .)

. 
end of do-file

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     33135      1437      1673      1981      2664      3048      2940      2751    343532      4379      1312
------------------------------------------------------------------------------------------------------------------------

   stats |   foreign  forei~_3  forei~_2  forei~_1  foreign0  foreign1  foreign2  foreign3     count     hole1     hole2
---------+--------------------------------------------------------------------------------------------------------------
     sum |     11553      1000      1140      1378      1483      1324      1087       913     21062       319        99
------------------------------------------------------------------------------------------------------------------------

. 
. *drop if missing(foreign)
. *tabstat foreign foreign_0 foreign_1 count, stat(sum) save
. *mat total = (total \ r(StatTotal))
. 
. *drop hole* x
. mat list total

total[14,11]
       foreign  foreign_3  foreign_2  foreign_1   foreign0   foreign1   foreign2   foreign3      count      hole1      hole2
sum     647076      12859      17142      25675     119746      99537      85840      74805    8091096     150760      75217
sum      11553       1000       1140       1378       1483       1324       1087        913      21062        137         24
sum     264681      12859      16564      23518      53373      43753      37290      32332    7550467     141086      71680
sum      11553       1000       1140       1378       1483       1324       1087        913      21062        137         24
sum      37745       1600       1995       2818       6186       4729       3734       3161     463679       3486       1246
sum      11553       1000       1140       1378       1483       1324       1087        913      21062        137         24
sum      35478       1544       1863       2473       4083       3708       3299       2967     397251       2954        992
sum      11553       1000       1140       1378       1483       1324       1087        913      21062        149         37
sum      34688       1504       1781       2236       3200       3459       3191       2896     380074       3436       1085
sum      11553       1000       1140       1378       1483       1324       1087        913      21062        193         54
sum      33286       1439       1677       1990       2674       3058       2944       2757     346130       4197       1261
sum      11553       1000       1140       1378       1483       1324       1087        913      21062        307         96
sum      33135       1437       1673       1981       2664       3048       2940       2751     343532       4379       1312
sum      11553       1000       1140       1378       1483       1324       1087        913      21062        319         99

. count
  343,532

. 
. * TFP (Cobb-Douglas)
. * FIXME: Replace CD with something fancy
. recode industry_mode (6 75 7 66 84 19 51 = .)
(industry_mode: 440 changes made)

. 
. levelsof industry_mode, local(levels)
1 2 3 5 8 9 10 11 12 13 14 15 16 17 18 20 21 22 23 24 25 26 27 28 29 30 31 32 33 35 36 37 38 39 41 42 43 45 46 47 49 50 52 53 55 56 68 69 70 71 72 73 74 77 78
>  79 80 81 82 85 86 87 88 90 91 92 93 94 95 96

.         foreach l of local levels {
  2.         disp `l'
  3.         qui reghdfe lnQ lnL lnK lnM if industry_mode == `l', a(frame_id_numeric year foundyear) resid
  4.         predict tfp_cd_`l', res
  5.         }
1
(298,158 missing values generated)
2
(342,510 missing values generated)
3
(342,831 missing values generated)
5
(343,296 missing values generated)
8
(342,525 missing values generated)
9
(343,416 missing values generated)
10
(325,346 missing values generated)
11
(341,420 missing values generated)
12
(343,419 missing values generated)
13
(339,751 missing values generated)
14
(334,142 missing values generated)
15
(340,027 missing values generated)
16
(338,658 missing values generated)
17
(341,500 missing values generated)
18
(340,174 missing values generated)
20
(340,912 missing values generated)
21
(342,646 missing values generated)
22
(336,713 missing values generated)
23
(339,198 missing values generated)
24
(341,607 missing values generated)
25
(325,770 missing values generated)
26
(338,378 missing values generated)
27
(339,803 missing values generated)
28
(334,271 missing values generated)
29
(341,088 missing values generated)
30
(342,929 missing values generated)
31
(338,879 missing values generated)
32
(341,831 missing values generated)
33
(342,469 missing values generated)
35
(340,931 missing values generated)
36
(340,709 missing values generated)
37
(343,123 missing values generated)
38
(340,327 missing values generated)
39
(342,749 missing values generated)
41
(332,317 missing values generated)
42
(331,834 missing values generated)
43
(332,319 missing values generated)
45
(332,855 missing values generated)
46
(317,263 missing values generated)
47
(318,632 missing values generated)
49
(333,648 missing values generated)
50
(343,269 missing values generated)
52
(339,374 missing values generated)
53
(343,064 missing values generated)
55
(339,371 missing values generated)
56
(335,324 missing values generated)
68
(334,885 missing values generated)
69
(342,482 missing values generated)
70
(341,161 missing values generated)
71
(338,183 missing values generated)
72
(342,059 missing values generated)
73
(342,498 missing values generated)
74
(342,790 missing values generated)
77
(342,463 missing values generated)
78
(340,350 missing values generated)
79
(342,510 missing values generated)
80
(339,948 missing values generated)
81
(337,992 missing values generated)
82
(340,584 missing values generated)
85
(342,030 missing values generated)
86
(341,170 missing values generated)
87
(342,778 missing values generated)
88
(342,754 missing values generated)
90
(342,757 missing values generated)
91
(343,154 missing values generated)
92
(343,170 missing values generated)
93
(342,087 missing values generated)
94
(343,237 missing values generated)
95
(342,600 missing values generated)
96
(340,944 missing values generated)

. 
. gen  TFP_cd =  .
(343,532 missing values generated)

. levelsof industry_mode, local(levels)
1 2 3 5 8 9 10 11 12 13 14 15 16 17 18 20 21 22 23 24 25 26 27 28 29 30 31 32 33 35 36 37 38 39 41 42 43 45 46 47 49 50 52 53 55 56 68 69 70 71 72 73 74 77 78
>  79 80 81 82 85 86 87 88 90 91 92 93 94 95 96

. foreach l of local levels {
  2. 
.                 qui replace TFP_cd = tfp_cd_`l' if TFP_cd == .
  3. }

. 
. drop tfp_cd_*

. 
. * industry dummy and age
. gen byte industrial_firm = inlist(teaor08_1d,"B","C","D","E")

. gen age = year - foundyear

. 
. * missing export means 0 export
. mvencode export exporter exporter_5, mv(0) override
      export: 87399 missing values recoded
  exporter_5: 87399 missing values recoded

. generate domestic_sales = sales - export

. replace domestic_sales = 0 if domestic_sales < 0 | missing(domestic_sales)
(8 real changes made)

. 
. count
  343,532

. 
. matrix rownames total = "beginning" "greenfield dropped" "sampling" "missing lnK" "missing lnQ" "missing lnL" "missing lnM"

. mata : mat_total_balance = st_matrix("total")

. mata: mata matsave "temp/matrix-balance" mat_total_balance, replace
(saving mat_total_balance[14,11])
file temp/matrix-balance.mmat saved

. drop hole* x

. 
. save_all_to_json

. cap drop __*

. save "`here'/temp/balance-small-clean.dta", replace
file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//temp/balance-small-clean.dta saved

. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/balance.log
  log type:  text
 closed on:  25 May 2021, 17:41:36
--------------------------------------------------------------------------------------------------------------------------------------------------------------
