-----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/expat/almos/output/balance.log
  log type:  text
 opened on:   8 Dec 2022, 10:51:17

. 
. use "$here/input/merleg-expat/balance-small.dta" 

. 
. * keep only numeric part of frame_id
. keep if substr(frame_id, 1, 2) == "ft"
(214,062 observations deleted)

. generate long frame_id_numeric = real(substr(frame_id, 3, 8))

. codebook frame_id*

-----------------------------------------------------------------------------------------------------------------------------------
frame_id                                                                   Frame_id identify one firm. Only_originalid if not valid
-----------------------------------------------------------------------------------------------------------------------------------

                  Type: String (str15), but longest is str10

         Unique values: 918,978                   Missing "": 0/8,122,237

              Examples: "ft11653592"
                        "ft13650485"
                        "ft21145467"
                        "ft24151038"

-----------------------------------------------------------------------------------------------------------------------------------
frame_id_numeric                                                                                                        (unlabeled)
-----------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [10000049,77902216]           Units: 1
         Unique values: 918,978                   Missing .: 0/8,122,237

                  Mean: 1.8e+07
             Std. dev.: 6.6e+06

           Percentiles:     10%       25%       50%       75%       90%
                        1.1e+07   1.2e+07   2.0e+07   2.3e+07   2.7e+07

. drop frame_id

. xtset frame_id_numeric year

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. 
. do "code/create/emp_clean"

. cap drop emp_cl

. clonevar emp_cl=emp
(831,002 missing values generated)

. 
. xtset frame_id_numeric year

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. 
. replace emp_cl=l.emp_cl if 8*emp_cl<l.emp_cl & 8*emp_cl<f.emp_cl & f.emp_cl!=. & l.emp_cl!=. & l.emp_cl>0 & emp_cl>0 & f.emp_cl>0
>  & 1.1*f.emp_cl>l.emp_cl & f.emp_cl>50 & l.emp_cl>50 /*29*/
(1 real change made)

. replace emp_cl=l.emp_cl if emp_cl>8*l.emp_cl & emp_cl>8*f.emp_cl & f.emp_cl!=. & l.emp_cl!=. & emp_cl!=. & l.emp_cl>0 & f.emp_cl>
> 0 & 1.1*l.emp_cl>f.emp_cl & f.emp_cl>50 & l.emp_cl>50 /*20*/
(3 real changes made)

. 
. replace emp_cl=. if 8*emp_cl<l.emp_cl & 8*emp_cl<f.emp_cl & f.emp_cl!=. & l.emp_cl!=. & l.emp_cl>0 & emp_cl>0 & f.emp_cl>0 /*& 1.
> 1*f.emp_cl<l.emp_cl 73*/
(1 real change made, 1 to missing)

. replace emp_cl=. if emp_cl>8*l.emp_cl & emp_cl>8*f.emp_cl & f.emp_cl!=. & l.emp_cl!=. & emp_cl!=. & l.emp_cl>0 & f.emp_cl>0 /*& 1
> .1*l.emp_cl<f.emp_cl 114*/
(3 real changes made, 3 to missing)

. 
. 
. * if emp<6
. replace emp_cl=0 if emp_cl>6 & l.emp_cl==0 & f.emp_cl==0 & emp_cl!=. /*418*/
(0 real changes made)

. replace emp_cl=l.emp_cl if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. & f.emp_cl!=. & l.emp_cl+5>f.emp_cl /*1630*/
(0 real changes made)

. replace emp_cl=l.emp_cl if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. & f.emp_cl!=. & l.emp_cl<f.emp_cl+5 /*532*/
(0 real changes made)

. 
. replace emp_cl=. if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. & f.emp_cl!=. & l.emp_cl+5<f.emp_cl /*0*/
(0 real changes made)

. replace emp_cl=. if emp_cl==0 & f.emp_cl>6 & l.emp_cl>6 & l.emp_cl!=. & f.emp_cl!=. & l.emp_cl>f.emp_cl+5 /*0*/
(0 real changes made)

. 
. ***** Last year
. bysort frame_id_numeric: egen lastyear=max(year)

. foreach i of numlist 1980/2018 {
  2. 
.     local j=`i'+1
  3. 
.     gen j1=emp_cl if year == `i'
  4.     gen j2=emp_cl if year == `j'
  5.    
.     bysort frame_id_numeric: egen v=mean(j1)
  6.     bysort frame_id_numeric: egen w=mean(j2)
  7.    
.     sort frame_id_numeric year
  8.    
.     replace emp_cl=. if 8*v<w & v>0 & w!=. & lastyear==`j' & year==`j'
  9.     replace emp_cl=. if 8*w<v & w>0 & v!=. & lastyear==`j' & year==`j'
 10.    
.     replace emp_cl=. if v>5 & w==0 & v!=. & lastyear==`j' & year==`j'
 11.     replace emp_cl=. if w>5 & v==0 & w!=. & lastyear==`j' & year==`j'
 12.    
.     drop j1 j2 v w      
 13. }
(8,119,007 missing values generated)
(8,118,973 missing values generated)
(8,043,649 missing values generated)
(8,042,916 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,973 missing values generated)
(8,118,968 missing values generated)
(8,042,916 missing values generated)
(8,042,872 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,968 missing values generated)
(8,118,952 missing values generated)
(8,042,872 missing values generated)
(8,042,676 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,952 missing values generated)
(8,118,935 missing values generated)
(8,042,676 missing values generated)
(8,042,455 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,935 missing values generated)
(8,118,396 missing values generated)
(8,042,455 missing values generated)
(8,035,110 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,396 missing values generated)
(8,118,023 missing values generated)
(8,035,110 missing values generated)
(8,031,369 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,023 missing values generated)
(8,117,556 missing values generated)
(8,031,369 missing values generated)
(8,027,046 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,117,556 missing values generated)
(8,117,199 missing values generated)
(8,027,046 missing values generated)
(8,023,304 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,117,199 missing values generated)
(8,114,932 missing values generated)
(8,023,304 missing values generated)
(7,991,929 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,114,932 missing values generated)
(8,099,603 missing values generated)
(7,991,929 missing values generated)
(7,781,163 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,099,603 missing values generated)
(8,083,067 missing values generated)
(7,781,163 missing values generated)
(7,533,878 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,083,067 missing values generated)
(8,030,023 missing values generated)
(7,533,878 missing values generated)
(6,818,421 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,030,023 missing values generated)
(8,006,112 missing values generated)
(6,818,421 missing values generated)
(6,432,340 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,006,112 missing values generated)
(7,976,485 missing values generated)
(6,432,340 missing values generated)
(5,983,120 missing values generated)
(0 real changes made)
(0 real changes made)
(2 real changes made, 2 to missing)
(0 real changes made)
(7,976,487 missing values generated)
(7,959,384 missing values generated)
(5,983,128 missing values generated)
(5,659,002 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,959,384 missing values generated)
(7,934,466 missing values generated)
(5,659,002 missing values generated)
(5,241,341 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,934,466 missing values generated)
(7,914,304 missing values generated)
(5,241,341 missing values generated)
(4,882,443 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,914,305 missing values generated)
(7,889,092 missing values generated)
(4,882,448 missing values generated)
(4,504,892 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(4 real changes made, 4 to missing)
(7,889,098 missing values generated)
(7,880,300 missing values generated)
(4,504,923 missing values generated)
(4,319,657 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,880,301 missing values generated)
(7,858,664 missing values generated)
(4,319,665 missing values generated)
(4,006,429 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,858,664 missing values generated)
(7,838,120 missing values generated)
(4,006,429 missing values generated)
(3,733,130 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,838,120 missing values generated)
(7,838,103 missing values generated)
(3,733,130 missing values generated)
(3,655,597 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(7,838,106 missing values generated)
(7,833,013 missing values generated)
(3,655,615 missing values generated)
(3,554,256 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,833,014 missing values generated)
(7,819,534 missing values generated)
(3,554,259 missing values generated)
(3,371,669 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,819,536 missing values generated)
(7,868,099 missing values generated)
(3,371,680 missing values generated)
(4,020,193 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,868,100 missing values generated)
(7,856,206 missing values generated)
(4,020,200 missing values generated)
(3,853,389 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,856,206 missing values generated)
(7,845,401 missing values generated)
(3,853,389 missing values generated)
(3,742,290 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,845,403 missing values generated)
(7,802,241 missing values generated)
(3,742,303 missing values generated)
(3,258,442 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,802,242 missing values generated)
(7,799,936 missing values generated)
(3,258,445 missing values generated)
(3,272,886 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,799,936 missing values generated)
(7,788,455 missing values generated)
(3,272,886 missing values generated)
(3,185,303 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,788,455 missing values generated)
(7,788,116 missing values generated)
(3,185,303 missing values generated)
(3,270,591 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,788,117 missing values generated)
(7,792,943 missing values generated)
(3,270,595 missing values generated)
(3,406,140 missing values generated)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,792,945 missing values generated)
(7,796,323 missing values generated)
(3,406,152 missing values generated)
(3,522,940 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,796,323 missing values generated)
(7,798,550 missing values generated)
(3,522,940 missing values generated)
(3,598,562 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,798,550 missing values generated)
(7,899,704 missing values generated)
(3,598,562 missing values generated)
(5,006,992 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(2 real changes made, 2 to missing)
(7,899,707 missing values generated)
(7,756,790 missing values generated)
(5,007,006 missing values generated)
(3,149,539 missing values generated)
(0 real changes made)
(2 real changes made, 2 to missing)
(0 real changes made)
(0 real changes made)
(7,756,792 missing values generated)
(7,764,331 missing values generated)
(3,149,562 missing values generated)
(3,303,951 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,764,332 missing values generated)
(7,777,706 missing values generated)
(3,303,959 missing values generated)
(3,566,063 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,777,706 missing values generated)
(8,122,237 missing values generated)
(3,566,063 missing values generated)
(8,122,237 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. ***** First year 
. bysort frame_id_numeric: egen firstyear=min(year)

. foreach i of numlist 1981/2019 {
  2. 
.     local j=`i'-1
  3. 
.     gen j1=emp if year == `i'
  4.     gen j2=emp if year == `j'
  5.    
.     bysort frame_id_numeric: egen v=mean(j1)
  6.     bysort frame_id_numeric: egen w=mean(j2)
  7.    
.     sort frame_id_numeric year
  8.    
.     replace emp_cl=. if 8*v<w & v>0 & w!=. & firstyear==`j' & year==`j'
  9.     replace emp_cl=. if 8*w<v & w>0 & v!=. & firstyear==`j' & year==`j'
 10.    
.     replace emp_cl=. if v>5 & w==0 & v!=. & firstyear==`j' & year==`j'
 11.     replace emp_cl=. if w>5 & v==0 & w!=. & firstyear==`j' & year==`j'
 12.    
.     drop j1 j2 v w
 13. }
(8,118,973 missing values generated)
(8,119,007 missing values generated)
(8,042,916 missing values generated)
(8,043,649 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,968 missing values generated)
(8,118,973 missing values generated)
(8,042,872 missing values generated)
(8,042,916 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,952 missing values generated)
(8,118,968 missing values generated)
(8,042,676 missing values generated)
(8,042,872 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,935 missing values generated)
(8,118,952 missing values generated)
(8,042,455 missing values generated)
(8,042,676 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,396 missing values generated)
(8,118,935 missing values generated)
(8,035,110 missing values generated)
(8,042,455 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,118,023 missing values generated)
(8,118,396 missing values generated)
(8,031,369 missing values generated)
(8,035,110 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,117,556 missing values generated)
(8,118,023 missing values generated)
(8,027,046 missing values generated)
(8,031,369 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,117,199 missing values generated)
(8,117,556 missing values generated)
(8,023,304 missing values generated)
(8,027,046 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,114,932 missing values generated)
(8,117,199 missing values generated)
(7,991,929 missing values generated)
(8,023,304 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,099,600 missing values generated)
(8,114,932 missing values generated)
(7,781,104 missing values generated)
(7,991,929 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,083,067 missing values generated)
(8,099,600 missing values generated)
(7,533,878 missing values generated)
(7,781,104 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,030,023 missing values generated)
(8,083,067 missing values generated)
(6,818,421 missing values generated)
(7,533,878 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made, 2 to missing)
(8,006,112 missing values generated)
(8,030,023 missing values generated)
(6,432,340 missing values generated)
(6,818,421 missing values generated)
(2 real changes made, 2 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,976,485 missing values generated)
(8,006,112 missing values generated)
(5,983,120 missing values generated)
(6,432,340 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,959,384 missing values generated)
(7,976,485 missing values generated)
(5,659,002 missing values generated)
(5,983,120 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,934,466 missing values generated)
(7,959,384 missing values generated)
(5,241,341 missing values generated)
(5,659,002 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,914,304 missing values generated)
(7,934,466 missing values generated)
(4,882,443 missing values generated)
(5,241,341 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,889,092 missing values generated)
(7,914,304 missing values generated)
(4,504,892 missing values generated)
(4,882,443 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,880,300 missing values generated)
(7,889,092 missing values generated)
(4,319,657 missing values generated)
(4,504,892 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,858,664 missing values generated)
(7,880,300 missing values generated)
(4,006,429 missing values generated)
(4,319,657 missing values generated)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,838,120 missing values generated)
(7,858,664 missing values generated)
(3,733,130 missing values generated)
(4,006,429 missing values generated)
(0 real changes made)
(0 real changes made)
(2 real changes made, 2 to missing)
(5 real changes made, 5 to missing)
(7,838,103 missing values generated)
(7,838,120 missing values generated)
(3,655,597 missing values generated)
(3,733,130 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(2 real changes made, 2 to missing)
(7,833,013 missing values generated)
(7,838,103 missing values generated)
(3,554,256 missing values generated)
(3,655,597 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,819,534 missing values generated)
(7,833,013 missing values generated)
(3,371,669 missing values generated)
(3,554,256 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(7,868,099 missing values generated)
(7,819,534 missing values generated)
(4,020,193 missing values generated)
(3,371,669 missing values generated)
(0 real changes made)
(0 real changes made)
(4 real changes made, 4 to missing)
(0 real changes made)
(7,856,206 missing values generated)
(7,868,099 missing values generated)
(3,853,389 missing values generated)
(4,020,193 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(7,845,401 missing values generated)
(7,856,206 missing values generated)
(3,742,290 missing values generated)
(3,853,389 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,802,240 missing values generated)
(7,845,401 missing values generated)
(3,258,431 missing values generated)
(3,742,290 missing values generated)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(7,799,936 missing values generated)
(7,802,240 missing values generated)
(3,272,886 missing values generated)
(3,258,431 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(7,788,455 missing values generated)
(7,799,936 missing values generated)
(3,185,303 missing values generated)
(3,272,886 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(0 real changes made)
(7,788,116 missing values generated)
(7,788,455 missing values generated)
(3,270,591 missing values generated)
(3,185,303 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,792,943 missing values generated)
(7,788,116 missing values generated)
(3,406,140 missing values generated)
(3,270,591 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made, 1 to missing)
(7,796,323 missing values generated)
(7,792,943 missing values generated)
(3,522,940 missing values generated)
(3,406,140 missing values generated)
(0 real changes made)
(0 real changes made)
(3 real changes made, 3 to missing)
(0 real changes made)
(7,798,550 missing values generated)
(7,796,323 missing values generated)
(3,598,562 missing values generated)
(3,522,940 missing values generated)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,899,704 missing values generated)
(7,798,550 missing values generated)
(5,006,992 missing values generated)
(3,598,562 missing values generated)
(0 real changes made)
(2 real changes made, 2 to missing)
(1 real change made, 1 to missing)
(0 real changes made)
(7,756,790 missing values generated)
(7,899,704 missing values generated)
(3,149,539 missing values generated)
(5,006,992 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,764,331 missing values generated)
(7,756,790 missing values generated)
(3,303,951 missing values generated)
(3,149,539 missing values generated)
(1 real change made, 1 to missing)
(2 real changes made, 2 to missing)
(2 real changes made, 2 to missing)
(0 real changes made)
(7,777,706 missing values generated)
(7,764,331 missing values generated)
(3,566,063 missing values generated)
(3,303,951 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,122,237 missing values generated)
(7,777,706 missing values generated)
(8,122,237 missing values generated)
(3,566,063 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. drop firstyear lastyear

. 
end of do-file

. count
  8,122,237

. count if emp == emp_cl & emp != .
  7,291,148

. count if emp != emp_cl & emp != . & emp_cl != .
  4

. count if emp != emp_cl & emp != .
  87

. count if emp != emp_cl & emp_cl != .
  4

. gen emp_add = emp_cl + 1
(831,085 missing values generated)

. corr emp emp_cl emp_add
(obs=7,291,152)

             |      emp   emp_cl  emp_add
-------------+---------------------------
         emp |   1.0000
      emp_cl |   0.9995   1.0000
     emp_add |   0.9995   1.0000   1.0000


. 
. * use fo2 instead of fo3
. merge 1:1 originalid year using "input/balance-sheet-80-19-plus-vars/balance-80-19-plus-vars.dta", keep(1 3) nogen
(variable originalid was long, now double to accommodate using data's values)
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           211
        from master                       211  
        from using                          0  

    Matched                         8,122,026  
    -----------------------------------------

. tab fo2 fo3, missing

   Foreign |
     owned |
     dummy |
share>=50% |  Foreign owned dummy
 1=foreign | with ultimate owners
     0=not |     from Complex
   foreign |         0          1 |     Total
-----------+----------------------+----------
         0 | 7,433,718     66,089 | 7,499,807 
         1 |       562    621,657 |   622,219 
         . |       155         56 |       211 
-----------+----------------------+----------
     Total | 7,434,435    687,802 | 8,122,237 

. 
. * foreign fill 
. rename fo3 foreign

. tab year foreign, missing

           |  Foreign owned dummy
           | with ultimate owners
      Year |     from Complex
 1980-2018 |         0          1 |     Total
-----------+----------------------+----------
      1980 |     3,231          0 |     3,231 
      1981 |     3,265          0 |     3,265 
      1982 |     3,269          0 |     3,269 
      1983 |     3,288          0 |     3,288 
      1984 |     3,303          0 |     3,303 
      1985 |     3,868          0 |     3,868 
      1986 |     4,244          0 |     4,244 
      1987 |     4,763          0 |     4,763 
      1988 |     5,494          0 |     5,494 
      1989 |    11,073          0 |    11,073 
      1990 |    21,514      2,354 |    23,868 
      1991 |    35,927      4,839 |    40,766 
      1992 |    84,610     10,318 |    94,928 
      1993 |   103,640     14,084 |   117,724 
      1994 |   128,805     18,257 |   147,062 
      1995 |   144,116     19,988 |   164,104 
      1996 |   168,004     21,150 |   189,154 
      1997 |   186,989     22,013 |   209,002 
      1998 |   210,235     23,668 |   233,903 
      1999 |   219,742     23,449 |   243,191 
      2000 |   239,734     24,714 |   264,448 
      2001 |   259,405     25,564 |   284,969 
      2002 |   258,525     26,413 |   284,938 
      2003 |   263,358     26,791 |   290,149 
      2004 |   276,196     27,376 |   303,572 
      2005 |   283,497     27,030 |   310,527 
      2006 |   290,856     27,044 |   317,900 
      2007 |   299,289     28,865 |   328,154 
      2008 |   313,628     31,062 |   344,690 
      2009 |   320,715     31,382 |   352,097 
      2010 |   333,496     31,378 |   364,874 
      2011 |   350,073     31,681 |   381,754 
      2012 |   346,205     29,921 |   376,126 
      2013 |   382,724     29,816 |   412,540 
      2014 |   373,712     28,203 |   401,915 
      2015 |   379,617     27,721 |   407,338 
      2016 |   378,513     26,460 |   404,973 
      2017 |   372,898     24,996 |   397,894 
      2018 |   362,614     21,265 |   383,879 
-----------+----------------------+----------
     Total | 7,434,435    687,802 | 8,122,237 

. inspect foreign

foreign:  Foreign owned dummy with ultim        Number of observations
-------------------------------------------------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero        7,434,435     7,434,435             -
|  #                         Positive      687,802       687,802             -
|  #                                   -----------   -----------   -----------
|  #                         Total       8,122,237     8,122,237             -
|  #   .                     Missing             -
+----------------------                -----------
0                     1                  8,122,237
   (2 unique values)

. *inspect jetok_18 if missing(foreign)
. recode foreign (.=0)
(0 changes made to foreign)

. 
. * interpolate small holes
. tab foreign

    Foreign |
owned dummy |
       with |
   ultimate |
owners from |
    Complex |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  7,434,435       91.53       91.53
          1 |    687,802        8.47      100.00
------------+-----------------------------------
      Total |  8,122,237      100.00

. tempvar before

. bys foreign: egen `before' = count(1)

. sort frame_id_numeric year

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & f2.foreign == 1
(800 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & f2.foreign == 0
(770 real changes made)

. bys frame_id_numeric (year): egen minyear = min(year)

. bys frame_id_numeric (year): egen maxyear = max(year)

. replace foreign = 1 if l.foreign == 1 & f.foreign == 1 & f2.foreign == 1 & year == (minyear + 1)
(164 real changes made)

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & year == (minyear + 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & f.foreign == 0 & f2.foreign == 0 & year == (maxyear - 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & year == (maxyear - 1)
(558 real changes made)

. tempvar after

. bys foreign: egen `after' = count(1)

. scalar foreign_interpolate = `before'-`after'

. display foreign_interpolate
-364

. 
end of do-file

. do "/home/tmp/SD3704492.000000"

. preserve
I/O error writing .dta file
    Usually such I/O errors are caused by the disk or file system being full.
r(693);

end of do-file

r(693);

. save "/srv/sandbox/expat/almos/temp/balance-small_t.dta"
file /srv/sandbox/expat/almos/temp/balance-small_t.dta saved

. do "/home/tmp/SD3704492.000000"

. use "$here/input/ceo-panel/ceo-panel.dta", clear

. * expat is changed if job_begin < 1990 in firm_panel.do, not here
. bys frame_id_numeric: egen first_year_expat = min(cond(expat == 1, year,.))
(11,659,587 missing values generated)

. duplicates drop frame_id_numeric, force

Duplicates in terms of frame_id_numeric

(12,609,931 observations deleted)

. tempfile expat

. save `expat'
file /home/tmp/St3704492.000001 saved as .dta format

. *restore
. 
. use "/srv/sandbox/expat/almos/temp/balance-small_t.dta", clear

. merge m:1 frame_id_numeric using `expat', keepusing(first_year_expat) keep(1 3) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                        20,291
        from master                    20,291  
        from using                          0  

    Matched                         8,101,946  
    -----------------------------------------

. 
end of do-file

. help cond

. do "/home/tmp/SD3704492.000000"

. bys frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.))
(7,066,682 missing values generated)

.         
. generate manager_after_owner = first_year_expat - first_year_foreign
(7,402,433 missing values generated)

. generate event_time = year - first_year_expat
(7,145,545 missing values generated)

. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(2,165 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(2,562 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(33,436 real changes made)

. 
. drop manager_after_owner event_time first_year_expat

. 
end of do-file

. do "/home/tmp/SD3704492.000000"

. generate time_foreign = year - first_year_foreign
(7,066,682 missing values generated)

. 
end of do-file

. tab time_foreign

time_foreig |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
        -37 |          2        0.00        0.00
        -36 |          3        0.00        0.00
        -35 |          4        0.00        0.00
        -34 |          3        0.00        0.00
        -33 |         11        0.00        0.00
        -32 |         12        0.00        0.00
        -31 |         15        0.00        0.00
        -30 |         17        0.00        0.01
        -29 |         21        0.00        0.01
        -28 |         29        0.00        0.01
        -27 |         53        0.01        0.02
        -26 |         81        0.01        0.02
        -25 |        110        0.01        0.03
        -24 |        150        0.01        0.05
        -23 |        204        0.02        0.07
        -22 |        270        0.03        0.09
        -21 |        346        0.03        0.13
        -20 |        448        0.04        0.17
        -19 |        583        0.06        0.22
        -18 |        745        0.07        0.29
        -17 |        941        0.09        0.38
        -16 |      1,181        0.11        0.50
        -15 |      1,452        0.14        0.63
        -14 |      1,741        0.16        0.80
        -13 |      2,080        0.20        0.99
        -12 |      2,475        0.23        1.23
        -11 |      2,939        0.28        1.51
        -10 |      3,486        0.33        1.84
         -9 |      4,173        0.40        2.23
         -8 |      4,964        0.47        2.70
         -7 |      5,929        0.56        3.27
         -6 |      7,211        0.68        3.95
         -5 |      8,740        0.83        4.78
         -4 |     10,860        1.03        5.81
         -3 |     13,505        1.28        7.08
         -2 |     17,922        1.70        8.78
         -1 |     26,714        2.53       11.31
          0 |    122,818       11.64       22.95
          1 |    100,456        9.52       32.47
          2 |     86,391        8.18       40.65
          3 |     75,047        7.11       47.76
          4 |     65,920        6.25       54.00
          5 |     58,370        5.53       59.53
          6 |     52,033        4.93       64.46
          7 |     46,568        4.41       68.88
          8 |     41,384        3.92       72.80
          9 |     36,798        3.49       76.28
         10 |     32,632        3.09       79.37
         11 |     28,541        2.70       82.08
         12 |     25,134        2.38       84.46
         13 |     22,434        2.13       86.58
         14 |     20,189        1.91       88.50
         15 |     18,136        1.72       90.22
         16 |     16,350        1.55       91.76
         17 |     14,709        1.39       93.16
         18 |     13,079        1.24       94.40
         19 |     11,513        1.09       95.49
         20 |     10,190        0.97       96.45
         21 |      8,993        0.85       97.30
         22 |      7,718        0.73       98.04
         23 |      6,579        0.62       98.66
         24 |      5,425        0.51       99.17
         25 |      4,028        0.38       99.55
         26 |      2,689        0.25       99.81
         27 |      1,392        0.13       99.94
         28 |        619        0.06      100.00
------------+-----------------------------------
      Total |  1,055,555      100.00

. order frame_id_numeric

. help bysort

. do "/home/tmp/SD3704492.000000"

. bys frame_id_numeric (year): gen owner_spell = sum(foreign != foreign[_n-1])

. bys frame_id_numeric: egen start_as_domestic = max((owner_spell == 1) & (foreign == 0))

. keep if start_as_domestic
(536,846 observations deleted)

. drop owner_spell start_as_domestic

. 
end of do-file

. do "/home/tmp/SD3704492.000000"

. bys frame_id_numeric: egen avg_emp = mean(emp)
(91,262 missing values generated)

. bys frame_id_numeric: egen industry_mode = mode(teaor08_2d), minmode
warning: For at least one group, teaor08_2d contains all missing values. Generating missing values for the modes in these groups.
         Use option missing to treat missing values as a category.
(1,189 missing values generated)

. local sample ((avg_emp >= 20) & (industry_mode != 64 & industry_mode != 65 & industry_mode != 66))

. drop if !`sample'
(7,104,527 observations deleted)

. scalar dropped_size_or_finance = r(N_drop)

. display dropped_size_or_finance
7104527

. 
end of do-file

. count
  480,864

. tab foundyear

 Foundation |
       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1876 |         39        0.01        0.01
       1894 |         34        0.01        0.02
       1896 |         29        0.01        0.02
       1901 |         17        0.00        0.02
       1903 |         12        0.00        0.03
       1905 |         20        0.00        0.03
       1907 |         26        0.01        0.04
       1912 |         30        0.01        0.04
       1914 |         30        0.01        0.05
       1923 |         59        0.01        0.06
       1928 |         30        0.01        0.07
       1930 |          6        0.00        0.07
       1935 |         44        0.01        0.08
       1936 |         37        0.01        0.09
       1937 |         30        0.01        0.09
       1940 |         56        0.01        0.10
       1945 |        233        0.05        0.15
       1946 |      1,357        0.28        0.43
       1947 |        303        0.06        0.50
       1948 |      1,861        0.39        0.88
       1949 |      5,308        1.10        1.99
       1950 |      4,568        0.95        2.94
       1951 |      6,492        1.35        4.29
       1952 |      3,417        0.71        5.00
       1953 |      2,727        0.57        5.57
       1954 |      3,085        0.64        6.21
       1955 |        925        0.19        6.40
       1956 |        760        0.16        6.56
       1957 |      2,326        0.48        7.04
       1958 |        833        0.17        7.21
       1959 |      3,168        0.66        7.87
       1960 |      3,165        0.66        8.53
       1961 |      2,503        0.52        9.05
       1962 |      1,803        0.37        9.43
       1963 |      1,371        0.29        9.71
       1964 |        562        0.12        9.83
       1965 |        454        0.09        9.92
       1966 |        728        0.15       10.08
       1967 |      1,763        0.37       10.44
       1968 |      1,416        0.29       10.74
       1969 |      1,574        0.33       11.06
       1970 |      1,676        0.35       11.41
       1971 |        717        0.15       11.56
       1972 |        651        0.14       11.70
       1973 |      1,523        0.32       12.01
       1974 |      3,649        0.76       12.77
       1975 |      3,808        0.79       13.56
       1976 |      2,311        0.48       14.04
       1977 |      1,739        0.36       14.41
       1978 |        977        0.20       14.61
       1979 |        457        0.10       14.70
       1980 |     10,620        2.21       16.91
       1981 |        809        0.17       17.08
       1982 |      2,212        0.46       17.54
       1983 |      1,394        0.29       17.83
       1984 |      1,666        0.35       18.18
       1985 |      2,956        0.61       18.79
       1986 |      2,830        0.59       19.38
       1987 |      3,315        0.69       20.07
       1988 |      5,114        1.06       21.13
       1989 |     22,979        4.78       25.91
       1990 |     31,603        6.57       32.48
       1991 |     39,171        8.15       40.63
       1992 |     27,548        5.73       46.36
       1993 |     25,428        5.29       51.65
       1994 |     16,882        3.51       55.16
       1995 |     14,926        3.10       58.26
       1996 |     14,999        3.12       61.38
       1997 |     12,647        2.63       64.01
       1998 |      9,660        2.01       66.02
       1999 |     10,450        2.17       68.19
       2000 |      9,023        1.88       70.07
       2001 |      7,901        1.64       71.71
       2002 |      6,461        1.34       73.06
       2003 |      6,756        1.40       74.46
       2004 |      5,749        1.20       75.66
       2005 |      7,849        1.63       77.29
       2006 |      5,821        1.21       78.50
       2007 |      6,331        1.32       79.82
       2008 |      5,138        1.07       80.89
       2009 |      4,726        0.98       81.87
       2010 |      5,138        1.07       82.94
       2011 |      5,739        1.19       84.13
       2012 |      3,783        0.79       84.92
       2013 |      4,888        1.02       85.93
       2014 |      3,196        0.66       86.60
       2015 |     17,964        3.74       90.33
       2016 |     20,906        4.35       94.68
       2017 |     15,932        3.31       97.99
       2018 |      9,645        2.01      100.00
------------+-----------------------------------
      Total |    480,864      100.00

. count if foundyear==.
  0

. do "/home/tmp/SD3704492.000000"

. tempvar foundyear

. bys frame_id_numeric: egen `foundyear' = min(year)

. replace foundyear = `foundyear' if missing(foundyear)
(0 real changes made)

. drop `foundyear'

. 
end of do-file

. do "/home/tmp/SD3704492.000000"

. foreach x in sales export tanass jetok ranyag ranyag8091 immat {
  2.         cap drop `x'_18
  3.         gen double `x'_18 = `x' / ppi18
  4.         replace `x'_18 = `x' if year < 1992 // FIXME: till ppi before 1992 is not filled up - just to not delete those rows be
> cause of missing ln dependent variables
  5. }
(30,511 missing values generated)
(56,600 real changes made)
(208,894 missing values generated)
(32,096 real changes made)
(38,271 missing values generated)
(54,497 real changes made)
(30,287 missing values generated)
(55,426 real changes made)
(64,221 missing values generated)
(0 real changes made)
(24,745 missing values generated)
(56,756 real changes made)
(167,577 missing values generated)
(0 real changes made)

. 
end of do-file

. sum *18

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       ppi18 |    456,119    .6877655    .2918479    .000337   1.574918
    sales_18 |    474,204     2160398    3.04e+07          0   5.90e+09
   export_18 |    295,821    843195.4    1.25e+07          0   1.14e+09
   tanass_18 |    466,444      960976    2.31e+07  -800.3072   6.09e+09
    jetok_18 |    474,427    562708.2    2.17e+07          0   7.93e+09
-------------+---------------------------------------------------------
   ranyag_18 |    416,643     1826724    2.28e+07   -9078889   2.70e+09
ranyag809~18 |    479,970    802169.7    1.40e+07   -3657175   2.22e+09
    immat_18 |    313,287     65553.9     3582970   -540.599   5.97e+08

. count
  480,864

. sum sales sales_18

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       sales |    475,060     1454781    1.73e+07          0   2.53e+09
    sales_18 |    474,204     2160398    3.04e+07          0   5.90e+09

. sum export export_18

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      export |    295,866    660959.9    1.09e+07          0   1.14e+09
   export_18 |    295,821    843195.4    1.25e+07          0   1.14e+09

. sum emp_clean, d
variable emp_clean not found
r(111);

. sum emp_add

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     emp_add |    381,191    160.7601    1018.327          1     134617

. sum emp_add, d

                           emp_add
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%            8              1       Obs             381,191
25%           23              1       Sum of wgt.     381,191

50%           44                      Mean           160.7601
                        Largest       Std. dev.      1018.327
75%          105         129392
90%          311         129695       Variance        1036991
95%          583         132423       Skewness       77.65555
99%         1851         134617       Kurtosis       8601.459

. do "/home/tmp/SD3704492.000000"

. gen lnL = ln(emp_add)
(99,673 missing values generated)

. *gen lnL_add = ln(emp_add)
. gen lnM = ln(ranyag_18)
(80,035 missing values generated)

. replace lnM = ln(ranyag8091_18) if year <= 1991
(56,610 real changes made)

. gen lnQ = ln(sales_18)
(53,683 missing values generated)

. gen lnQL = lnQ-lnL
(106,881 missing values generated)

. gen lnMQ = lnM - lnQ
(57,887 missing values generated)

. gen byte exporter = export_18 > 0 & export_18 != .

. gen export_share = export_18 / sales
(192,354 missing values generated)

. gen exporter_5 = (export_share > .05 & export_share != .)

. replace exporter_5 = . if export_share == .
(192,354 real changes made, 192,354 to missing)

. 
end of do-file

. do "/home/tmp/SD3704492.000000"

. inspect tanass_18

tanass_18:                                      Number of observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            4             1             3
|  #                         Zero           68,162        68,162             -
|  #                         Positive      398,278        75,313       322,965
|  #                                   -----------   -----------   -----------
|  #                         Total         466,444       143,476       322,968
|  #   .   .   .   .         Missing        14,420
+----------------------                -----------
-800.3072      6.09e+09                    480,864
(More than 99 unique values)

. tempvar gap 

. generate `gap' = missing(tanass_18) | (tanass_18 <= 0)

. bysort frame_id_numeric (year): generate spell = sum(`gap' != `gap'[_n-1])

. 
. egen gap_length = count(1), by(frame_id_numeric spell)

. egen max_spell = max(spell), by(frame_id_numeric)

. * if gap_length <= 2, interpolate tanass with geometric average
. bysort frame_id_numeric (year): replace tanass_18 = sqrt(tanass_18[_n-1] * tanass_18[_n+1]) if gap_length==1 & `gap'==1
(22388 real changes made, 21045 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1]^0.67 * tanass_18[_n+2]^0.33 if gap_length==2 & `gap'==1 & `ga
> p'[_n-1]==0
(808 real changes made, 608 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-2]^0.33 * tanass_18[_n+1]^0.67 if gap_length==2 & `gap'==1 & `ga
> p'[_n+1]==0
(1601 real changes made, 1401 to missing)

. * at either end, extrapolate for 1 year
. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n+1] if spell==1 & `gap'==1 & `gap'[_n+1]==0
(9769 real changes made)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1] if spell==max_spell & `gap'==1 & `gap'[_n-1]==0
(3855 real changes made)

. 
. drop spell gap_length max_spell

. replace tanass_18 = round(tanass_18)
(335,431 real changes made)

. inspect tanass_18

tanass_18:                                      Number of observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            2             2             -
|  #                         Zero           42,790        42,790             -
|  #                         Positive      413,645       413,635            10
|  #                                   -----------   -----------   -----------
|  #                         Total         456,437       456,427            10
|  #   .   .   .   .         Missing        24,427
+----------------------                -----------
-60            6.09e+09                    480,864
(More than 99 unique values)

. 
end of do-file

. do "/home/tmp/SD3704492.000000"

. gen lnK = ln(tanass_18)
(67,219 missing values generated)

. gen lnKL = lnK - lnL
(108,533 missing values generated)

. generate RperK = immat / (immat + tanass)
(227,750 missing values generated)

. replace RperK = 0 if RperK < 0 | missing(immat)
(166,692 real changes made)

. label variable RperK "Share of immaterial assets [0,1]"

. 
end of do-file

. do "/home/tmp/SD3704492.000000"

. count if missing(lnK, lnQ, lnL, lnM, foreign) & year > 1991
  111,937

. count if missing(lnK, lnQ, lnL, lnM, foreign)
  116,030

. *drop if missing(lnK, lnQ, lnL, lnM, foreign) // ASK: whether year condition needed
. *count
. 
. foreach var in lnK lnQ lnL lnM {
  2.         drop if missing(`var')
  3. }
(67,219 observations deleted)
(17,431 observations deleted)
(28,564 observations deleted)
(2,816 observations deleted)

. 
end of do-file

. do "/home/tmp/SD3704492.000000"

. count
  364,834

. 
end of do-file

. do "/home/tmp/SD3704492.000000"

. recode industry_mode (6 75 7 66 84 19 51 = .)
(514 changes made to industry_mode)

. 
. levelsof industry_mode, local(levels)
1 2 3 5 8 9 10 11 12 13 14 15 16 17 18 20 21 22 23 24 25 26 27 28 29 30 31 32 33 35 36 37 38 39 41 42 43 45 46 47 49 50 52 53 55 56
>  68 69 70 71 72 73 74 77 78 79 80 81 82 85 86 87 88 90 91 92 93 94 95 96

.         foreach l of local levels {
  2.         disp `l'
  3.         qui reghdfe lnQ lnL lnK lnM if industry_mode == `l', a(frame_id_numeric year foundyear) resid
  4.         predict tfp_cd_`l', res
  5.         }
1
(315,094 missing values generated)
2
(363,831 missing values generated)
3
(364,103 missing values generated)
5
(364,520 missing values generated)
8
(363,773 missing values generated)
9
(364,717 missing values generated)
10
(345,998 missing values generated)
11
(362,555 missing values generated)
12
(364,769 missing values generated)
13
(360,777 missing values generated)
14
(354,755 missing values generated)
15
(361,016 missing values generated)
16
(359,809 missing values generated)
17
(362,804 missing values generated)
18
(361,187 missing values generated)
20
(362,067 missing values generated)
21
(363,948 missing values generated)
22
(357,825 missing values generated)
23
(360,232 missing values generated)
24
(362,665 missing values generated)
25
(346,091 missing values generated)
26
(359,229 missing values generated)
27
(360,862 missing values generated)
28
(354,708 missing values generated)
29
(362,310 missing values generated)
30
(364,182 missing values generated)
31
(359,862 missing values generated)
32
(362,821 missing values generated)
33
(363,730 missing values generated)
35
(362,072 missing values generated)
36
(361,932 missing values generated)
37
(364,377 missing values generated)
38
(361,566 missing values generated)
39
(364,014 missing values generated)
41
(352,845 missing values generated)
42
(351,395 missing values generated)
43
(353,005 missing values generated)
45
(353,738 missing values generated)
46
(338,174 missing values generated)
47
(338,948 missing values generated)
49
(354,757 missing values generated)
50
(364,568 missing values generated)
52
(360,544 missing values generated)
53
(364,368 missing values generated)
55
(360,482 missing values generated)
56
(356,342 missing values generated)
68
(355,333 missing values generated)
69
(363,604 missing values generated)
70
(362,293 missing values generated)
71
(358,786 missing values generated)
72
(363,173 missing values generated)
73
(363,702 missing values generated)
74
(364,011 missing values generated)
77
(363,693 missing values generated)
78
(361,600 missing values generated)
79
(363,739 missing values generated)
80
(361,194 missing values generated)
81
(358,944 missing values generated)
82
(361,794 missing values generated)
85
(363,155 missing values generated)
86
(362,397 missing values generated)
87
(364,063 missing values generated)
88
(364,021 missing values generated)
90
(364,072 missing values generated)
91
(364,450 missing values generated)
92
(364,511 missing values generated)
93
(363,330 missing values generated)
94
(364,533 missing values generated)
95
(363,799 missing values generated)
96
(361,640 missing values generated)

. 
. gen  TFP_cd =  .
(364,834 missing values generated)

. levelsof industry_mode, local(levels)
1 2 3 5 8 9 10 11 12 13 14 15 16 17 18 20 21 22 23 24 25 26 27 28 29 30 31 32 33 35 36 37 38 39 41 42 43 45 46 47 49 50 52 53 55 56
>  68 69 70 71 72 73 74 77 78 79 80 81 82 85 86 87 88 90 91 92 93 94 95 96

. foreach l of local levels {
  2. 
.                 qui replace TFP_cd = tfp_cd_`l' if TFP_cd == .
  3. }

. 
. drop tfp_cd_*

. 
end of do-file

. do "/home/tmp/SD3704492.000000"

. gen byte industrial_firm = inlist(teaor08_1d,"B","C","D","E")

. gen age = year - foundyear

. 
end of do-file

. do "/home/tmp/SD3704492.000000"

. mvencode export exporter exporter_5, mv(0) override
      export: 89475 missing values recoded
  exporter_5: 89475 missing values recoded

. 
end of do-file

. do "/home/tmp/SD3704492.000000"

. generate domestic_sales = sales - export

. replace domestic_sales = 0 if domestic_sales < 0 | missing(domestic_sales)
(10 real changes made)

. 
. count
  364,834

. 
end of do-file

. do "/home/tmp/SD3704492.000000"

. cap drop __*

. save "$here/temp/balance-small-clean.dta", replace
file /srv/sandbox/expat/almos/temp/balance-small-clean.dta saved

. log close
      name:  <unnamed>
       log:  /srv/sandbox/expat/almos/output/balance.log
  log type:  text
 closed on:   8 Dec 2022, 12:09:29
-----------------------------------------------------------------------------------------------------------------------------------
