-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/balance.log
  log type:  text
 opened on:   6 May 2024, 17:05:43

. 
. use "`here'/input/merleg-expat/balance-small.dta" 

. 
. * keep only numeric part of frame_id
. keep if substr(frame_id, 1, 2) == "ft"
(214,062 observations deleted)

. generate long frame_id_numeric = real(substr(frame_id, 3, 8))

. codebook frame_id*

-------------------------------------------------------------------------------
frame_id               Frame_id identify one firm. Only_originalid if not valid
-------------------------------------------------------------------------------

                  Type: String (str15), but longest is str10

         Unique values: 918,978                   Missing "": 0/8,122,237

              Examples: "ft11653592"
                        "ft13650485"
                        "ft21145467"
                        "ft24151038"

-------------------------------------------------------------------------------
frame_id_numeric                                                    (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [10000049,77902216]           Units: 1
         Unique values: 918,978                   Missing .: 0/8,122,237

                  Mean: 1.8e+07
             Std. dev.: 6.6e+06

           Percentiles:     10%       25%       50%       75%       90%
                        1.1e+07   1.2e+07   2.0e+07   2.3e+07   2.7e+07

. drop frame_id

. xtset frame_id_numeric year

Panel variable: frame_id_numeric (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. 
. * use fo2 instead of fo3
. merge 1:1 originalid year using "`here'/input/balance-sheet-80-19-plus-vars/b
> alance-80-19-plus-vars.dta", keep(1 3) nogen
(variable originalid was long, now double to accommodate using data's values)
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           211
        from master                       211  
        from using                          0  

    Matched                         8,122,026  
    -----------------------------------------

. tab fo2 fo3, missing

   Foreign |
     owned |
     dummy |
share>=50% |  Foreign owned dummy
 1=foreign | with ultimate owners
     0=not |     from Complex
   foreign |         0          1 |     Total
-----------+----------------------+----------
         0 | 7,433,718     66,089 | 7,499,807 
         1 |       562    621,657 |   622,219 
         . |       155         56 |       211 
-----------+----------------------+----------
     Total | 7,434,435    687,802 | 8,122,237 

. 
. * foreign fill 
. rename fo3 foreign

. tab year foreign, missing

           |  Foreign owned dummy
           | with ultimate owners
      Year |     from Complex
 1980-2018 |         0          1 |     Total
-----------+----------------------+----------
      1980 |     3,231          0 |     3,231 
      1981 |     3,265          0 |     3,265 
      1982 |     3,269          0 |     3,269 
      1983 |     3,288          0 |     3,288 
      1984 |     3,303          0 |     3,303 
      1985 |     3,868          0 |     3,868 
      1986 |     4,244          0 |     4,244 
      1987 |     4,763          0 |     4,763 
      1988 |     5,494          0 |     5,494 
      1989 |    11,073          0 |    11,073 
      1990 |    21,514      2,354 |    23,868 
      1991 |    35,927      4,839 |    40,766 
      1992 |    84,610     10,318 |    94,928 
      1993 |   103,640     14,084 |   117,724 
      1994 |   128,805     18,257 |   147,062 
      1995 |   144,116     19,988 |   164,104 
      1996 |   168,004     21,150 |   189,154 
      1997 |   186,989     22,013 |   209,002 
      1998 |   210,235     23,668 |   233,903 
      1999 |   219,742     23,449 |   243,191 
      2000 |   239,734     24,714 |   264,448 
      2001 |   259,405     25,564 |   284,969 
      2002 |   258,525     26,413 |   284,938 
      2003 |   263,358     26,791 |   290,149 
      2004 |   276,196     27,376 |   303,572 
      2005 |   283,497     27,030 |   310,527 
      2006 |   290,856     27,044 |   317,900 
      2007 |   299,289     28,865 |   328,154 
      2008 |   313,628     31,062 |   344,690 
      2009 |   320,715     31,382 |   352,097 
      2010 |   333,496     31,378 |   364,874 
      2011 |   350,073     31,681 |   381,754 
      2012 |   346,205     29,921 |   376,126 
      2013 |   382,724     29,816 |   412,540 
      2014 |   373,712     28,203 |   401,915 
      2015 |   379,617     27,721 |   407,338 
      2016 |   378,513     26,460 |   404,973 
      2017 |   372,898     24,996 |   397,894 
      2018 |   362,614     21,265 |   383,879 
-----------+----------------------+----------
     Total | 7,434,435    687,802 | 8,122,237 

. inspect foreign

foreign:  Foreign owned dummy with ultim        Number of observations
-------------------------------------------------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero        7,434,435     7,434,435             -
|  #                         Positive      687,802       687,802             -
|  #                                   -----------   -----------   -----------
|  #                         Total       8,122,237     8,122,237             -
|  #   .                     Missing             -
+----------------------                -----------
0                     1                  8,122,237
   (2 unique values)

. *inspect jetok_18 if missing(foreign)
. recode foreign (.=0)
(0 changes made to foreign)

. 
. * interpolate small holes
. tab foreign

    Foreign |
owned dummy |
       with |
   ultimate |
owners from |
    Complex |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  7,434,435       91.53       91.53
          1 |    687,802        8.47      100.00
------------+-----------------------------------
      Total |  8,122,237      100.00

. tempvar before

. bys foreign: egen `before' = count(1)

. sort frame_id_numeric year

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & f2
> .foreign == 1
(800 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & f2
> .foreign == 0
(770 real changes made)

. bys frame_id_numeric (year): egen minyear = min(year)

. bys frame_id_numeric (year): egen maxyear = max(year)

. replace foreign = 1 if l.foreign == 1 & f.foreign == 1 & f2.foreign == 1 & ye
> ar == (minyear + 1)
(164 real changes made)

. replace foreign = 1 if l.foreign == 1 & l2.foreign == 1 & f.foreign == 1 & ye
> ar == (minyear + 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & f.foreign == 0 & f2.foreign == 0 & ye
> ar == (maxyear - 1)
(0 real changes made)

. replace foreign = 0 if l.foreign == 0 & l2.foreign == 0 & f.foreign == 0 & ye
> ar == (maxyear - 1)
(558 real changes made)

. tempvar after

. bys foreign: egen `after' = count(1)

. scalar foreign_interpolate = `before'-`after'

. display foreign_interpolate
-364

. 
. 
. * limit sample before large merge - sampling based on firm-level variables, f
> irm-year done later
. * average employment and financial firms deleted
. * break the tie when mode is not unique
. 
. * minimal employment cleaning
. replace emp = 1 if emp <= 0 | missing(emp)
(2,772,629 real changes made)

. bys frame_id_numeric: egen avg_emp = mean(emp)

. bys frame_id_numeric: egen industry_mode = mode(teaor08_2d), minmode
warning: For at least one group, teaor08_2d contains all missing values.
         Generating missing values for the modes in these groups. Use option
         missing to treat missing values as a category.
(1,289 missing values generated)

. 
. * drop finance
. drop if inrange(industry_mode, 64, 66)
(159,871 observations deleted)

. * drop human services
. drop if inrange(industry_mode, 77, 99)
(1,219,810 observations deleted)

. * drop small firms
. drop if (avg_emp < 10)
(6,026,135 observations deleted)

. 
. * proxy firm founding date with first balance sheet filed
. tempvar foundyear

. bys frame_id_numeric: egen `foundyear' = min(year)

. replace foundyear = `foundyear' if missing(foundyear)
(0 real changes made)

. drop `foundyear'

. 
. * deflate nominal values - FIXME: add ppi before 1992
. foreach x in sales export tanass jetok ranyag ranyag8091 immat {
  2.         cap drop `x'_18
  3.         gen double `x'_18 = `x' / ppi18
  4.         replace `x'_18 = `x' if year < 1992 // FIXME: till ppi before 1992
>  is not filled up - just to not delete those rows because of missing ln depen
> dent variables
  5. }
(28,432 missing values generated)
(62,701 real changes made)
(251,375 missing values generated)
(33,128 real changes made)
(35,550 missing values generated)
(59,342 real changes made)
(28,301 missing values generated)
(61,604 real changes made)
(68,324 missing values generated)
(0 real changes made)
(23,742 missing values generated)
(62,979 real changes made)
(267,625 missing values generated)
(0 real changes made)

. 
. mvencode export_18, mv(0) override
   export_18: 227655 missing values recoded

. 
. * creating dependent variables
. gen lnL = ln(emp)

. gen lnM = ln(ranyag_18)
(74,373 missing values generated)

. replace lnM = ln(ranyag8091_18) if year <= 1991
(62,804 real changes made)

. gen lnQ = ln(sales_18)
(22,045 missing values generated)

. gen lnQL = lnQ - lnL
(22,045 missing values generated)

. gen lnMQ = lnM - lnQ
(26,477 missing values generated)

. generate lnEx = ln(export_18)
(506,364 missing values generated)

. generate lnQd = ln(sales_18 - export_18)
(26,908 missing values generated)

. 
. gen byte exporter = export_18 > 0 & export_18 != .

. gen export_share = export_18 / sales_18
(22,045 missing values generated)

. gen exporter_5 = (export_share > .05 & export_share != .)

. replace exporter_5 = . if export_share == .
(22,045 real changes made, 22,045 to missing)

. 
. * extrapolate capital stock
. inspect tanass_18

tanass_18:                                      Number of observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            3             -             3
|  #                         Zero           27,267        27,267             -
|  #                         Positive      677,321        82,214       595,107
|  #                                   -----------   -----------   -----------
|  #                         Total         704,591       109,481       595,110
|  #   .   .   .   .         Missing        11,830
+----------------------                -----------
-1656.313      6.09e+09                    716,421
(More than 99 unique values)

. tempvar gap 

. generate `gap' = missing(tanass_18) | (tanass_18 <= 0)

. bysort frame_id_numeric (year): generate spell = sum(`gap' != `gap'[_n-1])

. 
. egen gap_length = count(1), by(frame_id_numeric spell)

. egen max_spell = max(spell), by(frame_id_numeric)

. * if gap_length <= 2, interpolate tanass with geometric average
. bysort frame_id_numeric (year): replace tanass_18 = sqrt(tanass_18[_n-1] * ta
> nass_18[_n+1]) if gap_length==1 & `gap'==1
(11481 real changes made, 8699 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1]^0.67 * ta
> nass_18[_n+2]^0.33 if gap_length==2 & `gap'==1 & `gap'[_n-1]==0
(1144 real changes made, 754 to missing)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-2]^0.33 * ta
> nass_18[_n+1]^0.67 if gap_length==2 & `gap'==1 & `gap'[_n+1]==0
(1620 real changes made, 1230 to missing)

. * at either end, extrapolate for 1 year
. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n+1] if spell=
> =1 & `gap'==1 & `gap'[_n+1]==0
(10607 real changes made)

. bysort frame_id_numeric (year): replace tanass_18 = tanass_18[_n-1] if spell=
> =max_spell & `gap'==1 & `gap'[_n-1]==0
(5078 real changes made)

. 
. drop spell gap_length max_spell

. replace tanass_18 = round(tanass_18)
(612,652 real changes made)

. inspect tanass_18

tanass_18:                                      Number of observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            3             3             -
|  #                         Zero           12,786        12,786             -
|  #                         Positive      696,568       696,558            10
|  #                                   -----------   -----------   -----------
|  #                         Total         709,357       709,347            10
|  #   .   .   .   .         Missing         7,064
+----------------------                -----------
-1656          6.09e+09                    716,421
(More than 99 unique values)

. 
. gen lnK = ln(tanass_18)
(19,853 missing values generated)

. gen lnKL = lnK - lnL
(19,853 missing values generated)

. generate RperK = immat / (immat + tanass)
(282,572 missing values generated)

. replace RperK = 0 if RperK < 0 | missing(immat)
(267,619 real changes made)

. label variable RperK "Share of immaterial assets [0,1]"

. 
. * firm-year deletions
. count if missing(lnK, lnQ, lnL, lnM, foreign) & year > 1991
  35,689

. count if missing(lnK, lnQ, lnL, lnM, foreign)
  38,491

. 
. foreach var in lnK lnQ lnL lnM {
  2.         drop if missing(`var')
  3. }
(19,853 observations deleted)
(14,853 observations deleted)
(0 observations deleted)
(3,785 observations deleted)

. 
. count
  677,930

. 
. gen age = year - foundyear

. 
. * missing export means 0 export
. mvencode export exporter exporter_5, mv(0) override
      export: 210182 missing values recoded

. generate domestic_sales = sales - export

. replace domestic_sales = 0 if domestic_sales < 0 | missing(domestic_sales)
(14 real changes made)

. 
. count
  677,930

. 
. cap drop __*

. save "`here'/temp/balance-small-clean.dta", replace
file /Users/koren/Tresorit/Mac/projects/expat//temp/balance-small-clean.dta
    saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/balance.log
  log type:  text
 closed on:   6 May 2024, 17:06:43
-------------------------------------------------------------------------------
