----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Documents/workspace/expat/output/descriptives.log
  log type:  text
 opened on:   8 Nov 2018, 10:06:48

. 
. use temp/firm_ceo_panel

. 
. * sample for faster graphs
. set seed 7805

. sample 25
(8,164,570 observations deleted)

. 
. ren N_total N

. reshape long N_ tenure_, i(frame_id year ) j(category) string
(note: j = domestic expat)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                  2.7e+06   -> 5.4e+06
Number of variables                   8   ->       7
j variable (2 values)                     ->   category
xij variables:
                     N_domestic N_expat   ->   N_
           tenure_domestic tenure_expat   ->   tenure_
-----------------------------------------------------------------------------

. 
. label var N_ "Number of CEOs"

. label var N "Total number of managers"

. label var tenure_ "Lowest tenure"

. label var category "Manager"

. 
. hist N if N <=20, disc scheme(538w)
(start=1, width=1)

. graph export output/figure/manager_N_histogram.png, width(800) replace
(file output/figure/manager_N_histogram.png written in PNG format)

. 
. hist N_ if N_ <=5, by(category ) disc scheme(538w)
(note:  clockdir by_legend_position not found in scheme, default attributes used)

. graph export output/figure/CEO_N_histogram.png, width(800) replace
(file output/figure/CEO_N_histogram.png written in PNG format)

. 
. hist tenure_ if tenure_ <=30, by(category ) disc scheme(538w)
(note:  clockdir by_legend_position not found in scheme, default attributes used)

. graph export output/figure/CEO_tenure_histogram.png, width(800) replace
(file output/figure/CEO_tenure_histogram.png written in PNG format)

. 
. log close
      name:  <unnamed>
       log:  /Users/koren/Documents/workspace/expat/output/descriptives.log
  log type:  text
 closed on:   8 Nov 2018, 10:08:51
----------------------------------------------------------------------------------
