----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Google Drive/Research/expat/research_design/talk/output/
> descriptives.log
  log type:  text
 opened on:  12 Jan 2019, 13:15:14

. 
. local format scheme(538w) plotregion(style(none)) 

. 
. use temp/firm_ceo_panel

. 
. gen spell_length = first_exit_year - enter_year + 1

. label var spell_length "Length of CEO spell"

. label var expat "manager nationality"

. label def xp 0 "Local" 1 "Expat"

. label val expat xp

. 
. egen spt = tag(frame_id manager_id)
variable __000000 already defined

. 
. hist spell_length if spell_length <=30 & spt, by(expat) disc `format' xsize(20) 
> ysize(8)
(note:  clockdir by_legend_position not found in scheme, default attributes used)

. graph export output/figure/CEO_tenure_histogram.png, width(1600) replace
(file output/figure/CEO_tenure_histogram.png written in PNG format)

. 
. use temp/analysis_sample, clear

. 
. label var expat "manager nationality"

. label def xp 0 "Local" 1 "Expat"

. label val expat xp

. 
. gen byte entrant = year==enter_year

. * only count managers actually at firm
. * cannot use "during" for this as that is 0 for founders
. keep if year>=enter_year & year<=first_exit_year
(539,789 observations deleted)

. 
. preserve

.         egen spt = tag(frame_id manager_id)

.         collapse (sum) N=spt, by(DD DE ED EE)

.         gen str1 from = ""
(5 missing values generated)

.         gen str1 to = ""
(5 missing values generated)

.         gen byte i = 1

.         foreach from in D E {
  2.         foreach to in D E {
  3.                 replace from = "`from'" if `from'`to'
  4.                 replace to = "`to'" if `from'`to'
  5.                 drop `from'`to'
  6.         }
  7.         }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

.         l

     +-----------------------+
     |     N   from   to   i |
     |-----------------------|
  1. | 29118               1 |
  2. |  4999      E    E   1 |
  3. |  2915      E    D   1 |
  4. |  2340      D    E   1 |
  5. | 28005      D    D   1 |
     +-----------------------+

.         drop if missing(from)
(1 observation deleted)

.         drop i

.         reshape wide N, i(from) j(to) string
(note: j = D E)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        4   ->       2
Number of variables                   3   ->       3
j variable (2 values)                to   ->   (dropped)
xij variables:
                                      N   ->   ND NE
-----------------------------------------------------------------------------

.         replace from = cond(from=="D","domestic","expat")
variable from was str1 now str8
(2 real changes made)

.         ren ND to_domestic

.         ren NE to_expat

.         export delimited output/table/switches.csv, replace
file output/table/switches.csv saved

. restore

. 
. preserve

.         gen byte categ = 1+expat

.         replace categ = 0 if founder==1
(173,878 real changes made)

.         tab categ

      categ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    173,878       47.19       47.19
          1 |    165,579       44.93       92.12
          2 |     29,036        7.88      100.00
------------+-----------------------------------
      Total |    368,493      100.00

.         collapse (count) N=entrant, by(age categ)

.         reshape wide N, i(age) j(categ)
(note: j = 0 1 2)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                      286   ->     108
Number of variables                   3   ->       4
j variable (3 values)             categ   ->   (dropped)
xij variables:
                                      N   ->   N0 N1 N2
-----------------------------------------------------------------------------

.         mvencode N*, mv(0) override
          N0: 32 missing values recoded
          N2: 6 missing values recoded

.         
.         egen total_N = rsum(N?)

.         foreach X of var N? {
  2.                 gen `X'_share = 100*`X'/total_N
  3.         }

.         replace N1_share = N2_share+N1_share
(102 real changes made)

.         replace N0_share = 100
(108 real changes made)

.         label var age "Firm age (year)"

.         tw (area N0_share N1_share N2_share age if age<=20, fintensity(inten20 i
> nten20 inten20) ),  `format' legend(order(1 "Founder" 2 "New local" 3 "New expat
> ")) xsize(16) ysize(10) aspect(.67)

.         graph export output/figure/CEO_type_by_age.png, width(1600) replace
(file output/figure/CEO_type_by_age.png written in PNG format)

. restore

. 
. collapse (count) N=entrant (sum) entrant (firstnm) age, by(frame_id year expat)

. reshape wide N entrant, i(frame_id year) j(expat)
(note: j = 0 1)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                   254144   ->  241123
Number of variables                   6   ->       7
j variable (2 values)             expat   ->   (dropped)
xij variables:
                                      N   ->   N0 N1
                                entrant   ->   entrant0 entrant1
-----------------------------------------------------------------------------

. reshape long
(note: j = 0 1)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                   241123   ->  482246
Number of variables                   7   ->       6
j variable (2 values)                     ->   expat
xij variables:
                                  N0 N1   ->   N
                      entrant0 entrant1   ->   entrant
-----------------------------------------------------------------------------

. 
. mvencode N entrant, mv(0) override
           N: 228102 missing values recoded
     entrant: 228102 missing values recoded

. 
. egen total_N = sum(N), by(frame_id year)

. 
. label var N "Number of CEOs"

. label var total_N "Number of CEOs"

. 
. hist total_N, disc `format' xsize(16) ysize(10) aspect(.67)
(start=1, width=1)

. graph export output/figure/CEO_N_histogram.png, width(1600) replace
(file output/figure/CEO_N_histogram.png written in PNG format)

. 
. hist N if N <=5, by(expat ) disc `format' xsize(20) ysize(8)
(note:  clockdir by_legend_position not found in scheme, default attributes used)

. graph export output/figure/CEO_N_histogram_by.png, width(1600) replace 
(file output/figure/CEO_N_histogram_by.png written in PNG format)

. 
. * only count one CEO per firm
. replace N=1 if N>1
(79,076 real changes made)

. replace entrant=1 if entrant>1
(9,412 real changes made)

. 
. reshape wide
(note: j = 0 1)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                   482246   ->  241123
Number of variables                   7   ->       8
j variable (2 values)             expat   ->   (dropped)
xij variables:
                                      N   ->   N0 N1
                                entrant   ->   entrant0 entrant1
-----------------------------------------------------------------------------

. collapse (sum) N0 N1 entrant0 entrant1 total_N, by(year)

. 
. foreach X of var N1 entrant1 entrant0 {
  2.         gen `X'_share = `X'/total_N*100
  3. }

. 
. line N1_share entrant0_share entrant1_share year, sort lwidth(thick thick thick)
>  `format' ytitle("Share of firms (%)") legend(order(1 "Expat CEO" 2 "New local C
> EO" 3 "New expat CEO")) xsize(16) ysize(10) aspect(.67)

. graph export output/figure/shares_over_time.png, width(1600) replace
(file output/figure/shares_over_time.png written in PNG format)

. 
. log close
      name:  <unnamed>
       log:  /Users/koren/Google Drive/Research/expat/research_design/talk/output/
> descriptives.log
  log type:  text
 closed on:  12 Jan 2019, 13:15:55
----------------------------------------------------------------------------------
