--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_weightsdo.log
  log type:  text
 opened on:  20 Jul 2021, 16:26:17

. 
. use "/`here'/external/pscore_docontrol.dta", clear

. drop treat_match year_match

. *mvencode weight_match, mv(0)
. reshape wide weight_match, i(frame_id_numeric) j(year)
(note: j = 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                     3409   ->     690
Number of variables                   3   ->      26
j variable (25 values)             year   ->   (dropped)
xij variables:
                           weight_match   ->   weight_match1989 weight_match1990 ... weight_match2013
-----------------------------------------------------------------------------

. *mvencode weight_match*, mv(0)
. duplicates report frame_id_numeric

Duplicates in terms of frame_id_numeric

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |          690             0
--------------------------------------

. tempfile weights

. save `weights'
file /srv/sandbox/zavecz/St1873248.000001 saved

. 
. use "`here'/temp/analysis_sample.dta", clear

. 
. rename ever_foreign ef

. rename ever_foreign_hire efh

. rename has_expat_ceo has_expat

. 
. count
  11,501

. count if ef & time_foreign <= 5
  11,501

. 
. merge m:1 frame_id_numeric using `weights', keep (1 3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                         5,845
        from master                     5,845  
        from using                          0  

    matched                             5,656  
    -----------------------------------------

. 
. drop if year > 2013
(611 observations deleted)

. 
. *duplicates tag frame_id_numeric weight_match1989, gen(dup)
. *replace dup = 1 if dup >=1 & dup != .
. *tab dup, miss
. 
. mvencode weight_match*, mv(0)
weight_~1989: 10664 missing values recoded
weight_~1990: 10020 missing values recoded
weight_~1991: 9474 missing values recoded
weight_~1992: 8948 missing values recoded
weight_~1993: 8754 missing values recoded
weight_~1994: 8558 missing values recoded
weight_~1995: 8589 missing values recoded
weight_~1996: 8671 missing values recoded
weight_~1997: 8508 missing values recoded
weight_~1998: 8616 missing values recoded
weight_~1999: 8710 missing values recoded
weight_~2000: 8770 missing values recoded
weight_~2001: 8832 missing values recoded
weight_~2002: 9059 missing values recoded
weight_~2003: 9344 missing values recoded
weight_~2004: 9539 missing values recoded
weight_~2005: 9778 missing values recoded
weight_~2006: 9908 missing values recoded
weight_~2007: 10054 missing values recoded
weight_~2008: 10168 missing values recoded
weight_~2009: 10376 missing values recoded
weight_~2010: 10473 missing values recoded
weight_~2011: 10515 missing values recoded
weight_~2012: 10678 missing values recoded
weight_~2013: 10834 missing values recoded

. 
. foreach var in foreign_only foreign_hire_only has_expat {
  2.                 attgt lnQL lnK lnL exporter lnQ, treatment(`var') aggregate(e) pre(5) post(5) reps(20) notyet limitcontrol(foreign == 0) weightprefix(wei
> ght_match)
  3.                 count if e(sample) == 1
  4.                 eststo m`var', title("`var'")
  5. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m5
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating lnQL: event_5
Estimating lnK: event_m5
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnK: event_5
Estimating lnL: event_m5
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating lnL: event_5
Estimating exporter: event_m5
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating exporter: event_5
Estimating lnQ: event_m5
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQ: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,674

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m5 |  -.0803593   .1193006    -0.67   0.501    -.3141841    .1534656
    event_m4 |   -.197007   .0916418    -2.15   0.032    -.3766217   -.0173922
    event_m3 |  -.0959595   .1045118    -0.92   0.359    -.3007989    .1088799
    event_m2 |  -.2981807   .1062661    -2.81   0.005    -.5064584   -.0899031
    event_m1 |  -.0518681   .0660534    -0.79   0.432    -.1813305    .0775943
     event_1 |   .0192556   .0595394     0.32   0.746    -.0974394    .1359506
     event_2 |  -.0390281   .0862474    -0.45   0.651    -.2080698    .1300136
     event_3 |  -.1493565   .1241915    -1.20   0.229    -.3927673    .0940544
     event_4 |  -.1377777   .1465248    -0.94   0.347     -.424961    .1494055
     event_5 |   -.079945    .143801    -0.56   0.578    -.3617898    .2018997
-------------+----------------------------------------------------------------
lnK          |
    event_m5 |  -.0179575   .2192891    -0.08   0.935    -.4477562    .4118412
    event_m4 |  -.1204011   .2054704    -0.59   0.558    -.5231156    .2823134
    event_m3 |  -.0040493   .1188729    -0.03   0.973    -.2370359    .2289373
    event_m2 |  -.0910015    .116119    -0.78   0.433    -.3185905    .1365875
    event_m1 |  -.0388928   .0535669    -0.73   0.468     -.143882    .0660965
     event_1 |   .0158599   .0726602     0.22   0.827    -.1265514    .1582712
     event_2 |    .003649   .0944958     0.04   0.969    -.1815594    .1888574
     event_3 |   .1306862   .1074068     1.22   0.224    -.0798274    .3411997
     event_4 |   .1247519   .1231896     1.01   0.311    -.1166952    .3661991
     event_5 |  -.0029498   .1345212    -0.02   0.983    -.2666066     .260707
-------------+----------------------------------------------------------------
lnL          |
    event_m5 |  -.0118839   .0982497    -0.12   0.904    -.2044498     .180682
    event_m4 |   .0436861    .086623     0.50   0.614    -.1260919    .2134641
    event_m3 |  -.0014905   .0949606    -0.02   0.987      -.18761    .1846289
    event_m2 |   .0139316    .070838     0.20   0.844    -.1249083    .1527714
    event_m1 |  -.0412287   .0354443    -1.16   0.245    -.1106982    .0282408
     event_1 |  -.0386918   .0581822    -0.67   0.506    -.1527269    .0753433
     event_2 |    .082473   .0614362     1.34   0.179    -.0379396    .2028857
     event_3 |   .1273987   .0925135     1.38   0.168    -.0539245    .3087218
     event_4 |   .2127584   .1250756     1.70   0.089    -.0323852     .457902
     event_5 |   .1164106   .1479023     0.79   0.431    -.1734726    .4062939
-------------+----------------------------------------------------------------
exporter     |
    event_m5 |  -.0415874   .0431536    -0.96   0.335     -.126167    .0429922
    event_m4 |  -.0470691   .0322458    -1.46   0.144    -.1102697    .0161315
    event_m3 |  -.0454559   .0325356    -1.40   0.162    -.1092245    .0183127
    event_m2 |  -.0115669   .0346383    -0.33   0.738    -.0794568     .056323
    event_m1 |  -.0507542   .0233872    -2.17   0.030    -.0965923    -.004916
     event_1 |   .0353166   .0255365     1.38   0.167    -.0147341    .0853672
     event_2 |   .0195747   .0290358     0.67   0.500    -.0373344    .0764837
     event_3 |  -.0046093   .0341435    -0.13   0.893    -.0715293    .0623107
     event_4 |  -.0052398   .0407825    -0.13   0.898    -.0851719    .0746924
     event_5 |   .0439573   .0410871     1.07   0.285    -.0365719    .1244865
-------------+----------------------------------------------------------------
lnQ          |
    event_m5 |  -.0922433   .1501596    -0.61   0.539    -.3865506    .2020641
    event_m4 |  -.1533209   .1256963    -1.22   0.223    -.3996811    .0930393
    event_m3 |  -.0974501    .114598    -0.85   0.395     -.322058    .1271578
    event_m2 |  -.2842492   .1260018    -2.26   0.024    -.5312081   -.0372903
    event_m1 |  -.0930969   .0650577    -1.43   0.152    -.2206075    .0344138
     event_1 |  -.0194362   .0643558    -0.30   0.763    -.1455713    .1066989
     event_2 |   .0434449   .0916296     0.47   0.635    -.1361458    .2230356
     event_3 |  -.0219578   .1033973    -0.21   0.832    -.2246129    .1806972
     event_4 |   .0749806   .1069018     0.70   0.483    -.1345431    .2845042
     event_5 |   .0364656   .1469681     0.25   0.804    -.2515866    .3245177
------------------------------------------------------------------------------
  5,674
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m5
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating lnQL: event_5
Estimating lnK: event_m5
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnK: event_5
Estimating lnL: event_m5
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating lnL: event_5
Estimating exporter: event_m5
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating exporter: event_5
Estimating lnQ: event_m5
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQ: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,473

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m5 |  -.0301146   .1341434    -0.22   0.822    -.2930307    .2328016
    event_m4 |   -.041743   .1093057    -0.38   0.703    -.2559783    .1724922
    event_m3 |  -.0364857   .0964253    -0.38   0.705    -.2254759    .1525045
    event_m2 |  -.2191015   .0732516    -2.99   0.003    -.3626721   -.0755309
    event_m1 |  -.2047868   .0816906    -2.51   0.012    -.3648974   -.0446762
     event_1 |  -.0783321    .105881    -0.74   0.459     -.285855    .1291908
     event_2 |  -.0227223   .1125012    -0.20   0.840    -.2432206    .1977761
     event_3 |  -.0849597   .1245103    -0.68   0.495    -.3289954    .1590761
     event_4 |  -.0842789   .1300189    -0.65   0.517    -.3391113    .1705534
     event_5 |  -.1439528   .1612533    -0.89   0.372    -.4600035    .1720979
-------------+----------------------------------------------------------------
lnK          |
    event_m5 |   .2399652    .171497     1.40   0.162    -.0961628    .5760933
    event_m4 |   .1007377   .1683169     0.60   0.550    -.2291574    .4306328
    event_m3 |   .1773063   .1366795     1.30   0.195    -.0905806    .4451931
    event_m2 |   .1592397   .0940059     1.69   0.090    -.0250084    .3434878
    event_m1 |    .010254    .086186     0.12   0.905    -.1586675    .1791755
     event_1 |   .0912157   .0767925     1.19   0.235    -.0592948    .2417263
     event_2 |   .0142056    .069908     0.20   0.839    -.1228115    .1512228
     event_3 |   .0385491   .1351258     0.29   0.775    -.2262927    .3033908
     event_4 |  -.1630585   .1504949    -1.08   0.279    -.4580232    .1319062
     event_5 |  -.3244999   .1990173    -1.63   0.103    -.7145665    .0655668
-------------+----------------------------------------------------------------
lnL          |
    event_m5 |   .1217125   .1335197     0.91   0.362    -.1399812    .3834062
    event_m4 |   .0734396   .1082191     0.68   0.497    -.1386661    .2855452
    event_m3 |   .1681462    .077757     2.16   0.031     .0157453     .320547
    event_m2 |    .177295   .0822758     2.15   0.031     .0160374    .3385525
    event_m1 |   .0274779   .0627199     0.44   0.661    -.0954508    .1504066
     event_1 |   .2020606   .0817475     2.47   0.013     .0418384    .3622828
     event_2 |   .1837204    .104864     1.75   0.080    -.0218092      .38925
     event_3 |   .2274424   .1208913     1.88   0.060    -.0095001    .4643849
     event_4 |   .1042218   .1338032     0.78   0.436    -.1580276    .3664712
     event_5 |  -.0007307   .1253423    -0.01   0.995     -.246397    .2449357
-------------+----------------------------------------------------------------
exporter     |
    event_m5 |  -.0446162   .0577101    -0.77   0.439    -.1577259    .0684936
    event_m4 |  -.0381611   .0427898    -0.89   0.372    -.1220276    .0457055
    event_m3 |  -.0494364   .0306737    -1.61   0.107    -.1095558     .010683
    event_m2 |  -.0301299   .0364391    -0.83   0.408    -.1015493    .0412895
    event_m1 |  -.0538889   .0398905    -1.35   0.177    -.1320728     .024295
     event_1 |   .0509374   .0259703     1.96   0.050     .0000366    .1018382
     event_2 |   .0133472   .0367491     0.36   0.716    -.0586796    .0853741
     event_3 |    .046667   .0410745     1.14   0.256    -.0338375    .1271716
     event_4 |  -.0146427   .0483834    -0.30   0.762    -.1094725    .0801871
     event_5 |   .0241627   .0439302     0.55   0.582    -.0619389    .1102642
-------------+----------------------------------------------------------------
lnQ          |
    event_m5 |   .0915979   .1724298     0.53   0.595    -.2463583     .429554
    event_m4 |   .0316965   .1176744     0.27   0.788    -.1989411    .2623341
    event_m3 |   .1316605   .0937369     1.40   0.160    -.0520604    .3153814
    event_m2 |  -.0418065   .0970233    -0.43   0.667    -.2319687    .1483556
    event_m1 |  -.1773089   .1081158    -1.64   0.101     -.389212    .0345941
     event_1 |   .1237285   .1093178     1.13   0.258    -.0905304    .3379874
     event_2 |   .1609982   .1316194     1.22   0.221    -.0969711    .4189675
     event_3 |   .1424828   .1318913     1.08   0.280    -.1160194    .4009849
     event_4 |   .0199429   .1342706     0.15   0.882    -.2432227    .2831085
     event_5 |  -.1446834   .1753707    -0.83   0.409    -.4884036    .1990368
------------------------------------------------------------------------------
  4,473
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m5
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating lnQL: event_5
Estimating lnK: event_m5
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnK: event_5
Estimating lnL: event_m5
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating lnL: event_5
Estimating exporter: event_m5
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating exporter: event_5
Estimating lnQ: event_m5
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQ: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,905

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m5 |   .3070783   .1311478     2.34   0.019     .0500332    .5641233
    event_m4 |   .2569221   .1100568     2.33   0.020     .0412146    .4726295
    event_m3 |   .1578322   .0991009     1.59   0.111    -.0364019    .3520663
    event_m2 |   .1431287   .0673678     2.12   0.034     .0110902    .2751671
    event_m1 |    -.00595   .0706462    -0.08   0.933    -.1444141    .1325141
     event_1 |   .1016031   .0822899     1.23   0.217    -.0596821    .2628883
     event_2 |   .2252585   .0909159     2.48   0.013     .0470666    .4034503
     event_3 |   .2873656   .0902787     3.18   0.001     .1104225    .4643087
     event_4 |   .2762865   .1151268     2.40   0.016     .0506422    .5019308
     event_5 |   .2413015   .1023056     2.36   0.018     .0407862    .4418168
-------------+----------------------------------------------------------------
lnK          |
    event_m5 |   .5122865   .1740785     2.94   0.003     .1710989     .853474
    event_m4 |   .4538569   .1554519     2.92   0.004     .1491769    .7585369
    event_m3 |   .1724292   .1213469     1.42   0.155    -.0654062    .4102647
    event_m2 |   .1935809   .0906819     2.13   0.033     .0158476    .3713143
    event_m1 |   .0992423   .0817181     1.21   0.225    -.0609223    .2594069
     event_1 |    .114445   .0835596     1.37   0.171    -.0493288    .2782189
     event_2 |   .2082663   .1135828     1.83   0.067    -.0143519    .4308846
     event_3 |   .2635678   .1320327     2.00   0.046     .0047885    .5223471
     event_4 |   .2514795   .1421099     1.77   0.077    -.0270508    .5300098
     event_5 |    .221455   .1723056     1.29   0.199    -.1162577    .5591678
-------------+----------------------------------------------------------------
lnL          |
    event_m5 |    .283684   .1364294     2.08   0.038     .0162873    .5510806
    event_m4 |    .210434   .1105628     1.90   0.057    -.0062652    .4271331
    event_m3 |   .0904685   .0776326     1.17   0.244    -.0616885    .2426256
    event_m2 |   .0368364   .0704606     0.52   0.601    -.1012639    .1749367
    event_m1 |   .0062656   .0497066     0.13   0.900    -.0911575    .1036887
     event_1 |   .0794146   .0560451     1.42   0.156    -.0304318     .189261
     event_2 |   .1265262   .0713603     1.77   0.076    -.0133374    .2663898
     event_3 |   .1410603   .0859006     1.64   0.101    -.0273018    .3094225
     event_4 |   .2163922   .1077639     2.01   0.045     .0051788    .4276056
     event_5 |   .1601196   .1158084     1.38   0.167    -.0668606    .3870998
-------------+----------------------------------------------------------------
exporter     |
    event_m5 |   .0555645   .0452475     1.23   0.219    -.0331189    .1442479
    event_m4 |  -.0234182   .0347195    -0.67   0.500    -.0914673    .0446308
    event_m3 |   .0251818   .0253063     1.00   0.320    -.0244176    .0747812
    event_m2 |  -.0189964   .0233909    -0.81   0.417    -.0648418    .0268489
    event_m1 |  -.0220228   .0262046    -0.84   0.401    -.0733828    .0293372
     event_1 |   .0543295   .0345993     1.57   0.116    -.0134838    .1221429
     event_2 |   .0588849   .0381754     1.54   0.123    -.0159375    .1337074
     event_3 |   .0718223   .0471104     1.52   0.127    -.0205124     .164157
     event_4 |   .1005008   .0445737     2.25   0.024      .013138    .1878636
     event_5 |   .0820334   .0613249     1.34   0.181    -.0381612    .2022279
-------------+----------------------------------------------------------------
lnQ          |
    event_m5 |   .5907623   .1268709     4.66   0.000     .3420999    .8394247
    event_m4 |   .4673561   .1320025     3.54   0.000      .208636    .7260762
    event_m3 |   .2483008   .0999855     2.48   0.013     .0523329    .4442687
    event_m2 |    .179965   .0844472     2.13   0.033     .0144516    .3454785
    event_m1 |   .0003156    .085467     0.00   0.997    -.1671966    .1678278
     event_1 |   .1810178   .0874757     2.07   0.039     .0095686     .352467
     event_2 |   .3517847    .105874     3.32   0.001     .1442756    .5592939
     event_3 |   .4284259   .1197336     3.58   0.000     .1937524    .6630995
     event_4 |   .4926787   .1301392     3.79   0.000     .2376105     .747747
     event_5 |   .4014212   .1494423     2.69   0.007     .1085196    .6943227
------------------------------------------------------------------------------
  4,905

. 
. foreach var in foreign_hire_only has_expat {
  2.                 attgt lnQL lnK lnL exporter lnQ if efh, treatment(`var') aggregate(e) pre(5) post(5) reps(20) notyet limitcontrol(foreign == 0) weightpre
> fix(weight_match)
  3.                 count if e(sample) == 1
  4.                 eststo mh`var', title("efh `var'")
  5. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m5
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating lnQL: event_5
Estimating lnK: event_m5
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnK: event_5
Estimating lnL: event_m5
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating lnL: event_5
Estimating exporter: event_m5
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating exporter: event_5
Estimating lnQ: event_m5
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQ: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,429

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m5 |  -.0287443   .1307565    -0.22   0.826    -.2850224    .2275338
    event_m4 |  -.0401617   .1395503    -0.29   0.774    -.3136753     .233352
    event_m3 |  -.0342235   .0998752    -0.34   0.732    -.2299752    .1615283
    event_m2 |  -.2179195   .1103066    -1.98   0.048    -.4341165   -.0017225
    event_m1 |   -.204172   .0851565    -2.40   0.017    -.3710757   -.0372683
     event_1 |  -.0796945   .0859587    -0.93   0.354    -.2481704    .0887815
     event_2 |  -.0260293   .0954049    -0.27   0.785    -.2130195    .1609609
     event_3 |  -.0901338   .1155339    -0.78   0.435    -.3165761    .1363084
     event_4 |  -.0903087   .1059898    -0.85   0.394    -.2980449    .1174275
     event_5 |  -.1507848   .1228849    -1.23   0.220    -.3916348    .0900653
-------------+----------------------------------------------------------------
lnK          |
    event_m5 |   .2344981   .1746067     1.34   0.179    -.1077248    .5767211
    event_m4 |   .0924461   .1637569     0.56   0.572    -.2285115    .4134037
    event_m3 |   .1696878   .1425958     1.19   0.234    -.1097948    .4491705
    event_m2 |    .154154   .0911334     1.69   0.091    -.0244641     .332772
    event_m1 |   .0078532   .0732613     0.11   0.915    -.1357363    .1514427
     event_1 |   .0932722   .1011454     0.92   0.356    -.1049691    .2915135
     event_2 |   .0174093   .1188113     0.15   0.884    -.2154566    .2502752
     event_3 |   .0433912   .1311964     0.33   0.741     -.213749    .3005315
     event_4 |  -.1568857   .1740614    -0.90   0.367    -.4980399    .1842684
     event_5 |  -.3221286   .2067241    -1.56   0.119    -.7273004    .0830433
-------------+----------------------------------------------------------------
lnL          |
    event_m5 |   .1215711   .2207477     0.55   0.582    -.3110865    .5542287
    event_m4 |   .0718598   .1703031     0.42   0.673    -.2619281    .4056476
    event_m3 |   .1664328   .1427748     1.17   0.244    -.1134007    .4462662
    event_m2 |   .1772091   .1088905     1.63   0.104    -.0362124    .3906305
    event_m1 |   .0273817    .049876     0.55   0.583    -.0703735    .1251369
     event_1 |      .2026   .0634932     3.19   0.001     .0781555    .3270445
     event_2 |   .1834956   .0917606     2.00   0.046     .0036482     .363343
     event_3 |    .226466   .1161099     1.95   0.051    -.0011053    .4540373
     event_4 |   .1037631   .1389961     0.75   0.455    -.1686643    .3761905
     event_5 |  -.0008618   .1336872    -0.01   0.995     -.262884    .2611604
-------------+----------------------------------------------------------------
exporter     |
    event_m5 |  -.0444328   .0732037    -0.61   0.544    -.1879094    .0990438
    event_m4 |  -.0379574   .0646237    -0.59   0.557    -.1646175    .0887028
    event_m3 |  -.0495009   .0493664    -1.00   0.316    -.1462572    .0472554
    event_m2 |  -.0299849   .0329337    -0.91   0.363    -.0945339     .034564
    event_m1 |  -.0538988   .0326219    -1.65   0.098    -.1178366    .0100389
     event_1 |   .0508429   .0194435     2.61   0.009     .0127343    .0889515
     event_2 |   .0131377   .0333504     0.39   0.694     -.052228    .0785034
     event_3 |   .0459473     .04278     1.07   0.283    -.0378999    .1297946
     event_4 |  -.0155254   .0402776    -0.39   0.700     -.094468    .0634171
     event_5 |   .0238259   .0572702     0.42   0.677    -.0884216    .1360735
-------------+----------------------------------------------------------------
lnQ          |
    event_m5 |   .0928267   .1593252     0.58   0.560     -.219445    .4050984
    event_m4 |   .0316981   .1184724     0.27   0.789    -.2005035    .2638997
    event_m3 |   .1322093     .10608     1.25   0.213    -.0757037    .3401223
    event_m2 |  -.0407104   .0711949    -0.57   0.567      -.18025    .0988291
    event_m1 |  -.1767903   .0643436    -2.75   0.006    -.3029015   -.0506791
     event_1 |   .1229055   .0988572     1.24   0.214     -.070851     .316662
     event_2 |   .1574663   .1205117     1.31   0.191    -.0787323    .3936648
     event_3 |   .1363322   .1445081     0.94   0.345    -.1468984    .4195629
     event_4 |   .0134544   .1693426     0.08   0.937    -.3184509    .3453597
     event_5 |  -.1516465   .1991028    -0.76   0.446    -.5418809    .2385878
------------------------------------------------------------------------------
  4,429
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m5
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating lnQL: event_5
Estimating lnK: event_m5
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnK: event_5
Estimating lnL: event_m5
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating lnL: event_5
Estimating exporter: event_m5
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating exporter: event_5
Estimating lnQ: event_m5
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQ: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,861

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m5 |   .3153894   .1078302     2.92   0.003     .1040461    .5267327
    event_m4 |   .2626542   .0969763     2.71   0.007     .0725842    .4527242
    event_m3 |   .1635576   .0924298     1.77   0.077    -.0176014    .3447167
    event_m2 |   .1460851   .0862374     1.69   0.090    -.0229371    .3151072
    event_m1 |  -.0045065   .0530778    -0.08   0.932     -.108537     .099524
     event_1 |   .0998628   .0962812     1.04   0.300    -.0888449    .2885704
     event_2 |   .2208076   .1123839     1.96   0.049     .0005392    .4410761
     event_3 |   .2820137   .1127333     2.50   0.012     .0610605     .502967
     event_4 |   .2705045   .1167778     2.32   0.021     .0416242    .4993847
     event_5 |   .2348549   .1302522     1.80   0.071    -.0204348    .4901446
-------------+----------------------------------------------------------------
lnK          |
    event_m5 |   .4918644    .180891     2.72   0.007     .1373245    .8464043
    event_m4 |   .4345163   .1534068     2.83   0.005     .1338446    .7351881
    event_m3 |   .1608316   .1571462     1.02   0.306    -.1471693    .4688325
    event_m2 |   .1887922   .1172571     1.61   0.107    -.0410274    .4186118
    event_m1 |   .0978351   .0817078     1.20   0.231    -.0623093    .2579795
     event_1 |   .1134763   .0786964     1.44   0.149    -.0407658    .2677185
     event_2 |   .2063705   .1244613     1.66   0.097    -.0375691    .4503101
     event_3 |   .2632313   .1504347     1.75   0.080    -.0316153    .5580779
     event_4 |   .2496561   .1713956     1.46   0.145    -.0862731    .5855853
     event_5 |   .2180394   .1764041     1.24   0.216    -.1277063    .5637851
-------------+----------------------------------------------------------------
lnL          |
    event_m5 |   .2863367   .1421107     2.01   0.044     .0078048    .5648686
    event_m4 |   .2121825   .1063216     2.00   0.046     .0037959     .420569
    event_m3 |   .0912033    .107486     0.85   0.396    -.1194654    .3018719
    event_m2 |   .0374891   .0674835     0.56   0.579    -.0947762    .1697544
    event_m1 |   .0059245    .032743     0.18   0.856    -.0582506    .0700996
     event_1 |   .0805171    .061799     1.30   0.193    -.0406067    .2016409
     event_2 |   .1268684   .1032933     1.23   0.219    -.0755827    .3293194
     event_3 |   .1410364   .1368202     1.03   0.303    -.1271262     .409199
     event_4 |   .2169844   .1543349     1.41   0.160    -.0855065    .5194753
     event_5 |   .1600563   .1536472     1.04   0.298    -.1410867    .4611994
-------------+----------------------------------------------------------------
exporter     |
    event_m5 |    .057154   .0584728     0.98   0.328    -.0574506    .1717586
    event_m4 |  -.0230218   .0485397    -0.47   0.635     -.118158    .0721143
    event_m3 |   .0255259   .0425634     0.60   0.549    -.0578968    .1089485
    event_m2 |  -.0185057   .0403965    -0.46   0.647    -.0976814    .0606701
    event_m1 |  -.0218568   .0234959    -0.93   0.352     -.067908    .0241944
     event_1 |   .0541979   .0245337     2.21   0.027     .0061127    .1022832
     event_2 |   .0586307   .0326998     1.79   0.073    -.0054598    .1227212
     event_3 |   .0713433   .0425415     1.68   0.094    -.0120366    .1547232
     event_4 |   .0999011   .0452154     2.21   0.027     .0112804    .1885217
     event_5 |   .0818679   .0471239     1.74   0.082    -.0104934    .1742291
-------------+----------------------------------------------------------------
lnQ          |
    event_m5 |   .6017261   .1760044     3.42   0.001     .2567638    .9466884
    event_m4 |   .4748367   .1463703     3.24   0.001     .1879561    .7617173
    event_m3 |   .2547609   .1366996     1.86   0.062    -.0131653    .5226872
    event_m2 |   .1835742   .1119623     1.64   0.101    -.0358679    .4030163
    event_m1 |    .001418   .0622746     0.02   0.982    -.1206379    .1234739
     event_1 |   .1803799   .1125558     1.60   0.109    -.0402254    .4009852
     event_2 |    .347676   .1569292     2.22   0.027     .0401004    .6552517
     event_3 |   .4230501   .1904161     2.22   0.026     .0498415    .7962588
     event_4 |   .4874889   .2012392     2.42   0.015     .0930674    .8819104
     event_5 |   .3949112   .2042776     1.93   0.053    -.0054654    .7952879
------------------------------------------------------------------------------
  4,861

. 
. esttab m* using "`here'/output/table_attgt_weightsdo.tex", mtitle b(3) se(3) replace
(note: file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_weightsdo.tex not found)
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_weightsdo.tex)

. esttab m* using "`here'/output/table_attgt_weightsdo.txt", mtitle b(3) se(3) replace
(note: file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_weightsdo.txt not found)
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_weightsdo.txt)

. 
. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_weightsdo.log
  log type:  text
 closed on:  20 Jul 2021, 16:28:46
--------------------------------------------------------------------------------------------------------------------------------------------------------------
