--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt.log
  log type:  text
 opened on:   7 Jul 2021, 21:56:51

. 
. use "`here'/temp/analysis_sample.dta", clear

. 
. replace foreign_hire = 1 if ever_foreign_hire == 1 & foreign == 1
(754 real changes made)

. replace has_expat_ceo = 1 if ever_expat == 1 & foreign == 1
(459 real changes made)

. 
. rename ever_foreign ef

. rename ever_foreign_hire efh

. rename has_expat_ceo has_expat

. 
. count
  16,663

. count if ef & time_foreign <= 5
  16,663

. 
. foreach var in foreign foreign_hire has_expat {
  2.                 attgt lnQL lnK lnL exporter lnQ, treatment(`var') aggregate(e) pre(5) post(5) reps(20) notyet
  3.                 count if e(sample) == 1
  4.                 eststo model_`var', title("`var'")
  5. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m5
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating lnQL: event_5
Estimating lnK: event_m5
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnK: event_5
Estimating lnL: event_m5
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating lnL: event_5
Estimating exporter: event_m5
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating exporter: event_5
Estimating lnQ: event_m5
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQ: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =     15,658

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m5 |   .0249255   .0499724     0.50   0.618    -.0730187    .1228696
    event_m4 |  -.0024088   .0452946    -0.05   0.958    -.0911845     .086367
    event_m3 |   .0010262   .0384761     0.03   0.979    -.0743857     .076438
    event_m2 |  -.0512761   .0319549    -1.60   0.109    -.1139065    .0113543
    event_m1 |  -.0272364   .0203155    -1.34   0.180    -.0670541    .0125813
     event_1 |   .0529145   .0255455     2.07   0.038     .0028463    .1029827
     event_2 |   .0926101   .0401537     2.31   0.021     .0139102    .1713099
     event_3 |    .116693   .0490765     2.38   0.017     .0205048    .2128812
     event_4 |   .0961642   .0484105     1.99   0.047     .0012813     .191047
     event_5 |   .1159856   .0484748     2.39   0.017     .0209768    .2109944
-------------+----------------------------------------------------------------
lnK          |
    event_m5 |   .2251865   .0612203     3.68   0.000      .105197     .345176
    event_m4 |   .1636423    .054843     2.98   0.003      .056152    .2711325
    event_m3 |   .0941783    .057015     1.65   0.099     -.017569    .2059256
    event_m2 |    .077164    .047063     1.64   0.101    -.0150778    .1694058
    event_m1 |   .0683722   .0316174     2.16   0.031     .0064033     .130341
     event_1 |  -.0220204   .0280975    -0.78   0.433    -.0770905    .0330498
     event_2 |  -.0474125   .0354732    -1.34   0.181    -.1169388    .0221138
     event_3 |  -.0318624   .0432637    -0.74   0.461    -.1166577     .052933
     event_4 |  -.1171392   .0799431    -1.47   0.143    -.2738249    .0395464
     event_5 |  -.1582284   .0864372    -1.83   0.067    -.3276421    .0111854
-------------+----------------------------------------------------------------
lnL          |
    event_m5 |   .1704571   .0521595     3.27   0.001     .0682263    .2726879
    event_m4 |   .1268876   .0485994     2.61   0.009     .0316345    .2221407
    event_m3 |   .1056755   .0380877     2.77   0.006      .031025    .1803261
    event_m2 |   .0802556    .024393     3.29   0.001     .0324463     .128065
    event_m1 |   .0263687      .0156     1.69   0.091    -.0042069    .0569442
     event_1 |   .0418461   .0201375     2.08   0.038     .0023773     .081315
     event_2 |   .0591103   .0302708     1.95   0.051    -.0002193    .1184399
     event_3 |   .0939927   .0391591     2.40   0.016     .0172422    .1707432
     event_4 |   .1199027   .0549383     2.18   0.029     .0122256    .2275798
     event_5 |   .0810291    .068926     1.18   0.240    -.0540634    .2161215
-------------+----------------------------------------------------------------
exporter     |
    event_m5 |   .0065329   .0155704     0.42   0.675    -.0239845    .0370503
    event_m4 |  -.0212942   .0167848    -1.27   0.205    -.0541918    .0116033
    event_m3 |   .0082952   .0167244     0.50   0.620    -.0244841    .0410745
    event_m2 |   .0034432   .0149232     0.23   0.818    -.0258058    .0326922
    event_m1 |  -.0166141   .0085524    -1.94   0.052    -.0333765    .0001484
     event_1 |   .0231704   .0086021     2.69   0.007     .0063105    .0400303
     event_2 |   .0190279   .0110384     1.72   0.085     -.002607    .0406628
     event_3 |   .0282746   .0171104     1.65   0.098    -.0052612    .0618104
     event_4 |   .0277561    .014207     1.95   0.051     -.000089    .0556012
     event_5 |   .0457302   .0171059     2.67   0.008     .0122032    .0792571
-------------+----------------------------------------------------------------
lnQ          |
    event_m5 |   .1953825   .0621548     3.14   0.002     .0735614    .3172037
    event_m4 |   .1244788   .0571645     2.18   0.029     .0124385    .2365191
    event_m3 |   .1067017   .0471572     2.26   0.024     .0142752    .1991281
    event_m2 |   .0289795   .0426584     0.68   0.497    -.0546294    .1125885
    event_m1 |  -.0008678   .0228766    -0.04   0.970    -.0457052    .0439696
     event_1 |   .0947607   .0257939     3.67   0.000     .0442055    .1453158
     event_2 |   .1517204    .039538     3.84   0.000     .0742273    .2292135
     event_3 |   .2106857    .054757     3.85   0.000      .103364    .3180074
     event_4 |   .2160668   .0777755     2.78   0.005     .0636296    .3685041
     event_5 |   .1970147   .0840898     2.34   0.019     .0322017    .3618276
------------------------------------------------------------------------------
  15,658
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m5
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating lnQL: event_5
Estimating lnK: event_m5
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnK: event_5
Estimating lnL: event_m5
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating lnL: event_5
Estimating exporter: event_m5
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating exporter: event_5
Estimating lnQ: event_m5
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQ: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =     15,888

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m5 |   .0321534   .0612985     0.52   0.600    -.0879894    .1522962
    event_m4 |   .0506358    .052477     0.96   0.335    -.0522172    .1534889
    event_m3 |   .0045297   .0427959     0.11   0.916    -.0793487    .0884081
    event_m2 |  -.0313065   .0350235    -0.89   0.371    -.0999513    .0373383
    event_m1 |  -.0557222   .0311614    -1.79   0.074    -.1167974    .0053531
     event_1 |   .0773101   .0357895     2.16   0.031      .007164    .1474563
     event_2 |   .1498066   .0525763     2.85   0.004      .046759    .2528542
     event_3 |   .1954548   .0537347     3.64   0.000     .0901366    .3007729
     event_4 |   .1835127   .0661635     2.77   0.006     .0538346    .3131907
     event_5 |   .1700068   .0686645     2.48   0.013     .0354269    .3045867
-------------+----------------------------------------------------------------
lnK          |
    event_m5 |   .2516117   .0966004     2.60   0.009     .0622784    .4409449
    event_m4 |   .1820867   .0768951     2.37   0.018      .031375    .3327984
    event_m3 |   .0682907   .0833971     0.82   0.413    -.0951645     .231746
    event_m2 |   .0974385   .0612278     1.59   0.112    -.0225658    .2174429
    event_m1 |    .053017   .0448132     1.18   0.237    -.0348153    .1408493
     event_1 |   .0392781   .0377372     1.04   0.298    -.0346856    .1132417
     event_2 |   .0341355    .050252     0.68   0.497    -.0643566    .1326277
     event_3 |   .0218224   .0579126     0.38   0.706    -.0916841     .135329
     event_4 |  -.0505761   .0691531    -0.73   0.465    -.1861137    .0849616
     event_5 |  -.0894653   .0825895    -1.08   0.279    -.2513379    .0724072
-------------+----------------------------------------------------------------
lnL          |
    event_m5 |   .2489941   .0741781     3.36   0.001     .1036077    .3943805
    event_m4 |   .1507419   .0618221     2.44   0.015     .0295728    .2719109
    event_m3 |   .1185221   .0511976     2.31   0.021     .0181767    .2188675
    event_m2 |   .1000614   .0341785     2.93   0.003     .0330727      .16705
    event_m1 |   .0295844   .0254867     1.16   0.246    -.0203688    .0795375
     event_1 |   .0858289   .0301739     2.84   0.004     .0266893    .1449686
     event_2 |   .0816048   .0387579     2.11   0.035     .0056407    .1575688
     event_3 |   .1186585   .0415924     2.85   0.004     .0371388    .2001782
     event_4 |   .1543735   .0537246     2.87   0.004     .0490752    .2596718
     event_5 |   .1100484   .0685659     1.61   0.108    -.0243383     .244435
-------------+----------------------------------------------------------------
exporter     |
    event_m5 |   .0157533   .0202976     0.78   0.438    -.0240292    .0555358
    event_m4 |  -.0299436   .0210828    -1.42   0.156    -.0712652     .011378
    event_m3 |  -.0060938   .0165679    -0.37   0.713    -.0385663    .0263786
    event_m2 |  -.0103724   .0162513    -0.64   0.523    -.0422244    .0214796
    event_m1 |  -.0152821   .0101901    -1.50   0.134    -.0352544    .0046901
     event_1 |   .0289473    .010273     2.82   0.005     .0088126    .0490819
     event_2 |    .023836    .011735     2.03   0.042     .0008358    .0468361
     event_3 |   .0376921   .0177645     2.12   0.034     .0028744    .0725099
     event_4 |    .045671   .0155892     2.93   0.003     .0151167    .0762253
     event_5 |   .0504706   .0165314     3.05   0.002     .0180697    .0828715
-------------+----------------------------------------------------------------
lnQ          |
    event_m5 |   .2811475   .0723552     3.89   0.000      .139334     .422961
    event_m4 |   .2013776   .0604762     3.33   0.001     .0828465    .3199087
    event_m3 |   .1230518    .051616     2.38   0.017     .0218864    .2242172
    event_m2 |   .0687548   .0430874     1.60   0.111    -.0156949    .1532045
    event_m1 |  -.0261378   .0331965    -0.79   0.431    -.0912017    .0389261
     event_1 |   .1631391   .0370298     4.41   0.000     .0905619    .2357162
     event_2 |   .2314114   .0504584     4.59   0.000     .1325148     .330308
     event_3 |   .3141133   .0594218     5.29   0.000     .1976488    .4305778
     event_4 |   .3378861   .0737104     4.58   0.000     .1934165    .4823558
     event_5 |   .2800552   .0781873     3.58   0.000     .1268109    .4332995
------------------------------------------------------------------------------
  15,888
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m5
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating lnQL: event_5
Estimating lnK: event_m5
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnK: event_5
Estimating lnL: event_m5
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating lnL: event_5
Estimating exporter: event_m5
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating exporter: event_5
Estimating lnQ: event_m5
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQ: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =     16,236

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m5 |   .1785585   .0883288     2.02   0.043     .0054372    .3516798
    event_m4 |   .1935984   .0575031     3.37   0.001     .0808945    .3063023
    event_m3 |   .0968774     .05707     1.70   0.090    -.0149777    .2087325
    event_m2 |   .0951843   .0497177     1.91   0.056    -.0022606    .1926292
    event_m1 |   .0132082   .0461241     0.29   0.775    -.0771933    .1036098
     event_1 |   .1737512   .0497469     3.49   0.000     .0762491    .2712533
     event_2 |   .3259989   .0850349     3.83   0.000     .1593334    .4926643
     event_3 |   .3649349   .0883723     4.13   0.000     .1917284    .5381413
     event_4 |   .3721193   .1051528     3.54   0.000     .1660236     .578215
     event_5 |   .3180513   .1033112     3.08   0.002      .115565    .5205375
-------------+----------------------------------------------------------------
lnK          |
    event_m5 |   .1820666    .174285     1.04   0.296    -.1595256    .5236589
    event_m4 |   .2106382   .1242396     1.70   0.090    -.0328669    .4541433
    event_m3 |   .0247418   .0970064     0.26   0.799    -.1653873    .2148708
    event_m2 |   .0515523   .0834811     0.62   0.537    -.1120676    .2151722
    event_m1 |   .0685377   .0642514     1.07   0.286    -.0573928    .1944681
     event_1 |   .1095917   .0529608     2.07   0.039     .0057904    .2133929
     event_2 |   .2433161   .0750089     3.24   0.001     .0963013    .3903308
     event_3 |   .2370833   .0857491     2.76   0.006     .0690181    .4051486
     event_4 |    .216308    .096361     2.24   0.025      .027444    .4051721
     event_5 |   .2381428   .1179865     2.02   0.044     .0068935    .4693921
-------------+----------------------------------------------------------------
lnL          |
    event_m5 |   .1296874   .0649328     2.00   0.046     .0024215    .2569534
    event_m4 |   .0922966   .0638808     1.44   0.149    -.0329075    .2175008
    event_m3 |   .0281581   .0555502     0.51   0.612    -.0807183    .1370345
    event_m2 |  -.0039522   .0496372    -0.08   0.937    -.1012394     .093335
    event_m1 |  -.0031938   .0324884    -0.10   0.922    -.0668698    .0604823
     event_1 |   .1066936   .0364205     2.93   0.003     .0353107    .1780766
     event_2 |   .1465627   .0344243     4.26   0.000     .0790923     .214033
     event_3 |   .1853679   .0469599     3.95   0.000     .0933282    .2774075
     event_4 |   .2416554   .0634101     3.81   0.000      .117374    .3659369
     event_5 |   .2235745   .0754811     2.96   0.003     .0756343    .3715147
-------------+----------------------------------------------------------------
exporter     |
    event_m5 |   .0437596   .0405148     1.08   0.280    -.0356479    .1231671
    event_m4 |  -.0300823   .0365976    -0.82   0.411    -.1018123    .0416477
    event_m3 |   .0114544   .0276321     0.41   0.678    -.0427036    .0656123
    event_m2 |   .0003916   .0202087     0.02   0.985    -.0392167    .0399998
    event_m1 |   .0014388    .020054     0.07   0.943    -.0378663    .0407438
     event_1 |   .0489052   .0194199     2.52   0.012      .010843    .0869675
     event_2 |   .0455965   .0273286     1.67   0.095    -.0079666    .0991596
     event_3 |    .072294   .0285554     2.53   0.011     .0163264    .1282615
     event_4 |   .0877523   .0322691     2.72   0.007     .0245059    .1509986
     event_5 |    .076999   .0245581     3.14   0.002      .028866     .125132
-------------+----------------------------------------------------------------
lnQ          |
    event_m5 |    .308246   .1148726     2.68   0.007     .0830998    .5333922
    event_m4 |    .285895   .0799191     3.58   0.000     .1292565    .4425334
    event_m3 |   .1250355   .0661075     1.89   0.059    -.0045328    .2546038
    event_m2 |    .091232   .0619655     1.47   0.141    -.0302182    .2126823
    event_m1 |   .0100145   .0482769     0.21   0.836    -.0846065    .1046355
     event_1 |   .2804449   .0615914     4.55   0.000     .1597279    .4011618
     event_2 |   .4725615   .0879875     5.37   0.000     .3001091     .645014
     event_3 |   .5503027    .097205     5.66   0.000     .3597844    .7408211
     event_4 |   .6137747   .1085334     5.66   0.000     .4010531    .8264964
     event_5 |   .5416258   .1124702     4.82   0.000     .3211883    .7620633
------------------------------------------------------------------------------
  16,236

. 
. esttab model* using "`here'/output/table_attgt.tex", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt.tex)

. esttab model* using "`here'/output/table_attgt.txt", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt.txt)

. 
. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt.log
  log type:  text
 closed on:   7 Jul 2021, 22:52:35
--------------------------------------------------------------------------------------------------------------------------------------------------------------
