--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_att5.log
  log type:  text
 opened on:  13 Jul 2021, 18:44:59

. 
. use "`here'/temp/analysis_sample.dta", clear

. 
. rename ever_foreign ef

. rename ever_foreign_hire efh

. rename has_expat_ceo has_expat

. 
. foreach var in foreign_only foreign_hire_only has_expat {
  2.         attgt lnQL lnK lnL exporter lnQ, treatment(`var') aggregate(att) pre(5) post(5) reps(20) notyet limitcontrol(foreign == 0)
  3.         count if e(sample) == 1
  4.         eststo m`var', title("`var'")
  5. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: att
Estimating lnK: att
Estimating lnL: att
Estimating exporter: att
Estimating lnQ: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,551

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
         att |   .0165484   .0616242     0.27   0.788    -.1042328    .1373296
-------------+----------------------------------------------------------------
lnK          |
         att |   .0505191    .081341     0.62   0.535    -.1089064    .2099445
-------------+----------------------------------------------------------------
lnL          |
         att |   .1061258   .0446854     2.37   0.018      .018544    .1937076
-------------+----------------------------------------------------------------
exporter     |
         att |   .0066088   .0170598     0.39   0.698    -.0268278    .0400453
-------------+----------------------------------------------------------------
lnQ          |
         att |   .1226742   .0731523     1.68   0.094    -.0207017    .2660502
------------------------------------------------------------------------------
  7,551
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: att
Estimating lnK: att
Estimating lnL: att
Estimating exporter: att
Estimating lnQ: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,293

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
         att |  -.0598702   .0635889    -0.94   0.346    -.1845022    .0647617
-------------+----------------------------------------------------------------
lnK          |
         att |  -.0365771   .1134218    -0.32   0.747    -.2588796    .1857255
-------------+----------------------------------------------------------------
lnL          |
         att |   .1875569   .0875602     2.14   0.032     .0159421    .3591717
-------------+----------------------------------------------------------------
exporter     |
         att |   .0166043   .0197059     0.84   0.399    -.0220185    .0552271
-------------+----------------------------------------------------------------
lnQ          |
         att |   .1276867   .1001137     1.28   0.202    -.0685326     .323906
------------------------------------------------------------------------------
  7,293
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: att
Estimating lnK: att
Estimating lnL: att
Estimating exporter: att
Estimating lnQ: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,987

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
         att |   .3133447   .0881678     3.55   0.000     .1405391    .4861504
-------------+----------------------------------------------------------------
lnK          |
         att |   .2281172   .0965313     2.36   0.018     .0389193    .4173152
-------------+----------------------------------------------------------------
lnL          |
         att |   .1869435   .0719918     2.60   0.009     .0458421    .3280449
-------------+----------------------------------------------------------------
exporter     |
         att |   .0617138   .0312705     1.97   0.048     .0004248    .1230028
-------------+----------------------------------------------------------------
lnQ          |
         att |   .5002883   .1408689     3.55   0.000     .2241904    .7763862
------------------------------------------------------------------------------
  7,987

. 
. foreach var in foreign_hire_only has_expat {
  2.                 attgt lnQL lnK lnL exporter lnQ if efh, treatment(`var') aggregate(att) pre(5) post(5) reps(20) notyet limitcontrol(foreign == 0)
  3.                 count if e(sample) == 1
  4.                 eststo mh`var', title("efh `var'")
  5. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: att
Estimating lnK: att
Estimating lnL: att
Estimating exporter: att
Estimating lnQ: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,906

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
         att |  -.0519911   .0596203    -0.87   0.383    -.1688447    .0648626
-------------+----------------------------------------------------------------
lnK          |
         att |  -.0032113   .1060808    -0.03   0.976    -.2111259    .2047033
-------------+----------------------------------------------------------------
lnL          |
         att |   .2157977   .0797193     2.71   0.007     .0595508    .3720446
-------------+----------------------------------------------------------------
exporter     |
         att |    .031092   .0213945     1.45   0.146    -.0108404    .0730245
-------------+----------------------------------------------------------------
lnQ          |
         att |   .1638067   .0858303     1.91   0.056    -.0044175    .3320309
------------------------------------------------------------------------------
  4,906
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: att
Estimating lnK: att
Estimating lnL: att
Estimating exporter: att
Estimating lnQ: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,600

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
         att |   .3096699   .0591736     5.23   0.000     .1936917     .425648
-------------+----------------------------------------------------------------
lnK          |
         att |   .2481838   .0626739     3.96   0.000     .1253453    .3710223
-------------+----------------------------------------------------------------
lnL          |
         att |   .2173145   .0651465     3.34   0.001     .0896297    .3449993
-------------+----------------------------------------------------------------
exporter     |
         att |    .072908   .0244436     2.98   0.003     .0249994    .1208167
-------------+----------------------------------------------------------------
lnQ          |
         att |   .5269844   .0945872     5.57   0.000     .3415969    .7123719
------------------------------------------------------------------------------
  5,600

. 
. esttab m* using "`here'/output/table_attgt_att5.tex", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_att5.tex)

. esttab m* using "`here'/output/table_attgt_att5.txt", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_att5.txt)

. 
. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_att5.log
  log type:  text
 closed on:  13 Jul 2021, 18:45:34
--------------------------------------------------------------------------------------------------------------------------------------------------------------
