--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_loop_2002.log
  log type:  text
 opened on:   8 Jul 2021, 17:53:42

. 
. use "`here'/temp/analysis_sample.dta"

. 
. rename ever_foreign ef

. rename ever_foreign_hire efh

. rename has_expat_ceo has_expat

. 
. gen lnIK = ln(immat_18)
(7,125 missing values generated)

. gen lnIK_0 = lnIK
(7,125 missing values generated)

. replace lnIK_0 = 0 if immat_18 == 0
(1,274 real changes made)

. 
. replace export_18 = 0 if export_18 == .
(2,465 real changes made)

. gen Qh = sales_18 - export_18

. gen lnQh = ln(Qh)
(121 missing values generated)

. gen lnQhr = lnQ - lnQh
(121 missing values generated)

. 
. foreach depvar in TFP_cd lnIK_0 lnQh lnQhr {
  2.         foreach var in foreign foreign_hire has_expat {
  3.                 attgt `depvar' if year >= 2002, treatment(`var') aggregate(e) pre(5) post(5) reps(20) notyet limitcontrol(foreign == 0)
  4.                 count if e(sample) == 1
  5.                 eststo model_`sample'`var'`depvar', title("`depvar' `sample' `var'")
  6.         }
  7. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: event_m5
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating TFP_cd: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,976

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .0034117   .0444677     0.08   0.939    -.0837434    .0905667
    event_m4 |   .0147359   .0313708     0.47   0.639    -.0467498    .0762216
    event_m3 |   .0318327   .0325383     0.98   0.328    -.0319412    .0956066
    event_m2 |  -.0076836   .0232685    -0.33   0.741    -.0532891    .0379219
    event_m1 |  -.0100392   .0186564    -0.54   0.591     -.046605    .0265267
     event_1 |   .0122597   .0241331     0.51   0.611    -.0350402    .0595597
     event_2 |   .0211991   .0228427     0.93   0.353    -.0235718      .06597
     event_3 |   .0214393   .0353733     0.61   0.544    -.0478912    .0907697
     event_4 |  -.0285151   .0398512    -0.72   0.474    -.1066219    .0495918
     event_5 |  -.0202674   .0489547    -0.41   0.679    -.1162168    .0756819
------------------------------------------------------------------------------
  5,976
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: event_m5
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating TFP_cd: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,258

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .0353571   .0362081     0.98   0.329    -.0356096    .1063238
    event_m4 |   .0301653   .0323304     0.93   0.351    -.0332012    .0935318
    event_m3 |   .0313779   .0339453     0.92   0.355    -.0351537    .0979095
    event_m2 |  -.0128523   .0296883    -0.43   0.665    -.0710402    .0453357
    event_m1 |   -.003356   .0208736    -0.16   0.872    -.0442675    .0375556
     event_1 |   .0319354   .0249636     1.28   0.201    -.0169924    .0808632
     event_2 |   .0536609   .0231456     2.32   0.020     .0082964    .0990254
     event_3 |   .0480059   .0425478     1.13   0.259    -.0353862    .1313981
     event_4 |   .0253539   .0456776     0.56   0.579    -.0641725    .1148803
     event_5 |  -.0115336   .0556444    -0.21   0.836    -.1205946    .0975275
------------------------------------------------------------------------------
  5,258
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: event_m5
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating TFP_cd: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,416

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .0920962    .061018     1.51   0.131    -.0274968    .2116893
    event_m4 |   .0835958   .0580779     1.44   0.150    -.0302349    .1974264
    event_m3 |    .073235   .0443699     1.65   0.099    -.0137284    .1601983
    event_m2 |   .0594575   .0384741     1.55   0.122    -.0159504    .1348653
    event_m1 |   .0520693   .0214526     2.43   0.015     .0100229    .0941157
     event_1 |   .0424563   .0396057     1.07   0.284    -.0351695    .1200821
     event_2 |   .0932739   .0420124     2.22   0.026     .0109312    .1756166
     event_3 |   .0799205   .0596591     1.34   0.180    -.0370092    .1968502
     event_4 |   .0849915   .0686595     1.24   0.216    -.0495786    .2195616
     event_5 |   .0436267   .1066115     0.41   0.682    -.1653281    .2525814
------------------------------------------------------------------------------
  4,416
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: event_m5
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnIK_0: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,187

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |  -.1732615   .4344453    -0.40   0.690    -1.024759    .6782357
    event_m4 |   -.187991   .3506708    -0.54   0.592    -.8752932    .4993112
    event_m3 |  -.1512145   .2561588    -0.59   0.555    -.6532766    .3508475
    event_m2 |  -.1158572   .1812406    -0.64   0.523    -.4710823    .2393678
    event_m1 |   .1309835   .0893682     1.47   0.143    -.0441749    .3061419
     event_1 |   .6644303   .1373452     4.84   0.000     .3952387    .9336219
     event_2 |   .6838957   .2336543     2.93   0.003     .2259417     1.14185
     event_3 |   .0963301   .3694977     0.26   0.794    -.6278722    .8205323
     event_4 |  -.0084021   .4726753    -0.02   0.986    -.9348287    .9180244
     event_5 |  -.2333696   .5318801    -0.44   0.661    -1.275835    .8090962
------------------------------------------------------------------------------
  5,187
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: event_m5
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnIK_0: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,606

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .0324886   .5601243     0.06   0.954    -1.065335    1.130312
    event_m4 |   .0849674   .4239553     0.20   0.841    -.7459697    .9159046
    event_m3 |  -.2366551   .2919676    -0.81   0.418     -.808901    .3355908
    event_m2 |  -.3476112   .2302695    -1.51   0.131    -.7989312    .1037088
    event_m1 |   .0985993   .1503616     0.66   0.512    -.1961041    .3933027
     event_1 |   .5217938   .1427309     3.66   0.000     .2420464    .8015412
     event_2 |   .6466081   .2023654     3.20   0.001     .2499792    1.043237
     event_3 |   .1210511   .3171572     0.38   0.703    -.5005656    .7426677
     event_4 |    .078398   .3946646     0.20   0.843    -.6951305    .8519264
     event_5 |   -.282514   .5190778    -0.54   0.586    -1.299888    .7348597
------------------------------------------------------------------------------
  4,606
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: event_m5
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnIK_0: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      3,858

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .0865943   .7721423     0.11   0.911    -1.426777    1.599965
    event_m4 |   .5839077   .7064314     0.83   0.408    -.8006724    1.968488
    event_m3 |  -.1367889   .4206118    -0.33   0.745    -.9611728     .687595
    event_m2 |   -.456958   .2985942    -1.53   0.126    -1.042192    .1282759
    event_m1 |   .0998243      .1791     0.56   0.577    -.2512053    .4508539
     event_1 |   .9048511   .3167358     2.86   0.004     .2840603    1.525642
     event_2 |    1.05433   .3737403     2.82   0.005     .3218122    1.786847
     event_3 |   .4411784   .3958594     1.11   0.265    -.3346917    1.217049
     event_4 |   .5179476   .5191245     1.00   0.318    -.4995177    1.535413
     event_5 |  -.0479152   .6043182    -0.08   0.937    -1.232357    1.136527
------------------------------------------------------------------------------
  3,858
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: event_m5
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnQh: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,971

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |    .200243   .1001786     2.00   0.046     .0038966    .3965895
    event_m4 |   .1444531   .0871922     1.66   0.098    -.0264405    .3153467
    event_m3 |   .1516845   .0852405     1.78   0.075    -.0153839    .3187529
    event_m2 |   .0731328   .0888569     0.82   0.410    -.1010235     .247289
    event_m1 |   .0338095   .0543314     0.62   0.534    -.0726781     .140297
     event_1 |   .1683153   .0678242     2.48   0.013     .0353823    .3012483
     event_2 |   .1145044   .0704452     1.63   0.104    -.0235656    .2525745
     event_3 |   .0098592   .0925997     0.11   0.915    -.1716329    .1913512
     event_4 |  -.1597294   .0941225    -1.70   0.090    -.3442061    .0247473
     event_5 |  -.1388482   .1506673    -0.92   0.357    -.4341507    .1564544
------------------------------------------------------------------------------
  5,971
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: event_m5
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnQh: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,247

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .2456162   .1086643     2.26   0.024     .0326381    .4585943
    event_m4 |    .185711   .1022905     1.82   0.069    -.0147746    .3861966
    event_m3 |   .1654175   .0781483     2.12   0.034     .0122496    .3185854
    event_m2 |   .1060813   .0901934     1.18   0.240    -.0706945     .282857
    event_m1 |   .0771847   .0654629     1.18   0.238    -.0511203    .2054897
     event_1 |   .2090707   .0847538     2.47   0.014     .0429564    .3751851
     event_2 |   .2413618   .0963923     2.50   0.012     .0524364    .4302873
     event_3 |   .0687575    .113924     0.60   0.546    -.1545294    .2920443
     event_4 |  -.0257269   .1222465    -0.21   0.833    -.2653256    .2138719
     event_5 |  -.2131284   .1873749    -1.14   0.255    -.5803766    .1541197
------------------------------------------------------------------------------
  5,247
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: event_m5
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnQh: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,404

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .4589224   .2276433     2.02   0.044     .0127497    .9050951
    event_m4 |   .5080072   .2404953     2.11   0.035      .036645    .9793694
    event_m3 |   .3249633   .1869911     1.74   0.082    -.0415325    .6914591
    event_m2 |   .2575268   .1874644     1.37   0.170    -.1098967    .6249503
    event_m1 |   .2513401   .1497303     1.68   0.093     -.042126    .5448061
     event_1 |   .3972957   .1643252     2.42   0.016     .0752243    .7193671
     event_2 |   .4134064   .1402101     2.95   0.003     .1385998    .6882131
     event_3 |   .1479443   .1322919     1.12   0.263    -.1113431    .4072317
     event_4 |   .0688562   .1656597     0.42   0.678     -.255831    .3935433
     event_5 |  -.0968396   .3283156    -0.29   0.768    -.7403264    .5466471
------------------------------------------------------------------------------
  4,404
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: event_m5
Estimating lnQhr: event_m4
Estimating lnQhr: event_m3
Estimating lnQhr: event_m2
Estimating lnQhr: event_m1
Estimating lnQhr: event_1
Estimating lnQhr: event_2
Estimating lnQhr: event_3
Estimating lnQhr: event_4
Estimating lnQhr: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,971

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |  -.0425516   .0897822    -0.47   0.636    -.2185215    .1334183
    event_m4 |  -.0152302   .0587953    -0.26   0.796    -.1304668    .1000064
    event_m3 |  -.0392182   .0507303    -0.77   0.439    -.1386478    .0602115
    event_m2 |  -.0196687   .0448455    -0.44   0.661    -.1075643    .0682269
    event_m1 |  -.0248971   .0367778    -0.68   0.498    -.0969803     .047186
     event_1 |   .0291968    .043253     0.68   0.500    -.0555775     .113971
     event_2 |   .0608028   .0420343     1.45   0.148     -.021583    .1431885
     event_3 |   .1173823   .0692704     1.69   0.090    -.0183852    .2531497
     event_4 |   .1158245   .0709161     1.63   0.102    -.0231684    .2548175
     event_5 |   .1682024   .0812752     2.07   0.038     .0089059    .3274989
------------------------------------------------------------------------------
  5,971
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: event_m5
Estimating lnQhr: event_m4
Estimating lnQhr: event_m3
Estimating lnQhr: event_m2
Estimating lnQhr: event_m1
Estimating lnQhr: event_1
Estimating lnQhr: event_2
Estimating lnQhr: event_3
Estimating lnQhr: event_4
Estimating lnQhr: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,247

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |  -.0836208   .1191431    -0.70   0.483    -.3171369    .1498953
    event_m4 |  -.0411704   .0959703    -0.43   0.668    -.2292688     .146928
    event_m3 |  -.0896626     .07506    -1.19   0.232    -.2367775    .0574524
    event_m2 |  -.0156718   .0598431    -0.26   0.793    -.1329621    .1016185
    event_m1 |  -.0432723   .0616968    -0.70   0.483    -.1641958    .0776513
     event_1 |   .0688651   .0614412     1.12   0.262    -.0515574    .1892876
     event_2 |   .0747102   .0499665     1.50   0.135    -.0232224    .1726427
     event_3 |   .1578141   .0898108     1.76   0.079    -.0182117      .33384
     event_4 |   .1791429   .0902396     1.99   0.047     .0022765    .3560093
     event_5 |   .2736628    .087489     3.13   0.002     .1021875    .4451381
------------------------------------------------------------------------------
  5,247
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: event_m5
Estimating lnQhr: event_m4
Estimating lnQhr: event_m3
Estimating lnQhr: event_m2
Estimating lnQhr: event_m1
Estimating lnQhr: event_1
Estimating lnQhr: event_2
Estimating lnQhr: event_3
Estimating lnQhr: event_4
Estimating lnQhr: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,404

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |  -.2105861   .2598909    -0.81   0.418    -.7199629    .2987907
    event_m4 |  -.1767656   .2262607    -0.78   0.435    -.6202285    .2666972
    event_m3 |  -.2301926   .1789855    -1.29   0.198    -.5809979    .1206126
    event_m2 |  -.0745997   .1351973    -0.55   0.581    -.3395815    .1903822
    event_m1 |  -.1269933   .1473735    -0.86   0.389      -.41584    .1618535
     event_1 |   .1296475   .1367316     0.95   0.343    -.1383414    .3976365
     event_2 |   .2060413     .08816     2.34   0.019     .0332509    .3788316
     event_3 |   .3080936   .1639171     1.88   0.060     -.013178    .6293653
     event_4 |   .3403032   .1749079     1.95   0.052      -.00251    .6831164
     event_5 |   .5729397   .1566263     3.66   0.000     .2659578    .8799216
------------------------------------------------------------------------------
  4,404

. 
. esttab model* using "`here'/output/table_attgt_loop_2002.tex", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_loop_2002.tex)

. esttab model* using "`here'/output/table_attgt_loop_2002.txt", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_loop_2002.txt)

. 
. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_loop_2002.log
  log type:  text
 closed on:   8 Jul 2021, 17:57:32
--------------------------------------------------------------------------------------------------------------------------------------------------------------
