--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_loop_att.log
  log type:  text
 opened on:  13 Jul 2021, 18:34:07

. 
. use "`here'/temp/analysis_sample.dta"

. 
. rename ever_foreign ef

. rename ever_foreign_hire efh

. rename has_expat_ceo has_expat

. 
. gen lnIK = ln(immat_18)
(5,130 missing values generated)

. gen lnIK_0 = lnIK
(5,130 missing values generated)

. replace lnIK_0 = 0 if immat_18 == 0
(857 real changes made)

. 
. replace export_18 = 0 if export_18 == .
(1,473 real changes made)

. gen Qh = sales_18 - export_18

. gen lnQh = ln(Qh)
(122 missing values generated)

. gen lnQhr = lnQ - lnQh
(122 missing values generated)

. 
. foreach depvar in TFP_cd lnIK_0 lnQh lnQhr {
  2.         foreach var in foreign_only foreign_hire_only has_expat {
  3.                 attgt `depvar', treatment(`var') aggregate(att) reps(20) notyet limitcontrol(foreign == 0)
  4.                 count if e(sample) == 1
  5.                 eststo m`var'`depvar', title("`depvar' `var'")
  6.         }
  7.         
.         foreach var in foreign_hire_only has_expat {
  8.                 attgt `depvar' if efh, treatment(`var') aggregate(att) reps(20) notyet limitcontrol(foreign == 0)
  9.                 count if e(sample) == 1
 10.                 eststo mh`var'`depvar', title("efh `depvar' `var'")
 11.         }
 12. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,646

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |  -.0146295   .0307337    -0.48   0.634    -.0748665    .0456075
------------------------------------------------------------------------------
  7,646
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,386

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .0023127   .0411557     0.06   0.955     -.078351    .0829764
------------------------------------------------------------------------------
  7,386
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      8,214

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .1120884   .0358078     3.13   0.002     .0419065    .1822703
------------------------------------------------------------------------------
  8,214
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,024

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .0122225   .0356005     0.34   0.731    -.0575532    .0819981
------------------------------------------------------------------------------
  5,024
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,847

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .1219092   .0395365     3.08   0.002     .0444191    .1993993
------------------------------------------------------------------------------
  5,847
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,142

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .1843154   .2955245     0.62   0.533    -.3949019    .7635328
------------------------------------------------------------------------------
  4,142
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,046

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |  -.0818178   .3342126    -0.24   0.807    -.7368624    .5732269
------------------------------------------------------------------------------
  4,046
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,301

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .7878877   .3342863     2.36   0.018     .1326985    1.443077
------------------------------------------------------------------------------
  4,301
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      2,695

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |    .033364   .2562614     0.13   0.896    -.4688991    .5356271
------------------------------------------------------------------------------
  2,695
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      2,946

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .8735574   .3303305     2.64   0.008     .2261215    1.520993
------------------------------------------------------------------------------
  2,946
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,626

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .2402234   .1027746     2.34   0.019     .0387888    .4416579
------------------------------------------------------------------------------
  7,626
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,369

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .0854888   .1204577     0.71   0.478    -.1506041    .3215816
------------------------------------------------------------------------------
  7,369
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      8,148

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .4201869   .1951876     2.15   0.031     .0376263    .8027476
------------------------------------------------------------------------------
  8,148
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,993

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .1292244   .1196268     1.08   0.280    -.1052399    .3636888
------------------------------------------------------------------------------
  4,993
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,767

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .4454405   .1253918     3.55   0.000      .199677     .691204
------------------------------------------------------------------------------
  5,767
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,626

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .0319554   .0458586     0.70   0.486    -.0579258    .1218366
------------------------------------------------------------------------------
  7,626
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,369

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .0441706   .0576383     0.77   0.443    -.0687983    .1571395
------------------------------------------------------------------------------
  7,369
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      8,148

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .3372446   .0487304     6.92   0.000     .2417348    .4327545
------------------------------------------------------------------------------
  8,148
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,993

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .0402182   .0574832     0.70   0.484    -.0724469    .1528832
------------------------------------------------------------------------------
  4,993
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,767

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .3481324    .060614     5.74   0.000     .2293312    .4669335
------------------------------------------------------------------------------
  5,767

. 
. esttab m* using "`here'/output/table_attgt_loop_att.tex", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_loop_att.tex)

. esttab m* using "`here'/output/table_attgt_loop_att.txt", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_loop_att.txt)

. 
. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_loop_att.log
  log type:  text
 closed on:  13 Jul 2021, 18:39:40
--------------------------------------------------------------------------------------------------------------------------------------------------------------
