--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_loop.log
  log type:  text
 opened on:  13 Jul 2021, 14:49:33

. 
. use "`here'/temp/analysis_sample.dta"

. 
. rename ever_foreign ef

. rename ever_foreign_hire efh

. rename has_expat_ceo has_expat

. 
. gen lnIK = ln(immat_18)
(5,130 missing values generated)

. gen lnIK_0 = lnIK
(5,130 missing values generated)

. replace lnIK_0 = 0 if immat_18 == 0
(857 real changes made)

. 
. replace export_18 = 0 if export_18 == .
(1,473 real changes made)

. gen Qh = sales_18 - export_18

. gen lnQh = ln(Qh)
(122 missing values generated)

. gen lnQhr = lnQ - lnQh
(122 missing values generated)

. 
. foreach depvar in TFP_cd lnIK_0 lnQh lnQhr {
  2.         foreach var in foreign foreign_hire has_expat {
  3.                 attgt `depvar', treatment(`var') aggregate(e) pre(5) post(5) reps(20) notyet limitcontrol(foreign == 0)
  4.                 count if e(sample) == 1
  5.                 eststo model_`sample'`var'`depvar', title("`depvar' `sample' `var'")
  6.         }
  7. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: event_m5
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating TFP_cd: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =     10,523

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .0932433   .0245825     3.79   0.000     .0450624    .1414242
    event_m4 |   .0749139   .0230678     3.25   0.001      .029702    .1201259
    event_m3 |   .0491912   .0257373     1.91   0.056    -.0012529    .0996353
    event_m2 |  -.0367886   .0274673    -1.34   0.180    -.0906235    .0170462
    event_m1 |  -.0056964   .0225264    -0.25   0.800    -.0498474    .0384545
     event_1 |   .0410496   .0199157     2.06   0.039     .0020155    .0800838
     event_2 |   .0516801   .0223765     2.31   0.021     .0078229    .0955373
     event_3 |   .0493539   .0246818     2.00   0.046     .0009785    .0977293
     event_4 |   .0361447   .0311605     1.16   0.246    -.0249288    .0972182
     event_5 |   .0262769   .0310713     0.85   0.398    -.0346216    .0871755
------------------------------------------------------------------------------
  10,523
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: event_m5
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating TFP_cd: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      9,231

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .0965324   .0284607     3.39   0.001     .0407505    .1523143
    event_m4 |   .1068297   .0318784     3.35   0.001     .0443492    .1693102
    event_m3 |   .0655206   .0265758     2.47   0.014      .013433    .1176082
    event_m2 |   .0061408   .0205228     0.30   0.765    -.0340831    .0463646
    event_m1 |  -.0289209   .0260628    -1.11   0.267    -.0800031    .0221614
     event_1 |   .0584655   .0259012     2.26   0.024     .0077001    .1092309
     event_2 |   .0691777    .029503     2.34   0.019     .0113529    .1270025
     event_3 |   .0915237   .0357504     2.56   0.010     .0214542    .1615931
     event_4 |   .0819549   .0379245     2.16   0.031     .0076243    .1562855
     event_5 |   .0606082   .0382855     1.58   0.113    -.0144299    .1356464
------------------------------------------------------------------------------
  9,231
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: event_m5
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating TFP_cd: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      8,146

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .0775034   .0404282     1.92   0.055    -.0017344    .1567413
    event_m4 |   .0949491   .0362915     2.62   0.009     .0238189    .1660792
    event_m3 |   .0685146   .0334577     2.05   0.041     .0029386    .1340905
    event_m2 |   .0460272   .0282515     1.63   0.103    -.0093446     .101399
    event_m1 |   .0034737   .0375775     0.09   0.926    -.0701769    .0771242
     event_1 |   .0858844    .031234     2.75   0.006     .0246669    .1471019
     event_2 |   .1046585   .0376146     2.78   0.005     .0309353    .1783817
     event_3 |   .1295684   .0451787     2.87   0.004     .0410198     .218117
     event_4 |   .1401963   .0444021     3.16   0.002     .0531697    .2272229
     event_5 |   .1195057   .0418886     2.85   0.004     .0374055    .2016059
------------------------------------------------------------------------------
  8,146
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: event_m5
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnIK_0: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,721

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .1351342   .2952818     0.46   0.647    -.4436074    .7138759
    event_m4 |   .0477269   .1663923     0.29   0.774    -.2783961    .3738499
    event_m3 |  -.0135745   .1931878    -0.07   0.944    -.3922155    .3650665
    event_m2 |  -.0130968    .139568    -0.09   0.925    -.2866449    .2604514
    event_m1 |   .0424795   .1183047     0.36   0.720    -.1893934    .2743524
     event_1 |   .6837425   .1287292     5.31   0.000     .4314379    .9360471
     event_2 |   .7116983    .194381     3.66   0.000     .3307186    1.092678
     event_3 |   .1000037   .2985528     0.33   0.738     -.485149    .6851565
     event_4 |   .1486801   .3453555     0.43   0.667    -.5282043    .8255645
     event_5 |   .0750088   .5219221     0.14   0.886    -.9479397    1.097957
------------------------------------------------------------------------------
  5,721
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: event_m5
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnIK_0: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,116

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .4568977   .3431725     1.33   0.183     -.215708    1.129503
    event_m4 |   .6068546   .2200846     2.76   0.006     .1754966    1.038213
    event_m3 |   .3067189   .2573125     1.19   0.233    -.1976043     .811042
    event_m2 |  -.0628129   .1988143    -0.32   0.752    -.4524818    .3268561
    event_m1 |   .0350933   .1475576     0.24   0.812    -.2541144     .324301
     event_1 |   .7415439   .1382538     5.36   0.000     .4705713    1.012516
     event_2 |   .8395479   .2080695     4.03   0.000     .4317391    1.247357
     event_3 |    .154413   .3154015     0.49   0.624    -.4637627    .7725886
     event_4 |     .18483   .3415387     0.54   0.588    -.4845734    .8542335
     event_5 |   .1192985   .4907875     0.24   0.808    -.8426274    1.081224
------------------------------------------------------------------------------
  5,116
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: event_m5
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnIK_0: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,543

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .2209841   .3892179     0.57   0.570    -.5418689    .9838371
    event_m4 |   .7560047   .3270038     2.31   0.021     .1150889     1.39692
    event_m3 |    .326935   .3361411     0.97   0.331    -.3318893    .9857594
    event_m2 |  -.0848628   .3095822    -0.27   0.784    -.6916328    .5219071
    event_m1 |  -.0701524   .2278038    -0.31   0.758    -.5166397    .3763349
     event_1 |   .9177961   .2284933     4.02   0.000     .4699574    1.365635
     event_2 |   1.078608   .2358878     4.57   0.000     .6162766     1.54094
     event_3 |   .6613756    .374604     1.77   0.077    -.0728346    1.395586
     event_4 |   .8525964   .4205339     2.03   0.043     .0283651    1.676828
     event_5 |   .4325483   .5866263     0.74   0.461    -.7172182    1.582315
------------------------------------------------------------------------------
  4,543
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: event_m5
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnQh: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =     10,468

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .2565778   .1085744     2.36   0.018     .0437758    .4693798
    event_m4 |   .1289531   .0662152     1.95   0.051    -.0008262    .2587324
    event_m3 |    .161921   .0494089     3.28   0.001     .0650813    .2587608
    event_m2 |   .0297556   .0717681     0.41   0.678    -.1109073    .1704184
    event_m1 |   .0890133   .0655887     1.36   0.175    -.0395382    .2175648
     event_1 |   .2852314   .0618941     4.61   0.000     .1639212    .4065417
     event_2 |   .3008986   .0899093     3.35   0.001     .1246796    .4771177
     event_3 |   .1970153   .1333154     1.48   0.139    -.0642781    .4583086
     event_4 |   .2455348   .1532017     1.60   0.109     -.054735    .5458046
     event_5 |   .3103198   .1600709     1.94   0.053    -.0034133     .624053
------------------------------------------------------------------------------
  10,468
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: event_m5
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnQh: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      9,176

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .3700747   .1443221     2.56   0.010     .0872085     .652941
    event_m4 |   .2588784   .0947109     2.73   0.006     .0732486    .4445083
    event_m3 |   .2576006   .0644859     3.99   0.000     .1312106    .3839906
    event_m2 |   .1321602   .0712028     1.86   0.063    -.0073946     .271715
    event_m1 |    .039863   .0636038     0.63   0.531    -.0847981    .1645241
     event_1 |   .2749769   .0972123     2.83   0.005     .0844443    .4655094
     event_2 |   .3225597   .1214798     2.66   0.008     .0844637    .5606556
     event_3 |   .2296775   .1667468     1.38   0.168    -.0971401    .5564952
     event_4 |   .3035639   .1812974     1.67   0.094    -.0517725    .6589003
     event_5 |   .3041076   .1924577     1.58   0.114    -.0731026    .6813179
------------------------------------------------------------------------------
  9,176
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: event_m5
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnQh: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      8,092

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .4759614   .2400088     1.98   0.047     .0055528      .94637
    event_m4 |   .4561251    .171756     2.66   0.008     .1194895    .7927608
    event_m3 |   .3539963   .1193818     2.97   0.003     .1200122    .5879804
    event_m2 |    .388514   .0955873     4.06   0.000     .2011663    .5758617
    event_m1 |    .190306   .0972335     1.96   0.050    -.0002683    .3808802
     event_1 |   .3891137   .1330451     2.92   0.003     .1283501    .6498773
     event_2 |   .4454478    .185957     2.40   0.017     .0809787    .8099168
     event_3 |   .3497627   .2280015     1.53   0.125     -.097112    .7966374
     event_4 |   .4346488   .2517381     1.73   0.084    -.0587489    .9280465
     event_5 |   .4740858   .2649941     1.79   0.074     -.045293    .9934646
------------------------------------------------------------------------------
  8,092
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: event_m5
Estimating lnQhr: event_m4
Estimating lnQhr: event_m3
Estimating lnQhr: event_m2
Estimating lnQhr: event_m1
Estimating lnQhr: event_1
Estimating lnQhr: event_2
Estimating lnQhr: event_3
Estimating lnQhr: event_4
Estimating lnQhr: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =     10,468

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |  -.0261028   .0666413    -0.39   0.695    -.1567173    .1045116
    event_m4 |  -.0206082    .054463    -0.38   0.705    -.1273538    .0861374
    event_m3 |  -.0425525   .0485511    -0.88   0.381     -.137711     .052606
    event_m2 |  -.0051566   .0445279    -0.12   0.908    -.0924297    .0821164
    event_m1 |  -.0286626   .0368193    -0.78   0.436    -.1008271    .0435019
     event_1 |   .1429354   .0314557     4.54   0.000     .0812835    .2045874
     event_2 |   .1368424   .0325958     4.20   0.000     .0729559    .2007289
     event_3 |   .1745654   .0335968     5.20   0.000     .1087169    .2404139
     event_4 |   .1402991   .0538074     2.61   0.009     .0348385    .2457598
     event_5 |   .2346883   .0524206     4.48   0.000     .1319457    .3374308
------------------------------------------------------------------------------
  10,468
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: event_m5
Estimating lnQhr: event_m4
Estimating lnQhr: event_m3
Estimating lnQhr: event_m2
Estimating lnQhr: event_m1
Estimating lnQhr: event_1
Estimating lnQhr: event_2
Estimating lnQhr: event_3
Estimating lnQhr: event_4
Estimating lnQhr: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      9,176

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |  -.0459794   .0958036    -0.48   0.631    -.2337509    .1417921
    event_m4 |   -.025865   .0805878    -0.32   0.748    -.1838142    .1320842
    event_m3 |  -.0367139   .0738255    -0.50   0.619    -.1814092    .1079814
    event_m2 |   .0064508   .0617941     0.10   0.917    -.1146634     .127565
    event_m1 |  -.0388907   .0558525    -0.70   0.486    -.1483597    .0705783
     event_1 |   .2090529   .0471674     4.43   0.000     .1166065    .3014994
     event_2 |   .1834937   .0510518     3.59   0.000      .083434    .2835534
     event_3 |   .2182649    .042556     5.13   0.000     .1348566    .3016732
     event_4 |   .1943946   .0718123     2.71   0.007     .0536451    .3351442
     event_5 |   .2981565   .0665025     4.48   0.000      .167814     .428499
------------------------------------------------------------------------------
  9,176
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: event_m5
Estimating lnQhr: event_m4
Estimating lnQhr: event_m3
Estimating lnQhr: event_m2
Estimating lnQhr: event_m1
Estimating lnQhr: event_1
Estimating lnQhr: event_2
Estimating lnQhr: event_3
Estimating lnQhr: event_4
Estimating lnQhr: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      8,092

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   -.176391   .1407662    -1.25   0.210    -.4522878    .0995057
    event_m4 |  -.1689153   .1322457    -1.28   0.202    -.4281122    .0902815
    event_m3 |  -.1469774   .1131948    -1.30   0.194    -.3688352    .0748804
    event_m2 |  -.0274241   .0941825    -0.29   0.771    -.2120185    .1571702
    event_m1 |  -.0799405    .086864    -0.92   0.357    -.2501908    .0903099
     event_1 |   .3126566   .0724652     4.31   0.000     .1706273    .4546858
     event_2 |   .2813041   .0766517     3.67   0.000     .1310695    .4315387
     event_3 |   .3084103   .0449003     6.87   0.000     .2204074    .3964133
     event_4 |    .291631   .0783262     3.72   0.000     .1381144    .4451476
     event_5 |   .4476213     .06662     6.72   0.000     .3170484    .5781941
------------------------------------------------------------------------------
  8,092

. 
. esttab model* using "`here'/output/table_attgt_loop.tex", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_loop.tex)

. esttab model* using "`here'/output/table_attgt_loop.txt", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_loop.txt)

. 
. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_loop.log
  log type:  text
 closed on:  13 Jul 2021, 14:51:59
--------------------------------------------------------------------------------------------------------------------------------------------------------------
