--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_att.log
  log type:  text
 opened on:   8 Jul 2021, 17:57:41

. 
. use "`here'/temp/analysis_sample.dta", clear

. 
. rename ever_foreign ef

. rename ever_foreign_hire efh

. rename has_expat_ceo has_expat

. 
. foreach var in foreign foreign_hire has_expat {
  2.         attgt lnQL lnK lnL exporter lnQ, treatment(`var') aggregate(att) reps(20) notyet limitcontrol(foreign == 0)
  3.         count if e(sample) == 1
  4.         eststo model_`sample'`var', title("`sample' `var'")
  5. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: att
Estimating lnK: att
Estimating lnL: att
Estimating exporter: att
Estimating lnQ: att
Callaway Sant'Anna (2021)

                                                Number of obs     =     15,771

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
         att |   .0881574   .0388172     2.27   0.023     .0120771    .1642377
-------------+----------------------------------------------------------------
lnK          |
         att |  -.0793211   .0609094    -1.30   0.193    -.1987014    .0400591
-------------+----------------------------------------------------------------
lnL          |
         att |   .0773702   .0416532     1.86   0.063    -.0042686    .1590089
-------------+----------------------------------------------------------------
exporter     |
         att |   .0300604   .0153472     1.96   0.050    -.0000195    .0601404
-------------+----------------------------------------------------------------
lnQ          |
         att |   .1655276   .0550109     3.01   0.003     .0577081     .273347
------------------------------------------------------------------------------
  15,771
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: att
Estimating lnK: att
Estimating lnL: att
Estimating exporter: att
Estimating lnQ: att
Callaway Sant'Anna (2021)

                                                Number of obs     =     13,851

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
         att |   .1431463   .0412444     3.47   0.001     .0623087    .2239839
-------------+----------------------------------------------------------------
lnK          |
         att |   -.051528   .0669205    -0.77   0.441    -.1826898    .0796338
-------------+----------------------------------------------------------------
lnL          |
         att |    .094462   .0415051     2.28   0.023     .0131135    .1758105
-------------+----------------------------------------------------------------
exporter     |
         att |   .0340105   .0189165     1.80   0.072    -.0030652    .0710862
-------------+----------------------------------------------------------------
lnQ          |
         att |   .2376083   .0638606     3.72   0.000     .1124438    .3627729
------------------------------------------------------------------------------
  13,851
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: att
Estimating lnK: att
Estimating lnL: att
Estimating exporter: att
Estimating lnQ: att
Callaway Sant'Anna (2021)

                                                Number of obs     =     11,793

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
         att |   .3012527    .046574     6.47   0.000     .2099694    .3925361
-------------+----------------------------------------------------------------
lnK          |
         att |   .1279725   .0846895     1.51   0.131    -.0380158    .2939609
-------------+----------------------------------------------------------------
lnL          |
         att |   .1531322   .0564742     2.71   0.007     .0424448    .2638196
-------------+----------------------------------------------------------------
exporter     |
         att |    .064755   .0209382     3.09   0.002     .0237167    .1057932
-------------+----------------------------------------------------------------
lnQ          |
         att |   .4543849   .0820717     5.54   0.000     .2935274    .6152424
------------------------------------------------------------------------------
  11,793

. 
. esttab model* using "`here'/output/table_attgt_att.tex", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_att.tex)

. esttab model* using "`here'/output/table_attgt_att.txt", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_att.txt)

. 
. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_att.log
  log type:  text
 closed on:   8 Jul 2021, 17:59:09
--------------------------------------------------------------------------------------------------------------------------------------------------------------
