--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_8.log
  log type:  text
 opened on:   1 Jul 2021, 10:35:05

. 
. use "`here'/temp/analysis_sample.dta"

. 
. *attgt exporter lnQL if inrange(year, 1992, 2004) & ever_foreign, treatment(has_expat_ceo ) aggregate(e) pre(2) post(3) reps(20)
. *matrix list e(b)
. *esttab
. 
. *foreach var in exporter lnQL {
. *       attgt `var' if inrange(year, 1992, 2004) & ever_foreign, treatment(has_expat_ceo ) aggregate(e) pre(2) post(3) reps(20)
. *       matrix list e(b)
. *       esttab
. *}
. 
. rename ever_foreign ef

. rename ever_foreign_hire efh

. rename has_expat_ceo has_expat

. 
. gen lnIK = ln(immat_18)
(139,036 missing values generated)

. gen lnIK_0=lnIK
(139,036 missing values generated)

. replace lnIK_0=0 if immat_18==0
(40,686 real changes made)

. gen lnEx=ln(export_18)
(198,574 missing values generated)

. gen Qh=sales_18-export_18
(79,688 missing values generated)

. gen lnQh=ln(Qh)
(80,529 missing values generated)

. 
. foreach sample in ef efh {
  2.         foreach var in foreign foreign_hire has_expat {
  3.                 *eststo: attgt exporter lnQL if inrange(year, 1992, 2004) & ever_foreign, treatment(`var') aggregate(e) pre(2) post(3) reps(20)
.                 *attgt exporter lnQL if inrange(year, 1992, 2004) & ever_foreign, treatment(`var') aggregate(e) pre(2) post(3) reps(20)
.                 attgt lnQL TFP_cd lnK lnL exporter lnQ if `sample', treatment(`var') aggregate(e) pre(8) post(8) reps(20) notyet
  4.                 count if e(sample) == 1
  5.                 eststo model_`sample'`var', title("`sample' `var'")
  6.                 *matrix list e(b)
.         }
  7. 
.         *esttab model_`sample'* using "`here'/output/table_`sample'_attgt.tex", mtitle title("`sample'") b(3) se(3) replace
.         *esttab model_`sample'* using "`here'/output/table_`sample'_attgt.txt", mtitle title("`sample'") b(3) se(3) replace
. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m8
Estimating lnQL: event_m7
Estimating lnQL: event_m6
Estimating lnQL: event_m5
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating lnQL: event_5
Estimating lnQL: event_6
Estimating lnQL: event_7
Estimating lnQL: event_8
Estimating TFP_cd: event_m8
Estimating TFP_cd: event_m7
Estimating TFP_cd: event_m6
Estimating TFP_cd: event_m5
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating TFP_cd: event_5
Estimating TFP_cd: event_6
Estimating TFP_cd: event_7
Estimating TFP_cd: event_8
Estimating lnK: event_m8
Estimating lnK: event_m7
Estimating lnK: event_m6
Estimating lnK: event_m5
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnK: event_5
Estimating lnK: event_6
Estimating lnK: event_7
Estimating lnK: event_8
Estimating lnL: event_m8
Estimating lnL: event_m7
Estimating lnL: event_m6
Estimating lnL: event_m5
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating lnL: event_5
Estimating lnL: event_6
Estimating lnL: event_7
Estimating lnL: event_8
Estimating exporter: event_m8
Estimating exporter: event_m7
Estimating exporter: event_m6
Estimating exporter: event_m5
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating exporter: event_5
Estimating exporter: event_6
Estimating exporter: event_7
Estimating exporter: event_8
Estimating lnQ: event_m8
Estimating lnQ: event_m7
Estimating lnQ: event_m6
Estimating lnQ: event_m5
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQ: event_5
Estimating lnQ: event_6
Estimating lnQ: event_7
Estimating lnQ: event_8
Callaway Sant'Anna (2021)

                                                Number of obs     =     17,446

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m8 |  -.0939373   .0878167    -1.07   0.285    -.2660548    .0781803
    event_m7 |   -.029296   .0725772    -0.40   0.686    -.1715446    .1129526
    event_m6 |  -.0152072   .0667109    -0.23   0.820    -.1459582    .1155438
    event_m5 |   .0359228   .0471611     0.76   0.446    -.0565112    .1283568
    event_m4 |   .0049842   .0454204     0.11   0.913    -.0840381    .0940066
    event_m3 |   .0074323   .0392714     0.19   0.850    -.0695383    .0844029
    event_m2 |  -.0473779   .0319314    -1.48   0.138    -.1099623    .0152064
    event_m1 |  -.0243542   .0206512    -1.18   0.238    -.0648297    .0161214
     event_1 |   .0566953   .0285995     1.98   0.047     .0006413    .1127493
     event_2 |   .0954647   .0430997     2.21   0.027     .0109908    .1799386
     event_3 |   .1192382   .0528394     2.26   0.024     .0156748    .2228015
     event_4 |   .1016077   .0489967     2.07   0.038     .0055759    .1976395
     event_5 |   .1206872   .0493332     2.45   0.014      .023996    .2173784
     event_6 |    .148433   .0583098     2.55   0.011     .0341479    .2627181
     event_7 |   .1904884    .072222     2.64   0.008     .0489358     .332041
     event_8 |   .1759583   .1063252     1.65   0.098    -.0324352    .3843518
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m8 |  -.0230071   .0455122    -0.51   0.613    -.1122095    .0661952
    event_m7 |  -.0210902   .0381184    -0.55   0.580    -.0958009    .0536206
    event_m6 |  -.0181746   .0360193    -0.50   0.614    -.0887711    .0524219
    event_m5 |   .0062815   .0276056     0.23   0.820    -.0478245    .0603875
    event_m4 |   .0213462   .0278544     0.77   0.443    -.0332475    .0759399
    event_m3 |   .0069399   .0218794     0.32   0.751     -.035943    .0498228
    event_m2 |  -.0444975   .0153945    -2.89   0.004    -.0746702   -.0143247
    event_m1 |  -.0164961   .0119257    -1.38   0.167    -.0398701    .0068779
     event_1 |   .0299231   .0094287     3.17   0.002     .0114431    .0484031
     event_2 |   .0470648   .0185185     2.54   0.011     .0107692    .0833604
     event_3 |   .0559805   .0204476     2.74   0.006     .0159039    .0960571
     event_4 |   .0408797   .0235817     1.73   0.083    -.0053397    .0870991
     event_5 |   .0183774   .0249894     0.74   0.462    -.0306009    .0673557
     event_6 |   .0242446   .0233083     1.04   0.298    -.0214387    .0699279
     event_7 |   .0274069   .0341581     0.80   0.422    -.0395418    .0943557
     event_8 |  -.0107182   .0379416    -0.28   0.778    -.0850825     .063646
-------------+----------------------------------------------------------------
lnK          |
    event_m8 |   .0985084   .1156241     0.85   0.394    -.1281107    .3251275
    event_m7 |    .153296   .0985066     1.56   0.120    -.0397734    .3463654
    event_m6 |   .2133758    .079228     2.69   0.007     .0580918    .3686598
    event_m5 |   .2365375    .064331     3.68   0.000      .110451     .362624
    event_m4 |   .1677503    .055425     3.03   0.002     .0591193    .2763812
    event_m3 |   .0992369   .0575703     1.72   0.085    -.0135988    .2120726
    event_m2 |   .0815873   .0471764     1.73   0.084    -.0108766    .1740513
    event_m1 |   .0699298   .0317919     2.20   0.028     .0076187    .1322408
     event_1 |  -.0177978   .0311301    -0.57   0.568    -.0788117    .0432161
     event_2 |  -.0471448    .038786    -1.22   0.224    -.1231639    .0288742
     event_3 |  -.0343832   .0487732    -0.70   0.481     -.129977    .0612105
     event_4 |  -.1206398   .0822421    -1.47   0.142    -.2818313    .0405516
     event_5 |  -.1632132   .0910377    -1.79   0.073    -.3416437    .0152174
     event_6 |  -.1212075   .0956331    -1.27   0.205     -.308645      .06623
     event_7 |  -.1375025   .1055494    -1.30   0.193    -.3443754    .0693704
     event_8 |   -.200516   .1169634    -1.71   0.086    -.4297601    .0287281
-------------+----------------------------------------------------------------
lnL          |
    event_m8 |   .1106612   .0936126     1.18   0.237    -.0728161    .2941386
    event_m7 |   .1462308   .0923603     1.58   0.113     -.034792    .3272536
    event_m6 |   .1379628   .0570617     2.42   0.016      .026124    .2498017
    event_m5 |   .1702525   .0525168     3.24   0.001     .0673214    .2731836
    event_m4 |   .1259473   .0484796     2.60   0.009     .0309291    .2209656
    event_m3 |   .1050834   .0380819     2.76   0.006     .0304442    .1797225
    event_m2 |   .0803851   .0241002     3.34   0.001     .0331497    .1276206
    event_m1 |   .0254707   .0153476     1.66   0.097      -.00461    .0555515
     event_1 |   .0443809   .0199934     2.22   0.026     .0051945    .0835673
     event_2 |    .060073   .0323559     1.86   0.063    -.0033434    .1234894
     event_3 |   .0932597   .0421706     2.21   0.027     .0106067    .1759126
     event_4 |    .119743   .0549976     2.18   0.029     .0119497    .2275363
     event_5 |   .0819243   .0685759     1.19   0.232    -.0524821    .2163306
     event_6 |   .0871849   .0700046     1.25   0.213    -.0500215    .2243913
     event_7 |   .0930007   .0896848     1.04   0.300    -.0827782    .2687797
     event_8 |   .1099627   .0836222     1.31   0.189    -.0539337    .2738591
-------------+----------------------------------------------------------------
exporter     |
    event_m8 |   .0062875   .0322136     0.20   0.845      -.05685    .0694251
    event_m7 |   .0053403    .023293     0.23   0.819    -.0403131    .0509938
    event_m6 |  -.0101194   .0200066    -0.51   0.613    -.0493317    .0290928
    event_m5 |   .0081053   .0158556     0.51   0.609     -.022971    .0391817
    event_m4 |  -.0197278   .0170345    -1.16   0.247    -.0531147    .0136592
    event_m3 |   .0096799   .0167516     0.58   0.563    -.0231527    .0425125
    event_m2 |   .0055675   .0147067     0.38   0.705    -.0232571     .034392
    event_m1 |  -.0168013   .0086666    -1.94   0.053    -.0337875    .0001849
     event_1 |   .0243733   .0084719     2.88   0.004     .0077688    .0409779
     event_2 |   .0207327    .010792     1.92   0.055    -.0004193    .0418847
     event_3 |   .0285873   .0170824     1.67   0.094    -.0048936    .0620683
     event_4 |   .0291572   .0144314     2.02   0.043     .0008722    .0574422
     event_5 |   .0488663   .0169697     2.88   0.004     .0156063    .0821263
     event_6 |   .0388927   .0189359     2.05   0.040     .0017791    .0760063
     event_7 |   .0321696   .0216428     1.49   0.137    -.0102496    .0745887
     event_8 |   .0422943   .0264416     1.60   0.110    -.0095302    .0941189
-------------+----------------------------------------------------------------
lnQ          |
    event_m8 |   .0167239   .0902379     0.19   0.853    -.1601392     .193587
    event_m7 |   .1169348   .0937094     1.25   0.212    -.0667323    .3006018
    event_m6 |   .1227556   .0813943     1.51   0.132    -.0367742    .2822854
    event_m5 |   .2061753   .0628245     3.28   0.001     .0830416     .329309
    event_m4 |   .1309316    .057351     2.28   0.022     .0185257    .2433374
    event_m3 |   .1125156   .0472271     2.38   0.017     .0199522     .205079
    event_m2 |   .0330072   .0427921     0.77   0.441    -.0508638    .1168782
    event_m1 |   .0011166   .0227071     0.05   0.961    -.0433885    .0456216
     event_1 |   .1010762   .0290211     3.48   0.000     .0441959    .1579566
     event_2 |   .1555377   .0425712     3.65   0.000     .0720998    .2389756
     event_3 |   .2124978   .0584698     3.63   0.000     .0978992    .3270965
     event_4 |   .2213506   .0785594     2.82   0.005      .067377    .3753243
     event_5 |   .2026115   .0830686     2.44   0.015     .0397999     .365423
     event_6 |   .2356179   .0761298     3.09   0.002     .0864063    .3848295
     event_7 |   .2834891   .1070591     2.65   0.008     .0736572     .493321
     event_8 |    .285921   .1316101     2.17   0.030     .0279701     .543872
------------------------------------------------------------------------------
  17,446
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m8
Estimating lnQL: event_m7
Estimating lnQL: event_m6
Estimating lnQL: event_m5
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating lnQL: event_5
Estimating lnQL: event_6
Estimating lnQL: event_7
Estimating lnQL: event_8
Estimating TFP_cd: event_m8
Estimating TFP_cd: event_m7
Estimating TFP_cd: event_m6
Estimating TFP_cd: event_m5
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating TFP_cd: event_5
Estimating TFP_cd: event_6
Estimating TFP_cd: event_7
Estimating TFP_cd: event_8
Estimating lnK: event_m8
Estimating lnK: event_m7
Estimating lnK: event_m6
Estimating lnK: event_m5
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnK: event_5
Estimating lnK: event_6
Estimating lnK: event_7
Estimating lnK: event_8
Estimating lnL: event_m8
Estimating lnL: event_m7
Estimating lnL: event_m6
Estimating lnL: event_m5
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating lnL: event_5
Estimating lnL: event_6
Estimating lnL: event_7
Estimating lnL: event_8
Estimating exporter: event_m8
Estimating exporter: event_m7
Estimating exporter: event_m6
Estimating exporter: event_m5
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating exporter: event_5
Estimating exporter: event_6
Estimating exporter: event_7
Estimating exporter: event_8
Estimating lnQ: event_m8
Estimating lnQ: event_m7
Estimating lnQ: event_m6
Estimating lnQ: event_m5
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQ: event_5
Estimating lnQ: event_6
Estimating lnQ: event_7
Estimating lnQ: event_8
Callaway Sant'Anna (2021)

                                                Number of obs     =     18,594

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m8 |   .0108458   .0586965     0.18   0.853    -.1041972    .1258888
    event_m7 |   .0265952   .0475123     0.56   0.576    -.0665272    .1197176
    event_m6 |   .1143114   .0618131     1.85   0.064    -.0068401    .2354629
    event_m5 |   .0750543   .0510499     1.47   0.142    -.0250017    .1751103
    event_m4 |   .1134905   .0443367     2.56   0.010     .0265922    .2003888
    event_m3 |   .0403397   .0447243     0.90   0.367    -.0473183    .1279976
    event_m2 |   .0172442   .0307647     0.56   0.575    -.0430534    .0775418
    event_m1 |   .0052543   .0207571     0.25   0.800    -.0354289    .0459375
     event_1 |   .1017181   .0322547     3.15   0.002     .0385001    .1649361
     event_2 |   .2018732   .0328258     6.15   0.000     .1375357    .2662106
     event_3 |   .2447883   .0507693     4.82   0.000     .1452824    .3442943
     event_4 |   .2324646     .05779     4.02   0.000     .1191983    .3457309
     event_5 |    .257727   .0615925     4.18   0.000     .1370079     .378446
     event_6 |   .2847853   .0794236     3.59   0.000     .1291179    .4404526
     event_7 |   .2750469   .0725349     3.79   0.000      .132881    .4172127
     event_8 |   .2721015   .0769684     3.54   0.000     .1212462    .4229569
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m8 |  -.0250886   .0352235    -0.71   0.476    -.0941255    .0439482
    event_m7 |  -.0405066   .0276101    -1.47   0.142    -.0946213    .0136081
    event_m6 |    .002426   .0295927     0.08   0.935    -.0555745    .0604266
    event_m5 |   .0026774   .0229081     0.12   0.907    -.0422217    .0475764
    event_m4 |   .0375661   .0227889     1.65   0.099    -.0070992    .0822315
    event_m3 |   .0014285   .0226075     0.06   0.950    -.0428814    .0457384
    event_m2 |  -.0239913   .0138926    -1.73   0.084    -.0512203    .0032377
    event_m1 |  -.0151095   .0085989    -1.76   0.079     -.031963    .0017441
     event_1 |   .0351019   .0169013     2.08   0.038     .0019758    .0682279
     event_2 |   .0733712   .0191339     3.83   0.000     .0358694     .110873
     event_3 |    .087409   .0214843     4.07   0.000     .0453006    .1295174
     event_4 |   .0850286   .0208423     4.08   0.000     .0441785    .1258788
     event_5 |   .0546535     .02764     1.98   0.048     .0004801     .108827
     event_6 |   .0901292   .0190241     4.74   0.000     .0528427    .1274157
     event_7 |   .0663086   .0235857     2.81   0.005     .0200815    .1125358
     event_8 |    .070131   .0257703     2.72   0.007     .0196221    .1206399
-------------+----------------------------------------------------------------
lnK          |
    event_m8 |   .2172466    .100006     2.17   0.030     .0212384    .4132548
    event_m7 |   .2393302   .0968152     2.47   0.013     .0495758    .4290845
    event_m6 |   .2828167   .0872832     3.24   0.001     .1117448    .4538886
    event_m5 |   .2606534   .0837614     3.11   0.002     .0964841    .4248228
    event_m4 |   .2096909   .0730367     2.87   0.004     .0665416    .3528402
    event_m3 |   .1105912   .0613706     1.80   0.072    -.0096931    .2308754
    event_m2 |   .0679644   .0388884     1.75   0.081    -.0082554    .1441841
    event_m1 |   .0524084   .0396703     1.32   0.186    -.0253441    .1301608
     event_1 |  -.0053787   .0343172    -0.16   0.875    -.0726391    .0618817
     event_2 |   .0069667   .0464565     0.15   0.881    -.0840864    .0980199
     event_3 |  -.0549426   .0613105    -0.90   0.370     -.175109    .0652238
     event_4 |  -.1092947   .0694997    -1.57   0.116    -.2455116    .0269222
     event_5 |  -.1880101   .0971761    -1.93   0.053    -.3784718    .0024516
     event_6 |  -.2082508   .0957637    -2.17   0.030    -.3959441   -.0205574
     event_7 |  -.1722134   .0842309    -2.04   0.041    -.3373029   -.0071239
     event_8 |  -.2175235   .1087875    -2.00   0.046    -.4307432   -.0043039
-------------+----------------------------------------------------------------
lnL          |
    event_m8 |    .111585   .0785301     1.42   0.155     -.042331    .2655011
    event_m7 |   .1131877   .0755324     1.50   0.134    -.0348529    .2612284
    event_m6 |   .1135936   .0566528     2.01   0.045     .0025562     .224631
    event_m5 |   .0855921   .0697782     1.23   0.220    -.0511707    .2223548
    event_m4 |   .0717806   .0577743     1.24   0.214     -.041455    .1850162
    event_m3 |   .0668513   .0394623     1.69   0.090    -.0104934    .1441959
    event_m2 |   .0203609   .0267276     0.76   0.446    -.0320242    .0727459
    event_m1 |   .0031964   .0186091     0.17   0.864    -.0332768    .0396695
     event_1 |   .0271374   .0219241     1.24   0.216     -.015833    .0701079
     event_2 |   .0087725   .0373388     0.23   0.814    -.0644103    .0819553
     event_3 |   .0146172   .0445488     0.33   0.743    -.0726968    .1019311
     event_4 |   .0602059   .0547746     1.10   0.272    -.0471503    .1675621
     event_5 |  -.0344842   .0783333    -0.44   0.660    -.1880147    .1190462
     event_6 |  -.0264995   .0858414    -0.31   0.758    -.1947455    .1417465
     event_7 |   .0202907   .0987812     0.21   0.837    -.1733169    .2138983
     event_8 |   .1066562   .1063745     1.00   0.316    -.1018341    .3151464
-------------+----------------------------------------------------------------
exporter     |
    event_m8 |   -.043578   .0299943    -1.45   0.146    -.1023658    .0152098
    event_m7 |  -.0303612   .0179328    -1.69   0.090    -.0655088    .0047864
    event_m6 |  -.0149837   .0204226    -0.73   0.463    -.0550114    .0250439
    event_m5 |  -.0073047   .0148706    -0.49   0.623    -.0364505    .0218411
    event_m4 |  -.0309715   .0219628    -1.41   0.158    -.0740179    .0120748
    event_m3 |  -.0140984   .0165136    -0.85   0.393    -.0464645    .0182677
    event_m2 |  -.0261525   .0136434    -1.92   0.055     -.052893    .0005881
    event_m1 |  -.0033893   .0091344    -0.37   0.711    -.0212924    .0145138
     event_1 |   .0137911   .0097283     1.42   0.156    -.0052761    .0328583
     event_2 |   .0131645   .0122999     1.07   0.284    -.0109429    .0372718
     event_3 |   .0268954   .0134946     1.99   0.046     .0004464    .0533444
     event_4 |   .0358277   .0149061     2.40   0.016     .0066123    .0650432
     event_5 |     .02245   .0193682     1.16   0.246    -.0155109     .060411
     event_6 |   .0202162   .0190705     1.06   0.289    -.0171613    .0575936
     event_7 |  -.0064685   .0249763    -0.26   0.796    -.0554212    .0424843
     event_8 |   .0100984   .0279126     0.36   0.718    -.0446093    .0648061
-------------+----------------------------------------------------------------
lnQ          |
    event_m8 |   .1224309   .0907701     1.35   0.177    -.0554753    .3003371
    event_m7 |    .139783    .091185     1.53   0.125    -.0389364    .3185023
    event_m6 |    .227905   .0745772     3.06   0.002     .0817364    .3740735
    event_m5 |   .1606464   .0804726     2.00   0.046     .0029231    .3183698
    event_m4 |    .185271   .0596956     3.10   0.002     .0682698    .3022723
    event_m3 |   .1071909    .052193     2.05   0.040     .0048946    .2094873
    event_m2 |   .0376051    .031336     1.20   0.230    -.0238124    .0990225
    event_m1 |   .0084507   .0300912     0.28   0.779    -.0505269    .0674283
     event_1 |   .1288555   .0394349     3.27   0.001     .0515646    .2061465
     event_2 |   .2106456   .0419808     5.02   0.000     .1283647    .2929266
     event_3 |   .2594055    .051317     5.05   0.000     .1588261    .3599849
     event_4 |   .2926705    .060775     4.82   0.000     .1735536    .4117873
     event_5 |   .2232427   .0706213     3.16   0.002     .0848275    .3616579
     event_6 |   .2582858   .0914757     2.82   0.005     .0789967    .4375749
     event_7 |   .2953376   .1018505     2.90   0.004     .0957143    .4949608
     event_8 |   .3787577   .1160155     3.26   0.001     .1513715     .606144
------------------------------------------------------------------------------
  18,594
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m8
Estimating lnQL: event_m7
Estimating lnQL: event_m6
Estimating lnQL: event_m5
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating lnQL: event_5
Estimating lnQL: event_6
Estimating lnQL: event_7
Estimating lnQL: event_8
Estimating TFP_cd: event_m8
Estimating TFP_cd: event_m7
Estimating TFP_cd: event_m6
Estimating TFP_cd: event_m5
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating TFP_cd: event_5
Estimating TFP_cd: event_6
Estimating TFP_cd: event_7
Estimating TFP_cd: event_8
Estimating lnK: event_m8
Estimating lnK: event_m7
Estimating lnK: event_m6
Estimating lnK: event_m5
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnK: event_5
Estimating lnK: event_6
Estimating lnK: event_7
Estimating lnK: event_8
Estimating lnL: event_m8
Estimating lnL: event_m7
Estimating lnL: event_m6
Estimating lnL: event_m5
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating lnL: event_5
Estimating lnL: event_6
Estimating lnL: event_7
Estimating lnL: event_8
Estimating exporter: event_m8
Estimating exporter: event_m7
Estimating exporter: event_m6
Estimating exporter: event_m5
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating exporter: event_5
Estimating exporter: event_6
Estimating exporter: event_7
Estimating exporter: event_8
Estimating lnQ: event_m8
Estimating lnQ: event_m7
Estimating lnQ: event_m6
Estimating lnQ: event_m5
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQ: event_5
Estimating lnQ: event_6
Estimating lnQ: event_7
Estimating lnQ: event_8
Callaway Sant'Anna (2021)

                                                Number of obs     =     19,913

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m8 |   .1096134    .074469     1.47   0.141    -.0363431      .25557
    event_m7 |    .112677   .0741692     1.52   0.129    -.0326919    .2580459
    event_m6 |   .0887572   .0819589     1.08   0.279    -.0718794    .2493938
    event_m5 |   .0420896   .0790436     0.53   0.594    -.1128329    .1970122
    event_m4 |   .1038312    .053586     1.94   0.053    -.0011956    .2088579
    event_m3 |   .0193589   .0497094     0.39   0.697    -.0780697    .1167875
    event_m2 |   .0239945   .0547229     0.44   0.661    -.0832604    .1312495
    event_m1 |   .0203631   .0217235     0.94   0.349    -.0222142    .0629403
     event_1 |   .1610208   .0406566     3.96   0.000     .0813353    .2407062
     event_2 |   .2872211   .0672144     4.27   0.000     .1554833    .4189589
     event_3 |   .3407519   .0715589     4.76   0.000     .2004991    .4810047
     event_4 |   .3238733   .0722913     4.48   0.000      .182185    .4655616
     event_5 |   .2823658   .0814098     3.47   0.001     .1228054    .4419261
     event_6 |   .3417098   .0975298     3.50   0.000     .1505549    .5328647
     event_7 |   .3487585   .1059393     3.29   0.001     .1411214    .5563957
     event_8 |   .3155063   .1069223     2.95   0.003     .1059426    .5250701
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m8 |   .0002669   .0375639     0.01   0.994    -.0733569    .0738907
    event_m7 |  -.0241104   .0316816    -0.76   0.447    -.0862053    .0379844
    event_m6 |  -.0025251   .0448351    -0.06   0.955    -.0904002    .0853501
    event_m5 |  -.0031813   .0271712    -0.12   0.907     -.056436    .0500733
    event_m4 |   .0632922   .0313513     2.02   0.044     .0018449    .1247396
    event_m3 |   .0145527   .0214908     0.68   0.498    -.0275686    .0566739
    event_m2 |  -.0015726     .01976    -0.08   0.937    -.0403016    .0371563
    event_m1 |   .0084354   .0120569     0.70   0.484    -.0151956    .0320665
     event_1 |   .0642859   .0233344     2.75   0.006     .0185514    .1100205
     event_2 |   .1025546   .0293629     3.49   0.000     .0450044    .1601047
     event_3 |   .0987621   .0268914     3.67   0.000      .046056    .1514682
     event_4 |   .0982946   .0291996     3.37   0.001     .0410644    .1555247
     event_5 |    .061293   .0374129     1.64   0.101    -.0120349     .134621
     event_6 |   .1130089   .0254862     4.43   0.000     .0630569    .1629609
     event_7 |     .10182   .0321496     3.17   0.002      .038808     .164832
     event_8 |   .0929754   .0352262     2.64   0.008     .0239333    .1620175
-------------+----------------------------------------------------------------
lnK          |
    event_m8 |   .0006506   .1633541     0.00   0.997    -.3195174    .3208187
    event_m7 |    .066693   .1296163     0.51   0.607    -.1873502    .3207362
    event_m6 |   .0793615   .1269262     0.63   0.532    -.1694092    .3281322
    event_m5 |   .1083022   .1225637     0.88   0.377    -.1319183    .3485227
    event_m4 |     .12485   .0993866     1.26   0.209    -.0699441    .3196442
    event_m3 |    .011677    .097544     0.12   0.905    -.1795058    .2028597
    event_m2 |  -.0187287   .0683951    -0.27   0.784    -.1527807    .1153233
    event_m1 |    .033407   .0491363     0.68   0.497    -.0628984    .1297124
     event_1 |   .0769569    .043962     1.75   0.080    -.0092071    .1631209
     event_2 |   .1496874    .059459     2.52   0.012     .0331499    .2662249
     event_3 |    .162312   .0727495     2.23   0.026     .0197257    .3048984
     event_4 |   .1349061   .0940722     1.43   0.152     -.049472    .3192843
     event_5 |   .1294349   .1162745     1.11   0.266     -.098459    .3573288
     event_6 |   .1770337   .1169048     1.51   0.130    -.0520954    .4061629
     event_7 |    .162408   .1287035     1.26   0.207    -.0898461    .4146622
     event_8 |   .0841904   .1350317     0.62   0.533    -.1804668    .3488476
-------------+----------------------------------------------------------------
lnL          |
    event_m8 |   -.081396   .0883703    -0.92   0.357    -.2545986    .0918066
    event_m7 |  -.0538404   .0636673    -0.85   0.398     -.178626    .0709452
    event_m6 |  -.0575172   .0567774    -1.01   0.311    -.1687987    .0537644
    event_m5 |   .0084854   .0519821     0.16   0.870    -.0933977    .1103685
    event_m4 |   .0187951    .048239     0.39   0.697    -.0757515    .1133418
    event_m3 |  -.0126175   .0427531    -0.30   0.768     -.096412    .0711769
    event_m2 |  -.0361361   .0389807    -0.93   0.354    -.1125368    .0402646
    event_m1 |  -.0081896   .0268928    -0.30   0.761    -.0608984    .0445193
     event_1 |   .0666962   .0270361     2.47   0.014     .0137064    .1196859
     event_2 |   .0853661   .0336994     2.53   0.011     .0193164    .1514158
     event_3 |   .1219772   .0403666     3.02   0.003     .0428601    .2010943
     event_4 |   .1692735   .0609642     2.78   0.005     .0497858    .2887612
     event_5 |   .1446891   .0631994     2.29   0.022     .0208206    .2685576
     event_6 |   .1409848   .0756691     1.86   0.062     -.007324    .2892935
     event_7 |   .1550924   .0876295     1.77   0.077    -.0166583    .3268431
     event_8 |   .2482119   .0968767     2.56   0.010      .058337    .4380867
-------------+----------------------------------------------------------------
exporter     |
    event_m8 |   -.020407   .0338659    -0.60   0.547     -.086783    .0459689
    event_m7 |   .0199483   .0273575     0.73   0.466    -.0336714     .073568
    event_m6 |  -.0251559     .02791    -0.90   0.367    -.0798585    .0295468
    event_m5 |  -.0113643   .0280501    -0.41   0.685    -.0663415    .0436128
    event_m4 |  -.0274924   .0328432    -0.84   0.403    -.0918639    .0368791
    event_m3 |   .0059465   .0254407     0.23   0.815    -.0439164    .0558094
    event_m2 |  -.0203678   .0232098    -0.88   0.380    -.0658581    .0251225
    event_m1 |   .0022682    .017483     0.13   0.897    -.0319979    .0365342
     event_1 |   .0395308   .0135233     2.92   0.003     .0130255     .066036
     event_2 |   .0374356    .016619     2.25   0.024     .0048629    .0700082
     event_3 |   .0352655   .0212604     1.66   0.097    -.0064042    .0769352
     event_4 |   .0514739   .0201532     2.55   0.011     .0119744    .0909734
     event_5 |   .0412932   .0211916     1.95   0.051    -.0002416     .082828
     event_6 |   .0216687   .0237893     0.91   0.362    -.0249575    .0682949
     event_7 |  -.0030121   .0265971    -0.11   0.910    -.0551414    .0491172
     event_8 |   .0018607   .0233766     0.08   0.937    -.0439566    .0476781
-------------+----------------------------------------------------------------
lnQ          |
    event_m8 |   .0282174   .1241239     0.23   0.820     -.215061    .2714959
    event_m7 |   .0588366   .1107765     0.53   0.595    -.1582815    .2759546
    event_m6 |   .0312401    .107248     0.29   0.771    -.1789623    .2414424
    event_m5 |   .0505751   .1013595     0.50   0.618    -.1480859     .249236
    event_m4 |   .1226263   .0788437     1.56   0.120    -.0319046    .2771571
    event_m3 |   .0067414   .0728602     0.09   0.926     -.136062    .1495448
    event_m2 |  -.0121416   .0732947    -0.17   0.868    -.1557966    .1315134
    event_m1 |   .0121735   .0358512     0.34   0.734    -.0580936    .0824406
     event_1 |   .2277169    .046918     4.85   0.000     .1357593    .3196745
     event_2 |   .3725873   .0708024     5.26   0.000     .2338171    .5113574
     event_3 |   .4627291   .0832479     5.56   0.000     .2995662    .6258919
     event_4 |   .4931468   .0911631     5.41   0.000     .3144704    .6718231
     event_5 |   .4270549   .1027204     4.16   0.000     .2257266    .6283832
     event_6 |   .4826945   .1238687     3.90   0.000     .2399165    .7254726
     event_7 |    .503851   .1359972     3.70   0.000     .2373013    .7704006
     event_8 |   .5637182   .1452597     3.88   0.000     .2790145     .848422
------------------------------------------------------------------------------
  19,913
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m8
Estimating lnQL: event_m7
Estimating lnQL: event_m6
Estimating lnQL: event_m5
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating lnQL: event_5
Estimating lnQL: event_6
Estimating lnQL: event_7
Estimating lnQL: event_8
Estimating TFP_cd: event_m8
Estimating TFP_cd: event_m7
Estimating TFP_cd: event_m6
Estimating TFP_cd: event_m5
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating TFP_cd: event_5
Estimating TFP_cd: event_6
Estimating TFP_cd: event_7
Estimating TFP_cd: event_8
Estimating lnK: event_m8
Estimating lnK: event_m7
Estimating lnK: event_m6
Estimating lnK: event_m5
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnK: event_5
Estimating lnK: event_6
Estimating lnK: event_7
Estimating lnK: event_8
Estimating lnL: event_m8
Estimating lnL: event_m7
Estimating lnL: event_m6
Estimating lnL: event_m5
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating lnL: event_5
Estimating lnL: event_6
Estimating lnL: event_7
Estimating lnL: event_8
Estimating exporter: event_m8
Estimating exporter: event_m7
Estimating exporter: event_m6
Estimating exporter: event_m5
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating exporter: event_5
Estimating exporter: event_6
Estimating exporter: event_7
Estimating exporter: event_8
Estimating lnQ: event_m8
Estimating lnQ: event_m7
Estimating lnQ: event_m6
Estimating lnQ: event_m5
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQ: event_5
Estimating lnQ: event_6
Estimating lnQ: event_7
Estimating lnQ: event_8
Callaway Sant'Anna (2021)

                                                Number of obs     =     12,338

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m8 |   -.087486   .0769983    -1.14   0.256       -.2384    .0634279
    event_m7 |  -.0696012   .0850557    -0.82   0.413    -.2363073     .097105
    event_m6 |   .0043644   .0577368     0.08   0.940    -.1087976    .1175264
    event_m5 |   .0389219   .0641939     0.61   0.544    -.0868958    .1647396
    event_m4 |   .0339577   .0521929     0.65   0.515    -.0683385    .1362539
    event_m3 |   .0035581   .0364917     0.10   0.922    -.0679644    .0750806
    event_m2 |  -.0438317   .0357872    -1.22   0.221    -.1139734    .0263099
    event_m1 |   -.050153   .0308722    -1.62   0.104    -.1106615    .0103554
     event_1 |   .0710262   .0437378     1.62   0.104    -.0146983    .1567506
     event_2 |   .1220738   .0621376     1.96   0.049     .0002863    .2438613
     event_3 |   .1577877   .0676124     2.33   0.020     .0252697    .2903057
     event_4 |   .1499647   .0573591     2.61   0.009     .0375429    .2623864
     event_5 |   .1487402    .063104     2.36   0.018     .0250586    .2724218
     event_6 |   .1752524   .0743665     2.36   0.018     .0294967    .3210081
     event_7 |   .2146379   .0862486     2.49   0.013     .0455938    .3836821
     event_8 |   .1879384   .1036944     1.81   0.070    -.0152989    .3911757
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m8 |  -.0425872   .0353703    -1.20   0.229    -.1119116    .0267373
    event_m7 |  -.0415178   .0413785    -1.00   0.316    -.1226183    .0395826
    event_m6 |  -.0064244   .0277671    -0.23   0.817     -.060847    .0479982
    event_m5 |   .0032206   .0275125     0.12   0.907    -.0507028     .057144
    event_m4 |   .0354763   .0270384     1.31   0.189     -.017518    .0884706
    event_m3 |   .0122768   .0237866     0.52   0.606     -.034344    .0588976
    event_m2 |  -.0481444   .0189724    -2.54   0.011    -.0853295   -.0109592
    event_m1 |    -.03295   .0163194    -2.02   0.043    -.0649354   -.0009646
     event_1 |   .0477653   .0168369     2.84   0.005     .0147656     .080765
     event_2 |    .062932   .0229376     2.74   0.006     .0179752    .1078889
     event_3 |   .0803057   .0263533     3.05   0.002     .0286541    .1319572
     event_4 |   .0767414   .0284007     2.70   0.007     .0210771    .1324057
     event_5 |   .0500774   .0344489     1.45   0.146    -.0174412    .1175959
     event_6 |   .0545707   .0305708     1.79   0.074    -.0053469    .1144884
     event_7 |   .0558917   .0350999     1.59   0.111    -.0129029    .1246862
     event_8 |   .0263892   .0425901     0.62   0.536    -.0570859    .1098642
-------------+----------------------------------------------------------------
lnK          |
    event_m8 |   .1284394   .1401095     0.92   0.359    -.1461702     .403049
    event_m7 |   .2148297   .1191545     1.80   0.071    -.0187088    .4483682
    event_m6 |   .2675881   .0904431     2.96   0.003     .0903229    .4448534
    event_m5 |   .3477586   .0641646     5.42   0.000     .2219982    .4735189
    event_m4 |   .2168489    .074557     2.91   0.004     .0707198     .362978
    event_m3 |   .1067338   .0781544     1.37   0.172    -.0464461    .2599137
    event_m2 |    .103226   .0648719     1.59   0.112    -.0239206    .2303726
    event_m1 |   .0701031    .043393     1.62   0.106    -.0149457    .1551518
     event_1 |   .0389361   .0428924     0.91   0.364    -.0451314    .1230035
     event_2 |    .005217   .0578883     0.09   0.928     -.108242     .118676
     event_3 |  -.0255315   .0650669    -0.39   0.695    -.1530602    .1019973
     event_4 |  -.1280461   .0693854    -1.85   0.065     -.264039    .0079469
     event_5 |  -.1695352   .1010247    -1.68   0.093      -.36754    .0284695
     event_6 |  -.1400358   .1137939    -1.23   0.218    -.3630679    .0829962
     event_7 |  -.1785058   .1340983    -1.33   0.183    -.4413337    .0843222
     event_8 |  -.2352804   .1762764    -1.33   0.182    -.5807757    .1102149
-------------+----------------------------------------------------------------
lnL          |
    event_m8 |   .1936402     .07016     2.76   0.006     .0561291    .3311513
    event_m7 |   .2278897   .0626322     3.64   0.000     .1051328    .3506466
    event_m6 |   .2032308   .0466984     4.35   0.000     .1117036    .2947579
    event_m5 |   .2345515   .0316372     7.41   0.000     .1725437    .2965593
    event_m4 |   .1325549   .0520532     2.55   0.011     .0305325    .2345774
    event_m3 |   .1105922   .0456244     2.42   0.015       .02117    .2000144
    event_m2 |   .0893155   .0266495     3.35   0.001     .0370835    .1415474
    event_m1 |   .0266716   .0202833     1.31   0.189     -.013083    .0664262
     event_1 |   .0979802   .0277402     3.53   0.000     .0436104      .15235
     event_2 |   .0968644   .0406417     2.38   0.017     .0172081    .1765207
     event_3 |   .1451494   .0496969     2.92   0.003     .0477453    .2425534
     event_4 |   .1737938    .052081     3.34   0.001     .0717169    .2758706
     event_5 |   .1325342   .0701651     1.89   0.059     -.004987    .2700554
     event_6 |   .1243015   .0737903     1.68   0.092    -.0203248    .2689278
     event_7 |   .0932632   .0888139     1.05   0.294    -.0808089    .2673353
     event_8 |   .1479144   .1032729     1.43   0.152    -.0544968    .3503257
-------------+----------------------------------------------------------------
exporter     |
    event_m8 |  -.0074336   .0386391    -0.19   0.847    -.0831649    .0682977
    event_m7 |   .0217824   .0360708     0.60   0.546    -.0489152    .0924799
    event_m6 |  -.0078992   .0302259    -0.26   0.794    -.0671408    .0513425
    event_m5 |   .0091887   .0243912     0.38   0.706    -.0386172    .0569945
    event_m4 |  -.0427795   .0259114    -1.65   0.099    -.0935649    .0080059
    event_m3 |   .0027608   .0204184     0.14   0.892    -.0372586    .0427802
    event_m2 |  -.0090509   .0170807    -0.53   0.596    -.0425285    .0244268
    event_m1 |  -.0226598   .0110196    -2.06   0.040    -.0442579   -.0010618
     event_1 |   .0365914   .0107195     3.41   0.001     .0155816    .0576013
     event_2 |   .0260753   .0113675     2.29   0.022     .0037955    .0483551
     event_3 |   .0379661   .0178538     2.13   0.033     .0029734    .0729589
     event_4 |   .0488216   .0147822     3.30   0.001     .0198491    .0777941
     event_5 |   .0710331   .0185813     3.82   0.000     .0346144    .1074519
     event_6 |   .0478447   .0163567     2.93   0.003     .0157861    .0799033
     event_7 |   .0363982   .0166112     2.19   0.028     .0038408    .0689555
     event_8 |   .0489637   .0295997     1.65   0.098    -.0090506     .106978
-------------+----------------------------------------------------------------
lnQ          |
    event_m8 |   .1061541   .1163688     0.91   0.362    -.1219245    .3342327
    event_m7 |   .1582885   .0891991     1.77   0.076    -.0165385    .3331155
    event_m6 |   .2075952   .0625772     3.32   0.001     .0849461    .3302442
    event_m5 |   .2734734   .0546814     5.00   0.000     .1662999    .3806469
    event_m4 |   .1665126   .0621482     2.68   0.007     .0447044    .2883207
    event_m3 |   .1141502   .0654881     1.74   0.081     -.014204    .2425045
    event_m2 |   .0454837   .0423021     1.08   0.282     -.037427    .1283943
    event_m1 |  -.0234815   .0314197    -0.75   0.455    -.0850628    .0380999
     event_1 |   .1690064   .0450929     3.75   0.000      .080626    .2573867
     event_2 |   .2189382   .0611149     3.58   0.000     .0991553    .3387211
     event_3 |   .3029371   .0677203     4.47   0.000     .1702078    .4356663
     event_4 |   .3237584   .0745433     4.34   0.000     .1776562    .4698606
     event_5 |   .2812744   .0828569     3.39   0.001     .1188778     .443671
     event_6 |   .2995539   .0864471     3.47   0.001     .1301206    .4689871
     event_7 |   .3079011   .1171496     2.63   0.009     .0782922    .5375101
     event_8 |   .3358528    .172614     1.95   0.052    -.0024644      .67417
------------------------------------------------------------------------------
  12,338
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m8
Estimating lnQL: event_m7
Estimating lnQL: event_m6
Estimating lnQL: event_m5
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating lnQL: event_5
Estimating lnQL: event_6
Estimating lnQL: event_7
Estimating lnQL: event_8
Estimating TFP_cd: event_m8
Estimating TFP_cd: event_m7
Estimating TFP_cd: event_m6
Estimating TFP_cd: event_m5
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating TFP_cd: event_5
Estimating TFP_cd: event_6
Estimating TFP_cd: event_7
Estimating TFP_cd: event_8
Estimating lnK: event_m8
Estimating lnK: event_m7
Estimating lnK: event_m6
Estimating lnK: event_m5
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnK: event_5
Estimating lnK: event_6
Estimating lnK: event_7
Estimating lnK: event_8
Estimating lnL: event_m8
Estimating lnL: event_m7
Estimating lnL: event_m6
Estimating lnL: event_m5
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating lnL: event_5
Estimating lnL: event_6
Estimating lnL: event_7
Estimating lnL: event_8
Estimating exporter: event_m8
Estimating exporter: event_m7
Estimating exporter: event_m6
Estimating exporter: event_m5
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating exporter: event_5
Estimating exporter: event_6
Estimating exporter: event_7
Estimating exporter: event_8
Estimating lnQ: event_m8
Estimating lnQ: event_m7
Estimating lnQ: event_m6
Estimating lnQ: event_m5
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQ: event_5
Estimating lnQ: event_6
Estimating lnQ: event_7
Estimating lnQ: event_8
Callaway Sant'Anna (2021)

                                                Number of obs     =     13,214

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m8 |   .0244919   .0762811     0.32   0.748    -.1250163        .174
    event_m7 |   .0497017   .0610701     0.81   0.416    -.0699936    .1693969
    event_m6 |    .134636   .0566598     2.38   0.017     .0235848    .2456872
    event_m5 |   .0814812   .0582665     1.40   0.162    -.0327191    .1956815
    event_m4 |   .1299352   .0412595     3.15   0.002     .0490681    .2108023
    event_m3 |   .0613942   .0491732     1.25   0.212    -.0349835    .1577719
    event_m2 |      .0327    .033186     0.99   0.324    -.0323435    .0977434
    event_m1 |   .0144183   .0206565     0.70   0.485    -.0260677    .0549043
     event_1 |   .0940794   .0339117     2.77   0.006     .0276137    .1605451
     event_2 |   .1848767   .0332517     5.56   0.000     .1197045    .2500489
     event_3 |   .2240135   .0409097     5.48   0.000     .1438321     .304195
     event_4 |   .2111725   .0555187     3.80   0.000     .1023578    .3199872
     event_5 |   .2476516   .0617589     4.01   0.000     .1266064    .3686967
     event_6 |   .2740641   .0741409     3.70   0.000     .1287506    .4193775
     event_7 |    .266887   .0795364     3.36   0.001     .1109984    .4227755
     event_8 |   .2595721   .0861989     3.01   0.003     .0906254    .4285188
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m8 |  -.0120203   .0361793    -0.33   0.740    -.0829305    .0588899
    event_m7 |  -.0259118   .0349025    -0.74   0.458    -.0943195    .0424959
    event_m6 |   .0149956   .0370046     0.41   0.685    -.0575322    .0875234
    event_m5 |    .006922   .0309063     0.22   0.823    -.0536533    .0674973
    event_m4 |   .0420468   .0215366     1.95   0.051    -.0001642    .0842577
    event_m3 |   .0061211   .0219985     0.28   0.781    -.0369952    .0492374
    event_m2 |  -.0216588   .0149422    -1.45   0.147     -.050945    .0076274
    event_m1 |  -.0112155   .0081816    -1.37   0.170    -.0272511    .0048201
     event_1 |   .0305676   .0174002     1.76   0.079    -.0035362    .0646714
     event_2 |   .0710858   .0182204     3.90   0.000     .0353744    .1067971
     event_3 |   .0847575   .0223881     3.79   0.000     .0408777    .1286373
     event_4 |   .0821444   .0283651     2.90   0.004     .0265498    .1377391
     event_5 |   .0546642   .0407723     1.34   0.180     -.025248    .1345764
     event_6 |   .0838544   .0340597     2.46   0.014     .0170987    .1506101
     event_7 |   .0612649   .0329591     1.86   0.063    -.0033336    .1258635
     event_8 |   .0598132   .0347081     1.72   0.085    -.0082135    .1278399
-------------+----------------------------------------------------------------
lnK          |
    event_m8 |   .2864989   .0969721     2.95   0.003     .0964371    .4765608
    event_m7 |   .3052429   .0798246     3.82   0.000     .1487896    .4616963
    event_m6 |   .3356575    .076488     4.39   0.000     .1857438    .4855711
    event_m5 |    .324986    .066163     4.91   0.000     .1953089    .4546631
    event_m4 |   .2586025   .0614824     4.21   0.000     .1380993    .3791057
    event_m3 |   .1429703   .0530355     2.70   0.007     .0390227    .2469179
    event_m2 |   .0914976   .0387549     2.36   0.018     .0155393    .1674558
    event_m1 |   .0670479   .0407155     1.65   0.100    -.0127531    .1468489
     event_1 |  -.0162468   .0348807    -0.47   0.641    -.0846118    .0521183
     event_2 |  -.0154412   .0477035    -0.32   0.746    -.1089384    .0780559
     event_3 |  -.0911143   .0685876    -1.33   0.184    -.2255435    .0433149
     event_4 |  -.1626219   .0765951    -2.12   0.034    -.3127456   -.0124982
     event_5 |  -.2551971    .089883    -2.84   0.005    -.4313647   -.0790296
     event_6 |  -.2727326   .1055975    -2.58   0.010    -.4796999   -.0657654
     event_7 |   -.236037   .1259827    -1.87   0.061    -.4829585    .0108846
     event_8 |  -.2886115   .1400556    -2.06   0.039    -.5631154   -.0141076
-------------+----------------------------------------------------------------
lnL          |
    event_m8 |   .1511593   .0796366     1.90   0.058    -.0049255    .3072441
    event_m7 |   .1452833   .0582192     2.50   0.013     .0311757    .2593909
    event_m6 |   .1278449   .0551552     2.32   0.020     .0197427    .2359472
    event_m5 |   .1022537   .0455224     2.25   0.025     .0130314     .191476
    event_m4 |    .087826   .0347455     2.53   0.011      .019726     .155926
    event_m3 |    .072656   .0312592     2.32   0.020     .0113891    .1339229
    event_m2 |   .0220197   .0312068     0.71   0.480    -.0391446     .083184
    event_m1 |   .0082764   .0189052     0.44   0.662    -.0287771    .0453299
     event_1 |   .0247352   .0227213     1.09   0.276    -.0197977    .0692681
     event_2 |   .0113691   .0388366     0.29   0.770    -.0647492    .0874873
     event_3 |   .0130166   .0510411     0.26   0.799    -.0870221    .1130553
     event_4 |   .0538086   .0573623     0.94   0.348    -.0586194    .1662366
     event_5 |  -.0452466   .0691283    -0.65   0.513    -.1807356    .0902425
     event_6 |  -.0419894   .0677288    -0.62   0.535    -.1747354    .0907566
     event_7 |  -.0076101   .0876428    -0.09   0.931    -.1793868    .1641666
     event_8 |   .0716729   .0673764     1.06   0.287    -.0603825    .2037282
-------------+----------------------------------------------------------------
exporter     |
    event_m8 |   -.040951   .0276459    -1.48   0.139     -.095136    .0132341
    event_m7 |   -.021573   .0216693    -1.00   0.319     -.064044    .0208979
    event_m6 |   -.014226   .0212376    -0.67   0.503     -.055851     .027399
    event_m5 |  -.0081762    .021691    -0.38   0.706    -.0506899    .0343375
    event_m4 |   -.034448   .0179333    -1.92   0.055    -.0695965    .0007006
    event_m3 |  -.0094379   .0140247    -0.67   0.501    -.0369259      .01805
    event_m2 |  -.0272982   .0126129    -2.16   0.030    -.0520191   -.0025773
    event_m1 |  -.0035076   .0098914    -0.35   0.723    -.0228943    .0158791
     event_1 |   .0144666     .01041     1.39   0.165    -.0059365    .0348698
     event_2 |   .0164302   .0121994     1.35   0.178    -.0074802    .0403406
     event_3 |   .0274169   .0180903     1.52   0.130    -.0080395    .0628733
     event_4 |    .038561   .0198812     1.94   0.052    -.0004054    .0775275
     event_5 |   .0249084   .0244258     1.02   0.308    -.0229653    .0727821
     event_6 |   .0214984   .0219237     0.98   0.327    -.0214712     .064468
     event_7 |  -.0115455   .0279067    -0.41   0.679    -.0662416    .0431506
     event_8 |   .0104561   .0275402     0.38   0.704    -.0435217    .0644338
-------------+----------------------------------------------------------------
lnQ          |
    event_m8 |   .1756512   .1024559     1.71   0.086    -.0251588    .3764612
    event_m7 |    .194985    .083172     2.34   0.019     .0319709     .357999
    event_m6 |   .2624809   .0838804     3.13   0.002     .0980784    .4268834
    event_m5 |   .1837349   .0653985     2.81   0.005     .0555563    .3119136
    event_m4 |   .2177612   .0538544     4.04   0.000     .1122084     .323314
    event_m3 |   .1340502   .0424176     3.16   0.002     .0509133    .2171871
    event_m2 |   .0547197   .0362028     1.51   0.131    -.0162365    .1256758
    event_m1 |   .0226947   .0315151     0.72   0.471    -.0390738    .0844632
     event_1 |   .1188146   .0417485     2.85   0.004     .0369891    .2006401
     event_2 |   .1962458    .038745     5.07   0.000     .1203069    .2721846
     event_3 |   .2370301   .0664622     3.57   0.000     .1067666    .3672937
     event_4 |   .2649811   .0706022     3.75   0.000     .1266033    .4033589
     event_5 |    .202405   .0757343     2.67   0.008     .0539686    .3508415
     event_6 |   .2320747   .0861122     2.70   0.007     .0632978    .4008515
     event_7 |   .2592768   .1125886     2.30   0.021     .0386072    .4799465
     event_8 |    .331245   .1314255     2.52   0.012     .0736557    .5888343
------------------------------------------------------------------------------
  13,214
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m8
Estimating lnQL: event_m7
Estimating lnQL: event_m6
Estimating lnQL: event_m5
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating lnQL: event_5
Estimating lnQL: event_6
Estimating lnQL: event_7
Estimating lnQL: event_8
Estimating TFP_cd: event_m8
Estimating TFP_cd: event_m7
Estimating TFP_cd: event_m6
Estimating TFP_cd: event_m5
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating TFP_cd: event_5
Estimating TFP_cd: event_6
Estimating TFP_cd: event_7
Estimating TFP_cd: event_8
Estimating lnK: event_m8
Estimating lnK: event_m7
Estimating lnK: event_m6
Estimating lnK: event_m5
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnK: event_5
Estimating lnK: event_6
Estimating lnK: event_7
Estimating lnK: event_8
Estimating lnL: event_m8
Estimating lnL: event_m7
Estimating lnL: event_m6
Estimating lnL: event_m5
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating lnL: event_5
Estimating lnL: event_6
Estimating lnL: event_7
Estimating lnL: event_8
Estimating exporter: event_m8
Estimating exporter: event_m7
Estimating exporter: event_m6
Estimating exporter: event_m5
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating exporter: event_5
Estimating exporter: event_6
Estimating exporter: event_7
Estimating exporter: event_8
Estimating lnQ: event_m8
Estimating lnQ: event_m7
Estimating lnQ: event_m6
Estimating lnQ: event_m5
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQ: event_5
Estimating lnQ: event_6
Estimating lnQ: event_7
Estimating lnQ: event_8
Callaway Sant'Anna (2021)

                                                Number of obs     =     14,533

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m8 |   .1102726   .0906059     1.22   0.224    -.0673116    .2878568
    event_m7 |   .1123162   .0947014     1.19   0.236    -.0732952    .2979275
    event_m6 |   .0898919   .0932499     0.96   0.335    -.0928745    .2726583
    event_m5 |   .0459455   .0808269     0.57   0.570    -.1124723    .2043633
    event_m4 |   .1099361   .0599053     1.84   0.066    -.0074761    .2273483
    event_m3 |   .0261679   .0469642     0.56   0.577    -.0658803     .118216
    event_m2 |   .0314215   .0560869     0.56   0.575    -.0785067    .1413498
    event_m1 |   .0234509   .0209236     1.12   0.262    -.0175586    .0644604
     event_1 |   .1592532   .0421926     3.77   0.000     .0765573    .2419491
     event_2 |   .2804584   .0709197     3.95   0.000     .1414583    .4194585
     event_3 |   .3327485   .0756204     4.40   0.000     .1845353    .4809617
     event_4 |   .3180989   .0686802     4.63   0.000     .1834881    .4527097
     event_5 |   .2781491   .0880794     3.16   0.002     .1055167    .4507814
     event_6 |   .3400989   .0924431     3.68   0.000     .1589137     .521284
     event_7 |   .3472329   .1077087     3.22   0.001     .1361278    .5583381
     event_8 |   .3122184   .0952789     3.28   0.001     .1254752    .4989617
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m8 |   .0021786    .035412     0.06   0.951    -.0672276    .0715848
    event_m7 |  -.0220592   .0474263    -0.47   0.642    -.1150131    .0708947
    event_m6 |   -.001463    .040931    -0.04   0.971    -.0816862    .0787603
    event_m5 |   -.001748    .030904    -0.06   0.955    -.0623187    .0588228
    event_m4 |   .0646655   .0318798     2.03   0.043     .0021823    .1271488
    event_m3 |   .0172131   .0206928     0.83   0.405     -.023344    .0577702
    event_m2 |   .0015495   .0196894     0.08   0.937     -.037041      .04014
    event_m1 |   .0099661    .011951     0.83   0.404    -.0134573    .0333896
     event_1 |   .0628606   .0238415     2.64   0.008     .0161322     .109589
     event_2 |   .1002487   .0300763     3.33   0.001     .0413002    .1591972
     event_3 |   .0965747   .0284339     3.40   0.001     .0408453     .152304
     event_4 |   .0985166   .0465682     2.12   0.034     .0072447    .1897885
     event_5 |   .0621785    .061986     1.00   0.316    -.0593119    .1836689
     event_6 |   .1131715   .0441166     2.57   0.010     .0267046    .1996384
     event_7 |   .1022737   .0436848     2.34   0.019     .0166531    .1878943
     event_8 |   .0915837   .0525782     1.74   0.082    -.0114677     .194635
-------------+----------------------------------------------------------------
lnK          |
    event_m8 |  -.0468615   .1285212    -0.36   0.715    -.2987584    .2050353
    event_m7 |   .0219356   .1062365     0.21   0.836    -.1862843    .2301554
    event_m6 |   .0397853   .0866941     0.46   0.646     -.130132    .2097025
    event_m5 |   .0788536   .0808642     0.98   0.329    -.0796373    .2373445
    event_m4 |   .1001359   .0979785     1.02   0.307    -.0918984    .2921702
    event_m3 |   -.012081   .0964418    -0.13   0.900    -.2011034    .1769415
    event_m2 |  -.0372534   .0683151    -0.55   0.586    -.1711485    .0966417
    event_m1 |   .0254111   .0485191     0.52   0.600    -.0696847    .1205068
     event_1 |    .085797   .0442422     1.94   0.052    -.0009161    .1725101
     event_2 |   .1697024   .0603167     2.81   0.005     .0514838    .2879211
     event_3 |   .1868858   .0750031     2.49   0.013     .0398824    .3338893
     event_4 |   .1595769   .0747185     2.14   0.033     .0131312    .3060225
     event_5 |   .1598338   .0910801     1.75   0.079    -.0186798    .3383475
     event_6 |     .21939   .1010015     2.17   0.030     .0214307    .4173492
     event_7 |   .2146708   .1293258     1.66   0.097    -.0388032    .4681448
     event_8 |     .14093   .1236419     1.14   0.254    -.1014036    .3832636
-------------+----------------------------------------------------------------
lnL          |
    event_m8 |  -.0995834   .1112368    -0.90   0.371    -.3176034    .1184366
    event_m7 |  -.0723959   .0771305    -0.94   0.348    -.2235689    .0787771
    event_m6 |  -.0792867   .0591955    -1.34   0.180    -.1953078    .0367344
    event_m5 |  -.0098126    .061614    -0.16   0.873    -.1305738    .1109486
    event_m4 |   .0001956   .0510906     0.00   0.997    -.0999402    .1003314
    event_m3 |  -.0298052   .0451192    -0.66   0.509    -.1182373    .0586269
    event_m2 |   -.049521   .0400729    -1.24   0.217    -.1280624    .0290204
    event_m1 |  -.0159747   .0272554    -0.59   0.558    -.0693943    .0374449
     event_1 |   .0724903   .0268838     2.70   0.007     .0197991    .1251815
     event_2 |   .0990982   .0346788     2.86   0.004      .031129    .1670675
     event_3 |   .1406848   .0420956     3.34   0.001     .0581788    .2231907
     event_4 |   .1911633   .0554063     3.45   0.001     .0825689    .2997577
     event_5 |   .1696925   .0674653     2.52   0.012     .0374629     .301922
     event_6 |   .1737751   .0732004     2.37   0.018      .030305    .3172452
     event_7 |    .189774   .0963881     1.97   0.049     .0008568    .3786912
     event_8 |   .2824623   .0736461     3.84   0.000     .1381186    .4268061
-------------+----------------------------------------------------------------
exporter     |
    event_m8 |   -.020069   .0293109    -0.68   0.494    -.0775174    .0373794
    event_m7 |   .0222242   .0311582     0.71   0.476    -.0388447     .083293
    event_m6 |  -.0251809   .0276145    -0.91   0.362    -.0793044    .0289426
    event_m5 |  -.0131458   .0262653    -0.50   0.617    -.0646249    .0383332
    event_m4 |  -.0311807   .0240744    -1.30   0.195    -.0783657    .0160044
    event_m3 |   .0049576   .0260153     0.19   0.849    -.0460315    .0559467
    event_m2 |  -.0213948   .0237543    -0.90   0.368    -.0679524    .0251628
    event_m1 |   .0008242   .0178162     0.05   0.963    -.0340949    .0357432
     event_1 |   .0404466   .0136956     2.95   0.003     .0136036    .0672895
     event_2 |   .0382557    .017321     2.21   0.027     .0043073    .0722042
     event_3 |   .0364916   .0224302     1.63   0.104    -.0074709    .0804541
     event_4 |   .0545401   .0206834     2.64   0.008     .0140015    .0950787
     event_5 |   .0427512    .019593     2.18   0.029     .0043497    .0811528
     event_6 |   .0234458   .0177715     1.32   0.187    -.0113856    .0582772
     event_7 |  -.0022706    .025969    -0.09   0.930     -.053169    .0486278
     event_8 |   .0015885   .0322149     0.05   0.961    -.0615515    .0647285
-------------+----------------------------------------------------------------
lnQ          |
    event_m8 |   .0106892   .1250505     0.09   0.932    -.2344052    .2557836
    event_m7 |   .0399202   .1277613     0.31   0.755    -.2104874    .2903279
    event_m6 |   .0106052   .1019175     0.10   0.917    -.1891494    .2103598
    event_m5 |   .0361329   .0910947     0.40   0.692    -.1424095    .2146753
    event_m4 |   .1101317   .0752642     1.46   0.143    -.0373836    .2576469
    event_m3 |  -.0036374   .0735836    -0.05   0.961    -.1478585    .1405838
    event_m2 |  -.0180995   .0757528    -0.24   0.811    -.1665723    .1303732
    event_m1 |   .0074762    .035607     0.21   0.834    -.0623122    .0772647
     event_1 |   .2317435   .0480049     4.83   0.000     .1376556    .3258313
     event_2 |   .3795567   .0740894     5.12   0.000      .234344    .5247693
     event_3 |   .4734332   .0869933     5.44   0.000     .3029295     .643937
     event_4 |   .5092622   .0955013     5.33   0.000      .322083    .6964414
     event_5 |   .4478415   .1136971     3.94   0.000     .2249993    .6706838
     event_6 |    .513874   .1133794     4.53   0.000     .2916544    .7360935
     event_7 |   .5370069   .1407349     3.82   0.000     .2611716    .8128423
     event_8 |   .5946808    .115406     5.15   0.000     .3684891    .8208724
------------------------------------------------------------------------------
  14,533

. 
. esttab model* using "`here'/output/table_attgt_8.tex", mtitle b(3) se(3) replace
(note: file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_8.tex not found)
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_8.tex)

. esttab model* using "`here'/output/table_attgt_8.txt", mtitle b(3) se(3) replace
(note: file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_8.txt not found)
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_8.txt)

. 
. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_8.log
  log type:  text
 closed on:   1 Jul 2021, 15:24:11
--------------------------------------------------------------------------------------------------------------------------------------------------------------
