--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_loop_att.log
  log type:  text
 opened on:   8 Jul 2021, 17:59:56

. 
. use "`here'/temp/analysis_sample.dta"

. 
. rename ever_foreign ef

. rename ever_foreign_hire efh

. rename has_expat_ceo has_expat

. 
. gen lnIK = ln(immat_18)
(7,125 missing values generated)

. gen lnIK_0 = lnIK
(7,125 missing values generated)

. replace lnIK_0 = 0 if immat_18 == 0
(1,274 real changes made)

. 
. replace export_18 = 0 if export_18 == .
(2,465 real changes made)

. gen Qh = sales_18 - export_18

. gen lnQh = ln(Qh)
(121 missing values generated)

. gen lnQhr = lnQ - lnQh
(121 missing values generated)

. 
. foreach depvar in TFP_cd lnIK_0 lnQh lnQhr {
  2.         foreach var in foreign foreign_hire has_expat {
  3.                 attgt `depvar', treatment(`var') aggregate(att) reps(20) notyet limitcontrol(foreign == 0)
  4.                 count if e(sample) == 1
  5.                 eststo model_`sample'`var'`depvar', title("`depvar' `sample' `var'")
  6.         }
  7. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                Number of obs     =     15,674

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .0379195   .0181771     2.09   0.037      .002293     .073546
------------------------------------------------------------------------------
  15,674
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                Number of obs     =     13,774

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .0659518   .0220909     2.99   0.003     .0226544    .1092492
------------------------------------------------------------------------------
  13,774
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                Number of obs     =     11,727

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .1194061   .0390856     3.05   0.002     .0427997    .1960125
------------------------------------------------------------------------------
  11,727
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      8,307

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .3670408    .165787     2.21   0.027     .0421042    .6919773
------------------------------------------------------------------------------
  8,307
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,390

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .3785744   .2137841     1.77   0.077    -.0404348    .7975837
------------------------------------------------------------------------------
  7,390
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      6,232

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .6912762    .266566     2.59   0.010     .1688164    1.213736
------------------------------------------------------------------------------
  6,232
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: att
Callaway Sant'Anna (2021)

                                                Number of obs     =     15,653

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .1435182   .0611196     2.35   0.019      .023726    .2633105
------------------------------------------------------------------------------
  15,653
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: att
Callaway Sant'Anna (2021)

                                                Number of obs     =     13,741

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .1783339   .0758386     2.35   0.019      .029693    .3269748
------------------------------------------------------------------------------
  13,741
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: att
Callaway Sant'Anna (2021)

                                                Number of obs     =     11,690

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |    .347941   .1345711     2.59   0.010     .0841864    .6116955
------------------------------------------------------------------------------
  11,690
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: att
Callaway Sant'Anna (2021)

                                                Number of obs     =     15,653

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .1262185   .0285971     4.41   0.000     .0701692    .1822678
------------------------------------------------------------------------------
  15,653
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: att
Callaway Sant'Anna (2021)

                                                Number of obs     =     13,741

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .1687336   .0368857     4.57   0.000      .096439    .2410282
------------------------------------------------------------------------------
  13,741
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: att
Callaway Sant'Anna (2021)

                                                Number of obs     =     11,690

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .2969782   .0593537     5.00   0.000     .1806472    .4133092
------------------------------------------------------------------------------
  11,690

. 
. esttab model* using "`here'/output/table_attgt_loop_att.tex", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_loop_att.tex)

. esttab model* using "`here'/output/table_attgt_loop_att.txt", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_loop_att.txt)

. 
. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_loop_att.log
  log type:  text
 closed on:   8 Jul 2021, 18:05:30
--------------------------------------------------------------------------------------------------------------------------------------------------------------
