--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_loop_att5.log
  log type:  text
 opened on:  13 Jul 2021, 18:46:23

. 
. use "`here'/temp/analysis_sample.dta"

. 
. rename ever_foreign ef

. rename ever_foreign_hire efh

. rename has_expat_ceo has_expat

. 
. gen lnIK = ln(immat_18)
(5,130 missing values generated)

. gen lnIK_0 = lnIK
(5,130 missing values generated)

. replace lnIK_0 = 0 if immat_18 == 0
(857 real changes made)

. 
. replace export_18 = 0 if export_18 == .
(1,473 real changes made)

. gen Qh = sales_18 - export_18

. gen lnQh = ln(Qh)
(122 missing values generated)

. gen lnQhr = lnQ - lnQh
(122 missing values generated)

. 
. foreach depvar in TFP_cd lnIK_0 lnQh lnQhr {
  2.         foreach var in foreign_only foreign_hire_only has_expat {
  3.                 attgt `depvar', treatment(`var') aggregate(att) pre(5) post(5) reps(20) notyet limitcontrol(foreign == 0)
  4.                 count if e(sample) == 1
  5.                 eststo m`var'`depvar', title("`depvar' `var'")
  6.         }
  7.         
.         foreach var in foreign_hire_only has_expat {
  8.                 attgt `depvar' if efh, treatment(`var') aggregate(att) pre(5) post(5) reps(20) notyet limitcontrol(foreign == 0)
  9.                 count if e(sample) == 1
 10.                 eststo mh`var'`depvar', title("efh `depvar' `var'")
 11.         }
 12. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,506

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |  -.0063867   .0281758    -0.23   0.821    -.0616102    .0488369
------------------------------------------------------------------------------
  7,506
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,256

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .0106712   .0410552     0.26   0.795    -.0697956    .0911379
------------------------------------------------------------------------------
  7,256
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,952

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .1142596   .0353909     3.23   0.001     .0448947    .1836245
------------------------------------------------------------------------------
  7,952
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,894

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .0193036   .0355508     0.54   0.587    -.0503748    .0889819
------------------------------------------------------------------------------
  4,894
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,590

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .1231415   .0383101     3.21   0.001     .0480551     .198228
------------------------------------------------------------------------------
  5,590
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,089

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .2503963    .291088     0.86   0.390    -.3201257    .8209184
------------------------------------------------------------------------------
  4,089
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      3,987

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .0090897   .3301168     0.03   0.978    -.6379274    .6561067
------------------------------------------------------------------------------
  3,987
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,202

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .8171302   .3005529     2.72   0.007     .2280574    1.406203
------------------------------------------------------------------------------
  4,202
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      2,636

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .1224615   .2576426     0.48   0.635    -.3825087    .6274316
------------------------------------------------------------------------------
  2,636
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      2,851

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .8804048   .3043762     2.89   0.004     .2838384    1.476971
------------------------------------------------------------------------------
  2,851
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,485

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .2442448   .1006898     2.43   0.015     .0468963    .4415932
------------------------------------------------------------------------------
  7,485
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,238

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .0957593   .1161164     0.82   0.410    -.1318245    .3233432
------------------------------------------------------------------------------
  7,238
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,893

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .4156111   .1912399     2.17   0.030     .0407878    .7904345
------------------------------------------------------------------------------
  7,893
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,862

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .1366357   .1100925     1.24   0.215    -.0791418    .3524131
------------------------------------------------------------------------------
  4,862
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,517

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |    .438365   .1229255     3.57   0.000     .1974355    .6792946
------------------------------------------------------------------------------
  5,517
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,485

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .0338221   .0469872     0.72   0.472    -.0582712    .1259154
------------------------------------------------------------------------------
  7,485
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,238

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .0450395   .0545093     0.83   0.409    -.0617967    .1518757
------------------------------------------------------------------------------
  7,238
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,893

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .3238898   .0477713     6.78   0.000     .2302597    .4175198
------------------------------------------------------------------------------
  7,893
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,862

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .0415775   .0546149     0.76   0.446    -.0654657    .1486207
------------------------------------------------------------------------------
  4,862
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,517

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .3300851   .0562704     5.87   0.000     .2197971    .4403731
------------------------------------------------------------------------------
  5,517

. 
. esttab m* using "`here'/output/table_attgt_loop_att5.tex", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_loop_att5.tex)

. esttab m* using "`here'/output/table_attgt_loop_att5.txt", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_loop_att5.txt)

. 
. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_loop_att5.log
  log type:  text
 closed on:  13 Jul 2021, 18:48:07
--------------------------------------------------------------------------------------------------------------------------------------------------------------
