--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_att.log
  log type:  text
 opened on:  13 Jul 2021, 18:32:06

. 
. use "`here'/temp/analysis_sample.dta", clear

. 
. rename ever_foreign ef

. rename ever_foreign_hire efh

. rename has_expat_ceo has_expat

. 
. foreach var in foreign_only foreign_hire_only has_expat {
  2.         attgt lnQL lnK lnL exporter lnQ, treatment(`var') aggregate(att) reps(20) notyet limitcontrol(foreign == 0)
  3.         count if e(sample) == 1
  4.         eststo m`var', title("`var'")
  5. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: att
Estimating lnK: att
Estimating lnL: att
Estimating exporter: att
Estimating lnQ: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,693

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
         att |   .0019182   .0691092     0.03   0.978    -.1335334    .1373697
-------------+----------------------------------------------------------------
lnK          |
         att |   .0422317   .0859749     0.49   0.623     -.126276    .2107394
-------------+----------------------------------------------------------------
lnL          |
         att |   .1202502    .046983     2.56   0.010     .0281653    .2123352
-------------+----------------------------------------------------------------
exporter     |
         att |   .0044046   .0156915     0.28   0.779    -.0263502    .0351594
-------------+----------------------------------------------------------------
lnQ          |
         att |   .1221684   .0809158     1.51   0.131    -.0364236    .2807604
------------------------------------------------------------------------------
  7,693
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: att
Estimating lnK: att
Estimating lnL: att
Estimating exporter: att
Estimating lnQ: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,424

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
         att |  -.0598466   .0659957    -0.91   0.364    -.1891957    .0695025
-------------+----------------------------------------------------------------
lnK          |
         att |  -.0767824     .12075    -0.64   0.525    -.3134481    .1598832
-------------+----------------------------------------------------------------
lnL          |
         att |   .1695566   .0883953     1.92   0.055    -.0036949    .3428081
-------------+----------------------------------------------------------------
exporter     |
         att |    .011839   .0200121     0.59   0.554     -.027384     .051062
-------------+----------------------------------------------------------------
lnQ          |
         att |     .10971   .1026595     1.07   0.285    -.0914989    .3109189
------------------------------------------------------------------------------
  7,424
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: att
Estimating lnK: att
Estimating lnL: att
Estimating exporter: att
Estimating lnQ: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      8,250

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
         att |   .3189124   .0896834     3.56   0.000     .1431363    .4946886
-------------+----------------------------------------------------------------
lnK          |
         att |   .2455252   .1037622     2.37   0.018     .0421551    .4488953
-------------+----------------------------------------------------------------
lnL          |
         att |   .2030542   .0754032     2.69   0.007     .0552667    .3508418
-------------+----------------------------------------------------------------
exporter     |
         att |   .0642609   .0335134     1.92   0.055    -.0014242    .1299459
-------------+----------------------------------------------------------------
lnQ          |
         att |   .5219667     .14397     3.63   0.000     .2397908    .8041426
------------------------------------------------------------------------------
  8,250

. 
. foreach var in foreign_hire_only has_expat {
  2.                 attgt lnQL lnK lnL exporter lnQ if efh, treatment(`var') aggregate(att) reps(20) notyet limitcontrol(foreign == 0)
  3.                 count if e(sample) == 1
  4.                 eststo mh`var', title("efh `var'")
  5. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: att
Estimating lnK: att
Estimating lnL: att
Estimating exporter: att
Estimating lnQ: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,037

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
         att |  -.0521357   .0600513    -0.87   0.385    -.1698341    .0655627
-------------+----------------------------------------------------------------
lnK          |
         att |  -.0463953    .114325    -0.41   0.685    -.2704681    .1776775
-------------+----------------------------------------------------------------
lnL          |
         att |   .2009354   .0855097     2.35   0.019     .0333395    .3685314
-------------+----------------------------------------------------------------
exporter     |
         att |   .0281563   .0247599     1.14   0.255    -.0203723    .0766848
-------------+----------------------------------------------------------------
lnQ          |
         att |   .1487997   .0943505     1.58   0.115    -.0361239    .3337234
------------------------------------------------------------------------------
  5,037
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: att
Estimating lnK: att
Estimating lnL: att
Estimating exporter: att
Estimating lnQ: att
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,858

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
         att |   .3159308   .0593267     5.33   0.000     .1996526    .4322091
-------------+----------------------------------------------------------------
lnK          |
         att |   .2625317   .0665483     3.94   0.000     .1320993     .392964
-------------+----------------------------------------------------------------
lnL          |
         att |   .2392737   .0703724     3.40   0.001     .1013464     .377201
-------------+----------------------------------------------------------------
exporter     |
         att |   .0779601   .0241165     3.23   0.001     .0306926    .1252277
-------------+----------------------------------------------------------------
lnQ          |
         att |   .5552046   .0975337     5.69   0.000      .364042    .7463672
------------------------------------------------------------------------------
  5,858

. 
. esttab m* using "`here'/output/table_attgt_att.tex", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_att.tex)

. esttab m* using "`here'/output/table_attgt_att.txt", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_att.txt)

. 
. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_att.log
  log type:  text
 closed on:  13 Jul 2021, 18:33:49
--------------------------------------------------------------------------------------------------------------------------------------------------------------
