--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt.log
  log type:  text
 opened on:  24 Jun 2021, 22:34:40

. 
. use "`here'/temp/analysis_sample.dta"

. 
. *attgt exporter lnQL if inrange(year, 1992, 2004) & ever_foreign, treatment(has_expat_ceo ) aggregate(e) pre(2) post(3) reps(20)
. *matrix list e(b)
. *esttab
. 
. *foreach var in exporter lnQL {
. *       attgt `var' if inrange(year, 1992, 2004) & ever_foreign, treatment(has_expat_ceo ) aggregate(e) pre(2) post(3) reps(20)
. *       matrix list e(b)
. *       esttab
. *}
. 
. rename ever_foreign ef

. rename ever_foreign_hire efh

. rename has_expat_ceo has_expat

. 
. gen lnIK = ln(immat_18)
(139,036 missing values generated)

. gen lnIK_0=lnIK
(139,036 missing values generated)

. replace lnIK_0=0 if immat_18==0
(40,686 real changes made)

. gen lnEx=ln(export_18)
(198,574 missing values generated)

. gen Qh=sales_18-export_18
(79,688 missing values generated)

. gen lnQh=ln(Qh)
(80,529 missing values generated)

. 
. foreach sample in ef efh {
  2.         foreach var in foreign foreign_hire has_expat {
  3.                 *eststo: attgt exporter lnQL if inrange(year, 1992, 2004) & ever_foreign, treatment(`var') aggregate(e) pre(2) post(3) reps(20)
.                 *attgt exporter lnQL if inrange(year, 1992, 2004) & ever_foreign, treatment(`var') aggregate(e) pre(2) post(3) reps(20)
.                 attgt lnQL TFP_cd lnK lnIK_0 lnL exporter lnQ lnQh lnEx if `sample', treatment(`var') aggregate(e) pre(4) post(4) reps(20) notyet
  4.                 count if e(sample) == 1
  5.                 eststo model_`sample'`var', title("`sample' `var'")
  6.                 *matrix list e(b)
.         }
  7. 
.         *esttab model_`sample'* using "`here'/output/table_`sample'_attgt.tex", mtitle title("`sample'") b(3) se(3) replace
.         *esttab model_`sample'* using "`here'/output/table_`sample'_attgt.txt", mtitle title("`sample'") b(3) se(3) replace
. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnEx: event_m4
Estimating lnEx: event_m3
Estimating lnEx: event_m2
Estimating lnEx: event_m1
Estimating lnEx: event_1
Estimating lnEx: event_2
Estimating lnEx: event_3
Estimating lnEx: event_4
Callaway Sant'Anna (2021)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m4 |  -3.272792   .7200789    -4.55   0.000    -4.684121   -1.861463
    event_m3 |  -1.884463   .5854468    -3.22   0.001    -3.031917   -.7370082
    event_m2 |   -1.80185   .4573557    -3.94   0.000     -2.69825   -.9054489
    event_m1 |  -.1201256   .1650677    -0.73   0.467    -.4436525    .2034012
     event_1 |   5.585639   .3332045    16.76   0.000      4.93257    6.238708
     event_2 |   4.181629   .6016044     6.95   0.000     3.002506    5.360752
     event_3 |   4.451368   .5841151     7.62   0.000     3.306523    5.596212
     event_4 |   4.272243   .7744211     5.52   0.000     2.754406    5.790081
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m4 |   .0113031    .023557     0.48   0.631    -.0348677    .0574739
    event_m3 |   .0174996   .0138407     1.26   0.206    -.0096277     .044627
    event_m2 |  -.0090197   .0162163    -0.56   0.578     -.040803    .0227636
    event_m1 |   .0052298   .0130935     0.40   0.690    -.0204329    .0308926
     event_1 |   .0407669   .0125971     3.24   0.001      .016077    .0654567
     event_2 |   .0358066   .0172715     2.07   0.038      .001955    .0696582
     event_3 |   .0178865   .0188715     0.95   0.343     -.019101    .0548739
     event_4 |   .0265012   .0275005     0.96   0.335    -.0273989    .0804012
-------------+----------------------------------------------------------------
lnK          |
    event_m4 |  -3.929139    .925033    -4.25   0.000    -5.742171   -2.116108
    event_m3 |  -2.357549   .6877535    -3.43   0.001    -3.705521   -1.009577
    event_m2 |  -2.163859   .5143721    -4.21   0.000    -3.172009   -1.155708
    event_m1 |  -.1434256   .1773411    -0.81   0.419    -.4910078    .2041565
     event_1 |   6.692404   .4065469    16.46   0.000     5.895586    7.489221
     event_2 |   4.983705   .6753567     7.38   0.000      3.66003    6.307379
     event_3 |    5.43605   .7030488     7.73   0.000     4.058099       6.814
     event_4 |   5.296773   .9235725     5.74   0.000     3.486605    7.106942
-------------+----------------------------------------------------------------
lnIK_0       |
    event_m4 |  -1.961344   .5252266    -3.73   0.000     -2.99077   -.9319191
    event_m3 |  -1.280911   .4837192    -2.65   0.008    -2.228983    -.332839
    event_m2 |  -1.283628   .4384828    -2.93   0.003    -2.143039   -.4242176
    event_m1 |  -.0830337   .1789294    -0.46   0.643    -.4337288    .2676614
     event_1 |   3.981303   .2736249    14.55   0.000     3.445008    4.517598
     event_2 |    3.20895   .5274597     6.08   0.000     2.175148    4.242752
     event_3 |   3.241998   .4727836     6.86   0.000     2.315359    4.168637
     event_4 |   3.168693   .5594009     5.66   0.000     2.072288    4.265099
-------------+----------------------------------------------------------------
lnL          |
    event_m4 |  -1.144635   .2902897    -3.94   0.000    -1.713592   -.5756773
    event_m3 |  -.7536257   .2194061    -3.43   0.001    -1.183654   -.3235976
    event_m2 |  -.7482835   .1920095    -3.90   0.000    -1.124615   -.3719518
    event_m1 |   -.034479   .0725374    -0.48   0.635    -.1766496    .1076917
     event_1 |   2.238479   .1291792    17.33   0.000     1.985292    2.491666
     event_2 |    1.79748   .2737839     6.57   0.000     1.260873    2.334086
     event_3 |      1.941    .258902     7.50   0.000     1.433561    2.448438
     event_4 |   1.838647   .3044646     6.04   0.000     1.241907    2.435386
-------------+----------------------------------------------------------------
exporter     |
    event_m4 |  -.3290991   .0710393    -4.63   0.000    -.4683337   -.1898646
    event_m3 |  -.1943162   .0559567    -3.47   0.001    -.3039892   -.0846431
    event_m2 |   -.186042   .0431767    -4.31   0.000    -.2706668   -.1014171
    event_m1 |  -.0158539    .016336    -0.97   0.332    -.0478719    .0161641
     event_1 |   .5604001    .031538    17.77   0.000     .4985868    .6222133
     event_2 |   .4189072   .0591094     7.09   0.000      .303055    .5347595
     event_3 |   .4498318   .0564783     7.96   0.000     .3391364    .5605272
     event_4 |   .4286403   .0757247     5.66   0.000     .2802227    .5770579
-------------+----------------------------------------------------------------
lnQ          |
    event_m4 |  -4.417427   1.001342    -4.41   0.000     -6.38002   -2.454833
    event_m3 |  -2.638089   .7956135    -3.32   0.001    -4.197462   -1.078715
    event_m2 |  -2.550133   .6329496    -4.03   0.000    -3.790692   -1.309575
    event_m1 |  -.1546047   .2196256    -0.70   0.481    -.5850628    .2758535
     event_1 |   7.824118   .4522668    17.30   0.000     6.937692    8.710545
     event_2 |   5.979109    .862432     6.93   0.000     4.288774    7.669445
     event_3 |   6.392367   .8191672     7.80   0.000     4.786829    7.997905
     event_4 |    6.11089   1.071152     5.70   0.000     4.011471    8.210309
-------------+----------------------------------------------------------------
lnQh         |
    event_m4 |  -4.022174   .9688905    -4.15   0.000    -5.921165   -2.123184
    event_m3 |  -2.361048   .7939645    -2.97   0.003     -3.91719   -.8049067
    event_m2 |  -2.443646   .6340257    -3.85   0.000    -3.686314   -1.200979
    event_m1 |  -.1060443   .2224816    -0.48   0.634    -.5421003    .3300117
     event_1 |   7.487391   .4509034    16.61   0.000     6.603636    8.371145
     event_2 |    5.72685   .8521352     6.72   0.000     4.056696    7.397004
     event_3 |   6.040595   .8079458     7.48   0.000     4.457051     7.62414
     event_4 |   5.634653    1.01815     5.53   0.000     3.639115    7.630191
-------------+----------------------------------------------------------------
lnEx         |
    event_m4 |  -3.404778   .7722928    -4.41   0.000    -4.918445   -1.891112
    event_m3 |   -2.20413   .6389366    -3.45   0.001    -3.456423   -.9518373
    event_m2 |   -1.80358   .4611862    -3.91   0.000    -2.707488   -.8996713
    event_m1 |  -.1778234   .1856599    -0.96   0.338    -.5417102    .1860634
     event_1 |   5.710257   .3253881    17.55   0.000     5.072509    6.348006
     event_2 |    4.40378   .5866785     7.51   0.000     3.253912    5.553649
     event_3 |   4.867597   .6095498     7.99   0.000     3.672901    6.062292
     event_4 |    4.75839   .8715218     5.46   0.000     3.050239    6.466542
------------------------------------------------------------------------------
  0
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnEx: event_m4
Estimating lnEx: event_m3
Estimating lnEx: event_m2
Estimating lnEx: event_m1
Estimating lnEx: event_1
Estimating lnEx: event_2
Estimating lnEx: event_3
Estimating lnEx: event_4
Callaway Sant'Anna (2021)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m4 |  -1.454042    .523296    -2.78   0.005    -2.479684   -.4284008
    event_m3 |  -.8084485   .4280546    -1.89   0.059     -1.64742    .0305231
    event_m2 |  -.6596162   .4258635    -1.55   0.121    -1.494293     .175061
    event_m1 |   .0977433   .2341948     0.42   0.676      -.36127    .5567567
     event_1 |   4.631154   .2439934    18.98   0.000     4.152936    5.109373
     event_2 |   3.125692   .3491513     8.95   0.000     2.441368    3.810016
     event_3 |   3.180422   .4865136     6.54   0.000     2.226873    4.133971
     event_4 |   2.974761   .5247913     5.67   0.000     1.946189    4.003333
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m4 |   .0306877   .0226971     1.35   0.176    -.0137977    .0751732
    event_m3 |   .0415779   .0182125     2.28   0.022     .0058821    .0772737
    event_m2 |   .0393383   .0141645     2.78   0.005     .0115764    .0671001
    event_m1 |   .0154314   .0145682     1.06   0.289    -.0131218    .0439845
     event_1 |   .0386044   .0109267     3.53   0.000     .0171885    .0600203
     event_2 |   .0334643   .0158288     2.11   0.035     .0024404    .0644883
     event_3 |   .0079577   .0179003     0.44   0.657    -.0271262    .0430415
     event_4 |   .0279595   .0221663     1.26   0.207    -.0154857    .0714046
-------------+----------------------------------------------------------------
lnK          |
    event_m4 |  -1.764462   .5981572    -2.95   0.003    -2.936828   -.5920949
    event_m3 |  -1.069555   .5066706    -2.11   0.035    -2.062611   -.0764988
    event_m2 |  -.8342901    .482298    -1.73   0.084    -1.779577    .1109967
    event_m1 |    .114123   .2831099     0.40   0.687    -.4407621    .6690082
     event_1 |   5.567569    .341465    16.30   0.000      4.89831    6.236828
     event_2 |   3.692874   .4514993     8.18   0.000     2.807952    4.577797
     event_3 |   3.754783   .6039543     6.22   0.000     2.571055    4.938512
     event_4 |   3.478281   .6173119     5.63   0.000     2.268372     4.68819
-------------+----------------------------------------------------------------
lnIK_0       |
    event_m4 |  -1.204977   .5114711    -2.36   0.018    -2.207442   -.2025125
    event_m3 |  -.6726717   .3998199    -1.68   0.092    -1.456304    .1109609
    event_m2 |  -.7669942   .4129878    -1.86   0.063    -1.576435    .0424471
    event_m1 |   .0607142   .2616321     0.23   0.816    -.4520752    .5735036
     event_1 |    3.36218   .2719838    12.36   0.000     2.829101    3.895258
     event_2 |   2.408809   .3462507     6.96   0.000      1.73017    3.087448
     event_3 |   2.241819   .3836223     5.84   0.000     1.489933    2.993705
     event_4 |    2.00854   .3670181     5.47   0.000     1.289197    2.727882
-------------+----------------------------------------------------------------
lnL          |
    event_m4 |  -.6046941   .2101053    -2.88   0.004    -1.016493   -.1928954
    event_m3 |  -.4273927   .1634753    -2.61   0.009    -.7477983    -.106987
    event_m2 |  -.3097767   .1743819    -1.78   0.076    -.6515591    .0320056
    event_m1 |   .0408171   .1168255     0.35   0.727    -.1881567    .2697909
     event_1 |   1.846188    .117709    15.68   0.000     1.615482    2.076893
     event_2 |   1.260191   .1744816     7.22   0.000     .9182137    1.602169
     event_3 |   1.240809   .1924465     6.45   0.000     .8636209    1.617997
     event_4 |   1.170714    .195387     5.99   0.000     .7877628    1.553666
-------------+----------------------------------------------------------------
exporter     |
    event_m4 |  -.1539975   .0483359    -3.19   0.001    -.2487342   -.0592608
    event_m3 |  -.0871745    .040794    -2.14   0.033    -.1671292   -.0072198
    event_m2 |  -.0727151   .0407966    -1.78   0.075     -.152675    .0072447
    event_m1 |   .0009374   .0235114     0.04   0.968     -.045144    .0470189
     event_1 |   .4631993   .0239025    19.38   0.000     .4163512    .5100474
     event_2 |   .3038213     .03442     8.83   0.000     .2363593    .3712832
     event_3 |   .3064982   .0461258     6.64   0.000     .2160933    .3969031
     event_4 |   .2843482   .0493547     5.76   0.000     .1876147    .3810818
-------------+----------------------------------------------------------------
lnQ          |
    event_m4 |  -2.058736    .715719    -2.88   0.004     -3.46152   -.6559528
    event_m3 |  -1.235841   .5838697    -2.12   0.034    -2.380205   -.0914775
    event_m2 |   -.969393   .5945627    -1.63   0.103    -2.134714    .1959285
    event_m1 |   .1385604   .3451525     0.40   0.688     -.537926    .8150468
     event_1 |   6.477342   .3488971    18.57   0.000     5.793517    7.161168
     event_2 |   4.385883   .5106441     8.59   0.000     3.385039    5.386727
     event_3 |   4.421231   .6706184     6.59   0.000     3.106843    5.735619
     event_4 |   4.145475   .7085768     5.85   0.000      2.75669     5.53426
-------------+----------------------------------------------------------------
lnQh         |
    event_m4 |  -1.749323   .7564406    -2.31   0.021    -3.231919   -.2667269
    event_m3 |   -1.00021   .6227593    -1.61   0.108    -2.220796     .220376
    event_m2 |  -.8260992   .6185322    -1.34   0.182      -2.0384    .3862017
    event_m1 |   .2487107   .3359883     0.74   0.459    -.4098142    .9072357
     event_1 |   6.093529   .3458912    17.62   0.000     5.415595    6.771464
     event_2 |   4.098635   .4897161     8.37   0.000     3.138809    5.058461
     event_3 |   4.135405   .6323303     6.54   0.000      2.89606    5.374749
     event_4 |   3.757075   .6470876     5.81   0.000     2.488807    5.025343
-------------+----------------------------------------------------------------
lnEx         |
    event_m4 |  -1.701639   .5489444    -3.10   0.002     -2.77755   -.6257279
    event_m3 |  -1.009901   .4033131    -2.50   0.012     -1.80038    -.219422
    event_m2 |  -.8715769   .4262978    -2.04   0.041    -1.707105   -.0360485
    event_m1 |  -.0066113   .2812794    -0.02   0.981    -.5579087    .5446861
     event_1 |   4.801864   .2743908    17.50   0.000     4.264068     5.33966
     event_2 |   3.403852   .4118028     8.27   0.000     2.596734    4.210971
     event_3 |   3.497137   .5351904     6.53   0.000     2.448183    4.546091
     event_4 |   3.444458   .5563489     6.19   0.000     2.354034    4.534882
------------------------------------------------------------------------------
  0
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnEx: event_m4
Estimating lnEx: event_m3
Estimating lnEx: event_m2
Estimating lnEx: event_m1
Estimating lnEx: event_1
Estimating lnEx: event_2
Estimating lnEx: event_3
Estimating lnEx: event_4
Callaway Sant'Anna (2021)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m4 |  -1.021251   .4450864    -2.29   0.022    -1.893604   -.1488976
    event_m3 |  -.4769477   .3658722    -1.30   0.192    -1.194044    .2401488
    event_m2 |  -.5158993   .3763457    -1.37   0.170    -1.253523    .2217248
    event_m1 |   .1057815   .3081379     0.34   0.731    -.4981577    .7097206
     event_1 |   4.139773    .324424    12.76   0.000     3.503913    4.775632
     event_2 |   2.433892   .3784855     6.43   0.000     1.692074     3.17571
     event_3 |   2.126233   .5467806     3.89   0.000     1.054563    3.197904
     event_4 |   1.913806   .4991091     3.83   0.000     .9355699    2.892041
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m4 |   .0299717    .024805     1.21   0.227    -.0186452    .0785887
    event_m3 |   .0384694   .0178095     2.16   0.031     .0035634    .0733754
    event_m2 |   .0607535   .0142367     4.27   0.000     .0328501    .0886568
    event_m1 |   .0175548   .0165874     1.06   0.290    -.0149558    .0500655
     event_1 |    .044444   .0259307     1.71   0.087    -.0063792    .0952672
     event_2 |   .0335899   .0213514     1.57   0.116     -.008258    .0754378
     event_3 |   .0243212    .020283     1.20   0.230    -.0154326    .0640751
     event_4 |    .033996   .0165146     2.06   0.040     .0016279     .066364
-------------+----------------------------------------------------------------
lnK          |
    event_m4 |  -1.290869     .57733    -2.24   0.025    -2.422415   -.1593228
    event_m3 |  -.7184812   .4709328    -1.53   0.127    -1.641493    .2045301
    event_m2 |  -.7023375   .5050394    -1.39   0.164    -1.692197    .2875217
    event_m1 |   .1296366   .3977091     0.33   0.744    -.6498589    .9091321
     event_1 |   4.899715    .415633    11.79   0.000     4.085089    5.714341
     event_2 |   2.823654   .4985414     5.66   0.000     1.846531    3.800777
     event_3 |    2.25758   .7187431     3.14   0.002     .8488698    3.666291
     event_4 |   2.085552   .6456893     3.23   0.001      .820024    3.351079
-------------+----------------------------------------------------------------
lnIK_0       |
    event_m4 |  -.5591439   .5312319    -1.05   0.293    -1.600339    .4820515
    event_m3 |  -.5450083   .4138701    -1.32   0.188    -1.356179    .2661622
    event_m2 |  -.2597106   .4086731    -0.64   0.525    -1.060695    .5412738
    event_m1 |   .2970348   .3019243     0.98   0.325    -.2947261    .8887956
     event_1 |   2.982982   .2884778    10.34   0.000     2.417576    3.548388
     event_2 |    2.00244   .3529843     5.67   0.000     1.310603    2.694276
     event_3 |   1.519295   .4213547     3.61   0.000     .6934547    2.345135
     event_4 |   1.522386   .4391828     3.47   0.001     .6616032    2.383168
-------------+----------------------------------------------------------------
lnL          |
    event_m4 |  -.3899241   .2014666    -1.94   0.053    -.7847914    .0049432
    event_m3 |  -.2803896   .1585643    -1.77   0.077      -.59117    .0303908
    event_m2 |  -.2394833   .1767036    -1.36   0.175    -.5858161    .1068495
    event_m1 |     .10284    .150294     0.68   0.494    -.1917309    .3974109
     event_1 |   1.588949   .1211126    13.12   0.000     1.351572    1.826325
     event_2 |   .9169037    .163541     5.61   0.000     .5963692    1.237438
     event_3 |   .6958978   .2288746     3.04   0.002     .2473119    1.144484
     event_4 |   .6437882   .2272613     2.83   0.005     .1983642    1.089212
-------------+----------------------------------------------------------------
exporter     |
    event_m4 |  -.1014615   .0452681    -2.24   0.025    -.1901854   -.0127376
    event_m3 |  -.0460599   .0360292    -1.28   0.201    -.1166757     .024556
    event_m2 |  -.0520779   .0383856    -1.36   0.175    -.1273122    .0231565
    event_m1 |   .0104381   .0316164     0.33   0.741     -.051529    .0724051
     event_1 |    .416613   .0336465    12.38   0.000     .3506671    .4825588
     event_2 |   .2352879   .0409602     5.74   0.000     .1550074    .3155685
     event_3 |   .1958874   .0542952     3.61   0.000     .0894707    .3023042
     event_4 |   .1719181    .051889     3.31   0.001     .0702176    .2736186
-------------+----------------------------------------------------------------
lnQ          |
    event_m4 |  -1.411175   .6386853    -2.21   0.027    -2.662975   -.1593748
    event_m3 |  -.7573373   .5173181    -1.46   0.143    -1.771262    .2565876
    event_m2 |  -.7553826   .5494566    -1.37   0.169    -1.832298    .3215326
    event_m1 |   .2086215   .4525467     0.46   0.645    -.6783538    1.095597
     event_1 |   5.728721   .4356679    13.15   0.000     4.874828    6.582615
     event_2 |   3.350796   .5365638     6.24   0.000      2.29915    4.402441
     event_3 |   2.822131    .767333     3.68   0.000     1.318186    4.326076
     event_4 |   2.557594   .7114282     3.60   0.000      1.16322    3.951967
-------------+----------------------------------------------------------------
lnQh         |
    event_m4 |   -1.10901    .615988    -1.80   0.072    -2.316324    .0983046
    event_m3 |   -.533077   .5394632    -0.99   0.323    -1.590405    .5242514
    event_m2 |  -.6256478   .4823273    -1.30   0.195    -1.570992    .3196963
    event_m1 |   .3223498   .4373786     0.74   0.461    -.5348966    1.179596
     event_1 |   5.107871   .4182974    12.21   0.000     4.288023    5.927719
     event_2 |   2.967274   .5311669     5.59   0.000     1.926206    4.008342
     event_3 |   2.507552   .7182097     3.49   0.000     1.099887    3.915217
     event_4 |   2.111812   .6489631     3.25   0.001      .839868    3.383756
-------------+----------------------------------------------------------------
lnEx         |
    event_m4 |    -1.1957   .5614757    -2.13   0.033    -2.296172   -.0952276
    event_m3 |  -.6947443   .4477694    -1.55   0.121    -1.572356    .1828676
    event_m2 |  -.6982631    .473967    -1.47   0.141    -1.627221    .2306951
    event_m1 |  -.1815305   .4047462    -0.45   0.654    -.9748184    .6117574
     event_1 |   4.550408   .3869457    11.76   0.000     3.792008    5.308807
     event_2 |   2.546674   .5016003     5.08   0.000     1.563556    3.529793
     event_3 |     2.3297   .6220634     3.75   0.000     1.110478    3.548922
     event_4 |   2.020056    .644343     3.14   0.002     .7571672    3.282945
------------------------------------------------------------------------------
  0
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnEx: event_m4
Estimating lnEx: event_m3
Estimating lnEx: event_m2
Estimating lnEx: event_m1
Estimating lnEx: event_1
Estimating lnEx: event_2
Estimating lnEx: event_3
Estimating lnEx: event_4
Callaway Sant'Anna (2021)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m4 |  -3.058327   .8869307    -3.45   0.001    -4.796679   -1.319975
    event_m3 |  -1.636553   .6718204    -2.44   0.015    -2.953297   -.3198091
    event_m2 |  -1.812575   .5780462    -3.14   0.002    -2.945524   -.6796248
    event_m1 |  -.3515063   .3079903    -1.14   0.254    -.9551562    .2521435
     event_1 |    6.14931   .3173348    19.38   0.000     5.527345    6.771275
     event_2 |   4.800711   .8189279     5.86   0.000     3.195642     6.40578
     event_3 |   5.178196   .6379926     8.12   0.000     3.927753    6.428638
     event_4 |   4.922805   .9810125     5.02   0.000     3.000055    6.845554
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m4 |   .0441557   .0335364     1.32   0.188    -.0215744    .1098859
    event_m3 |   .0500711   .0267135     1.87   0.061    -.0022865    .1024287
    event_m2 |   .0151534   .0183464     0.83   0.409    -.0208048    .0511116
    event_m1 |   .0176898   .0151316     1.17   0.242    -.0119676    .0473473
     event_1 |   .0355287   .0179947     1.97   0.048     .0002598    .0707977
     event_2 |   .0219488   .0195524     1.12   0.262    -.0163732    .0602708
     event_3 |  -.0061128   .0331022    -0.18   0.853     -.070992    .0587663
     event_4 |   .0151223   .0218471     0.69   0.489    -.0276973    .0579418
-------------+----------------------------------------------------------------
lnK          |
    event_m4 |  -3.728031    1.12849    -3.30   0.001    -5.939831   -1.516231
    event_m3 |  -2.052324   .8496149    -2.42   0.016    -3.717538   -.3871089
    event_m2 |  -2.195232    .717578    -3.06   0.002    -3.601659   -.7888052
    event_m1 |  -.4056446   .3564293    -1.14   0.255    -1.104233    .2929441
     event_1 |   7.407439   .4047834    18.30   0.000     6.614078      8.2008
     event_2 |   5.852337   1.025141     5.71   0.000     3.843098    7.861576
     event_3 |   6.308401   .8745996     7.21   0.000     4.594217    8.022584
     event_4 |    5.93362   1.167253     5.08   0.000     3.645847    8.221394
-------------+----------------------------------------------------------------
lnIK_0       |
    event_m4 |  -1.858452   .7158719    -2.60   0.009    -3.261535   -.4553692
    event_m3 |  -1.070433   .5780074    -1.85   0.064    -2.203307    .0624404
    event_m2 |  -1.260283   .5623649    -2.24   0.025    -2.362498   -.1580681
    event_m1 |  -.1791609   .3122634    -0.57   0.566    -.7911858    .4328641
     event_1 |   4.567852    .337479    13.54   0.000     3.906406    5.229299
     event_2 |   4.107714   .9709256     4.23   0.000     2.204735    6.010693
     event_3 |   4.073126   .7110066     5.73   0.000     2.679578    5.466673
     event_4 |   3.546878   .8454667     4.20   0.000     1.889794    5.203962
-------------+----------------------------------------------------------------
lnL          |
    event_m4 |  -1.129456   .3584979    -3.15   0.002    -1.832099   -.4268128
    event_m3 |  -.7359921   .2665722    -2.76   0.006    -1.258464   -.2135203
    event_m2 |  -.6923707   .2177793    -3.18   0.001     -1.11921   -.2655311
    event_m1 |  -.0734678   .1291026    -0.57   0.569    -.3265042    .1795686
     event_1 |   2.489941   .1214955    20.49   0.000     2.251815    2.728068
     event_2 |   1.971695   .2955357     6.67   0.000     1.392456    2.550934
     event_3 |   2.159066   .2627553     8.22   0.000     1.644075    2.674057
     event_4 |   2.061211   .3854463     5.35   0.000      1.30575    2.816671
-------------+----------------------------------------------------------------
exporter     |
    event_m4 |  -.3151545   .0905051    -3.48   0.000    -.4925413   -.1377677
    event_m3 |  -.1712325   .0663681    -2.58   0.010    -.3013116   -.0411534
    event_m2 |  -.1846797   .0564197    -3.27   0.001    -.2952603    -.074099
    event_m1 |  -.0388737   .0299992    -1.30   0.195     -.097671    .0199236
     event_1 |   .6188118   .0298383    20.74   0.000     .5603298    .6772938
     event_2 |   .4747835   .0780211     6.09   0.000      .321865     .627702
     event_3 |   .5143787   .0675806     7.61   0.000     .3819231    .6468343
     event_4 |   .4947634   .1033057     4.79   0.000      .292288    .6972387
-------------+----------------------------------------------------------------
lnQ          |
    event_m4 |  -4.187783   1.224726    -3.42   0.001    -6.588201   -1.787365
    event_m3 |  -2.372545    .918422    -2.58   0.010    -4.172619   -.5724709
    event_m2 |  -2.504945   .7815445    -3.21   0.001    -4.036744   -.9731464
    event_m1 |  -.4249741   .4230697    -1.00   0.315    -1.254175    .4042272
     event_1 |   8.639251   .4243419    20.36   0.000     7.807557    9.470946
     event_2 |   6.772406   1.103515     6.14   0.000     4.609557    8.935255
     event_3 |   7.337261   .8902262     8.24   0.000      5.59245    9.082073
     event_4 |   6.984015   1.359233     5.14   0.000     4.319967    9.648063
-------------+----------------------------------------------------------------
lnQh         |
    event_m4 |  -3.750388   1.097766    -3.42   0.001    -5.901969   -1.598807
    event_m3 |  -2.046507   .8678379    -2.36   0.018    -3.747438    -.345576
    event_m2 |  -2.388182   .8070785    -2.96   0.003    -3.970026   -.8063368
    event_m1 |  -.3487957   .3978139    -0.88   0.381    -1.128497    .4309052
     event_1 |    8.23468   .4394273    18.74   0.000     7.373418    9.095942
     event_2 |   6.482651   1.095761     5.92   0.000     4.334999    8.630302
     event_3 |   6.937845   .8870008     7.82   0.000     5.199356    8.676335
     event_4 |   6.364347   1.299281     4.90   0.000     3.817802    8.910891
-------------+----------------------------------------------------------------
lnEx         |
    event_m4 |  -3.222285   1.064484    -3.03   0.002    -5.308634   -1.135935
    event_m3 |  -2.069932   .8163608    -2.54   0.011     -3.66997   -.4698942
    event_m2 |  -1.961754   .6113704    -3.21   0.001    -3.160018   -.7634898
    event_m1 |  -.3735732    .337376    -1.11   0.268    -1.034818    .2876716
     event_1 |   6.301341   .3163993    19.92   0.000      5.68121    6.921473
     event_2 |   4.927834   .6862028     7.18   0.000     3.582901    6.272767
     event_3 |   5.582256    .576653     9.68   0.000     4.452037    6.712475
     event_4 |   5.531958   1.195336     4.63   0.000     3.189141    7.874774
------------------------------------------------------------------------------
  0
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnEx: event_m4
Estimating lnEx: event_m3
Estimating lnEx: event_m2
Estimating lnEx: event_m1
Estimating lnEx: event_1
Estimating lnEx: event_2
Estimating lnEx: event_3
Estimating lnEx: event_4
Callaway Sant'Anna (2021)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m4 |  -2.523067   .7093709    -3.56   0.000    -3.913408   -1.132726
    event_m3 |  -1.556876   .4528835    -3.44   0.001    -2.444512    -.669241
    event_m2 |  -1.486267   .6002365    -2.48   0.013    -2.662709   -.3098247
    event_m1 |  -.0535732   .2496661    -0.21   0.830    -.5429097    .4357633
     event_1 |    4.74635   .2501918    18.97   0.000     4.255983    5.236717
     event_2 |   3.911713   .7287068     5.37   0.000     2.483474    5.339952
     event_3 |   4.416786   .6720844     6.57   0.000     3.099525    5.734048
     event_4 |   4.465372   .9868857     4.52   0.000     2.531112    6.399633
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m4 |   .0350332   .0232247     1.51   0.131    -.0104864    .0805528
    event_m3 |   .0421489   .0240721     1.75   0.080    -.0050316    .0893294
    event_m2 |   .0388446    .020589     1.89   0.059    -.0015091    .0791983
    event_m1 |   .0181617   .0149007     1.22   0.223    -.0110431    .0473666
     event_1 |   .0429467   .0103228     4.16   0.000     .0227143     .063179
     event_2 |   .0379622   .0141526     2.68   0.007     .0102237    .0657008
     event_3 |   .0112215   .0210894     0.53   0.595     -.030113     .052556
     event_4 |   .0371812   .0182417     2.04   0.042     .0014281    .0729343
-------------+----------------------------------------------------------------
lnK          |
    event_m4 |  -2.956708   .9098671    -3.25   0.001    -4.740014   -1.173401
    event_m3 |  -1.885009   .5966431    -3.16   0.002    -3.054408   -.7156096
    event_m2 |  -1.806477   .8147771    -2.22   0.027    -3.403411    -.209543
    event_m1 |   -.055794   .3020869    -0.18   0.853    -.6478735    .5362854
     event_1 |   5.693624   .3491162    16.31   0.000     5.009368    6.377879
     event_2 |   4.649082   .9329638     4.98   0.000     2.820506    6.477657
     event_3 |   5.234842   .8712777     6.01   0.000     3.527169    6.942515
     event_4 |   5.175829   1.166998     4.44   0.000     2.888555    7.463102
-------------+----------------------------------------------------------------
lnIK_0       |
    event_m4 |  -1.601327   .5929814    -2.70   0.007     -2.76355   -.4391052
    event_m3 |  -.9261932   .4179288    -2.22   0.027    -1.745318   -.1070678
    event_m2 |  -1.450612   .6842208    -2.12   0.034     -2.79166   -.1095635
    event_m1 |   -.006882   .2789276    -0.02   0.980      -.55357     .539806
     event_1 |   3.436944   .2881392    11.93   0.000     2.872202    4.001687
     event_2 |   3.200912   .8732291     3.67   0.000     1.489414    4.912409
     event_3 |   3.216092   .6147386     5.23   0.000     2.011226    4.420957
     event_4 |   2.682278   .7599558     3.53   0.000     1.192792    4.171764
-------------+----------------------------------------------------------------
lnL          |
    event_m4 |  -.9701806   .3066473    -3.16   0.002    -1.571198   -.3691629
    event_m3 |  -.6962815    .199361    -3.49   0.000    -1.087022    -.305541
    event_m2 |  -.5979151   .2573955    -2.32   0.020    -1.102401   -.0934293
    event_m1 |  -.0074137   .1232819    -0.06   0.952    -.2490417    .2342143
     event_1 |   1.882332   .1149603    16.37   0.000     1.657014     2.10765
     event_2 |   1.530959     .29037     5.27   0.000     .9618445    2.100074
     event_3 |   1.693431   .2348529     7.21   0.000     1.233128    2.153734
     event_4 |   1.693831   .3752771     4.51   0.000     .9583012    2.429361
-------------+----------------------------------------------------------------
exporter     |
    event_m4 |  -.2647842   .0745154    -3.55   0.000    -.4108317   -.1187367
    event_m3 |  -.1658352   .0492654    -3.37   0.001    -.2623936   -.0692768
    event_m2 |  -.1557926   .0605115    -2.57   0.010    -.2743929   -.0371922
    event_m1 |  -.0151354   .0247191    -0.61   0.540    -.0635839    .0333131
     event_1 |   .4746886   .0245383    19.34   0.000     .4265945    .5227827
     event_2 |   .3804521   .0711239     5.35   0.000     .2410518    .5198524
     event_3 |   .4329396   .0701313     6.17   0.000     .2954848    .5703944
     event_4 |   .4426757   .1042255     4.25   0.000     .2383975    .6469539
-------------+----------------------------------------------------------------
lnQ          |
    event_m4 |  -3.493248   1.007453    -3.47   0.001     -5.46782   -1.518675
    event_m3 |  -2.253158   .6381551    -3.53   0.000    -3.503919   -1.002397
    event_m2 |  -2.084182   .8500186    -2.45   0.014    -3.750188   -.4181759
    event_m1 |  -.0609869   .3679896    -0.17   0.868    -.7822332    .6602595
     event_1 |   6.628682   .3532681    18.76   0.000     5.936289    7.321075
     event_2 |   5.442672   1.011718     5.38   0.000     3.459741    7.425604
     event_3 |   6.110217   .9004602     6.79   0.000     4.345348    7.875087
     event_4 |   6.159203   1.354377     4.55   0.000     3.504673    8.813733
-------------+----------------------------------------------------------------
lnQh         |
    event_m4 |  -2.984787   .8576986    -3.48   0.001    -4.665846   -1.303729
    event_m3 |  -1.903782    .547623    -3.48   0.001    -2.977104   -.8304611
    event_m2 |  -1.913547   .8401169    -2.28   0.023    -3.560146   -.2669482
    event_m1 |   .0483342   .3561656     0.14   0.892    -.6497376     .746406
     event_1 |   6.241622   .3459151    18.04   0.000     5.563641    6.919603
     event_2 |    5.13457   1.001615     5.13   0.000     3.171441    7.097699
     event_3 |   5.725513   .8542962     6.70   0.000     4.051123    7.399903
     event_4 |   5.473234   1.212747     4.51   0.000     3.096295    7.850174
-------------+----------------------------------------------------------------
lnEx         |
    event_m4 |  -2.955037   .9692401    -3.05   0.002    -4.854713   -1.055362
    event_m3 |  -1.869828   .5857008    -3.19   0.001     -3.01778   -.7218755
    event_m2 |  -1.595314   .5689552    -2.80   0.005    -2.710446   -.4801822
    event_m1 |  -.1495489   .2941305    -0.51   0.611     -.726034    .4269362
     event_1 |    4.93491   .2691735    18.33   0.000      4.40734     5.46248
     event_2 |   4.091955   .6146483     6.66   0.000     2.887266    5.296643
     event_3 |   4.677846    .606269     7.72   0.000      3.48958    5.866111
     event_4 |   5.198103   1.223885     4.25   0.000     2.799333    7.596872
------------------------------------------------------------------------------
  0
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnEx: event_m4
Estimating lnEx: event_m3
Estimating lnEx: event_m2
Estimating lnEx: event_m1
Estimating lnEx: event_1
Estimating lnEx: event_2
Estimating lnEx: event_3
Estimating lnEx: event_4
Callaway Sant'Anna (2021)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m4 |  -1.093095   .4987279    -2.19   0.028    -2.070584   -.1156059
    event_m3 |   -.504461    .329976    -1.53   0.126    -1.151202    .1422802
    event_m2 |  -.5606172   .3642882    -1.54   0.124    -1.274609    .1533746
    event_m1 |   .0839239   .3019961     0.28   0.781    -.5079777    .6758254
     event_1 |   4.171341    .327516    12.74   0.000     3.529421     4.81326
     event_2 |   2.456642   .3841587     6.39   0.000     1.703705    3.209579
     event_3 |   2.154913   .4552719     4.73   0.000     1.262597     3.04723
     event_4 |   1.934733   .4899342     3.95   0.000     .9744794    2.894986
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m4 |   .0324567   .0219248     1.48   0.139    -.0105152    .0754285
    event_m3 |   .0387839   .0204711     1.89   0.058    -.0013387    .0789066
    event_m2 |   .0605278   .0210449     2.88   0.004     .0192806    .1017751
    event_m1 |    .017645   .0168732     1.05   0.296    -.0154259     .050716
     event_1 |   .0459967   .0258134     1.78   0.075    -.0045967      .09659
     event_2 |   .0352523   .0210548     1.67   0.094    -.0060144    .0765189
     event_3 |   .0278511    .029751     0.94   0.349    -.0304598     .086162
     event_4 |   .0348747   .0182768     1.91   0.056    -.0009472    .0706965
-------------+----------------------------------------------------------------
lnK          |
    event_m4 |  -1.370925   .6551524    -2.09   0.036       -2.655   -.0868503
    event_m3 |  -.7456223    .447467    -1.67   0.096    -1.622642     .131397
    event_m2 |  -.7510187   .4794798    -1.57   0.117    -1.690782    .1887444
    event_m1 |   .0982405   .3856526     0.25   0.799    -.6576248    .8541058
     event_1 |    4.93707    .419584    11.77   0.000       4.1147    5.759439
     event_2 |   2.844839   .4958836     5.74   0.000     1.872925    3.816753
     event_3 |   2.274933   .5888047     3.86   0.000     1.120897    3.428969
     event_4 |   2.084993   .6302947     3.31   0.001     .8496383    3.320348
-------------+----------------------------------------------------------------
lnIK_0       |
    event_m4 |  -.6096167   .4653133    -1.31   0.190    -1.521614    .3023806
    event_m3 |  -.5737923   .4608049    -1.25   0.213    -1.476953    .3293688
    event_m2 |  -.2931294    .315867    -0.93   0.353    -.9122174    .3259586
    event_m1 |   .2730198   .2943347     0.93   0.354    -.3038656    .8499053
     event_1 |    3.01127   .2887144    10.43   0.000       2.4454     3.57714
     event_2 |   2.034403   .3507726     5.80   0.000     1.346902    2.721905
     event_3 |   1.553589   .4144753     3.75   0.000     .7412326    2.365946
     event_4 |   1.527029   .4951343     3.08   0.002     .5565838    2.497475
-------------+----------------------------------------------------------------
lnL          |
    event_m4 |  -.4063191   .2213347    -1.84   0.066    -.8401271     .027489
    event_m3 |  -.2828277   .1538865    -1.84   0.066    -.5844397    .0187843
    event_m2 |  -.2419018   .1708003    -1.42   0.157    -.5766642    .0928606
    event_m1 |   .0996678   .1476274     0.68   0.500    -.1896766    .3890122
     event_1 |   1.595729   .1194063    13.36   0.000     1.361697    1.829761
     event_2 |   .9126516   .1590532     5.74   0.000     .6009131     1.22439
     event_3 |   .6943343   .1971346     3.52   0.000     .3079577    1.080711
     event_4 |   .6351271   .2256558     2.81   0.005     .1928498    1.077404
-------------+----------------------------------------------------------------
exporter     |
    event_m4 |  -.1069587   .0488264    -2.19   0.028    -.2026568   -.0112606
    event_m3 |  -.0475829   .0317867    -1.50   0.134    -.1098837     .014718
    event_m2 |  -.0556164   .0363504    -1.53   0.126    -.1268618     .015629
    event_m1 |   .0084302   .0308233     0.27   0.784    -.0519824    .0688427
     event_1 |   .4196502   .0339231    12.37   0.000     .3531622    .4861383
     event_2 |    .236517   .0410102     5.77   0.000     .1561386    .3168955
     event_3 |   .1970594   .0475702     4.14   0.000     .1038235    .2902952
     event_4 |   .1722362   .0502764     3.43   0.001     .0736963    .2707761
-------------+----------------------------------------------------------------
lnQ          |
    event_m4 |  -1.499414   .7067949    -2.12   0.034    -2.884706   -.1141213
    event_m3 |  -.7872887   .4688983    -1.68   0.093    -1.706312    .1317351
    event_m2 |   -.802519   .5270198    -1.52   0.128    -1.835459    .2304208
    event_m1 |   .1835916   .4439216     0.41   0.679    -.6864788    1.053662
     event_1 |    5.76707   .4380069    13.17   0.000     4.908592    6.625548
     event_2 |   3.369294    .537661     6.27   0.000     2.315497     4.42309
     event_3 |   2.849248   .6335371     4.50   0.000     1.607538    4.090958
     event_4 |    2.56986   .6965095     3.69   0.000     1.204726    3.934993
-------------+----------------------------------------------------------------
lnQh         |
    event_m4 |  -1.214492   .6281495    -1.93   0.053    -2.445643    .0166582
    event_m3 |  -.5795514   .4384565    -1.32   0.186     -1.43891    .2798074
    event_m2 |  -.6861428   .4908577    -1.40   0.162    -1.648206    .2759207
    event_m1 |   .2937077   .4324703     0.68   0.497    -.5539186    1.141334
     event_1 |   5.149764   .4204788    12.25   0.000     4.325641    5.973887
     event_2 |   2.995333   .5333253     5.62   0.000     1.950035    4.040632
     event_3 |   2.551966   .6096208     4.19   0.000     1.357131    3.746801
     event_4 |    2.15151    .738061     2.92   0.004     .7049373    3.598083
-------------+----------------------------------------------------------------
lnEx         |
    event_m4 |  -1.263195   .5949228    -2.12   0.034    -2.429223   -.0971681
    event_m3 |  -.7178695   .4733907    -1.52   0.129    -1.645698    .2099593
    event_m2 |  -.7423461   .5163985    -1.44   0.151    -1.754469    .2697763
    event_m1 |  -.2090934   .3967286    -0.53   0.598    -.9866671    .5684803
     event_1 |   4.585122   .3919764    11.70   0.000     3.816862    5.353382
     event_2 |   2.562632   .5006297     5.12   0.000     1.581416    3.543848
     event_3 |   2.335466   .5014709     4.66   0.000     1.352601    3.318331
     event_4 |   1.996334   .5501264     3.63   0.000     .9181066    3.074562
------------------------------------------------------------------------------
  0

. 
. esttab model* using "`here'/output/table_attgt.tex", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt.tex)

. esttab model* using "`here'/output/table_attgt.txt", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt.txt)

. 
. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt.log
  log type:  text
 closed on:  25 Jun 2021, 01:37:23
--------------------------------------------------------------------------------------------------------------------------------------------------------------
