--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_weightsfo.log
  log type:  text
 opened on:  20 Jul 2021, 16:42:17

. 
. use "/`here'/external/pscore_focontrol.dta", clear

. drop treat_match year_match

. *mvencode weight_match, mv(0)
. reshape wide weight_match, i(frame_id_numeric) j(year)
(note: j = 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                      733   ->     733
Number of variables                   3   ->      30
j variable (29 values)             year   ->   (dropped)
xij variables:
                           weight_match   ->   weight_match1989 weight_match1990 ... weight_match2017
-----------------------------------------------------------------------------

. *mvencode weight_match*, mv(0)
. duplicates report frame_id_numeric

Duplicates in terms of frame_id_numeric

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |          733             0
--------------------------------------

. tempfile weights

. save `weights'
file /srv/sandbox/zavecz/St1873248.000001 saved

. 
. use "`here'/temp/analysis_sample.dta", clear

. 
. rename ever_foreign ef

. rename ever_foreign_hire efh

. rename has_expat_ceo has_expat

. 
. count
  11,501

. count if ef & time_foreign <= 5
  11,501

. 
. merge m:1 frame_id_numeric using `weights', keep (1 3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                         6,281
        from master                     6,281  
        from using                          0  

    matched                             5,220  
    -----------------------------------------

. 
. drop if year > 2013
(611 observations deleted)

. 
. *duplicates tag frame_id_numeric weight_match1989, gen(dup)
. *replace dup = 1 if dup >=1 & dup != .
. *tab dup, miss
. 
. mvencode weight_match*, mv(0)
weight_~1989: 10817 missing values recoded
weight_~1990: 10839 missing values recoded
weight_~1991: 10498 missing values recoded
weight_~1992: 10615 missing values recoded
weight_~1993: 10835 missing values recoded
weight_~1994: 10600 missing values recoded
weight_~1995: 10639 missing values recoded
weight_~1996: 10700 missing values recoded
weight_~1997: 10723 missing values recoded
weight_~1998: 10688 missing values recoded
weight_~1999: 10736 missing values recoded
weight_~2000: 10716 missing values recoded
weight_~2001: 10696 missing values recoded
weight_~2002: 10717 missing values recoded
weight_~2003: 10669 missing values recoded
weight_~2004: 10588 missing values recoded
weight_~2005: 10695 missing values recoded
weight_~2006: 10568 missing values recoded
weight_~2007: 10552 missing values recoded
weight_~2008: 10619 missing values recoded
weight_~2009: 10737 missing values recoded
weight_~2010: 10785 missing values recoded
weight_~2011: 10791 missing values recoded
weight_~2012: 10827 missing values recoded
weight_~2013: 10838 missing values recoded
weight_~2014: 10809 missing values recoded
weight_~2015: 10835 missing values recoded
weight_~2016: 10808 missing values recoded
weight_~2017: 10880 missing values recoded

. 
. foreach var in foreign_only foreign_hire_only has_expat {
  2.                 attgt lnQL lnK lnL exporter lnQ, treatment(`var') aggregate(e) pre(5) post(5) reps(20) notyet limitcontrol(foreign == 0) weightprefix(wei
> ght_match)
  3.                 count if e(sample) == 1
  4.                 eststo m`var', title("`var'")
  5. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m5
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating lnQL: event_5
Estimating lnK: event_m5
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnK: event_5
Estimating lnL: event_m5
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating lnL: event_5
Estimating exporter: event_m5
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating exporter: event_5
Estimating lnQ: event_m5
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQ: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,092

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m5 |  -.1049183   .1309098    -0.80   0.423    -.3614968    .1516601
    event_m4 |  -.2806674   .0890236    -3.15   0.002    -.4551505   -.1061844
    event_m3 |  -.0905709   .1493963    -0.61   0.544    -.3833822    .2022404
    event_m2 |   -.185433   .0882776    -2.10   0.036    -.3584539    -.012412
    event_m1 |   .0879252   .0946448     0.93   0.353    -.0975753    .2734256
     event_1 |   .2028626   .1091292     1.86   0.063    -.0110267    .4167519
     event_2 |   .1992611   .1180884     1.69   0.092    -.0321879    .4307101
     event_3 |   .2147081   .1298683     1.65   0.098     -.039829    .4692452
     event_4 |   .2573653   .1590675     1.62   0.106    -.0544012    .5691319
     event_5 |   .3341668   .1595179     2.09   0.036     .0215174    .6468161
-------------+----------------------------------------------------------------
lnK          |
    event_m5 |  -.1058843   .2411365    -0.44   0.661    -.5785031    .3667346
    event_m4 |  -.0437422    .190978    -0.23   0.819    -.4180522    .3305678
    event_m3 |    .042389   .1455966     0.29   0.771    -.2429751     .327753
    event_m2 |  -.1774595   .1279396    -1.39   0.165    -.4282165    .0732975
    event_m1 |  -.0341079   .0815076    -0.42   0.676    -.1938599    .1256441
     event_1 |   .1950673   .1212042     1.61   0.108    -.0424885    .4326231
     event_2 |   .4329706   .1476955     2.93   0.003     .1434928    .7224484
     event_3 |   .6235788   .1480722     4.21   0.000     .3333627     .913795
     event_4 |   .6035965   .1693522     3.56   0.000     .2716724    .9355207
     event_5 |   .7160877   .1925442     3.72   0.000      .338708    1.093467
-------------+----------------------------------------------------------------
lnL          |
    event_m5 |  -.0830206    .141376    -0.59   0.557    -.3601126    .1940713
    event_m4 |   .0635243   .1296152     0.49   0.624    -.1905168    .3175653
    event_m3 |  -.0355774   .1462561    -0.24   0.808    -.3222341    .2510793
    event_m2 |   -.036393   .1072983    -0.34   0.734    -.2466938    .1739079
    event_m1 |   -.066617   .0507661    -1.31   0.189    -.1661168    .0328827
     event_1 |   .0876445   .1109745     0.79   0.430    -.1298615    .3051505
     event_2 |   .2429083   .0710297     3.42   0.001     .1036926    .3821241
     event_3 |   .2458263   .1343931     1.83   0.067    -.0175793     .509232
     event_4 |   .4410188    .162792     2.71   0.007     .1219524    .7600852
     event_5 |   .4216588   .1652763     2.55   0.011     .0977231    .7455944
-------------+----------------------------------------------------------------
exporter     |
    event_m5 |   .0238828   .0645138     0.37   0.711    -.1025619    .1503275
    event_m4 |  -.0181595   .0420816    -0.43   0.666    -.1006379    .0643189
    event_m3 |   .0292709   .0404729     0.72   0.470    -.0500545    .1085963
    event_m2 |   .0354761   .0327676     1.08   0.279    -.0287472    .0996993
    event_m1 |  -.0092165   .0281928    -0.33   0.744    -.0644732    .0460403
     event_1 |   .2059731   .0544952     3.78   0.000     .0991644    .3127818
     event_2 |   .0811756   .0541085     1.50   0.134     -.024875    .1872263
     event_3 |  -.0891706    .114361    -0.78   0.436     -.313314    .1349728
     event_4 |  -.0141231   .0962233    -0.15   0.883    -.2027174    .1744711
     event_5 |   .0171876     .10225     0.17   0.867    -.1832187     .217594
-------------+----------------------------------------------------------------
lnQ          |
    event_m5 |  -.1879391   .1715487    -1.10   0.273    -.5241685    .1482903
    event_m4 |  -.2171432   .1319851    -1.65   0.100    -.4758293    .0415429
    event_m3 |  -.1261485   .1511555    -0.83   0.404    -.4224078    .1701109
    event_m2 |   -.221826   .1140369    -1.95   0.052    -.4453342    .0016823
    event_m1 |   .0213081   .1008879     0.21   0.833    -.1764285    .2190448
     event_1 |   .2905071   .0501069     5.80   0.000     .1922994    .3887149
     event_2 |   .4421695   .1016401     4.35   0.000     .2429585    .6413804
     event_3 |   .4605343   .1778812     2.59   0.010     .1118936     .809175
     event_4 |    .698384   .1061757     6.58   0.000     .4902835    .9064845
     event_5 |   .7558255   .1019771     7.41   0.000     .5559541    .9556969
------------------------------------------------------------------------------
  4,092
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m5
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating lnQL: event_5
Estimating lnK: event_m5
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnK: event_5
Estimating lnL: event_m5
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating lnL: event_5
Estimating exporter: event_m5
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating exporter: event_5
Estimating lnQ: event_m5
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQ: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      2,787

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m5 |  -.0140751   .1910335    -0.07   0.941    -.3884938    .3603436
    event_m4 |  -.1688588   .1448573    -1.17   0.244     -.452774    .1150563
    event_m3 |  -.0645589   .1262636    -0.51   0.609     -.312031    .1829133
    event_m2 |    -.27166   .0905814    -3.00   0.003    -.4491963   -.0941238
    event_m1 |  -.0927124   .1453667    -0.64   0.524    -.3776258     .192201
     event_1 |   .1572494   .1326855     1.19   0.236    -.1028094    .4173083
     event_2 |    .245306   .1077341     2.28   0.023      .034151     .456461
     event_3 |   .2919462   .1109786     2.63   0.009     .0744322    .5094603
     event_4 |   .3371245   .1351217     2.49   0.013     .0722909    .6019582
     event_5 |   .3738939   .1539462     2.43   0.015      .072165    .6756229
-------------+----------------------------------------------------------------
lnK          |
    event_m5 |   .1639818    .210433     0.78   0.436    -.2484593     .576423
    event_m4 |    .087148   .2142568     0.41   0.684    -.3327876    .5070837
    event_m3 |   .1336308    .189027     0.71   0.480    -.2368554     .504117
    event_m2 |    .090845   .1293686     0.70   0.483    -.1627127    .3444028
    event_m1 |   .0455717   .1050428     0.43   0.664    -.1603084    .2514517
     event_1 |    .346762   .1294008     2.68   0.007      .093141    .6003829
     event_2 |   .4341161   .1132213     3.83   0.000     .2122065    .6560257
     event_3 |   .5455852   .1437049     3.80   0.000     .2639288    .8272416
     event_4 |   .3852716   .1749701     2.20   0.028     .0423364    .7282068
     event_5 |   .4859005   .2238374     2.17   0.030     .0471874    .9246137
-------------+----------------------------------------------------------------
lnL          |
    event_m5 |  -.0684912   .1472349    -0.47   0.642    -.3570664     .220084
    event_m4 |   .0531754   .1082328     0.49   0.623    -.1589569    .2653078
    event_m3 |   .1538902   .0876988     1.75   0.079    -.0179962    .3257767
    event_m2 |   .1602186   .0652618     2.46   0.014     .0323078    .2881294
    event_m1 |   .0269934   .0747851     0.36   0.718    -.1195828    .1735695
     event_1 |   .2626615   .1684911     1.56   0.119    -.0675751     .592898
     event_2 |   .2746688   .1253215     2.19   0.028     .0290431    .5202945
     event_3 |   .3156956   .1640988     1.92   0.054    -.0059322    .6373234
     event_4 |   .2924639   .1792001     1.63   0.103    -.0587617    .6436896
     event_5 |   .2279195   .2002481     1.14   0.255    -.1645595    .6203985
-------------+----------------------------------------------------------------
exporter     |
    event_m5 |  -.1069237   .0946645    -1.13   0.259    -.2924626    .0786153
    event_m4 |  -.0794376   .0625477    -1.27   0.204    -.2020288    .0431537
    event_m3 |  -.0866595   .0452485    -1.92   0.055     -.175345     .002026
    event_m2 |   -.053604   .0421918    -1.27   0.204    -.1362984    .0290904
    event_m1 |  -.0662753   .0480338    -1.38   0.168    -.1604198    .0278693
     event_1 |    .256417    .069545     3.69   0.000     .1201112    .3927228
     event_2 |   .0936699   .0655414     1.43   0.153    -.0347889    .2221288
     event_3 |   .0050289   .0967337     0.05   0.959    -.1845656    .1946234
     event_4 |  -.0283389   .0852291    -0.33   0.740    -.1953849    .1387071
     event_5 |  -.0050131   .0811647    -0.06   0.951     -.164093    .1540669
-------------+----------------------------------------------------------------
lnQ          |
    event_m5 |  -.0825664   .1675743    -0.49   0.622     -.411006    .2458731
    event_m4 |  -.1156834   .1124872    -1.03   0.304    -.3361544    .1047875
    event_m3 |   .0893313   .1041855     0.86   0.391    -.1148684    .2935311
    event_m2 |  -.1114414   .1051158    -1.06   0.289    -.3174647    .0945818
    event_m1 |  -.0657191   .1538251    -0.43   0.669    -.3672108    .2357726
     event_1 |   .4199109   .1121863     3.74   0.000     .2000297     .639792
     event_2 |   .5199749   .1024341     5.08   0.000     .3192078     .720742
     event_3 |   .6076418   .1543028     3.94   0.000      .305214    .9100697
     event_4 |   .6295885   .1465627     4.30   0.000     .3423309     .916846
     event_5 |   .6018134   .1754349     3.43   0.001     .2579673    .9456595
------------------------------------------------------------------------------
  2,787
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m5
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating lnQL: event_5
Estimating lnK: event_m5
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnK: event_5
Estimating lnL: event_m5
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating lnL: event_5
Estimating exporter: event_m5
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating exporter: event_5
Estimating lnQ: event_m5
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQ: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      3,496

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m5 |   .2872748   .1783992     1.61   0.107    -.0623812    .6369308
    event_m4 |   .1121801   .1516807     0.74   0.460    -.1851086    .4094688
    event_m3 |   .0282638   .1435641     0.20   0.844    -.2531167    .3096443
    event_m2 |   .2855853   .0845887     3.38   0.001     .1197944    .4513762
    event_m1 |   .1454133   .0998057     1.46   0.145    -.0502022    .3410288
     event_1 |   .4101455   .1247442     3.29   0.001     .1656514    .6546396
     event_2 |   .5349676   .1021366     5.24   0.000     .3347836    .7351516
     event_3 |   .7044569   .1054299     6.68   0.000     .4978181    .9110957
     event_4 |   .6884801   .1647965     4.18   0.000     .3654849    1.011475
     event_5 |   .7023305   .1455875     4.82   0.000     .4169843    .9876767
-------------+----------------------------------------------------------------
lnK          |
    event_m5 |    .154124   .2804646     0.55   0.583    -.3955766    .7038246
    event_m4 |   .4569303   .2643603     1.73   0.084    -.0612063    .9750669
    event_m3 |   .0975305   .1352813     0.72   0.471    -.1676159    .3626769
    event_m2 |  -.0390881   .1265723    -0.31   0.757    -.2871653     .208989
    event_m1 |  -.0039307   .1217158    -0.03   0.974    -.2424892    .2346278
     event_1 |   .3624786   .1377503     2.63   0.009     .0924931    .6324642
     event_2 |   .6431766    .183701     3.50   0.000     .2831293    1.003224
     event_3 |   .7651429   .1693359     4.52   0.000     .4332505    1.097035
     event_4 |   .8374155   .1789812     4.68   0.000     .4866187    1.188212
     event_5 |    .958685   .1813756     5.29   0.000     .6031952    1.314175
-------------+----------------------------------------------------------------
lnL          |
    event_m5 |   .0711204   .1914866     0.37   0.710    -.3041864    .4464272
    event_m4 |   .1422349   .1579747     0.90   0.368    -.1673899    .4518596
    event_m3 |   .0016044   .1484946     0.01   0.991    -.2894396    .2926485
    event_m2 |  -.0939653     .09577    -0.98   0.327     -.281671    .0937404
    event_m1 |   .0263743   .0758775     0.35   0.728    -.1223429    .1750915
     event_1 |   .1862266    .124012     1.50   0.133    -.0568324    .4292856
     event_2 |   .3277896   .0781504     4.19   0.000     .1746175    .4809616
     event_3 |   .3945105   .1298077     3.04   0.002     .1400921     .648929
     event_4 |   .5169403   .1860506     2.78   0.005     .1522878    .8815928
     event_5 |   .5028883   .1772703     2.84   0.005     .1554449    .8503317
-------------+----------------------------------------------------------------
exporter     |
    event_m5 |   .0915734   .0814719     1.12   0.261    -.0681086    .2512553
    event_m4 |  -.0278034   .0893138    -0.31   0.756    -.2028552    .1472483
    event_m3 |   .0745609   .0569226     1.31   0.190    -.0370054    .1861273
    event_m2 |   .0585406   .0499961     1.17   0.242      -.03945    .1565312
    event_m1 |   .0688861   .0548563     1.26   0.209    -.0386302    .1764024
     event_1 |   .2260482   .0664791     3.40   0.001     .0957516    .3563449
     event_2 |   .1688538   .0624577     2.70   0.007     .0464391    .2912686
     event_3 |   .0716648   .0992424     0.72   0.470    -.1228468    .2661764
     event_4 |   .1456933   .0772086     1.89   0.059    -.0056327    .2970193
     event_5 |   .1224762   .0666232     1.84   0.066     -.008103    .2530553
-------------+----------------------------------------------------------------
lnQ          |
    event_m5 |   .3583953   .2346013     1.53   0.127    -.1014148    .8182054
    event_m4 |    .254415   .1630495     1.56   0.119    -.0651562    .5739862
    event_m3 |   .0298683   .1658366     0.18   0.857    -.2951655     .354902
    event_m2 |     .19162   .1402077     1.37   0.172    -.0831819     .466422
    event_m1 |   .1717877    .116379     1.48   0.140    -.0563109    .3998864
     event_1 |   .5963721   .0741735     8.04   0.000     .4509948    .7417495
     event_2 |   .8627572   .0987735     8.73   0.000     .6691647     1.05635
     event_3 |   1.098967   .0961874    11.43   0.000     .9104435    1.287491
     event_4 |    1.20542   .1214363     9.93   0.000     .9674096    1.443431
     event_5 |   1.205219   .1243619     9.69   0.000      .961474    1.448964
------------------------------------------------------------------------------
  3,496

. 
. foreach var in foreign_hire_only has_expat {
  2.                 attgt lnQL lnK lnL exporter lnQ if efh, treatment(`var') aggregate(e) pre(5) post(5) reps(20) notyet limitcontrol(foreign == 0) weightpre
> fix(weight_match)
  3.                 count if e(sample) == 1
  4.                 eststo mh`var', title("efh `var'")
  5. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m5
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating lnQL: event_5
Estimating lnK: event_m5
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnK: event_5
Estimating lnL: event_m5
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating lnL: event_5
Estimating exporter: event_m5
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating exporter: event_5
Estimating lnQ: event_m5
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQ: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      2,737

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m5 |  -.0133702   .1347288    -0.10   0.921    -.2774338    .2506935
    event_m4 |  -.1678559   .1461552    -1.15   0.251    -.4543149     .118603
    event_m3 |  -.0673593   .1324042    -0.51   0.611    -.3268669    .1921482
    event_m2 |  -.2756308    .111696    -2.47   0.014     -.494551   -.0567107
    event_m1 |  -.0937862   .1478011    -0.63   0.526    -.3834709    .1958986
     event_1 |   .1483421   .1267219     1.17   0.242    -.1000283    .3967125
     event_2 |   .2162074    .100109     2.16   0.031     .0199974    .4124175
     event_3 |   .2993301   .1003728     2.98   0.003     .1026029    .4960572
     event_4 |   .3585182   .0988102     3.63   0.000     .1648537    .5521827
     event_5 |   .3923884   .1031934     3.80   0.000      .190133    .5946438
-------------+----------------------------------------------------------------
lnK          |
    event_m5 |   .1737963    .185022     0.94   0.348    -.1888401    .5364328
    event_m4 |   .0939293   .1712226     0.55   0.583    -.2416609    .4295195
    event_m3 |   .1502605   .1715784     0.88   0.381    -.1860271     .486548
    event_m2 |   .0989359   .1136899     0.87   0.384    -.1238922     .321764
    event_m1 |   .0468114   .0927916     0.50   0.614    -.1350569    .2286796
     event_1 |   .2070394   .1212853     1.71   0.088    -.0306754    .4447542
     event_2 |   .3972029    .128287     3.10   0.002      .145765    .6486408
     event_3 |   .5162269   .0979601     5.27   0.000     .3242287    .7082251
     event_4 |   .3494957   .1671401     2.09   0.037     .0219071    .6770843
     event_5 |   .4771571   .1736107     2.75   0.006     .1368864    .8174277
-------------+----------------------------------------------------------------
lnL          |
    event_m5 |  -.0700986   .2279795    -0.31   0.758    -.5169303     .376733
    event_m4 |   .0336643   .1554812     0.22   0.829    -.2710733    .3384018
    event_m3 |   .1573707   .1235924     1.27   0.203     -.084866    .3996074
    event_m2 |   .1644998   .0964215     1.71   0.088    -.0244829    .3534825
    event_m1 |   .0283566   .0631736     0.45   0.654    -.0954614    .1521747
     event_1 |   .2535237   .1318024     1.92   0.054    -.0048042    .5118517
     event_2 |   .2624348   .0796023     3.30   0.001     .1064171    .4184525
     event_3 |   .3043348   .1099134     2.77   0.006     .0889084    .5197612
     event_4 |   .2682299   .1504696     1.78   0.075    -.0266851    .5631449
     event_5 |   .2115074   .1763647     1.20   0.230    -.1341611    .5571759
-------------+----------------------------------------------------------------
exporter     |
    event_m5 |  -.1008261   .0908271    -1.11   0.267     -.278844    .0771918
    event_m4 |   -.075221   .0945482    -0.80   0.426    -.2605322    .1100901
    event_m3 |    -.08246   .0740851    -1.11   0.266    -.2276641    .0627441
    event_m2 |  -.0526871   .0528106    -1.00   0.318    -.1561941    .0508198
    event_m1 |  -.0655011   .0453621    -1.44   0.149    -.1544091    .0234069
     event_1 |   .2142857   .0775618     2.76   0.006     .0622674     .366304
     event_2 |   .0781525    .067387     1.16   0.246    -.0539236    .2102286
     event_3 |  -.0107527   .0906895    -0.12   0.906    -.1885008    .1669954
     event_4 |  -.0506329   .0867836    -0.58   0.560    -.2207255    .1194597
     event_5 |  -.0230769   .0885711    -0.26   0.794     -.196673    .1505192
-------------+----------------------------------------------------------------
lnQ          |
    event_m5 |  -.0834689   .1642645    -0.51   0.611    -.4054214    .2384836
    event_m4 |  -.1341917   .1469797    -0.91   0.361    -.4222666    .1538831
    event_m3 |   .0900113    .149692     0.60   0.548    -.2033796    .3834023
    event_m2 |   -.111131   .1060651    -1.05   0.295    -.3190149    .0967529
    event_m1 |  -.0654296    .128602    -0.51   0.611    -.3174848    .1866256
     event_1 |   .4018659   .1009463     3.98   0.000     .2040148     .599717
     event_2 |   .4786423    .103419     4.63   0.000     .2759448    .6813398
     event_3 |   .6036649   .1252244     4.82   0.000     .3582295    .8491003
     event_4 |   .6267481   .1520656     4.12   0.000      .328705    .9247912
     event_5 |   .6038958   .1811379     3.33   0.001     .2488721    .9589196
------------------------------------------------------------------------------
  2,737
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m5
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating lnQL: event_5
Estimating lnK: event_m5
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnK: event_5
Estimating lnL: event_m5
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating lnL: event_5
Estimating exporter: event_m5
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating exporter: event_5
Estimating lnQ: event_m5
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQ: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      3,446

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m5 |    .251039   .1781949     1.41   0.159    -.0982166    .6002945
    event_m4 |   .1041318   .1677918     0.62   0.535    -.2247341    .4329978
    event_m3 |   .0443303   .1614551     0.27   0.784    -.2721159    .3607765
    event_m2 |   .3010696   .1710733     1.76   0.078    -.0342279    .6363671
    event_m1 |   .1427771   .1093665     1.31   0.192    -.0715772    .3571315
     event_1 |   .4159227   .1045255     3.98   0.000     .2110566    .6207889
     event_2 |   .5151109   .1019155     5.05   0.000     .3153603    .7148616
     event_3 |   .7297873   .1121598     6.51   0.000     .5099581    .9496166
     event_4 |   .7335793    .100662     7.29   0.000     .5362853    .9308733
     event_5 |   .7394431   .1149158     6.43   0.000     .5142123    .9646739
-------------+----------------------------------------------------------------
lnK          |
    event_m5 |     .19543   .2903806     0.67   0.501    -.3737055    .7645654
    event_m4 |   .4745983   .3055827     1.55   0.120    -.1243327    1.073529
    event_m3 |   .1607213   .2111736     0.76   0.447    -.2531713     .574614
    event_m2 |   -.017376   .1439939    -0.12   0.904    -.2995988    .2648468
    event_m1 |  -.0093876   .0957649    -0.10   0.922    -.1970833     .178308
     event_1 |    .149234   .2390032     0.62   0.532    -.3192038    .6176717
     event_2 |    .529653   .2484754     2.13   0.033     .0426501    1.016656
     event_3 |   .6548669    .251968     2.60   0.009     .1610187    1.148715
     event_4 |   .7344552   .2785383     2.64   0.008     .1885301     1.28038
     event_5 |   .8495454   .2492603     3.41   0.001     .3610041    1.338087
-------------+----------------------------------------------------------------
lnL          |
    event_m5 |   .1390083   .2987652     0.47   0.642    -.4465606    .7245773
    event_m4 |   .1407815   .2087895     0.67   0.500    -.2684384    .5500014
    event_m3 |   .0668148   .1920353     0.35   0.728    -.3095675    .4431971
    event_m2 |  -.0845247   .1305082    -0.65   0.517     -.340316    .1712666
    event_m1 |   .0427448    .061759     0.69   0.489    -.0783006    .1637902
     event_1 |   .1777329   .0961658     1.85   0.065    -.0107486    .3662143
     event_2 |   .2850571   .0624844     4.56   0.000     .1625898    .4075243
     event_3 |    .358898   .1001227     3.58   0.000     .1626611    .5551349
     event_4 |   .4613748   .1076526     4.29   0.000     .2503795    .6723701
     event_5 |   .4468708   .0956104     4.67   0.000     .2594779    .6342638
-------------+----------------------------------------------------------------
exporter     |
    event_m5 |    .095223   .0905308     1.05   0.293    -.0822141    .2726602
    event_m4 |    -.02405     .10693    -0.22   0.822    -.2336289     .185529
    event_m3 |   .1066506   .0627021     1.70   0.089    -.0162432    .2295443
    event_m2 |   .0601543   .0484893     1.24   0.215    -.0348829    .1551916
    event_m1 |   .0694842   .0452533     1.54   0.125    -.0192106    .1581791
     event_1 |   .1863014   .0592239     3.15   0.002     .0702246    .3023781
     event_2 |   .1242432   .0588747     2.11   0.035     .0088509    .2396355
     event_3 |   .0286624   .1093031     0.26   0.793    -.1855677    .2428925
     event_4 |   .0971223    .042868     2.27   0.023     .0131025    .1811421
     event_5 |   .0996016    .050728     1.96   0.050     .0001765    .1990266
-------------+----------------------------------------------------------------
lnQ          |
    event_m5 |   .3900474   .3215908     1.21   0.225    -.2402591    1.020354
    event_m4 |   .2449134   .2312209     1.06   0.290    -.2082712     .698098
    event_m3 |   .1111451    .200461     0.55   0.579    -.2817512    .5040413
    event_m2 |    .216545     .16457     1.32   0.188    -.1060064    .5390963
    event_m1 |   .1855219   .0853254     2.17   0.030     .0182873    .3527566
     event_1 |   .5936556   .0742709     7.99   0.000     .4480874    .7392239
     event_2 |    .800168   .0984596     8.13   0.000     .6071907    .9931453
     event_3 |   1.088685   .1408618     7.73   0.000     .8126011    1.364769
     event_4 |   1.194954   .1014213    11.78   0.000     .9961719    1.393736
     event_5 |   1.186314   .1074229    11.04   0.000      .975769    1.396859
------------------------------------------------------------------------------
  3,446

. 
. esttab m* using "`here'/output/table_attgt_weightsfo.tex", mtitle b(3) se(3) replace
(note: file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_weightsfo.tex not found)
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_weightsfo.tex)

. esttab m* using "`here'/output/table_attgt_weightsfo.txt", mtitle b(3) se(3) replace
(note: file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_weightsfo.txt not found)
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_weightsfo.txt)

. 
. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_weightsfo.log
  log type:  text
 closed on:  20 Jul 2021, 16:44:23
--------------------------------------------------------------------------------------------------------------------------------------------------------------
