--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_att5.log
  log type:  text
 opened on:   6 Jul 2021, 17:44:59

. 
. use "`here'/temp/analysis_sample.dta", clear

. 
. replace foreign_hire = 1 if ever_foreign_hire == 1 & foreign == 1
(1,544 real changes made)

. replace has_expat_ceo = 1 if ever_expat_ceo == 1 & foreign == 1
(2,378 real changes made)

. 
. rename ever_foreign ef

. rename ever_foreign_hire efh

. rename has_expat_ceo has_expat

. 
. foreach sample in ef efh {
  2.         foreach var in foreign foreign_hire has_expat {
  3.                 attgt lnQL lnK lnL exporter lnQ if `sample' & time_foreign <= 5, treatment(`var') aggregate(att) pre(5) post(5) reps(20) notyet
  4.                 count if e(sample) == 1
  5.                 eststo model_`sample'`var', title("`sample' `var'")
  6.         }
  7. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
unknown function *if!missing()
r(133);

end of do-file

r(133);

. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_att5.log
  log type:  text
 closed on:   6 Jul 2021, 17:50:28
--------------------------------------------------------------------------------------------------------------------------------------------------------------
