--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_2002.log
  log type:  text
 opened on:  29 Jun 2021, 12:14:21

. 
. use "`here'/temp/analysis_sample.dta"

. 
. *attgt exporter lnQL if inrange(year, 1992, 2004) & ever_foreign, treatment(has_expat_ceo ) aggregate(e) pre(2) post(3) reps(20)
. *matrix list e(b)
. *esttab
. 
. *foreach var in exporter lnQL {
. *       attgt `var' if inrange(year, 1992, 2004) & ever_foreign, treatment(has_expat_ceo ) aggregate(e) pre(2) post(3) reps(20)
. *       matrix list e(b)
. *       esttab
. *}
. 
. rename ever_foreign ef

. rename ever_foreign_hire efh

. rename has_expat_ceo has_expat

. 
. gen lnIK = ln(immat_18)
(139,036 missing values generated)

. gen lnIK_0=lnIK
(139,036 missing values generated)

. replace lnIK_0=0 if immat_18==0
(40,686 real changes made)

. gen lnEx=ln(export_18)
(198,574 missing values generated)

. gen Qh=sales_18-export_18
(79,688 missing values generated)

. gen lnQh=ln(Qh)
(80,529 missing values generated)

. 
. foreach sample in ef efh {
  2.         foreach var in foreign foreign_hire has_expat {
  3.                 *eststo: attgt exporter lnQL if inrange(year, 1992, 2004) & ever_foreign, treatment(`var') aggregate(e) pre(2) post(3) reps(20)
.                 *attgt exporter lnQL if inrange(year, 1992, 2004) & ever_foreign, treatment(`var') aggregate(e) pre(2) post(3) reps(20)
.                 *attgt lnQL TFP_cd lnK lnIK_0 lnL exporter lnQ lnQh lnEx if `sample' & year >= 2002, treatment(`var') aggregate(e) pre(4) post(4) reps(20) n
> otyet
.                 attgt lnQL TFP_cd lnK lnL exporter lnQ if `sample' & year >= 2002, treatment(`var') aggregate(e) pre(4) post(4) reps(20) notyet
  4.                 count if e(sample) == 1
  5.                 eststo model_`sample'`var', title("`sample' `var'")
  6.                 *matrix list e(b)
.         }
  7. 
.         *esttab model_`sample'* using "`here'/output/table_`sample'_attgt.tex", mtitle title("`sample'") b(3) se(3) replace
.         *esttab model_`sample'* using "`here'/output/table_`sample'_attgt.txt", mtitle title("`sample'") b(3) se(3) replace
. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,902

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m4 |   .0279538   .0423745     0.66   0.509    -.0550988    .1110063
    event_m3 |   .0177016   .0566468     0.31   0.755    -.0933241    .1287272
    event_m2 |   .0208867   .0428911     0.49   0.626    -.0631784    .1049518
    event_m1 |   .0012936   .0257627     0.05   0.960    -.0492004    .0517877
     event_1 |   .0537509   .0412665     1.30   0.193      -.02713    .1346319
     event_2 |   .0463789   .0634193     0.73   0.465    -.0779206    .1706784
     event_3 |   .0841695   .0693351     1.21   0.225    -.0517248    .2200638
     event_4 |   .0460686   .0758125     0.61   0.543    -.1025212    .1946583
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m4 |   .0076493   .0151152     0.51   0.613     -.021976    .0372746
    event_m3 |   .0282221   .0228237     1.24   0.216    -.0165116    .0729557
    event_m2 |  -.0067103    .022641    -0.30   0.767     -.051086    .0376653
    event_m1 |  -.0085386   .0125362    -0.68   0.496    -.0331091    .0160318
     event_1 |   .0089591   .0164321     0.55   0.586    -.0232472    .0411653
     event_2 |   .0252881   .0282221     0.90   0.370    -.0300262    .0806023
     event_3 |   .0266934   .0335295     0.80   0.426    -.0390233      .09241
     event_4 |  -.0095308   .0368316    -0.26   0.796    -.0817195    .0626578
-------------+----------------------------------------------------------------
lnK          |
    event_m4 |   .0521055   .0753873     0.69   0.489    -.0956509    .1998619
    event_m3 |   .0640143   .0621539     1.03   0.303    -.0578051    .1858337
    event_m2 |   .0492053   .0660179     0.75   0.456    -.0801874    .1785979
    event_m1 |   .0674969   .0404633     1.67   0.095    -.0118097    .1468035
     event_1 |  -.0297806   .0367073    -0.81   0.417    -.1017255    .0421643
     event_2 |   -.005314   .0406149    -0.13   0.896    -.0849176    .0742897
     event_3 |  -.0677734   .0686507    -0.99   0.324    -.2023264    .0667795
     event_4 |  -.1514273   .1147627    -1.32   0.187     -.376358    .0735033
-------------+----------------------------------------------------------------
lnL          |
    event_m4 |   .0835732     .07965     1.05   0.294    -.0725379    .2396843
    event_m3 |   .0518898   .0373876     1.39   0.165    -.0213886    .1251682
    event_m2 |   .0068414   .0476806     0.14   0.886    -.0866108    .1002936
    event_m1 |  -.0107619   .0280236    -0.38   0.701    -.0656871    .0441633
     event_1 |   .0335272   .0203503     1.65   0.099    -.0063586    .0734131
     event_2 |   .0623311   .0391213     1.59   0.111    -.0143453    .1390075
     event_3 |   .0206355   .0499455     0.41   0.679    -.0772558    .1185267
     event_4 |   .0200486    .097521     0.21   0.837     -.171089    .2111863
-------------+----------------------------------------------------------------
exporter     |
    event_m4 |  -.0134662   .0231848    -0.58   0.561    -.0589076    .0319752
    event_m3 |   .0037536   .0255857     0.15   0.883    -.0463935    .0539007
    event_m2 |   .0239894   .0252311     0.95   0.342    -.0254626    .0734415
    event_m1 |  -.0064137   .0137187    -0.47   0.640    -.0333019    .0204744
     event_1 |   .0230729   .0128366     1.80   0.072    -.0020864    .0482322
     event_2 |   .0208975   .0148441     1.41   0.159    -.0081964    .0499914
     event_3 |   .0006508   .0240085     0.03   0.978    -.0464051    .0477066
     event_4 |   .0126041   .0327465     0.38   0.700    -.0515779    .0767861
-------------+----------------------------------------------------------------
lnQ          |
    event_m4 |   .1115269   .0746812     1.49   0.135    -.0348457    .2578994
    event_m3 |   .0695913   .0601597     1.16   0.247    -.0483195    .1875021
    event_m2 |    .027728   .0654351     0.42   0.672    -.1005223    .1559784
    event_m1 |  -.0094683   .0403215    -0.23   0.814     -.088497    .0695603
     event_1 |   .0872782   .0490737     1.78   0.075    -.0089044    .1834608
     event_2 |   .1087099   .0634115     1.71   0.086    -.0155743    .2329942
     event_3 |    .104805   .0690989     1.52   0.129    -.0306264    .2402364
     event_4 |   .0661172   .1253651     0.53   0.598    -.1795939    .3118283
------------------------------------------------------------------------------
  5,902
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,282

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m4 |   .0649826   .0578831     1.12   0.262    -.0484662    .1784313
    event_m3 |   .0794815    .045943     1.73   0.084    -.0105652    .1695282
    event_m2 |   .0188883   .0428149     0.44   0.659    -.0650275    .1028041
    event_m1 |   .0115131   .0301024     0.38   0.702    -.0474865    .0705127
     event_1 |    .077355   .0420864     1.84   0.066    -.0051329    .1598428
     event_2 |   .1451423   .0630394     2.30   0.021     .0215872    .2686973
     event_3 |   .1594202   .0709748     2.25   0.025     .0203122    .2985283
     event_4 |   .1550913   .0802639     1.93   0.053    -.0022231    .3124058
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m4 |   .0014661    .030032     0.05   0.961    -.0573956    .0603277
    event_m3 |   .0228205   .0204367     1.12   0.264    -.0172347    .0628757
    event_m2 |  -.0312783   .0236774    -1.32   0.186    -.0776851    .0151286
    event_m1 |  -.0164299   .0150442    -1.09   0.275     -.045916    .0130561
     event_1 |   .0295291   .0174544     1.69   0.091    -.0046808     .063739
     event_2 |   .0560915   .0290674     1.93   0.054    -.0008796    .1130626
     event_3 |   .0572606   .0365702     1.57   0.117    -.0144156    .1289369
     event_4 |   .0571277   .0428667     1.33   0.183    -.0268894    .1411449
-------------+----------------------------------------------------------------
lnK          |
    event_m4 |     .02748    .100378     0.27   0.784    -.1692573    .2242173
    event_m3 |   .0186667   .0789669     0.24   0.813    -.1361056    .1734391
    event_m2 |   .0544482   .0564645     0.96   0.335    -.0562202    .1651165
    event_m1 |   .0617903    .042223     1.46   0.143    -.0209652    .1445459
     event_1 |  -.0088172   .0402669    -0.22   0.827    -.0877388    .0701043
     event_2 |     .05279   .0603244     0.88   0.382    -.0654437    .1710237
     event_3 |  -.0728083   .0846727    -0.86   0.390    -.2387638    .0931472
     event_4 |  -.1545544   .1305078    -1.18   0.236    -.4103451    .1012362
-------------+----------------------------------------------------------------
lnL          |
    event_m4 |   .0714841   .0603697     1.18   0.236    -.0468384    .1898065
    event_m3 |   .0080097    .044341     0.18   0.857    -.0788971    .0949165
    event_m2 |  -.0303103   .0458762    -0.66   0.509    -.1202259    .0596053
    event_m1 |  -.0149867   .0318905    -0.47   0.638     -.077491    .0475175
     event_1 |    .028653   .0274152     1.05   0.296    -.0250798    .0823858
     event_2 |   .0215752   .0518875     0.42   0.678    -.0801224    .1232728
     event_3 |  -.0155513   .0621208    -0.25   0.802    -.1373059    .1062033
     event_4 |   .0368407   .0810556     0.45   0.649    -.1220254    .1957069
-------------+----------------------------------------------------------------
exporter     |
    event_m4 |  -.0405338   .0225612    -1.80   0.072    -.0847529    .0036854
    event_m3 |  -.0296681     .01815    -1.63   0.102    -.0652414    .0059052
    event_m2 |  -.0215024   .0197972    -1.09   0.277    -.0603043    .0172995
    event_m1 |  -.0033139   .0162335    -0.20   0.838    -.0351311    .0285032
     event_1 |   .0150872   .0148315     1.02   0.309     -.013982    .0441564
     event_2 |   .0141483   .0208303     0.68   0.497    -.0266783     .054975
     event_3 |   .0219628   .0229052     0.96   0.338    -.0229305    .0668561
     event_4 |   .0645846   .0324962     1.99   0.047     .0008933    .1282759
-------------+----------------------------------------------------------------
lnQ          |
    event_m4 |   .1364666   .0861775     1.58   0.113    -.0324381    .3053713
    event_m3 |   .0874913   .0607759     1.44   0.150    -.0316274    .2066099
    event_m2 |   -.011422   .0462636    -0.25   0.805    -.1020969    .0792529
    event_m1 |  -.0034736   .0327417    -0.11   0.916    -.0676461    .0606989
     event_1 |    .106008   .0463518     2.29   0.022     .0151602    .1968558
     event_2 |   .1667175   .0779644     2.14   0.032       .01391     .319525
     event_3 |   .1438689   .0854189     1.68   0.092    -.0235491     .311287
     event_4 |   .1919321   .1131008     1.70   0.090    -.0297414    .4136055
------------------------------------------------------------------------------
  7,282
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Callaway Sant'Anna (2021)

                                                Number of obs     =      9,737

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m4 |   .0544414   .0595317     0.91   0.360    -.0622385    .1711213
    event_m3 |   .0088159   .0490206     0.18   0.857    -.0872628    .1048946
    event_m2 |   .0623243   .0407967     1.53   0.127    -.0176358    .1422843
    event_m1 |   .0306433   .0245116     1.25   0.211    -.0173987    .0786852
     event_1 |   .1267313   .0454168     2.79   0.005      .037716    .2157467
     event_2 |   .2444729   .0536899     4.55   0.000     .1392427    .3497031
     event_3 |   .2952292   .0614768     4.80   0.000      .174737    .4157215
     event_4 |   .2799236   .0756731     3.70   0.000      .131607    .4282401
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m4 |   .0060711   .0325275     0.19   0.852    -.0576817    .0698239
    event_m3 |   .0198749    .018076     1.10   0.272    -.0155534    .0553032
    event_m2 |   .0043558   .0278223     0.16   0.876    -.0501748    .0588864
    event_m1 |   .0021897   .0133343     0.16   0.870    -.0239451    .0283245
     event_1 |   .0320213   .0212495     1.51   0.132     -.009627    .0736696
     event_2 |   .0657494   .0278681     2.36   0.018     .0111289    .1203699
     event_3 |    .067726   .0333709     2.03   0.042     .0023203    .1331316
     event_4 |   .0593687   .0376047     1.58   0.114    -.0143351    .1330726
-------------+----------------------------------------------------------------
lnK          |
    event_m4 |   -.042033   .1213096    -0.35   0.729    -.2797955    .1957294
    event_m3 |  -.0416326    .094377    -0.44   0.659     -.226608    .1433429
    event_m2 |  -.0099509   .0839187    -0.12   0.906    -.1744286    .1545267
    event_m1 |   .0266909   .0490259     0.54   0.586     -.069398    .1227799
     event_1 |   .0400902   .0583615     0.69   0.492    -.0742963    .1544767
     event_2 |   .0979413   .0898764     1.09   0.276    -.0782133    .2740958
     event_3 |   .0253123   .1114774     0.23   0.820    -.1931795     .243804
     event_4 |  -.0084109   .1232219    -0.07   0.946    -.2499213    .2330995
-------------+----------------------------------------------------------------
lnL          |
    event_m4 |   .0077299    .056783     0.14   0.892    -.1035627    .1190226
    event_m3 |  -.0520308    .039589    -1.31   0.189    -.1296238    .0255622
    event_m2 |  -.1277819   .0554025    -2.31   0.021    -.2363687   -.0191951
    event_m1 |  -.0659604    .031867    -2.07   0.038    -.1284186   -.0035021
     event_1 |   .0334623   .0508158     0.66   0.510    -.0661348    .1330594
     event_2 |   .0147087   .0612507     0.24   0.810    -.1053404    .1347579
     event_3 |  -.0150847   .0609686    -0.25   0.805    -.1345808    .1044115
     event_4 |   -.000565   .1039043    -0.01   0.996    -.2042138    .2030837
-------------+----------------------------------------------------------------
exporter     |
    event_m4 |  -.0287961   .0307566    -0.94   0.349    -.0890779    .0314857
    event_m3 |   .0009939   .0274009     0.04   0.971    -.0527108    .0546986
    event_m2 |  -.0149377   .0285633    -0.52   0.601    -.0709208    .0410454
    event_m1 |    .010497    .020418     0.51   0.607    -.0295215    .0505155
     event_1 |    .026168   .0185517     1.41   0.158    -.0101927    .0625287
     event_2 |   .0192389   .0202916     0.95   0.343    -.0205319    .0590098
     event_3 |   -.001526   .0267252    -0.06   0.954    -.0539063    .0508544
     event_4 |   .0193919   .0315422     0.61   0.539    -.0424296    .0812135
-------------+----------------------------------------------------------------
lnQ          |
    event_m4 |   .0621713   .0857841     0.72   0.469    -.1059626    .2303051
    event_m3 |   -.043215   .0658576    -0.66   0.512    -.1722935    .0858636
    event_m2 |  -.0654576   .0706415    -0.93   0.354    -.2039125    .0729972
    event_m1 |  -.0353171   .0330611    -1.07   0.285    -.1001157    .0294815
     event_1 |   .1601936   .0764054     2.10   0.036     .0104417    .3099456
     event_2 |   .2591817   .0896197     2.89   0.004     .0835302    .4348332
     event_3 |   .2801446   .1046362     2.68   0.007     .0750614    .4852277
     event_4 |   .2793585   .1359811     2.05   0.040     .0128405    .5458765
------------------------------------------------------------------------------
  9,737
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Callaway Sant'Anna (2021)

                                                Number of obs     =      3,700

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m4 |   .0603393   .0653746     0.92   0.356    -.0677926    .1884712
    event_m3 |   .0125385   .0432839     0.29   0.772    -.0722964    .0973735
    event_m2 |   .0187476   .0357641     0.52   0.600    -.0513487    .0888438
    event_m1 |   -.002804   .0346986    -0.08   0.936    -.0708121    .0652041
     event_1 |   .0833718   .0547496     1.52   0.128    -.0239354     .190679
     event_2 |   .0930617   .0742504     1.25   0.210    -.0524663    .2385898
     event_3 |   .1261279   .0784736     1.61   0.108    -.0276775    .2799333
     event_4 |   .1266262   .0779912     1.62   0.104    -.0262338    .2794862
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m4 |   .0011631   .0277365     0.04   0.967    -.0531995    .0555256
    event_m3 |    .016316   .0297552     0.55   0.583    -.0420031    .0746352
    event_m2 |  -.0207834   .0249593    -0.83   0.405    -.0697027     .028136
    event_m1 |  -.0086862   .0194779    -0.45   0.656    -.0468622    .0294897
     event_1 |   .0329209   .0238817     1.38   0.168    -.0138863    .0797281
     event_2 |   .0564872   .0309935     1.82   0.068    -.0042589    .1172333
     event_3 |   .0638946   .0477356     1.34   0.181    -.0296654    .1574546
     event_4 |   .0696352    .037049     1.88   0.060    -.0029795    .1422499
-------------+----------------------------------------------------------------
lnK          |
    event_m4 |    .080429   .1132374     0.71   0.478    -.1415123    .3023702
    event_m3 |   .0865214   .0621077     1.39   0.164    -.0352075    .2082503
    event_m2 |   .1175581   .0718729     1.64   0.102    -.0233103    .2584265
    event_m1 |   .0944411   .0499554     1.89   0.059    -.0034697    .1923519
     event_1 |   .0266313   .0534709     0.50   0.618    -.0781696    .1314322
     event_2 |    .081184   .0502675     1.62   0.106    -.0173385    .1797065
     event_3 |  -.0701522   .0757373    -0.93   0.354    -.2185946    .0782901
     event_4 |  -.1612717   .1280402    -1.26   0.208    -.4122259    .0896825
-------------+----------------------------------------------------------------
lnL          |
    event_m4 |   .0634095   .0930701     0.68   0.496    -.1190046    .2458236
    event_m3 |   .0460293   .0644667     0.71   0.475    -.0803231    .1723817
    event_m2 |   .0138195   .0534308     0.26   0.796     -.090903    .1185421
    event_m1 |  -.0026322   .0368628    -0.07   0.943     -.074882    .0696176
     event_1 |   .0728514   .0310552     2.35   0.019     .0119843    .1337186
     event_2 |   .1123071   .0534459     2.10   0.036     .0075551     .217059
     event_3 |   .0634009   .0595096     1.07   0.287    -.0532357    .1800375
     event_4 |   .0885697   .0879179     1.01   0.314    -.0837461    .2608855
-------------+----------------------------------------------------------------
exporter     |
    event_m4 |  -.0610617    .025192    -2.42   0.015    -.1104371   -.0116862
    event_m3 |  -.0074101   .0288117    -0.26   0.797      -.06388    .0490599
    event_m2 |   .0088031    .030164     0.29   0.770    -.0503172    .0679234
    event_m1 |  -.0058254   .0211141    -0.28   0.783    -.0472083    .0355576
     event_1 |   .0460488   .0187058     2.46   0.014     .0093861    .0827115
     event_2 |    .036053   .0208838     1.73   0.084    -.0048784    .0769845
     event_3 |   .0261668   .0270377     0.97   0.333    -.0268262    .0791598
     event_4 |   .0591087   .0270109     2.19   0.029     .0061682    .1120491
-------------+----------------------------------------------------------------
lnQ          |
    event_m4 |   .1237487   .0828425     1.49   0.135    -.0386197    .2861171
    event_m3 |   .0585678   .0750021     0.78   0.435    -.0884337    .2055693
    event_m2 |   .0325671   .0667715     0.49   0.626    -.0983027    .1634368
    event_m1 |  -.0054362   .0419564    -0.13   0.897    -.0876692    .0767967
     event_1 |   .1562232   .0661398     2.36   0.018     .0265917    .2858548
     event_2 |   .2053688   .0782398     2.62   0.009     .0520215    .3587161
     event_3 |   .1895288   .0741001     2.56   0.011     .0442953    .3347622
     event_4 |   .2151959   .1228157     1.75   0.080    -.0255184    .4559102
------------------------------------------------------------------------------
  3,700
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,502

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m4 |   .0939194   .0508633     1.85   0.065    -.0057709    .1936097
    event_m3 |   .1215465   .0488366     2.49   0.013     .0258286    .2172644
    event_m2 |   .0526204    .042483     1.24   0.215    -.0306447    .1358854
    event_m1 |   .0284008    .028156     1.01   0.313    -.0267839    .0835855
     event_1 |   .0623762   .0449907     1.39   0.166    -.0258038    .1505563
     event_2 |   .1104756   .0589577     1.87   0.061    -.0050793    .2260305
     event_3 |   .1199482   .0678833     1.77   0.077    -.0131006    .2529971
     event_4 |   .1119827   .0721348     1.55   0.121    -.0293989    .2533642
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m4 |    .007004   .0312248     0.22   0.823    -.0541955    .0682034
    event_m3 |   .0321209   .0222743     1.44   0.149     -.011536    .0757778
    event_m2 |  -.0249366   .0257239    -0.97   0.332    -.0753545    .0254812
    event_m1 |  -.0105021   .0134981    -0.78   0.437    -.0369579    .0159537
     event_1 |   .0222989   .0192606     1.16   0.247    -.0154512     .060049
     event_2 |   .0513681    .027259     1.88   0.060    -.0020584    .1047947
     event_3 |   .0528667   .0332651     1.59   0.112    -.0123317     .118065
     event_4 |   .0536414   .0349491     1.53   0.125    -.0148576    .1221403
-------------+----------------------------------------------------------------
lnK          |
    event_m4 |   .1050205   .1041331     1.01   0.313    -.0990766    .3091177
    event_m3 |   .0737213   .0576837     1.28   0.201    -.0393366    .1867792
    event_m2 |   .0933654    .054138     1.72   0.085    -.0127432    .1994739
    event_m1 |   .0878904   .0435789     2.02   0.044     .0024773    .1733036
     event_1 |  -.0259892    .038993    -0.67   0.505    -.1024139    .0504356
     event_2 |   .0142845   .0625809     0.23   0.819    -.1083717    .1369408
     event_3 |  -.1401531    .094173    -1.49   0.137    -.3247287    .0444225
     event_4 |  -.2525989   .1315015    -1.92   0.055    -.5103372    .0051393
-------------+----------------------------------------------------------------
lnL          |
    event_m4 |   .1048178   .0596658     1.76   0.079     -.012125    .2217606
    event_m3 |   .0191413    .048499     0.39   0.693    -.0759149    .1141976
    event_m2 |  -.0284789   .0513322    -0.55   0.579    -.1290881    .0721303
    event_m1 |  -.0050024   .0311175    -0.16   0.872    -.0659917    .0559868
     event_1 |   .0238116   .0265616     0.90   0.370    -.0282482    .0758713
     event_2 |   .0261398   .0533891     0.49   0.624     -.078501    .1307806
     event_3 |  -.0257621    .067373    -0.38   0.702    -.1578108    .1062865
     event_4 |    .014193   .0950775     0.15   0.881    -.1721556    .2005415
-------------+----------------------------------------------------------------
exporter     |
    event_m4 |  -.0448127   .0210409    -2.13   0.033    -.0860521   -.0035732
    event_m3 |   -.021243    .017905    -1.19   0.235     -.056336    .0138501
    event_m2 |  -.0253534   .0205768    -1.23   0.218    -.0656831    .0149763
    event_m1 |  -.0040659   .0169444    -0.24   0.810    -.0372762    .0291445
     event_1 |   .0170594   .0159587     1.07   0.285    -.0142191    .0483379
     event_2 |   .0215283   .0191831     1.12   0.262    -.0160699    .0591265
     event_3 |   .0205987   .0215094     0.96   0.338     -.021559    .0627564
     event_4 |   .0655603   .0329685     1.99   0.047     .0009432    .1301774
-------------+----------------------------------------------------------------
lnQ          |
    event_m4 |   .1987372    .077034     2.58   0.010     .0477533    .3497212
    event_m3 |   .1406879   .0565218     2.49   0.013     .0299071    .2514686
    event_m2 |   .0241415   .0522227     0.46   0.644    -.0782132    .1264961
    event_m1 |   .0233984   .0334022     0.70   0.484    -.0420688    .0888656
     event_1 |   .0861878   .0490265     1.76   0.079    -.0099023    .1822779
     event_2 |   .1366154   .0874945     1.56   0.118    -.0348707    .3081015
     event_3 |   .0941861   .1007345     0.93   0.350    -.1032498     .291622
     event_4 |   .1261756   .1275956     0.99   0.323    -.1239071    .3762583
------------------------------------------------------------------------------
  4,502
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Callaway Sant'Anna (2021)

                                                Number of obs     =      6,957

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m4 |   .0514196   .0642299     0.80   0.423    -.0744688     .177308
    event_m3 |   .0132298   .0465931     0.28   0.776     -.078091    .1045506
    event_m2 |   .0701205   .0411202     1.71   0.088    -.0104737    .1507146
    event_m1 |   .0359427   .0244739     1.47   0.142    -.0120252    .0839107
     event_1 |   .1243576    .046844     2.65   0.008     .0325451    .2161701
     event_2 |   .2385223   .0567729     4.20   0.000     .1272494    .3497952
     event_3 |    .293168   .0659553     4.44   0.000      .163898    .4224379
     event_4 |   .2862885   .0881921     3.25   0.001     .1134351    .4591418
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m4 |   .0030142   .0266079     0.11   0.910    -.0491364    .0551648
    event_m3 |   .0223322   .0197219     1.13   0.257     -.016322    .0609864
    event_m2 |   .0070119    .028443     0.25   0.805    -.0487354    .0627592
    event_m1 |    .004183   .0126536     0.33   0.741    -.0206176    .0289836
     event_1 |   .0300766   .0217525     1.38   0.167    -.0125574    .0727106
     event_2 |   .0623277   .0290689     2.14   0.032     .0053538    .1193016
     event_3 |   .0660851    .033808     1.95   0.051    -.0001772    .1323475
     event_4 |   .0634157   .0497538     1.27   0.202    -.0341001    .1609314
-------------+----------------------------------------------------------------
lnK          |
    event_m4 |  -.0744757   .1097738    -0.68   0.497    -.2896283     .140677
    event_m3 |  -.0707178   .0933815    -0.76   0.449    -.2537422    .1123067
    event_m2 |  -.0327366   .0834578    -0.39   0.695    -.1963108    .1308376
    event_m1 |   .0173429   .0480217     0.36   0.718    -.0767779    .1114637
     event_1 |   .0525128   .0611082     0.86   0.390     -.067257    .1722827
     event_2 |   .1262618   .0932915     1.35   0.176    -.0565861    .3091098
     event_3 |    .056343   .1164608     0.48   0.629    -.1719161     .284602
     event_4 |   .0234478   .1044895     0.22   0.822    -.1813478    .2282434
-------------+----------------------------------------------------------------
lnL          |
    event_m4 |  -.0089165   .0607818    -0.15   0.883    -.1280468    .1102137
    event_m3 |  -.0708593    .043251    -1.64   0.101    -.1556297    .0139111
    event_m2 |  -.1431176   .0571165    -2.51   0.012    -.2550637   -.0311714
    event_m1 |  -.0740341   .0328822    -2.25   0.024    -.1384821   -.0095861
     event_1 |   .0397452   .0513134     0.77   0.439    -.0608271    .1403176
     event_2 |   .0296871   .0611139     0.49   0.627     -.090094    .1494681
     event_3 |   .0001375   .0598364     0.00   0.998    -.1171397    .1174147
     event_4 |    .015939   .0954666     0.17   0.867    -.1711722    .2030502
-------------+----------------------------------------------------------------
exporter     |
    event_m4 |  -.0289795   .0244439    -1.19   0.236    -.0768886    .0189296
    event_m3 |   .0019537    .028404     0.07   0.945    -.0537171    .0576246
    event_m2 |  -.0153954    .029327    -0.52   0.600    -.0728754    .0420845
    event_m1 |   .0095558    .021105     0.45   0.651    -.0318091    .0509208
     event_1 |   .0268281   .0180515     1.49   0.137    -.0085523    .0622084
     event_2 |   .0191914   .0198681     0.97   0.334    -.0197495    .0581322
     event_3 |  -.0036146   .0265981    -0.14   0.892    -.0557459    .0485167
     event_4 |   .0172175   .0364673     0.47   0.637    -.0542572    .0886922
-------------+----------------------------------------------------------------
lnQ          |
    event_m4 |    .042503   .0906345     0.47   0.639    -.1351374    .2201435
    event_m3 |  -.0576296   .0675824    -0.85   0.394    -.1900886    .0748295
    event_m2 |  -.0729971   .0725523    -1.01   0.314     -.215197    .0692028
    event_m1 |  -.0380913   .0332416    -1.15   0.252    -.1032437     .027061
     event_1 |   .1641028   .0773237     2.12   0.034     .0125512    .3156544
     event_2 |   .2682094   .0907485     2.96   0.003     .0903457    .4460731
     event_3 |   .2933054   .1065284     2.75   0.006     .0845136    .5020973
     event_4 |   .3022274   .1505286     2.01   0.045     .0071969     .597258
------------------------------------------------------------------------------
  6,957

. 
. esttab model* using "`here'/output/table_attgt_2002.tex", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_2002.tex)

. esttab model* using "`here'/output/table_attgt_2002.txt", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_2002.txt)

. 
. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_2002.log
  log type:  text
 closed on:  29 Jun 2021, 14:16:36
--------------------------------------------------------------------------------------------------------------------------------------------------------------
