--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_loop.log
  log type:  text
 opened on:   8 Jul 2021, 17:43:56

. 
. use "`here'/temp/analysis_sample.dta"

. 
. rename ever_foreign ef

. rename ever_foreign_hire efh

. rename has_expat_ceo has_expat

. 
. gen lnIK = ln(immat_18)
(7,125 missing values generated)

. gen lnIK_0 = lnIK
(7,125 missing values generated)

. replace lnIK_0 = 0 if immat_18 == 0
(1,274 real changes made)

. 
. replace export_18 = 0 if export_18 == .
(2,465 real changes made)

. gen Qh = sales_18 - export_18

. gen lnQh = ln(Qh)
(121 missing values generated)

. gen lnQhr = lnQ - lnQh
(121 missing values generated)

. 
. foreach depvar in TFP_cd lnIK_0 lnQh lnQhr {
  2.         foreach var in foreign foreign_hire has_expat {
  3.                         attgt `depvar', treatment(`var') aggregate(e) pre(5) post(5) reps(20) notyet limitcontrol(foreign == 0)
  4.                         count if e(sample) == 1
  5.                         eststo model_`sample'`var'`depvar', title("`depvar' `sample' `var'")
  6.         }
  7. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: event_m5
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating TFP_cd: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =     15,349

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |    .012408    .026496     0.47   0.640    -.0395232    .0643393
    event_m4 |   .0250971   .0223483     1.12   0.261    -.0187049     .068899
    event_m3 |   .0080783   .0155318     0.52   0.603    -.0223635    .0385201
    event_m2 |  -.0461385   .0236196    -1.95   0.051    -.0924321    .0001552
    event_m1 |  -.0174539   .0136756    -1.28   0.202    -.0442576    .0093498
     event_1 |   .0322012   .0116736     2.76   0.006     .0093214     .055081
     event_2 |    .046031   .0173974     2.65   0.008     .0119327    .0801294
     event_3 |   .0547627   .0215853     2.54   0.011     .0124563     .097069
     event_4 |   .0353463   .0284854     1.24   0.215    -.0204841    .0911767
     event_5 |   .0270702   .0350564     0.77   0.440     -.041639    .0957795
------------------------------------------------------------------------------
  15,349
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: event_m5
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating TFP_cd: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =     13,543

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .0193773   .0200581     0.97   0.334    -.0199359    .0586905
    event_m4 |   .0466867   .0351943     1.33   0.185    -.0222929    .1156663
    event_m3 |   .0300266    .019917     1.51   0.132      -.00901    .0690633
    event_m2 |   -.032621   .0251441    -1.30   0.195    -.0819025    .0166605
    event_m1 |   -.029614   .0207488    -1.43   0.154     -.070281    .0110529
     event_1 |   .0537745    .017416     3.09   0.002     .0196397    .0879093
     event_2 |    .067224   .0237402     2.83   0.005      .020694    .1137539
     event_3 |   .0892251   .0259657     3.44   0.001     .0383333    .1401169
     event_4 |     .07764   .0316207     2.46   0.014     .0156646    .1396154
     event_5 |   .0461214   .0387423     1.19   0.234    -.0298121    .1220548
------------------------------------------------------------------------------
  13,543
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: event_m5
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating TFP_cd: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =     11,665

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |    .072072    .044823     1.61   0.108    -.0157794    .1599234
    event_m4 |   .1029749   .0489291     2.10   0.035     .0070755    .1988742
    event_m3 |   .0720268   .0344431     2.09   0.037     .0045196     .139534
    event_m2 |   .0295139   .0306362     0.96   0.335    -.0305319    .0895598
    event_m1 |   .0136182   .0323303     0.42   0.674     -.049748    .0769844
     event_1 |   .0838689   .0311534     2.69   0.007     .0228094    .1449283
     event_2 |   .1263317   .0408575     3.09   0.002     .0462525    .2064108
     event_3 |   .1423954   .0417159     3.41   0.001     .0606337    .2241571
     event_4 |   .1399131   .0527792     2.65   0.008     .0364677    .2433584
     event_5 |   .1020441   .0599001     1.70   0.088     -.015358    .2194462
------------------------------------------------------------------------------
  11,665
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: event_m5
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnIK_0: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      8,654

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |  -.0434198   .2600697    -0.17   0.867    -.5531471    .4663075
    event_m4 |  -.0994388   .1690519    -0.59   0.556    -.4307743    .2318968
    event_m3 |  -.0777129   .2176362    -0.36   0.721    -.5042719    .3488462
    event_m2 |  -.0502757   .1500385    -0.34   0.738    -.3443458    .2437944
    event_m1 |   .0994061   .0667115     1.49   0.136     -.031346    .2301582
     event_1 |   .5929234   .1073614     5.52   0.000      .382499    .8033479
     event_2 |   .6874034   .1698299     4.05   0.000      .354543    1.020264
     event_3 |   .2020226   .2002708     1.01   0.313    -.1905009    .5945461
     event_4 |   .2270319   .2811487     0.81   0.419    -.3240095    .7780732
     event_5 |   .0647452     .23014     0.28   0.778    -.3863209    .5158113
------------------------------------------------------------------------------
  8,654
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: event_m5
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnIK_0: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      7,754

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |    .232165   .2433544     0.95   0.340     -.244801    .7091309
    event_m4 |   .2220972   .2194956     1.01   0.312    -.2081063    .6523008
    event_m3 |  -.0336708   .1638932    -0.21   0.837    -.3548956     .287554
    event_m2 |  -.2499578   .1558755    -1.60   0.109    -.5554681    .0555525
    event_m1 |   .0718751    .079089     0.91   0.363    -.0831365    .2268867
     event_1 |   .5912927    .150292     3.93   0.000     .2967259    .8858595
     event_2 |   .7244069   .1947871     3.72   0.000     .3426313    1.106183
     event_3 |   .2512392   .2637347     0.95   0.341    -.2656714    .7681497
     event_4 |   .3039332   .3327532     0.91   0.361     -.348251    .9561175
     event_5 |   .0527557   .2864317     0.18   0.854    -.5086401    .6141515
------------------------------------------------------------------------------
  7,754
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: event_m5
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnIK_0: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      6,667

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |  -.1083691   .4901634    -0.22   0.825    -1.069072    .8523334
    event_m4 |   .2468101   .4603571     0.54   0.592    -.6554732    1.149093
    event_m3 |  -.0306451   .3231716    -0.09   0.924    -.6640498    .6027596
    event_m2 |  -.3682853   .2956317    -1.25   0.213    -.9477127    .2111421
    event_m1 |   .0235968   .1645995     0.14   0.886    -.2990124    .3462059
     event_1 |   .8971807   .2142683     4.19   0.000     .4772226    1.317139
     event_2 |   1.094775   .2405288     4.55   0.000     .6233473    1.566203
     event_3 |   .5756985    .281632     2.04   0.041     .0237098    1.127687
     event_4 |   .6650568   .3738134     1.78   0.075    -.0676041    1.397718
     event_5 |   .2830257   .3741545     0.76   0.449    -.4503037    1.016355
------------------------------------------------------------------------------
  6,667
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: event_m5
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnQh: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =     15,334

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .2415304    .087457     2.76   0.006     .0701179     .412943
    event_m4 |    .144423   .0613626     2.35   0.019     .0241545    .2646915
    event_m3 |   .1244677   .0587835     2.12   0.034     .0092542    .2396812
    event_m2 |   .0227114   .0455592     0.50   0.618     -.066583    .1120058
    event_m1 |   .0435197   .0228003     1.91   0.056    -.0011681    .0882075
     event_1 |   .1691934   .0499415     3.39   0.001     .0713099    .2670768
     event_2 |   .1564947   .0636189     2.46   0.014     .0318039    .2811854
     event_3 |   .1338695   .0604306     2.22   0.027     .0154276    .2523113
     event_4 |   .0868303   .0786107     1.10   0.269    -.0672437    .2409044
     event_5 |   .1415744   .0963209     1.47   0.142    -.0472111    .3303598
------------------------------------------------------------------------------
  15,334
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: event_m5
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnQh: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =     13,518

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .3050107   .1001362     3.05   0.002     .1087472    .5012741
    event_m4 |   .2307759   .0638759     3.61   0.000     .1055815    .3559704
    event_m3 |   .1559109   .0584344     2.67   0.008     .0413815    .2704402
    event_m2 |   .0498249   .0401569     1.24   0.215    -.0288811     .128531
    event_m1 |   .0043059   .0367917     0.12   0.907    -.0678044    .0764162
     event_1 |   .2004063   .0665813     3.01   0.003     .0699094    .3309033
     event_2 |   .2056956   .0787206     2.61   0.009      .051406    .3599853
     event_3 |   .1780833   .0770478     2.31   0.021     .0270724    .3290942
     event_4 |   .1701437   .0976465     1.74   0.081    -.0212399    .3615273
     event_5 |   .1316345   .1096451     1.20   0.230    -.0832659    .3465349
------------------------------------------------------------------------------
  13,518
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: event_m5
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnQh: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =     11,638

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |     .45758   .1951991     2.34   0.019     .0749967    .8401633
    event_m4 |   .4903672   .1616869     3.03   0.002     .1734668    .8072676
    event_m3 |   .2952506   .1152358     2.56   0.010     .0693925    .5211087
    event_m2 |   .2768901   .1075075     2.58   0.010     .0661793    .4876009
    event_m1 |   .1561772   .0903388     1.73   0.084    -.0208836     .333238
     event_1 |   .3769376    .113755     3.31   0.001     .1539819    .5998934
     event_2 |   .4022841   .1469027     2.74   0.006     .1143601    .6902081
     event_3 |   .3348443   .1387888     2.41   0.016     .0628232    .6068654
     event_4 |   .3522397   .1723082     2.04   0.041     .0145217    .6899576
     event_5 |   .3014434   .1899769     1.59   0.113    -.0709046    .6737913
------------------------------------------------------------------------------
  11,638
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: event_m5
Estimating lnQhr: event_m4
Estimating lnQhr: event_m3
Estimating lnQhr: event_m2
Estimating lnQhr: event_m1
Estimating lnQhr: event_1
Estimating lnQhr: event_2
Estimating lnQhr: event_3
Estimating lnQhr: event_4
Estimating lnQhr: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =     15,334

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |  -.0086557   .0331614    -0.26   0.794     -.073651    .0563395
    event_m4 |  -.0184938   .0329152    -0.56   0.574    -.0830065    .0460189
    event_m3 |  -.0206285   .0311617    -0.66   0.508    -.0817042    .0404473
    event_m2 |  -.0046193   .0259531    -0.18   0.859    -.0554865    .0462478
    event_m1 |  -.0151233   .0198698    -0.76   0.447    -.0540674    .0238209
     event_1 |   .0872767   .0171153     5.10   0.000     .0537314     .120822
     event_2 |   .0975222    .026117     3.73   0.000     .0463339    .1487105
     event_3 |   .1328537   .0367025     3.62   0.000     .0609182    .2047893
     event_4 |   .1229271     .04746     2.59   0.010     .0299072     .215947
     event_5 |   .1844965    .043718     4.22   0.000     .0988108    .2701822
------------------------------------------------------------------------------
  15,334
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: event_m5
Estimating lnQhr: event_m4
Estimating lnQhr: event_m3
Estimating lnQhr: event_m2
Estimating lnQhr: event_m1
Estimating lnQhr: event_1
Estimating lnQhr: event_2
Estimating lnQhr: event_3
Estimating lnQhr: event_4
Estimating lnQhr: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =     13,518

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |  -.0178005   .0440778    -0.40   0.686    -.1041914    .0685904
    event_m4 |  -.0230173    .047421    -0.49   0.627    -.1159607    .0699261
    event_m3 |  -.0212834    .043438    -0.49   0.624    -.1064204    .0638536
    event_m2 |   .0061789   .0308107     0.20   0.841    -.0542089    .0665668
    event_m1 |  -.0261552    .032116    -0.81   0.415    -.0891014     .036791
     event_1 |   .1338754   .0231636     5.78   0.000     .0884754    .1792753
     event_2 |   .1254944   .0355742     3.53   0.000     .0557702    .1952186
     event_3 |   .1653934   .0421448     3.92   0.000     .0827911    .2479957
     event_4 |   .1603572   .0559005     2.87   0.004     .0507943    .2699202
     event_5 |   .2386155   .0616502     3.87   0.000     .1177834    .3594476
------------------------------------------------------------------------------
  13,518
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: event_m5
Estimating lnQhr: event_m4
Estimating lnQhr: event_m3
Estimating lnQhr: event_m2
Estimating lnQhr: event_m1
Estimating lnQhr: event_1
Estimating lnQhr: event_2
Estimating lnQhr: event_3
Estimating lnQhr: event_4
Estimating lnQhr: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =     11,638

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |  -.1331779   .0851238    -1.56   0.118    -.3000175    .0336618
    event_m4 |  -.1847713   .0916856    -2.02   0.044    -.3644717   -.0050709
    event_m3 |  -.1272313   .0849626    -1.50   0.134     -.293755    .0392923
    event_m2 |  -.0580746    .064898    -0.89   0.371    -.1852725    .0691232
    event_m1 |   -.074804   .0650049    -1.15   0.250    -.2022113    .0526034
     event_1 |   .2370978   .0487276     4.87   0.000     .1415934    .3326022
     event_2 |   .2444303     .07196     3.40   0.001     .1033913    .3854693
     event_3 |   .2576114   .0664463     3.88   0.000     .1273791    .3878437
     event_4 |   .2687493   .0813095     3.31   0.001     .1093857    .4281129
     event_5 |   .4257689   .0992498     4.29   0.000     .2312428    .6202949
------------------------------------------------------------------------------
  11,638

. 
. esttab model* using "`here'/output/table_attgt_loop.tex", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_loop.tex)

. esttab model* using "`here'/output/table_attgt_loop.txt", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_loop.txt)

. 
. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_loop.log
  log type:  text
 closed on:   8 Jul 2021, 17:50:10
--------------------------------------------------------------------------------------------------------------------------------------------------------------
