--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_loop_weightsdo.log
  log type:  text
 opened on:  20 Jul 2021, 16:33:57

. 
. use "/`here'/external/pscore_docontrol.dta", clear

. drop treat_match year_match

. *mvencode weight_match, mv(0)
. reshape wide weight_match, i(frame_id_numeric) j(year)
(note: j = 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                     3409   ->     690
Number of variables                   3   ->      26
j variable (25 values)             year   ->   (dropped)
xij variables:
                           weight_match   ->   weight_match1989 weight_match1990 ... weight_match2013
-----------------------------------------------------------------------------

. *mvencode weight_match*, mv(0)
. duplicates report frame_id_numeric

Duplicates in terms of frame_id_numeric

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |          690             0
--------------------------------------

. tempfile weights

. save `weights'
file /srv/sandbox/zavecz/St1873248.000001 saved

. 
. use "`here'/temp/analysis_sample.dta"

. 
. rename ever_foreign ef

. rename ever_foreign_hire efh

. rename has_expat_ceo has_expat

. 
. gen lnIK = ln(immat_18)
(5,130 missing values generated)

. gen lnIK_0 = lnIK
(5,130 missing values generated)

. replace lnIK_0 = 0 if immat_18 == 0
(857 real changes made)

. 
. replace export_18 = 0 if export_18 == .
(1,473 real changes made)

. gen Qh = sales_18 - export_18

. gen lnQh = ln(Qh)
(122 missing values generated)

. gen lnQhr = lnQ - lnQh
(122 missing values generated)

. 
. merge m:1 frame_id_numeric using `weights', keep (1 3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                         5,845
        from master                     5,845  
        from using                          0  

    matched                             5,656  
    -----------------------------------------

. drop if year > 2013
(611 observations deleted)

. mvencode weight_match*, mv(0)
weight_~1989: 10664 missing values recoded
weight_~1990: 10020 missing values recoded
weight_~1991: 9474 missing values recoded
weight_~1992: 8948 missing values recoded
weight_~1993: 8754 missing values recoded
weight_~1994: 8558 missing values recoded
weight_~1995: 8589 missing values recoded
weight_~1996: 8671 missing values recoded
weight_~1997: 8508 missing values recoded
weight_~1998: 8616 missing values recoded
weight_~1999: 8710 missing values recoded
weight_~2000: 8770 missing values recoded
weight_~2001: 8832 missing values recoded
weight_~2002: 9059 missing values recoded
weight_~2003: 9344 missing values recoded
weight_~2004: 9539 missing values recoded
weight_~2005: 9778 missing values recoded
weight_~2006: 9908 missing values recoded
weight_~2007: 10054 missing values recoded
weight_~2008: 10168 missing values recoded
weight_~2009: 10376 missing values recoded
weight_~2010: 10473 missing values recoded
weight_~2011: 10515 missing values recoded
weight_~2012: 10678 missing values recoded
weight_~2013: 10834 missing values recoded

. 
. foreach depvar in TFP_cd lnIK_0 lnQh lnQhr {
  2.         foreach var in foreign_only foreign_hire_only has_expat {
  3.                 attgt `depvar', treatment(`var') aggregate(e) pre(5) post(5) reps(20) notyet limitcontrol(foreign == 0) weightprefix(weight_match)
  4.                 count if e(sample) == 1
  5.                 eststo m`var'`depvar', title("`depvar' `var'")
  6.         }
  7.         
.         foreach var in foreign_hire_only has_expat {
  8.                 attgt `depvar' if efh, treatment(`var') aggregate(e) pre(5) post(5) reps(20) notyet limitcontrol(foreign == 0) weightprefix(weight_match)
  9.                 count if e(sample) == 1
 10.                 eststo mh`var'`depvar', title("efh `depvar' `var'")
 11.         }
 12. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: event_m5
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating TFP_cd: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,648

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .0641126    .060349     1.06   0.288    -.0541692    .1823945
    event_m4 |     .00034   .0356588     0.01   0.992      -.06955      .07023
    event_m3 |  -.0035109   .0401274    -0.09   0.930    -.0821593    .0751374
    event_m2 |   -.127748   .0577056    -2.21   0.027    -.2408489    -.014647
    event_m1 |  -.0070067   .0293554    -0.24   0.811    -.0645422    .0505288
     event_1 |   .0008219   .0405599     0.02   0.984     -.078674    .0803178
     event_2 |   -.011359     .05219    -0.22   0.828    -.1136495    .0909315
     event_3 |  -.0638609   .0618563    -1.03   0.302    -.1850971    .0573753
     event_4 |  -.0606029   .0721113    -0.84   0.401    -.2019385    .0807328
     event_5 |  -.0379157   .0710967    -0.53   0.594    -.1772626    .1014311
------------------------------------------------------------------------------
  5,648
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: event_m5
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating TFP_cd: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,463

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .0622333   .0627452     0.99   0.321     -.060745    .1852116
    event_m4 |   .1120176    .066287     1.69   0.091    -.0179025    .2419378
    event_m3 |   .0636587   .0445394     1.43   0.153    -.0236369    .1509543
    event_m2 |  -.0795222   .0454171    -1.75   0.080     -.168538    .0094937
    event_m1 |  -.1031968   .0451337    -2.29   0.022    -.1916572   -.0147364
     event_1 |   .0167946   .0491079     0.34   0.732     -.079455    .1130443
     event_2 |   .0300854   .0408312     0.74   0.461    -.0499423    .1101132
     event_3 |   .0390347   .0487544     0.80   0.423    -.0565222    .1345916
     event_4 |  -.0143769    .038946    -0.37   0.712    -.0907098    .0619559
     event_5 |  -.0541532   .0554491    -0.98   0.329    -.1628314     .054525
------------------------------------------------------------------------------
  4,463
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: event_m5
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating TFP_cd: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,903

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .1424949    .037672     3.78   0.000     .0686591    .2163306
    event_m4 |    .142947   .0469967     3.04   0.002     .0508353    .2350588
    event_m3 |   .0817902   .0448835     1.82   0.068    -.0061799    .1697604
    event_m2 |   .0415734   .0371037     1.12   0.263    -.0311486    .1142954
    event_m1 |  -.0152353   .0274294    -0.56   0.579    -.0689959    .0385253
     event_1 |   .0700154   .0448202     1.56   0.118    -.0178306    .1578614
     event_2 |   .0803665   .0490168     1.64   0.101    -.0157046    .1764377
     event_3 |   .0973973   .0513856     1.90   0.058    -.0033167    .1981113
     event_4 |   .1236197   .0465243     2.66   0.008     .0324338    .2148057
     event_5 |   .1062841   .0525384     2.02   0.043     .0033108    .2092575
------------------------------------------------------------------------------
  4,903
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: event_m5
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating TFP_cd: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,419

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .0628763   .0549793     1.14   0.253    -.0448813    .1706338
    event_m4 |   .1122847   .0717558     1.56   0.118     -.028354    .2529234
    event_m3 |   .0648236   .0502157     1.29   0.197    -.0335974    .1632447
    event_m2 |  -.0783388   .0633682    -1.24   0.216    -.2025381    .0458606
    event_m1 |  -.1026022   .0430929    -2.38   0.017    -.1870628   -.0181416
     event_1 |   .0165471   .0401467     0.41   0.680    -.0621389    .0952331
     event_2 |   .0284525   .0501738     0.57   0.571    -.0698863    .1267914
     event_3 |   .0357418   .0583153     0.61   0.540    -.0785542    .1500378
     event_4 |  -.0179104   .0607394    -0.29   0.768    -.1369574    .1011366
     event_5 |  -.0589948    .066767    -0.88   0.377    -.1898557    .0718662
------------------------------------------------------------------------------
  4,419
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating TFP_cd: event_m5
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating TFP_cd: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,859

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .1482989   .0426453     3.48   0.001     .0647157    .2318821
    event_m4 |   .1452114   .0514425     2.82   0.005      .044386    .2460368
    event_m3 |   .0842503   .0430384     1.96   0.050    -.0001035    .1686041
    event_m2 |   .0431177   .0368463     1.17   0.242    -.0290998    .1153352
    event_m1 |  -.0148553   .0516175    -0.29   0.774    -.1160237    .0863132
     event_1 |    .069638   .0455545     1.53   0.126    -.0196472    .1589232
     event_2 |   .0783969   .0600925     1.30   0.192    -.0393822     .196176
     event_3 |   .0941247   .0633091     1.49   0.137    -.0299589    .2182082
     event_4 |   .1211612   .0595542     2.03   0.042     .0044371    .2378853
     event_5 |   .1021049   .0630057     1.62   0.105    -.0213839    .2255937
------------------------------------------------------------------------------
  4,859
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: event_m5
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnIK_0: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      3,064

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |  -.8761262   .5717706    -1.53   0.125    -1.996776    .2445236
    event_m4 |  -1.354485   .5315268    -2.55   0.011    -2.396258   -.3127113
    event_m3 |  -.6654195   .4381353    -1.52   0.129    -1.524149    .1933099
    event_m2 |   .0512222   .2336103     0.22   0.826    -.4066455      .50909
    event_m1 |  -.0766881   .1608358    -0.48   0.633    -.3919204    .2385442
     event_1 |   .5591641   .1863553     3.00   0.003     .1939144    .9244138
     event_2 |   .5419038   .3090219     1.75   0.079    -.0637679    1.147576
     event_3 |   .1085675   .4639297     0.23   0.815     -.800718    1.017853
     event_4 |   .2211048   .4820008     0.46   0.646    -.7235994    1.165809
     event_5 |   .4472395   .6869358     0.65   0.515    -.8991299    1.793609
------------------------------------------------------------------------------
  3,064
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: event_m5
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnIK_0: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      2,470

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .5044465   .5913647     0.85   0.394     -.654607      1.6635
    event_m4 |   .0316752   .4223704     0.07   0.940    -.7961555    .8595059
    event_m3 |   .3113516   .3612808     0.86   0.389    -.3967457    1.019449
    event_m2 |   .4052534    .272253     1.49   0.137    -.1283526    .9388595
    event_m1 |   .3272623   .3032117     1.08   0.280    -.2670216    .9215462
     event_1 |    .760325   .2969942     2.56   0.010      .178227    1.342423
     event_2 |    .821411   .4026768     2.04   0.041      .032179    1.610643
     event_3 |  -.3338988   .4410571    -0.76   0.449    -1.198355    .5305572
     event_4 |  -.2525186   .4684657    -0.54   0.590    -1.170694    .6656572
     event_5 |  -.0464207   .6233077    -0.07   0.941    -1.268081     1.17524
------------------------------------------------------------------------------
  2,470
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: event_m5
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnIK_0: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      2,497

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |  -.1334327   .6124815    -0.22   0.828    -1.333875    1.067009
    event_m4 |   .4871123   .5286028     0.92   0.357    -.5489301    1.523155
    event_m3 |   .1938897   .4458762     0.43   0.664    -.6800117    1.067791
    event_m2 |  -.1879183   .3021207    -0.62   0.534    -.7800639    .4042273
    event_m1 |    -.19971   .2197887    -0.91   0.364     -.630488    .2310679
     event_1 |   1.204571   .3652088     3.30   0.001     .4887746    1.920367
     event_2 |   1.329315    .424843     3.13   0.002     .4966384    2.161992
     event_3 |    1.08403   .4953048     2.19   0.029     .1132508     2.05481
     event_4 |   1.305895    .546475     2.39   0.017     .2348236    2.376966
     event_5 |   1.080154   .6478717     1.67   0.095    -.1896508     2.34996
------------------------------------------------------------------------------
  2,497
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: event_m5
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnIK_0: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      2,452

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .5046468     .45911     1.10   0.272    -.3951922    1.404486
    event_m4 |   .0381638    .362371     0.11   0.916    -.6720703    .7483979
    event_m3 |   .3026945   .3299629     0.92   0.359    -.3440209    .9494099
    event_m2 |   .4000682    .297879     1.34   0.179    -.1837639    .9839003
    event_m1 |   .3229579   .2823223     1.14   0.253    -.2303837    .8762995
     event_1 |   .7490912   .3633287     2.06   0.039     .0369799    1.461202
     event_2 |   .7994343   .3810652     2.10   0.036     .0525602    1.546308
     event_3 |  -.3668025   .4023383    -0.91   0.362    -1.155371    .4217662
     event_4 |  -.2871416   .4269656    -0.67   0.501    -1.123979    .5496956
     event_5 |  -.0679121   .5518253    -0.12   0.902     -1.14947    1.013646
------------------------------------------------------------------------------
  2,452
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnIK_0: event_m5
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnIK_0: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      2,479

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |  -.1328903    .598438    -0.22   0.824    -1.305807    1.040027
    event_m4 |   .5157364   .5070956     1.02   0.309    -.4781527    1.509626
    event_m3 |   .2097411   .4151083     0.51   0.613    -.6038563    1.023338
    event_m2 |  -.1748072   .3302394    -0.53   0.597    -.8220646    .4724501
    event_m1 |  -.1828036   .2110005    -0.87   0.386    -.5963569    .2307497
     event_1 |   1.196733   .2155093     5.55   0.000     .7743421    1.619123
     event_2 |    1.31374   .2530422     5.19   0.000      .817786    1.809693
     event_3 |   1.063781   .2669395     3.99   0.000      .540589    1.586973
     event_4 |   1.281891   .4813297     2.66   0.008     .3385023     2.22528
     event_5 |   1.079364   .5953891     1.81   0.070    -.0875769    2.246305
------------------------------------------------------------------------------
  2,479
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: event_m5
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnQh: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,620

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |  -.1561566   .1644455    -0.95   0.342    -.4784638    .1661506
    event_m4 |  -.2313268   .1697868    -1.36   0.173    -.5641028    .1014492
    event_m3 |   -.230531   .1525685    -1.51   0.131    -.5295597    .0684977
    event_m2 |   -.353529   .1654571    -2.14   0.033     -.677819    -.029239
    event_m1 |   .0043966   .1029911     0.04   0.966    -.1974623    .2062555
     event_1 |   .1483622   .0874227     1.70   0.090    -.0229831    .3197075
     event_2 |   .1541628    .091973     1.68   0.094    -.0261009    .3344265
     event_3 |   .0404475   .0989725     0.41   0.683    -.1535351      .23443
     event_4 |    .042422   .1231517     0.34   0.730     -.198951    .2837949
     event_5 |   .0071392   .1456864     0.05   0.961    -.2784009    .2926793
------------------------------------------------------------------------------
  5,620
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: event_m5
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnQh: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,434

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   -.174403   .2551709    -0.68   0.494    -.6745289    .3257229
    event_m4 |  -.1442349   .1391593    -1.04   0.300    -.4169821    .1285122
    event_m3 |  -.0443357   .1285379    -0.34   0.730    -.2962652    .2075939
    event_m2 |  -.4245617   .2126223    -2.00   0.046    -.8412938   -.0078296
    event_m1 |  -.3042287   .1273773    -2.39   0.017    -.5538837   -.0545737
     event_1 |   .0801407   .1150113     0.70   0.486    -.1452774    .3055587
     event_2 |   .0539082    .180172     0.30   0.765    -.2992225    .4070388
     event_3 |   .0120745   .1671456     0.07   0.942    -.3155249    .3396739
     event_4 |  -.1046366   .1428235    -0.73   0.464    -.3845656    .1752924
     event_5 |  -.2668981   .2062537    -1.29   0.196    -.6711479    .1373518
------------------------------------------------------------------------------
  4,434
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: event_m5
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnQh: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,832

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .6635321   .2666866     2.49   0.013      .140836    1.186228
    event_m4 |    .575937   .1827851     3.15   0.002     .2176847    .9341892
    event_m3 |    .377552   .1200142     3.15   0.002     .1423286    .6127754
    event_m2 |   .3551004   .1254905     2.83   0.005     .1091435    .6010572
    event_m1 |   .1369516   .0913075     1.50   0.134    -.0420078    .3159109
     event_1 |   .2842346   .1542977     1.84   0.065    -.0181833    .5866526
     event_2 |   .2745067   .1892962     1.45   0.147    -.0965071    .6455205
     event_3 |   .2023143   .1962338     1.03   0.303    -.1822969    .5869255
     event_4 |   .2337366   .2161496     1.08   0.280    -.1899089    .6573821
     event_5 |     .27517   .2357938     1.17   0.243    -.1869775    .7373174
------------------------------------------------------------------------------
  4,832
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: event_m5
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnQh: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,390

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |  -.1740827   .1877219    -0.93   0.354    -.5420108    .1938453
    event_m4 |  -.1443889    .162863    -0.89   0.375    -.4635946    .1748167
    event_m3 |  -.0448831   .1116501    -0.40   0.688    -.2637132     .173947
    event_m2 |  -.4245096    .215503    -1.97   0.049    -.8468878   -.0021314
    event_m1 |  -.3048645   .1172395    -2.60   0.009    -.5346497   -.0750793
     event_1 |   .0790957   .1253885     0.63   0.528    -.1666613    .3248526
     event_2 |   .0500144   .1862893     0.27   0.788     -.315106    .4151348
     event_3 |   .0057571   .1798187     0.03   0.974     -.346681    .3581951
     event_4 |  -.1114536   .1719156    -0.65   0.517    -.4484021    .2254949
     event_5 |  -.2761687    .221664    -1.25   0.213    -.7106221    .1582847
------------------------------------------------------------------------------
  4,390
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQh: event_m5
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnQh: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,788

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |    .674703   .3363557     2.01   0.045     .0154579    1.333948
    event_m4 |   .5850455    .248868     2.35   0.019     .0972731    1.072818
    event_m3 |   .3832745   .1571447     2.44   0.015     .0752766    .6912724
    event_m2 |   .3575344   .1677594     2.13   0.033      .028732    .6863368
    event_m1 |   .1369237   .0852508     1.61   0.108    -.0301647    .3040122
     event_1 |   .2836504   .1170145     2.42   0.015     .0543063    .5129946
     event_2 |   .2703616   .1777942     1.52   0.128    -.0781086    .6188317
     event_3 |   .1969483   .2524114     0.78   0.435    -.2977689    .6916656
     event_4 |   .2279519   .2548632     0.89   0.371    -.2715709    .7274747
     event_5 |   .2660773   .2440294     1.09   0.276    -.2122115    .7443661
------------------------------------------------------------------------------
  4,788
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: event_m5
Estimating lnQhr: event_m4
Estimating lnQhr: event_m3
Estimating lnQhr: event_m2
Estimating lnQhr: event_m1
Estimating lnQhr: event_1
Estimating lnQhr: event_2
Estimating lnQhr: event_3
Estimating lnQhr: event_4
Estimating lnQhr: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      5,620

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .1067908   .0983904     1.09   0.278    -.0860509    .2996325
    event_m4 |   .1052809    .093987     1.12   0.263    -.0789303    .2894921
    event_m3 |   .0736576   .0787019     0.94   0.349    -.0805952    .2279104
    event_m2 |   .0246358   .0844998     0.29   0.771    -.1409809    .1902524
    event_m1 |   .0207052   .0569544     0.36   0.716    -.0909234    .1323338
     event_1 |   .0167413   .0383577     0.44   0.663    -.0584383     .091921
     event_2 |   .0070567   .0591405     0.12   0.905    -.1088565      .12297
     event_3 |   .0248323   .0667515     0.37   0.710    -.1059983    .1556628
     event_4 |   .0206672   .0695822     0.30   0.766    -.1157114    .1570458
     event_5 |   .0504507   .0841709     0.60   0.549    -.1145211    .2154226
------------------------------------------------------------------------------
  5,620
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: event_m5
Estimating lnQhr: event_m4
Estimating lnQhr: event_m3
Estimating lnQhr: event_m2
Estimating lnQhr: event_m1
Estimating lnQhr: event_1
Estimating lnQhr: event_2
Estimating lnQhr: event_3
Estimating lnQhr: event_4
Estimating lnQhr: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,434

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   .2260689   .1340938     1.69   0.092    -.0367502     .488888
    event_m4 |   .2890898    .121512     2.38   0.017     .0509307    .5272489
    event_m3 |   .1972692   .0943341     2.09   0.037     .0123777    .3821607
    event_m2 |    .123762   .0777341     1.59   0.111    -.0285939     .276118
    event_m1 |   .0474911   .0736555     0.64   0.519     -.096871    .1918531
     event_1 |   .0559068   .0369462     1.51   0.130    -.0165065    .1283201
     event_2 |   .0501792   .0461287     1.09   0.277    -.0402315    .1405898
     event_3 |   .0662462   .0571728     1.16   0.247    -.0458104    .1783028
     event_4 |   .0176951   .0835382     0.21   0.832    -.1460369     .181427
     event_5 |  -.0126964   .0750889    -0.17   0.866     -.159868    .1344752
------------------------------------------------------------------------------
  4,434
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: event_m5
Estimating lnQhr: event_m4
Estimating lnQhr: event_m3
Estimating lnQhr: event_m2
Estimating lnQhr: event_m1
Estimating lnQhr: event_1
Estimating lnQhr: event_2
Estimating lnQhr: event_3
Estimating lnQhr: event_4
Estimating lnQhr: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,832

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |   -.193337    .193736    -1.00   0.318    -.5730526    .1863786
    event_m4 |  -.0535692   .1034037    -0.52   0.604    -.2562367    .1490983
    event_m3 |  -.0785384   .0795926    -0.99   0.324     -.234537    .0774602
    event_m2 |   .0341474   .1001928     0.34   0.733    -.1622268    .2305216
    event_m1 |  -.0415389   .0563478    -0.74   0.461    -.1519786    .0689007
     event_1 |   .3524586   .0762827     4.62   0.000     .2029472    .5019699
     event_2 |   .2926364   .0746809     3.92   0.000     .1462646    .4390083
     event_3 |   .2821878   .0637965     4.42   0.000      .157149    .4072265
     event_4 |   .2946572    .095949     3.07   0.002     .1066006    .4827137
     event_5 |   .4349323   .1039155     4.19   0.000     .2312617    .6386029
------------------------------------------------------------------------------
  4,832
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: event_m5
Estimating lnQhr: event_m4
Estimating lnQhr: event_m3
Estimating lnQhr: event_m2
Estimating lnQhr: event_m1
Estimating lnQhr: event_1
Estimating lnQhr: event_2
Estimating lnQhr: event_3
Estimating lnQhr: event_4
Estimating lnQhr: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,390

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |    .226273   .1108824     2.04   0.041     .0089476    .4435985
    event_m4 |   .2892714   .1108729     2.61   0.009     .0719644    .5065783
    event_m3 |   .1982574   .0905621     2.19   0.029      .020759    .3757558
    event_m2 |   .1246026   .0768199     1.62   0.105    -.0259618    .2751669
    event_m1 |   .0481605   .0606307     0.79   0.427    -.0706735    .1669944
     event_1 |   .0557131   .0375272     1.48   0.138    -.0178389    .1292652
     event_2 |    .049887   .0532324     0.94   0.349    -.0544466    .1542207
     event_3 |   .0654987    .074741     0.88   0.381    -.0809911    .2119884
     event_4 |   .0175295   .0896191     0.20   0.845    -.1581207    .1931796
     event_5 |  -.0117116   .0846637    -0.14   0.890    -.1776493    .1542261
------------------------------------------------------------------------------
  4,390
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2013, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQhr: event_m5
Estimating lnQhr: event_m4
Estimating lnQhr: event_m3
Estimating lnQhr: event_m2
Estimating lnQhr: event_m1
Estimating lnQhr: event_1
Estimating lnQhr: event_2
Estimating lnQhr: event_3
Estimating lnQhr: event_4
Estimating lnQhr: event_5
Callaway Sant'Anna (2021)

                                                Number of obs     =      4,788

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m5 |  -.1951168   .1667852    -1.17   0.242    -.5220097    .1317762
    event_m4 |  -.0551668   .1126462    -0.49   0.624    -.2759493    .1656157
    event_m3 |   -.078507   .1018198    -0.77   0.441    -.2780701    .1210561
    event_m2 |   .0344146   .1051008     0.33   0.743    -.1715793    .2404085
    event_m1 |  -.0410669   .0649163    -0.63   0.527    -.1683005    .0861668
     event_1 |   .3520139   .0765614     4.60   0.000     .2019563    .5020716
     event_2 |   .2920043   .0690828     4.23   0.000     .1566045    .4274042
     event_3 |   .2815286   .0683363     4.12   0.000      .147592    .4154653
     event_4 |   .2949166   .0935013     3.15   0.002     .1116575    .4781758
     event_5 |   .4369593   .0748526     5.84   0.000     .2902509    .5836676
------------------------------------------------------------------------------
  4,788

. 
. esttab m* using "`here'/output/table_attgt_loop_weightsdo.tex", mtitle b(3) se(3) replace
(note: file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_loop_weightsdo.tex not found)
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_loop_weightsdo.tex)

. esttab m* using "`here'/output/table_attgt_loop_weightsdo.txt", mtitle b(3) se(3) replace
(note: file /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_loop_weightsdo.txt not found)
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_loop_weightsdo.txt)

. 
. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_loop_weightsdo.log
  log type:  text
 closed on:  20 Jul 2021, 16:37:29
--------------------------------------------------------------------------------------------------------------------------------------------------------------
