--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_2002.log
  log type:  text
 opened on:  25 Jun 2021, 08:05:55

. 
. use "`here'/temp/analysis_sample.dta"

. 
. *attgt exporter lnQL if inrange(year, 1992, 2004) & ever_foreign, treatment(has_expat_ceo ) aggregate(e) pre(2) post(3) reps(20)
. *matrix list e(b)
. *esttab
. 
. *foreach var in exporter lnQL {
. *       attgt `var' if inrange(year, 1992, 2004) & ever_foreign, treatment(has_expat_ceo ) aggregate(e) pre(2) post(3) reps(20)
. *       matrix list e(b)
. *       esttab
. *}
. 
. rename ever_foreign ef

. rename ever_foreign_hire efh

. rename has_expat_ceo has_expat

. 
. gen lnIK = ln(immat_18)
(139,036 missing values generated)

. gen lnIK_0=lnIK
(139,036 missing values generated)

. replace lnIK_0=0 if immat_18==0
(40,686 real changes made)

. gen lnEx=ln(export_18)
(198,574 missing values generated)

. gen Qh=sales_18-export_18
(79,688 missing values generated)

. gen lnQh=ln(Qh)
(80,529 missing values generated)

. 
. foreach sample in ef efh {
  2.         foreach var in foreign foreign_hire has_expat {
  3.                 *eststo: attgt exporter lnQL if inrange(year, 1992, 2004) & ever_foreign, treatment(`var') aggregate(e) pre(2) post(3) reps(20)
.                 *attgt exporter lnQL if inrange(year, 1992, 2004) & ever_foreign, treatment(`var') aggregate(e) pre(2) post(3) reps(20)
.                 attgt lnQL TFP_cd lnK lnIK_0 lnL exporter lnQ lnQh lnEx if `sample' & year >= 2002, treatment(`var') aggregate(e) pre(4) post(4) reps(20) no
> tyet
  4.                 count if e(sample) == 1
  5.                 eststo model_`sample'`var', title("`sample' `var'")
  6.                 *matrix list e(b)
.         }
  7. 
.         *esttab model_`sample'* using "`here'/output/table_`sample'_attgt.tex", mtitle title("`sample'") b(3) se(3) replace
.         *esttab model_`sample'* using "`here'/output/table_`sample'_attgt.txt", mtitle title("`sample'") b(3) se(3) replace
. }
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnEx: event_m4
Estimating lnEx: event_m3
Estimating lnEx: event_m2
Estimating lnEx: event_m1
Estimating lnEx: event_1
Estimating lnEx: event_2
Estimating lnEx: event_3
Estimating lnEx: event_4
Callaway Sant'Anna (2021)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m4 |  -3.883665   .8797567    -4.41   0.000    -5.607956   -2.159373
    event_m3 |    -2.7156   .8485557    -3.20   0.001    -4.378738   -1.052461
    event_m2 |  -2.243202   .8050803    -2.79   0.005    -3.821131   -.6652741
    event_m1 |  -.1104809   .3665692    -0.30   0.763    -.8289432    .6079815
     event_1 |   5.922243   .3629836    16.32   0.000     5.210808    6.633678
     event_2 |   4.838318   .6306311     7.67   0.000     3.602304    6.074333
     event_3 |   5.343514   .8214689     6.50   0.000     3.733464    6.953563
     event_4 |   5.548067   1.140366     4.87   0.000     3.312991    7.783143
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m4 |   .0084804   .0316335     0.27   0.789    -.0535201    .0704809
    event_m3 |   .0159558   .0210986     0.76   0.450    -.0253968    .0573083
    event_m2 |   -.012649   .0204561    -0.62   0.536    -.0527423    .0274443
    event_m1 |   .0141425   .0141203     1.00   0.317    -.0135328    .0418177
     event_1 |   .0520225   .0079644     6.53   0.000     .0364126    .0676323
     event_2 |   .0419704   .0200091     2.10   0.036     .0027533    .0811874
     event_3 |   .0379321   .0232764     1.63   0.103    -.0076889     .083553
     event_4 |   .0610618   .0324795     1.88   0.060    -.0025969    .1247205
-------------+----------------------------------------------------------------
lnK          |
    event_m4 |  -4.861767   1.066584    -4.56   0.000    -6.952234     -2.7713
    event_m3 |  -3.361991   1.052948    -3.19   0.001    -5.425731    -1.29825
    event_m2 |  -2.733636   1.003011    -2.73   0.006    -4.699502     -.76777
    event_m1 |  -.1985185   .4382995    -0.45   0.651     -1.05757    .6605327
     event_1 |   7.017734   .4238525    16.56   0.000     6.186998    7.848469
     event_2 |   5.670284   .7272406     7.80   0.000     4.244919    7.095649
     event_3 |   6.356405   .9499593     6.69   0.000     4.494519    8.218291
     event_4 |   6.655389   1.383919     4.81   0.000     3.942958     9.36782
-------------+----------------------------------------------------------------
lnIK_0       |
    event_m4 |  -2.286278   .6974376    -3.28   0.001     -3.65323    -.919325
    event_m3 |  -1.751872   .6737334    -2.60   0.009    -3.072365   -.4313784
    event_m2 |  -1.637866    .679326    -2.41   0.016     -2.96932   -.3064113
    event_m1 |  -.0953243   .2413427    -0.39   0.693    -.5683472    .3776987
     event_1 |   4.127179   .2191483    18.83   0.000     3.697656    4.556701
     event_2 |   3.589172   .4644168     7.73   0.000     2.678932    4.499413
     event_3 |   3.814963   .6331133     6.03   0.000     2.574084    5.055843
     event_4 |   4.027999    .864523     4.66   0.000     2.333565    5.722433
-------------+----------------------------------------------------------------
lnL          |
    event_m4 |  -1.396947   .3105858    -4.50   0.000    -2.005684   -.7882104
    event_m3 |  -.9993835   .3179124    -3.14   0.002     -1.62248   -.3762866
    event_m2 |  -.9718728   .3130017    -3.11   0.002    -1.585345   -.3584007
    event_m1 |  -.0860538   .1389248    -0.62   0.536    -.3583414    .1862339
     event_1 |   2.385823   .1342172    17.78   0.000     2.122762    2.648884
     event_2 |   2.070507   .2794552     7.41   0.000     1.522785    2.618229
     event_3 |   2.296015   .3551345     6.47   0.000     1.599964    2.992066
     event_4 |   2.290067   .4370352     5.24   0.000     1.433494     3.14664
-------------+----------------------------------------------------------------
exporter     |
    event_m4 |  -.4055413   .0833329    -4.87   0.000    -.5688709   -.2422118
    event_m3 |  -.2844906   .0830727    -3.42   0.001    -.4473102   -.1216711
    event_m2 |  -.2287451   .0771717    -2.96   0.003    -.3799989   -.0774912
    event_m1 |  -.0169836   .0355188    -0.48   0.633    -.0865992    .0526319
     event_1 |   .5852447   .0354101    16.53   0.000     .5158421    .6546473
     event_2 |   .4802033   .0588433     8.16   0.000     .3648726    .5955341
     event_3 |   .5323316   .0779981     6.82   0.000      .379458    .6852051
     event_4 |   .5565236   .1116011     4.99   0.000     .3377893    .7752578
-------------+----------------------------------------------------------------
lnQ          |
    event_m4 |  -5.280612   1.184128    -4.46   0.000     -7.60146   -2.959764
    event_m3 |  -3.714983   1.159823    -3.20   0.001    -5.988195   -1.441772
    event_m2 |  -3.215075   1.100923    -2.92   0.003    -5.372846   -1.057305
    event_m1 |  -.1965347   .5006773    -0.39   0.695    -1.177844    .7847749
     event_1 |   8.308066   .4849239    17.13   0.000     7.357633      9.2585
     event_2 |   6.908825   .8675415     7.96   0.000     5.208475    8.609176
     event_3 |   7.639529   1.137822     6.71   0.000     5.409439    9.869618
     event_4 |   7.838134    1.56519     5.01   0.000     4.770417    10.90585
-------------+----------------------------------------------------------------
lnQh         |
    event_m4 |  -4.808177   1.220409    -3.94   0.000    -7.200134    -2.41622
    event_m3 |  -3.327506    1.19306    -2.79   0.005    -5.665861   -.9891503
    event_m2 |  -3.026384   1.095953    -2.76   0.006    -5.174412   -.8783566
    event_m1 |  -.1432484   .4983749    -0.29   0.774    -1.120045    .8335485
     event_1 |   8.029467   .4363979    18.40   0.000     7.174143    8.884791
     event_2 |    6.72828   .8484371     7.93   0.000     5.065374    8.391187
     event_3 |   7.324377   1.105192     6.63   0.000      5.15824    9.490514
     event_4 |   7.301125   1.458506     5.01   0.000     4.442506    10.15974
-------------+----------------------------------------------------------------
lnEx         |
    event_m4 |  -4.052648   .9296838    -4.36   0.000    -5.874795   -2.230501
    event_m3 |  -2.935958   .9255095    -3.17   0.002    -4.749923   -1.121993
    event_m2 |  -2.425152   .7421382    -3.27   0.001    -3.879716   -.9705881
    event_m1 |  -.2266898   .3264467    -0.69   0.487    -.8665136    .4131339
     event_1 |   6.039238   .3870769    15.60   0.000     5.280582    6.797895
     event_2 |   4.977051   .5295575     9.40   0.000     3.939137    6.014964
     event_3 |   5.624188   .7827418     7.19   0.000     4.090042    7.158334
     event_4 |    5.95299   1.234236     4.82   0.000     3.533931    8.372049
------------------------------------------------------------------------------
  0
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnEx: event_m4
Estimating lnEx: event_m3
Estimating lnEx: event_m2
Estimating lnEx: event_m1
Estimating lnEx: event_1
Estimating lnEx: event_2
Estimating lnEx: event_3
Estimating lnEx: event_4
Callaway Sant'Anna (2021)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m4 |  -1.339386   .7026324    -1.91   0.057     -2.71652    .0377485
    event_m3 |  -.5339556   .5909162    -0.90   0.366     -1.69213    .6242188
    event_m2 |  -.7544885   .5235716    -1.44   0.150     -1.78067     .271693
    event_m1 |   .1728524   .3149658     0.55   0.583    -.4444693    .7901741
     event_1 |   4.960743   .5109188     9.71   0.000      3.95936    5.962125
     event_2 |   3.540929    .593324     5.97   0.000     2.378035    4.703822
     event_3 |   3.589919   .5931484     6.05   0.000      2.42737    4.752469
     event_4 |    3.79382   .6190216     6.13   0.000      2.58056     5.00708
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m4 |   .0225172   .0252189     0.89   0.372     -.026911    .0719453
    event_m3 |   .0218738   .0163091     1.34   0.180    -.0100915    .0538391
    event_m2 |   .0297061   .0175719     1.69   0.091    -.0047341    .0641463
    event_m1 |   .0039041   .0117468     0.33   0.740    -.0191192    .0269274
     event_1 |   .0476265   .0180092     2.64   0.008     .0123291    .0829238
     event_2 |   .0271352   .0171287     1.58   0.113    -.0064364    .0607069
     event_3 |   .0060638   .0214994     0.28   0.778    -.0360742    .0482018
     event_4 |   .0392337   .0244792     1.60   0.109    -.0087446     .087212
-------------+----------------------------------------------------------------
lnK          |
    event_m4 |  -1.702855   .7734997    -2.20   0.028    -3.218887   -.1868235
    event_m3 |  -.7600132    .706005    -1.08   0.282    -2.143758    .6237312
    event_m2 |  -.9476957   .6069551    -1.56   0.118    -2.137306    .2419145
    event_m1 |   .2252543   .3958603     0.57   0.569    -.5506177    1.001126
     event_1 |   5.887325   .6291201     9.36   0.000     4.654273    7.120378
     event_2 |    4.16114   .7132141     5.83   0.000     2.763266    5.559014
     event_3 |   4.269834   .7065415     6.04   0.000     2.885038     5.65463
     event_4 |   4.392148   .7393311     5.94   0.000     2.943086    5.841211
-------------+----------------------------------------------------------------
lnIK_0       |
    event_m4 |  -1.027154   .5761353    -1.78   0.075    -2.156358    .1020508
    event_m3 |  -.2596332    .431954    -0.60   0.548    -1.106247     .586981
    event_m2 |  -.7935654   .4846145    -1.64   0.102    -1.743392    .1562615
    event_m1 |     .22131   .2903962     0.76   0.446    -.3478561    .7904761
     event_1 |   3.557583   .3931919     9.05   0.000     2.786941    4.328225
     event_2 |   2.772066   .4754807     5.83   0.000     1.840141    3.703991
     event_3 |   2.663728   .4982673     5.35   0.000     1.687142    3.640314
     event_4 |   2.734382   .5121243     5.34   0.000     1.730637    3.738127
-------------+----------------------------------------------------------------
lnL          |
    event_m4 |  -.5098972   .2536348    -2.01   0.044    -1.007012   -.0127821
    event_m3 |  -.2706085   .2285121    -1.18   0.236    -.7184839    .1772669
    event_m2 |  -.3809717   .2196617    -1.73   0.083    -.8115007    .0495572
    event_m1 |   .0748853   .1571516     0.48   0.634    -.2331261    .3828968
     event_1 |   1.969727   .1807926    10.89   0.000      1.61538    2.324074
     event_2 |   1.481443   .2357639     6.28   0.000     1.019355    1.943532
     event_3 |   1.503907   .2463344     6.11   0.000       1.0211    1.986713
     event_4 |   1.556473   .2451908     6.35   0.000     1.075907    2.037038
-------------+----------------------------------------------------------------
exporter     |
    event_m4 |  -.1520209   .0642299    -2.37   0.018    -.2779092   -.0261327
    event_m3 |  -.0662391   .0562205    -1.18   0.239    -.1764293     .043951
    event_m2 |  -.0819675   .0501592    -1.63   0.102    -.1802778    .0163428
    event_m1 |   .0101414   .0313069     0.32   0.746     -.051219    .0715017
     event_1 |   .4873776   .0497815     9.79   0.000     .3898077    .5849475
     event_2 |     .34399   .0571383     6.02   0.000     .2320011    .4559789
     event_3 |   .3462779   .0555726     6.23   0.000     .2373577    .4551981
     event_4 |   .3651838   .0592816     6.16   0.000     .2489939    .4813736
-------------+----------------------------------------------------------------
lnQ          |
    event_m4 |  -1.849283   .9302968    -1.99   0.047    -3.672631   -.0259346
    event_m3 |  -.8045642   .8046868    -1.00   0.317    -2.381721     .772593
    event_m2 |   -1.13546   .7356658    -1.54   0.123    -2.577339    .3064182
    event_m1 |   .2477379   .4627441     0.54   0.592    -.6592239      1.1547
     event_1 |    6.93047   .6808177    10.18   0.000     5.596092    8.264848
     event_2 |   5.022372   .8199475     6.13   0.000     3.415305     6.62944
     event_3 |   5.093826   .8239474     6.18   0.000     3.478919    6.708733
     event_4 |   5.350293   .8498999     6.30   0.000     3.684519    7.016066
-------------+----------------------------------------------------------------
lnQh         |
    event_m4 |  -1.574039   .9669205    -1.63   0.104    -3.469169    .3210899
    event_m3 |  -.5206406   .8451985    -0.62   0.538    -2.177199    1.135918
    event_m2 |  -.9900137   .7493885    -1.32   0.186    -2.458788    .4787607
    event_m1 |   .3078543   .4393275     0.70   0.483    -.5532118     1.16892
     event_1 |   6.576279   .6372308    10.32   0.000      5.32733    7.825229
     event_2 |   4.788577   .7772216     6.16   0.000     3.265251    6.311904
     event_3 |   4.790714   .7716009     6.21   0.000     3.278404    6.303024
     event_4 |   4.918261   .7863706     6.25   0.000     3.377003    6.459519
-------------+----------------------------------------------------------------
lnEx         |
    event_m4 |  -1.328224   .6379882    -2.08   0.037    -2.578658   -.0777898
    event_m3 |  -.6607189   .5156023    -1.28   0.200    -1.671281     .349843
    event_m2 |  -1.021008   .5431899    -1.88   0.060    -2.085641    .0436243
    event_m1 |   .1238178   .3297997     0.38   0.707    -.5225777    .7702133
     event_1 |   5.111717   .5109033    10.01   0.000     4.110365    6.113069
     event_2 |   3.861968   .6297701     6.13   0.000     2.627642    5.096295
     event_3 |   4.027331   .7024108     5.73   0.000     2.650632    5.404031
     event_4 |   4.372951   .6609186     6.62   0.000     3.077574    5.668328
------------------------------------------------------------------------------
  0
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnEx: event_m4
Estimating lnEx: event_m3
Estimating lnEx: event_m2
Estimating lnEx: event_m1
Estimating lnEx: event_1
Estimating lnEx: event_2
Estimating lnEx: event_3
Estimating lnEx: event_4
Callaway Sant'Anna (2021)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m4 |  -.7652415   .4597715    -1.66   0.096    -1.666377     .135894
    event_m3 |   -.341254   .4520823    -0.75   0.450    -1.227319    .5448109
    event_m2 |  -.3383981   .3513311    -0.96   0.335    -1.026994    .3501982
    event_m1 |   .1844433   .3881978     0.48   0.635    -.5764104     .945297
     event_1 |   3.503149   .5005031     7.00   0.000     2.522181    4.484117
     event_2 |   1.951769    .550693     3.54   0.000     .8724311    3.031108
     event_3 |   1.508915   .6192058     2.44   0.015      .295294    2.722536
     event_4 |   1.234403   .6406139     1.93   0.054    -.0211769    2.489983
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m4 |   .0297399   .0232566     1.28   0.201    -.0158421     .075322
    event_m3 |    .003536   .0168975     0.21   0.834    -.0295825    .0366545
    event_m2 |   .0441271   .0148723     2.97   0.003      .014978    .0732762
    event_m1 |    .020377   .0144843     1.41   0.159    -.0080118    .0487658
     event_1 |   .0364105   .0207685     1.75   0.080    -.0042951     .077116
     event_2 |   .0266193   .0180123     1.48   0.139    -.0086843    .0619228
     event_3 |   .0377044   .0242198     1.56   0.120    -.0097654    .0851743
     event_4 |   .0514821   .0201968     2.55   0.011     .0118971    .0910671
-------------+----------------------------------------------------------------
lnK          |
    event_m4 |  -1.009022   .6051275    -1.67   0.095     -2.19505    .1770058
    event_m3 |  -.4270812   .5961182    -0.72   0.474    -1.595451     .741289
    event_m2 |  -.4130562   .4931358    -0.84   0.402    -1.379585    .5534723
    event_m1 |   .2287574   .5145101     0.44   0.657    -.7796638    1.237179
     event_1 |   3.996648    .566432     7.06   0.000     2.886462    5.106834
     event_2 |   2.110583   .6260679     3.37   0.001     .8835128    3.337654
     event_3 |    1.44346   .7477562     1.93   0.054    -.0221157    2.909035
     event_4 |   1.145284   .7664654     1.49   0.135    -.3569608    2.647528
-------------+----------------------------------------------------------------
lnIK_0       |
    event_m4 |  -.3290951   .5596732    -0.59   0.557    -1.426034    .7678442
    event_m3 |  -.2882485   .4491703    -0.64   0.521    -1.168606    .5921092
    event_m2 |  -.1658031   .3403683    -0.49   0.626    -.8329127    .5013066
    event_m1 |   .2458249   .2824926     0.87   0.384    -.3078504    .7995002
     event_1 |   2.512085   .3638854     6.90   0.000     1.798883    3.225287
     event_2 |   1.657626   .4200825     3.95   0.000     .8342793    2.480973
     event_3 |   1.099394   .4329708     2.54   0.011     .2507863    1.948001
     event_4 |    1.07836   .5180297     2.08   0.037       .06304    2.093679
-------------+----------------------------------------------------------------
lnL          |
    event_m4 |  -.2522896   .2075551    -1.22   0.224    -.6590902    .1545111
    event_m3 |  -.1506405   .2069127    -0.73   0.467     -.556182    .2549009
    event_m2 |  -.1701887   .1749279    -0.97   0.331     -.513041    .1726636
    event_m1 |   .1162096   .1859532     0.62   0.532     -.248252    .4806712
     event_1 |   1.302208   .1872789     6.95   0.000     .9351484    1.669268
     event_2 |   .7081883   .2085652     3.40   0.001      .299408    1.116969
     event_3 |   .4953568   .2561057     1.93   0.053    -.0066012    .9973148
     event_4 |   .3677308   .2709228     1.36   0.175    -.1632681    .8987296
-------------+----------------------------------------------------------------
exporter     |
    event_m4 |  -.0779307   .0492165    -1.58   0.113    -.1743933    .0185319
    event_m3 |  -.0314208   .0456824    -0.69   0.492    -.1209568    .0581152
    event_m2 |  -.0296799    .035888    -0.83   0.408    -.1000191    .0406592
    event_m1 |   .0209398   .0401412     0.52   0.602    -.0577354    .0996151
     event_1 |   .3472816   .0493278     7.04   0.000     .2506009    .4439624
     event_2 |   .1876407   .0543443     3.45   0.001     .0811278    .2941537
     event_3 |   .1370986   .0608039     2.25   0.024     .0179252    .2562719
     event_4 |   .1092161   .0639337     1.71   0.088    -.0160916    .2345238
-------------+----------------------------------------------------------------
lnQ          |
    event_m4 |  -1.017531   .6501214    -1.57   0.118    -2.291746    .2566833
    event_m3 |  -.4918946   .6460418    -0.76   0.446    -1.758113    .7743241
    event_m2 |  -.5085868   .5212675    -0.98   0.329    -1.530252    .5130788
    event_m1 |   .3006529   .5653571     0.53   0.595    -.8074265    1.408732
     event_1 |   4.805357   .6760591     7.11   0.000     3.480305    6.130408
     event_2 |   2.659958   .7511217     3.54   0.000     1.187786    4.132129
     event_3 |   2.004272   .8600178     2.33   0.020      .318668    3.689876
     event_4 |   1.602134    .894999     1.79   0.073    -.1520318      3.3563
-------------+----------------------------------------------------------------
lnQh         |
    event_m4 |  -.8485233   .6123019    -1.39   0.166    -2.048613    .3515663
    event_m3 |   -.240978   .6546732    -0.37   0.713    -1.524114    1.042158
    event_m2 |  -.4054272   .4479086    -0.91   0.365    -1.283312    .4724575
    event_m1 |   .3319223   .5176856     0.64   0.521    -.6827229    1.346567
     event_1 |   4.295738   .5893597     7.29   0.000     3.140615    5.450862
     event_2 |   2.458365   .6909304     3.56   0.000     1.104166    3.812564
     event_3 |   1.709687   .8013848     2.13   0.033     .1390019    3.280373
     event_4 |   1.195566   .8423638     1.42   0.156    -.4554365    2.846569
-------------+----------------------------------------------------------------
lnEx         |
    event_m4 |  -.7323383   .6172331    -1.19   0.235    -1.942093    .4774164
    event_m3 |  -.4325846   .5773041    -0.75   0.454     -1.56408    .6989106
    event_m2 |  -.4450766   .4882039    -0.91   0.362    -1.401939    .5117855
    event_m1 |   .0228393   .4544397     0.05   0.960    -.8678462    .9135248
     event_1 |   3.846122   .5395531     7.13   0.000     2.788617    4.903627
     event_2 |   1.899156   .6148501     3.09   0.002     .6940722     3.10424
     event_3 |     1.6757    .739472     2.27   0.023     .2263614    3.125038
     event_4 |   1.203836   .7379483     1.63   0.103    -.2425159    2.650188
------------------------------------------------------------------------------
  0
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnEx: event_m4
Estimating lnEx: event_m3
Estimating lnEx: event_m2
Estimating lnEx: event_m1
Estimating lnEx: event_1
Estimating lnEx: event_2
Estimating lnEx: event_3
Estimating lnEx: event_4
Callaway Sant'Anna (2021)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m4 |  -3.273809   .7168517    -4.57   0.000    -4.678813   -1.868806
    event_m3 |  -2.291864   .8777453    -2.61   0.009    -4.012213   -.5715146
    event_m2 |  -2.198717   .7012049    -3.14   0.002    -3.573053   -.8243809
    event_m1 |  -.2545023   .3279442    -0.78   0.438    -.8972611    .3882564
     event_1 |   6.633544   .3776594    17.56   0.000     5.893345    7.373743
     event_2 |   5.656847    .846553     6.68   0.000     3.997633     7.31606
     event_3 |   6.303926   .9216564     6.84   0.000     4.497512    8.110339
     event_4 |   6.434444   1.318687     4.88   0.000     3.849865    9.019023
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m4 |   .0422606   .0302931     1.40   0.163    -.0171129     .101634
    event_m3 |   .0410476   .0331962     1.24   0.216    -.0240158    .1061109
    event_m2 |   .0185731   .0223298     0.83   0.406    -.0251925    .0623388
    event_m1 |   .0323158   .0194144     1.66   0.096    -.0057356    .0703673
     event_1 |   .0445793   .0188183     2.37   0.018     .0076961    .0814625
     event_2 |   .0231876   .0209817     1.11   0.269    -.0179359     .064311
     event_3 |   .0026028    .030537     0.09   0.932    -.0572486    .0624541
     event_4 |   .0551415    .024465     2.25   0.024     .0071911     .103092
-------------+----------------------------------------------------------------
lnK          |
    event_m4 |  -4.036926    .975919    -4.14   0.000    -5.949692   -2.124159
    event_m3 |  -2.810958   1.141231    -2.46   0.014     -5.04773   -.5741862
    event_m2 |  -2.765246   .8823284    -3.13   0.002    -4.494578   -1.035914
    event_m1 |  -.4132901   .4086781    -1.01   0.312    -1.214284    .3877041
     event_1 |   7.899493     .50237    15.72   0.000     6.914866     8.88412
     event_2 |   6.828065   1.195272     5.71   0.000     4.485376    9.170754
     event_3 |   7.559292   1.280426     5.90   0.000     5.049703    10.06888
     event_4 |   7.515468   1.598773     4.70   0.000     4.381931    10.64901
-------------+----------------------------------------------------------------
lnIK_0       |
    event_m4 |  -1.769308    .795481    -2.22   0.026    -3.328422   -.2101941
    event_m3 |  -1.372197   .7515609    -1.83   0.068     -2.84523    .1008349
    event_m2 |  -1.572878   .7087532    -2.22   0.026    -2.962009   -.1837472
    event_m1 |  -.1550654   .2918767    -0.53   0.595    -.7271332    .4170024
     event_1 |   4.805987   .3947363    12.18   0.000     4.032318    5.579656
     event_2 |   4.799756   1.086079     4.42   0.000     2.671081    6.928431
     event_3 |   4.897019   .9988302     4.90   0.000     2.939348     6.85469
     event_4 |   4.511519   1.119854     4.03   0.000     2.316644    6.706393
-------------+----------------------------------------------------------------
lnL          |
    event_m4 |  -1.139685   .3073977    -3.71   0.000    -1.742174   -.5371968
    event_m3 |  -.8437204   .3532569    -2.39   0.017    -1.536091   -.1513497
    event_m2 |   -.884602   .2801797    -3.16   0.002    -1.433744   -.3354599
    event_m1 |  -.1074941   .1492886    -0.72   0.471    -.4000944    .1851062
     event_1 |   2.708035   .1813921    14.93   0.000     2.352513    3.063557
     event_2 |   2.325602   .3733177     6.23   0.000     1.593913    3.057292
     event_3 |   2.610429   .4015617     6.50   0.000     1.823382    3.397475
     event_4 |   2.606389   .5223956     4.99   0.000     1.582513    3.630266
-------------+----------------------------------------------------------------
exporter     |
    event_m4 |  -.3534937   .0768022    -4.60   0.000    -.5040232   -.2029642
    event_m3 |  -.2471244   .0904099    -2.73   0.006    -.4243245   -.0699242
    event_m2 |  -.2200668   .0699637    -3.15   0.002     -.357193   -.0829406
    event_m1 |  -.0306545   .0324175    -0.95   0.344    -.0941916    .0328827
     event_1 |   .6577751   .0379728    17.32   0.000     .5833498    .7322004
     event_2 |   .5602492   .0861908     6.50   0.000     .3913183      .72918
     event_3 |   .6261131   .0956404     6.55   0.000     .4386614    .8135648
     event_4 |   .6519535   .1382439     4.72   0.000     .3810005    .9229066
-------------+----------------------------------------------------------------
lnQ          |
    event_m4 |  -4.413494   1.003918    -4.40   0.000    -6.381138   -2.445851
    event_m3 |  -3.135584   1.214373    -2.58   0.010    -5.515712   -.7554569
    event_m2 |  -3.083319   .9676229    -3.19   0.001    -4.979825   -1.186813
    event_m1 |  -.3619964   .4516108    -0.80   0.423    -1.247137    .5231444
     event_1 |   9.341579    .537302    17.39   0.000     8.288486    10.39467
     event_2 |   7.982449   1.207831     6.61   0.000     5.615144    10.34975
     event_3 |   8.914354   1.311688     6.80   0.000     6.343494    11.48521
     event_4 |   9.040833   1.828509     4.94   0.000     5.457021    12.62465
-------------+----------------------------------------------------------------
lnQh         |
    event_m4 |  -3.877449   .9234652    -4.20   0.000    -5.687408   -2.067491
    event_m3 |  -2.645165   1.096663    -2.41   0.016    -4.794585    -.495744
    event_m2 |  -2.925533   .9714925    -3.01   0.003    -4.829623   -1.021443
    event_m1 |  -.2993628   .4616932    -0.65   0.517    -1.204265    .6055393
     event_1 |   9.007422   .5362386    16.80   0.000     7.956414    10.05843
     event_2 |   7.759887   1.220589     6.36   0.000     5.367576     10.1522
     event_3 |   8.510379   1.311186     6.49   0.000     5.940502    11.08026
     event_4 |   8.293382   1.698601     4.88   0.000     4.964184    11.62258
-------------+----------------------------------------------------------------
lnEx         |
    event_m4 |  -3.498843   .9326639    -3.75   0.000     -5.32683   -1.670855
    event_m3 |  -2.557338   1.090712    -2.34   0.019    -4.695093   -.4195823
    event_m2 |  -2.569291   .7707664    -3.33   0.001    -4.079965   -1.058617
    event_m1 |  -.2796442   .3382928    -0.83   0.408    -.9426859    .3833975
     event_1 |   6.694753   .4096016    16.34   0.000     5.891949    7.497558
     event_2 |   5.644272   .6783452     8.32   0.000      4.31474    6.973805
     event_3 |   6.599967   .8123834     8.12   0.000     5.007725    8.192209
     event_4 |   7.002273   1.625359     4.31   0.000     3.816628    10.18792
------------------------------------------------------------------------------
  0
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnEx: event_m4
Estimating lnEx: event_m3
Estimating lnEx: event_m2
Estimating lnEx: event_m1
Estimating lnEx: event_1
Estimating lnEx: event_2
Estimating lnEx: event_3
Estimating lnEx: event_4
Callaway Sant'Anna (2021)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m4 |  -2.914111    .670379    -4.35   0.000    -4.228029   -1.600192
    event_m3 |  -1.579031   .6535126    -2.42   0.016    -2.859893   -.2981702
    event_m2 |  -1.905894   .7301982    -2.61   0.009    -3.337056   -.4747318
    event_m1 |  -.0483787   .3413849    -0.14   0.887    -.7174808    .6207234
     event_1 |   5.130131   .2904674    17.66   0.000     4.560825    5.699437
     event_2 |   4.647295     .57952     8.02   0.000     3.511457    5.783134
     event_3 |   5.291723   .8016791     6.60   0.000     3.720461    6.862985
     event_4 |   5.891982   1.312758     4.49   0.000     3.319024    8.464939
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m4 |    .025154   .0286915     0.88   0.381    -.0310802    .0813883
    event_m3 |   .0247917    .032174     0.77   0.441    -.0382683    .0878516
    event_m2 |   .0309022   .0246023     1.26   0.209    -.0173174    .0791218
    event_m1 |   .0080269   .0227253     0.35   0.724     -.036514    .0525677
     event_1 |   .0512588   .0157418     3.26   0.001     .0204054    .0821121
     event_2 |   .0298883   .0132908     2.25   0.025     .0038388    .0559378
     event_3 |   .0089338   .0250518     0.36   0.721    -.0401668    .0580345
     event_4 |   .0525406   .0209644     2.51   0.012     .0114511      .09363
-------------+----------------------------------------------------------------
lnK          |
    event_m4 |  -3.454337   .8780742    -3.93   0.000    -5.175331   -1.733343
    event_m3 |  -1.908568    .887697    -2.15   0.032    -3.648422    -.168714
    event_m2 |  -2.313175   .9973389    -2.32   0.020    -4.267923   -.3584262
    event_m1 |  -.0177789   .4292731    -0.04   0.967    -.8591387    .8235809
     event_1 |   6.079202    .348127    17.46   0.000     5.396885    6.761518
     event_2 |    5.51926   .8105234     6.81   0.000     3.930663    7.107856
     event_3 |   6.316314   1.073393     5.88   0.000     4.212503    8.420125
     event_4 |   6.794868   1.559015     4.36   0.000     3.739255    9.850481
-------------+----------------------------------------------------------------
lnIK_0       |
    event_m4 |  -1.633011   .6074454    -2.69   0.007    -2.823582   -.4424396
    event_m3 |  -.6367913   .5831855    -1.09   0.275    -1.779814    .5062314
    event_m2 |  -1.741296   .8467134    -2.06   0.040    -3.400824   -.0817682
    event_m1 |   .1286355    .368838     0.35   0.727    -.5942736    .8515446
     event_1 |   3.674495   .2875963    12.78   0.000     3.110816    4.238173
     event_2 |   3.903928    .673055     5.80   0.000     2.584764    5.223092
     event_3 |   4.044033   .7510664     5.38   0.000      2.57197    5.516096
     event_4 |   3.716404   1.045487     3.55   0.000     1.667286    5.765522
-------------+----------------------------------------------------------------
lnL          |
    event_m4 |  -1.057454   .3124084    -3.38   0.001    -1.669764   -.4451451
    event_m3 |  -.6582262   .3024936    -2.18   0.030    -1.251103   -.0653497
    event_m2 |  -.7923122    .321247    -2.47   0.014    -1.421945   -.1626797
    event_m1 |   .0040239    .167548     0.02   0.981    -.3243642    .3324119
     event_1 |   2.031022   .1217077    16.69   0.000     1.792479    2.269565
     event_2 |     1.8774   .2291633     8.19   0.000     1.428248    2.326552
     event_3 |   2.143222   .3144141     6.82   0.000     1.526982    2.759463
     event_4 |   2.311372   .5192487     4.45   0.000     1.293663    3.329081
-------------+----------------------------------------------------------------
exporter     |
    event_m4 |  -.3180266   .0716095    -4.44   0.000    -.4583787   -.1776745
    event_m3 |  -.1778883   .0698254    -2.55   0.011    -.3147435   -.0410331
    event_m2 |   -.198174   .0731983    -2.71   0.007      -.34164    -.054708
    event_m1 |  -.0129288   .0340449    -0.38   0.704    -.0796555    .0537979
     event_1 |   .5040791   .0278743    18.08   0.000     .4494465    .5587118
     event_2 |   .4529313     .05969     7.59   0.000      .335941    .5699216
     event_3 |   .5222812   .0844792     6.18   0.000      .356705    .6878573
     event_4 |   .5904937   .1382003     4.27   0.000     .3196261    .8613613
-------------+----------------------------------------------------------------
lnQ          |
    event_m4 |  -3.971565   .9552291    -4.16   0.000     -5.84378    -2.09935
    event_m3 |  -2.237258   .9449795    -2.37   0.018    -4.089383   -.3851319
    event_m2 |  -2.698206    1.04434    -2.58   0.010    -4.745075   -.6513371
    event_m1 |  -.0443548   .4977511    -0.09   0.929    -1.019929    .9312195
     event_1 |   7.161153   .3959937    18.08   0.000      6.38502    7.937287
     event_2 |   6.524695   .7976266     8.18   0.000     4.961376    8.088015
     event_3 |   7.434945   1.105434     6.73   0.000     5.268334    9.601557
     event_4 |   8.203354   1.823574     4.50   0.000     4.629215    11.77749
-------------+----------------------------------------------------------------
lnQh         |
    event_m4 |  -3.378129   .8465409    -3.99   0.000    -5.037318   -1.718939
    event_m3 |  -1.785752   .8130819    -2.20   0.028    -3.379363   -.1921405
    event_m2 |  -2.525559   1.058358    -2.39   0.017    -4.599901   -.4512158
    event_m1 |   .0071352   .4661984     0.02   0.988     -.906597    .9208673
     event_1 |    6.80424   .4010343    16.97   0.000     6.018227    7.590252
     event_2 |   6.261469   .8115074     7.72   0.000     4.670943    7.851994
     event_3 |   6.983766    1.06424     6.56   0.000     4.897894    9.069638
     event_4 |   7.333618   1.630004     4.50   0.000     4.138869    10.52837
-------------+----------------------------------------------------------------
lnEx         |
    event_m4 |  -3.172718   .8019804    -3.96   0.000     -4.74457   -1.600865
    event_m3 |  -1.866309    .869101    -2.15   0.032    -3.569715   -.1629022
    event_m2 |  -2.030303    .657263    -3.09   0.002    -3.318515   -.7420909
    event_m1 |  -.0793368   .3223227    -0.25   0.806    -.7110777    .5524041
     event_1 |   5.308536   .3333565    15.92   0.000     4.655169    5.961903
     event_2 |   4.841136   .4531985    10.68   0.000     3.952883    5.729389
     event_3 |   5.661101   .7330933     7.72   0.000     4.224264    7.097937
     event_4 |   6.844325   1.618608     4.23   0.000     3.671912    10.01674
------------------------------------------------------------------------------
  0
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQL: event_m4
Estimating lnQL: event_m3
Estimating lnQL: event_m2
Estimating lnQL: event_m1
Estimating lnQL: event_1
Estimating lnQL: event_2
Estimating lnQL: event_3
Estimating lnQL: event_4
Estimating TFP_cd: event_m4
Estimating TFP_cd: event_m3
Estimating TFP_cd: event_m2
Estimating TFP_cd: event_m1
Estimating TFP_cd: event_1
Estimating TFP_cd: event_2
Estimating TFP_cd: event_3
Estimating TFP_cd: event_4
Estimating lnK: event_m4
Estimating lnK: event_m3
Estimating lnK: event_m2
Estimating lnK: event_m1
Estimating lnK: event_1
Estimating lnK: event_2
Estimating lnK: event_3
Estimating lnK: event_4
Estimating lnIK_0: event_m4
Estimating lnIK_0: event_m3
Estimating lnIK_0: event_m2
Estimating lnIK_0: event_m1
Estimating lnIK_0: event_1
Estimating lnIK_0: event_2
Estimating lnIK_0: event_3
Estimating lnIK_0: event_4
Estimating lnL: event_m4
Estimating lnL: event_m3
Estimating lnL: event_m2
Estimating lnL: event_m1
Estimating lnL: event_1
Estimating lnL: event_2
Estimating lnL: event_3
Estimating lnL: event_4
Estimating exporter: event_m4
Estimating exporter: event_m3
Estimating exporter: event_m2
Estimating exporter: event_m1
Estimating exporter: event_1
Estimating exporter: event_2
Estimating exporter: event_3
Estimating exporter: event_4
Estimating lnQ: event_m4
Estimating lnQ: event_m3
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Estimating lnQ: event_3
Estimating lnQ: event_4
Estimating lnQh: event_m4
Estimating lnQh: event_m3
Estimating lnQh: event_m2
Estimating lnQh: event_m1
Estimating lnQh: event_1
Estimating lnQh: event_2
Estimating lnQh: event_3
Estimating lnQh: event_4
Estimating lnEx: event_m4
Estimating lnEx: event_m3
Estimating lnEx: event_m2
Estimating lnEx: event_m1
Estimating lnEx: event_1
Estimating lnEx: event_2
Estimating lnEx: event_3
Estimating lnEx: event_4
Callaway Sant'Anna (2021)
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnQL         |
    event_m4 |  -.8347458   .4632637    -1.80   0.072    -1.742726    .0732343
    event_m3 |  -.3346801   .5043781    -0.66   0.507    -1.323243    .6538828
    event_m2 |  -.3904601   .3919109    -1.00   0.319    -1.158591    .3776711
    event_m1 |   .1459234   .3852352     0.38   0.705    -.6091238    .9009706
     event_1 |   3.545353   .3221293    11.01   0.000     2.913991    4.176715
     event_2 |   1.999447   .4966215     4.03   0.000     1.026087    2.972807
     event_3 |   1.538797   .5630287     2.73   0.006     .4352814    2.642313
     event_4 |   1.273962   .5627773     2.26   0.024     .1709386    2.376985
-------------+----------------------------------------------------------------
TFP_cd       |
    event_m4 |    .030434   .0327714     0.93   0.353    -.0337967    .0946647
    event_m3 |   .0051388   .0240166     0.21   0.831    -.0419329    .0522105
    event_m2 |   .0445069   .0194938     2.28   0.022     .0062997    .0827141
    event_m1 |   .0203349   .0177169     1.15   0.251    -.0143895    .0550593
     event_1 |   .0370035   .0195383     1.89   0.058    -.0012909    .0752979
     event_2 |   .0271626   .0221701     1.23   0.221      -.01629    .0706152
     event_3 |   .0410752   .0303838     1.35   0.176     -.018476    .1006265
     event_4 |    .052335   .0198282     2.64   0.008     .0134724    .0911977
-------------+----------------------------------------------------------------
lnK          |
    event_m4 |  -1.064989   .6406179    -1.66   0.096    -2.320577    .1905986
    event_m3 |  -.4087749   .6833412    -0.60   0.550    -1.748099    .9305492
    event_m2 |  -.4747962   .5388095    -0.88   0.378    -1.530843    .5812509
    event_m1 |   .1808209   .5098945     0.35   0.723    -.8185539    1.180196
     event_1 |   4.046351   .3817774    10.60   0.000     3.298081    4.794621
     event_2 |   2.162972    .588291     3.68   0.000     1.009943    3.316001
     event_3 |   1.453044   .6675697     2.18   0.030      .144631    2.761456
     event_4 |   1.155949   .7136586     1.62   0.105    -.2427966    2.554694
-------------+----------------------------------------------------------------
lnIK_0       |
    event_m4 |  -.3924498   .3961989    -0.99   0.322    -1.168985    .3840859
    event_m3 |    -.30751   .6664871    -0.46   0.645    -1.613801    .9987807
    event_m2 |  -.2115916   .4260764    -0.50   0.619    -1.046686    .6235028
    event_m1 |   .2092904   .3251918     0.64   0.520    -.4280739    .8466547
     event_1 |    2.55448   .3162433     8.08   0.000     1.934655    3.174306
     event_2 |   1.723339   .4621531     3.73   0.000     .8175359    2.629143
     event_3 |   1.150479   .4929769     2.33   0.020     .1842616    2.116696
     event_4 |   1.109262   .5426361     2.04   0.041      .045715    2.172809
-------------+----------------------------------------------------------------
lnL          |
    event_m4 |  -.2571678   .1874909    -1.37   0.170    -.6246433    .1103076
    event_m3 |  -.1362129   .2336808    -0.58   0.560    -.5942189    .3217931
    event_m2 |  -.1760854   .2129841    -0.83   0.408    -.5935265    .2413557
    event_m1 |   .1089237   .1658624     0.66   0.511    -.2161606    .4340079
     event_1 |    1.31409   .1198995    10.96   0.000     1.079091    1.549089
     event_2 |    .714899   .1896082     3.77   0.000     .3432738    1.086524
     event_3 |   .4932945   .2142981     2.30   0.021      .073278     .913311
     event_4 |   .3640328   .2577303     1.41   0.158    -.1411093    .8691749
-------------+----------------------------------------------------------------
exporter     |
    event_m4 |  -.0830615   .0463825    -1.79   0.073    -.1739694    .0078465
    event_m3 |  -.0296747   .0480878    -0.62   0.537     -.123925    .0645756
    event_m2 |  -.0341141   .0380643    -0.90   0.370    -.1087187    .0404906
    event_m1 |   .0174237   .0373138     0.47   0.641    -.0557099    .0905574
     event_1 |   .3512543   .0312173    11.25   0.000     .2900695     .412439
     event_2 |   .1914442   .0479271     3.99   0.000     .0975089    .2853796
     event_3 |   .1385431   .0529546     2.62   0.009      .034754    .2423321
     event_4 |   .1115556   .0526028     2.12   0.034     .0084561    .2146551
-------------+----------------------------------------------------------------
lnQ          |
    event_m4 |  -1.091914   .6327669    -1.73   0.084    -2.332114    .1482865
    event_m3 |   -.470893    .728138    -0.65   0.518    -1.898017    .9562312
    event_m2 |  -.5665455    .599818    -0.94   0.345    -1.742167    .6090761
    event_m1 |   .2548471   .5359463     0.48   0.634    -.7955882    1.305282
     event_1 |   4.859443   .4293669    11.32   0.000     4.017899    5.700986
     event_2 |   2.714346   .6739817     4.03   0.000     1.393366    4.035326
     event_3 |   2.032092   .7589619     2.68   0.007     .5445539     3.51963
     event_4 |   1.637995   .8054796     2.03   0.042     .0592835    3.216706
-------------+----------------------------------------------------------------
lnQh         |
    event_m4 |   -.952029   .5730107    -1.66   0.097    -2.075109    .1710513
    event_m3 |  -.2481308   .6805292    -0.36   0.715    -1.581943    1.085682
    event_m2 |  -.4863901   .5532724    -0.88   0.379    -1.570784    .5980038
    event_m1 |   .2775072   .4801056     0.58   0.563    -.6634825    1.218497
     event_1 |   4.356313   .4547075     9.58   0.000     3.465102    5.247523
     event_2 |   2.527063   .6533655     3.87   0.000      1.24649    3.807636
     event_3 |   1.758809   .7345719     2.39   0.017     .3190748    3.198544
     event_4 |   1.258943   .7878415     1.60   0.110    -.2851981    2.803084
-------------+----------------------------------------------------------------
lnEx         |
    event_m4 |  -.7571562   .5948723    -1.27   0.203    -1.923084    .4087721
    event_m3 |  -.3976145   .7051784    -0.56   0.573    -1.779739    .9845097
    event_m2 |  -.4830347   .6014824    -0.80   0.422    -1.661919    .6958492
    event_m1 |  -.0132964   .4850946    -0.03   0.978    -.9640644    .9374716
     event_1 |   3.887519   .3469868    11.20   0.000     3.207437    4.567601
     event_2 |   1.933814    .534761     3.62   0.000     .8857015    2.981926
     event_3 |   1.670163   .5631061     2.97   0.003     .5664956    2.773831
     event_4 |   1.183109   .5726341     2.07   0.039     .0607667    2.305451
------------------------------------------------------------------------------
  0

. 
. esttab model* using "`here'/output/table_attgt_2002.tex", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_2002.tex)

. esttab model* using "`here'/output/table_attgt_2002.txt", mtitle b(3) se(3) replace
(output written to /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/table_attgt_2002.txt)

. 
. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/est_attgt_2002.log
  log type:  text
 closed on:  25 Jun 2021, 10:48:23
--------------------------------------------------------------------------------------------------------------------------------------------------------------
