-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/firm_panel.log
  log type:  text
 opened on:  21 Mar 2024, 16:58:47

. 
. * keep only sample from balance-small
. use "`here'/temp/balance-small-clean.dta"

. by frame_id_numeric: egen firm_birth = min(year)

. by frame_id_numeric: egen firm_death = max(year)

. keep frame_id year firm_birth firm_death foreign

. tempfile sample

. save `sample', replace
(file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St72375.000001 not
    found)
file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St72375.000001 saved
    as .dta format

. 
. use "`here'/temp/ceo-panel.dta", clear 

. 
. * only keep sample firms
. merge m:1 frame_id_numeric year using `sample', keep(match) nogen
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           523,664  
    -----------------------------------------

. count if first_year_of_firm == firm_birth
  303,753

. 
. *for descriptives (number of ceo-s and nceo-s in original data, number of ceo
>  and nceo job-spells in original data)
. count
  523,664

. egen company_manager_id = group(frame_id_numeric manager_id)

. codebook manager_id

-------------------------------------------------------------------------------
manager_id                                                    group(manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [2,1607091]                   Units: 1
         Unique values: 85,185                    Missing .: 0/523,664

                  Mean: 844071
             Std. dev.: 421869

           Percentiles:    10%       25%       50%       75%       90%
                        221200    583169    834510   1.2e+06   1.4e+06

. codebook company_manager_id

-------------------------------------------------------------------------------
company_manager_id                           group(frame_id_numeric manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [1,97522]                     Units: 1
         Unique values: 97,522                    Missing .: 0/523,664

                  Mean: 43370.4
             Std. dev.: 26392.3

           Percentiles:     10%       25%       50%       75%       90%
                           7995     21073   42363.5     63591     80107

. 
. * balance panel
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. by company_manager_id: generate gap = year - year[_n-1] - 1
(97,522 missing values generated)

. replace gap = 0 if missing(gap)
(97,522 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    516,986       98.72       98.72
          1 |      3,478        0.66       99.39
          2 |      1,024        0.20       99.58
          3 |        647        0.12       99.71
          4 |        394        0.08       99.78
          5 |        318        0.06       99.84
          6 |        212        0.04       99.88
          7 |        144        0.03       99.91
          8 |        117        0.02       99.93
          9 |        102        0.02       99.95
         10 |         55        0.01       99.96
         11 |         40        0.01       99.97
         12 |         31        0.01       99.98
         13 |         26        0.00       99.98
         14 |         19        0.00       99.99
         15 |         18        0.00       99.99
         16 |         14        0.00       99.99
         17 |          9        0.00       99.99
         18 |          5        0.00      100.00
         19 |          5        0.00      100.00
         20 |          7        0.00      100.00
         21 |          6        0.00      100.00
         22 |          2        0.00      100.00
         23 |          2        0.00      100.00
         25 |          3        0.00      100.00
------------+-----------------------------------
      Total |    523,664      100.00

. 
. * fill in holes of 1 year, but not longer
. expand 1 + (gap == 1), generate(filled_in)
(3,478 observations created)

. replace year = year - 1 if filled_in
(3,478 real changes made)

. 
. * create contiguous spells
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. gen change = ceo != L.ceo

. bysort company_manager_id (year): gen job_spell = sum(change)

. 
. * create job begin and end for each manager spell
. bys frame_id_numeric manager_id job_spell: egen job_begin = min(year)

. bys frame_id_numeric manager_id job_spell: egen job_end = max(year)

. keep frame_id_numeric manager_id job_spell year job_begin job_end expat firm_
> birth foreign

. 
. * if first managers arrive in year 1, extrapolate to year 0 - DROP SPELL
. bys frame_id_numeric: egen first_cohort = min(job_begin)

. replace job_begin = job_begin - 1 if (first_cohort == firm_birth + 1) & (job_
> begin == first_cohort)
(61,475 real changes made)

. 
. * NOTE: no collapse and expand --> there might be holes
. sort frame_id_numeric manager_id year

. count if frame_id_numeric == frame_id_numeric[_n-1] & manager_id == manager_i
> d[_n-1] & year != (year[_n-1] + 1)
  3,200

. 
. * expat before 1990 are mostly error, convert them to locals
. replace expat = 0 if job_begin < 1990
(832 real changes made)

. 
. ***********************
. * time invariant vars and drop entire series of firms from sample *
. ***********************
. by frame_id_numeric: egen first_year_expat = min(cond(expat == 1, job_begin,.
> ))
(389,769 missing values generated)

. by frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.)
> )
(366,062 missing values generated)

. 
. * which of the two happened first?
. generate manager_after_owner = first_year_expat - first_year_foreign
(404,728 missing values generated)

. tabulate manager_after_owner

manager_aft |
   er_owner |      Freq.     Percent        Cum.
------------+-----------------------------------
        -25 |         61        0.05        0.05
        -22 |         45        0.04        0.09
        -18 |         41        0.03        0.12
        -16 |         52        0.04        0.16
        -15 |         81        0.07        0.23
        -13 |        202        0.17        0.39
        -12 |         84        0.07        0.46
        -11 |         47        0.04        0.50
        -10 |        164        0.13        0.63
         -9 |        212        0.17        0.81
         -8 |        531        0.43        1.24
         -7 |        277        0.23        1.47
         -6 |        692        0.57        2.03
         -5 |        324        0.26        2.30
         -4 |        382        0.31        2.61
         -3 |      1,035        0.85        3.46
         -2 |      1,592        1.30        4.76
         -1 |     17,724       14.48       19.23
          0 |     65,274       53.32       72.56
          1 |      9,885        8.08       80.63
          2 |      3,420        2.79       83.43
          3 |      2,887        2.36       85.78
          4 |      2,463        2.01       87.80
          5 |      1,755        1.43       89.23
          6 |      2,105        1.72       90.95
          7 |      1,228        1.00       91.95
          8 |      1,379        1.13       93.08
          9 |      1,288        1.05       94.13
         10 |      1,236        1.01       95.14
         11 |        810        0.66       95.80
         12 |        940        0.77       96.57
         13 |        537        0.44       97.01
         14 |        693        0.57       97.58
         15 |        334        0.27       97.85
         16 |        384        0.31       98.16
         17 |        570        0.47       98.63
         18 |        418        0.34       98.97
         19 |        381        0.31       99.28
         21 |        150        0.12       99.40
         22 |         65        0.05       99.46
         23 |        128        0.10       99.56
         24 |        199        0.16       99.72
         25 |         37        0.03       99.75
         26 |        233        0.19       99.94
         27 |         28        0.02       99.97
         28 |         41        0.03      100.00
------------+-----------------------------------
      Total |    122,414      100.00

. * event time relative to that
. generate event_time = year - first_year_expat
(389,769 missing values generated)

. 
. * if foreign manager arrives up to X years before or Y years later than forei
> gn owner, use foreign manager as arrival date. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(225 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(209 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(440 real changes made)

. 
. * drop firms where expat arrives earlier than X years before owner
. drop if manager_after_owner < -2
(4,230 observations deleted)

. 
. * ever expat and foreign created after foreign changes (drops were firm level
>  before so should not mess with ever variables)
. foreach X of var expat foreign {
  2.         by frame_id_numeric: egen ever_`X' = max(`X'==1)
  3. }

. 
. * drop if there was an expat but was never foreign - these are likely error
. drop if ever_expat == 1 & ever_foreign == 0
(14,962 observations deleted)

. 
. * drop too many CEO-s
. egen fp_tag = tag(frame_id_numeric manager_id) 

. by frame_id_numeric: egen n_ceo_ever = sum(fp_tag)

. drop if n_ceo > 15
(18,055 observations deleted)

. drop fp_tag n_ceo_ever

.         
. * hired or fired ceo since last observed year of firm
. tempvar previous_year

. generate previous_year = .
(489,895 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `previous_year' = max(cond(year 
> < `t', year, .))
  3.         quietly replace previous_year = `previous_year' if year == `t'
  4.         drop `previous_year'
  5. }

. 
. tempvar next_year

. generate next_year = .
(489,895 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `next_year' = min(cond(year > `t
> ', year, .))
  3.         quietly replace next_year = `next_year' if year == `t'
  4.         drop `next_year'
  5. }

. 
. generate byte hire = (job_begin <= year) & (job_begin > previous_year) & !mis
> sing(previous_year)

. generate byte fire = (job_end >= year) & (job_end < next_year) & !missing(nex
> t_year)

. tabulate hire fire 

           |         fire
      hire |         0          1 |     Total
-----------+----------------------+----------
         0 |   410,755     35,652 |   446,407 
         1 |    37,348      6,140 |    43,488 
-----------+----------------------+----------
     Total |   448,103     41,792 |   489,895 

. 
. * number of expats and locals
. bys frame_id_numeric year: egen n_expat_ceo = total(cond(expat, 1, 0))

. bys frame_id_numeric year: egen n_local_ceo = total(cond(!expat, 1, 0))

. 
. * create firm-year data
. collapse (firstnm) n_expat_ceo n_local_ceo foreign ever_expat ever_foreign (c
> ount) n_ceo = expat (max) hire_ceo = hire fire_ceo = fire, by(frame_id_numeri
> c year)

. 
. * if there is a change in the ceo team, hiring, increement the spell counter
. bys frame_id_numeric (year): gen ceo_spell = sum(hire_ceo) + 1 // so that ind
> ex start from 1

. 
. tabulate n_expat_ceo n_local_ceo

 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         0          1          2          3          4 |     Total
-----------+-------------------------------------------------------+----------
         0 |         0    216,063     61,538     15,837      2,964 |   298,626 
         1 |    16,013      9,999      1,625        300         74 |    28,028 
         2 |     6,742      2,599        438         97         22 |     9,906 
         3 |     1,927        495        123         33         18 |     2,596 
         4 |       504        111         23          1          0 |       639 
         5 |       110         23          1          1          0 |       135 
         6 |        69          6          1          0          0 |        76 
         7 |         5          0          2          0          0 |         7 
-----------+-------------------------------------------------------+----------
     Total |    25,370    229,296     63,751     16,269      3,078 |   340,013 


 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         5          6          7          8          9 |     Total
-----------+-------------------------------------------------------+----------
         0 |     1,491        357        243         53         65 |   298,626 
         1 |        11          3          1          2          0 |    28,028 
         2 |         5          2          0          1          0 |     9,906 
         3 |         0          0          0          0          0 |     2,596 
         4 |         0          0          0          0          0 |       639 
         5 |         0          0          0          0          0 |       135 
         6 |         0          0          0          0          0 |        76 
         7 |         0          0          0          0          0 |         7 
-----------+-------------------------------------------------------+----------
     Total |     1,507        362        244         56         65 |   340,013 


 (firstnm) |
n_expat_ce |      (firstnm) n_local_ceo
         o |        10         11         12 |     Total
-----------+---------------------------------+----------
         0 |         3          8          4 |   298,626 
         1 |         0          0          0 |    28,028 
         2 |         0          0          0 |     9,906 
         3 |         0          0          0 |     2,596 
         4 |         0          0          0 |       639 
         5 |         0          0          0 |       135 
         6 |         0          0          0 |        76 
         7 |         0          0          0 |         7 
-----------+---------------------------------+----------
     Total |         3          8          4 |   340,013 

. * create dummies from numbers
. foreach var in expat local {
  2.         gen has_`var'_ceo = (n_`var'_ceo > 0) & !missing(n_`var'_ceo)
  3. }

.         
. count
  340,013

. compress
  variable year was float now int
  variable n_expat_ceo was float now byte
  variable n_local_ceo was float now byte
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable n_ceo was long now byte
  variable ceo_spell was float now byte
  variable has_expat_ceo was float now byte
  variable has_local_ceo was float now byte
  (8,840,338 bytes saved)

. save "`here'/temp/firm_events.dta", replace
file /Users/koren/Tresorit/Mac/projects/expat//temp/firm_events.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/firm_panel.log
  log type:  text
 closed on:  21 Mar 2024, 16:59:15
-------------------------------------------------------------------------------
