-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/firm_panel.lo
> g
  log type:  text
 opened on:  19 Mar 2024, 19:57:30

. 
. * keep only sample from balance-small
. use "`here'/temp/balance-small-clean.dta"

. by frame_id_numeric: egen firm_birth = min(year)

. by frame_id_numeric: egen firm_death = max(year)

. keep frame_id year firm_birth firm_death foreign

. tempfile sample

. save `sample', replace
(file /var/folders/5z/21k9mmsd55d1w5_jl5n192sh0000gn/T//St59393.000001 not
    found)
file /var/folders/5z/21k9mmsd55d1w5_jl5n192sh0000gn/T//St59393.000001 saved
    as .dta format

. 
. use "`here'/temp/ceo-panel.dta", clear 

. 
. * only keep sample firms
. merge m:1 frame_id_numeric year using `sample', keep(match) nogen
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           523,671  
    -----------------------------------------

. count if first_year_of_firm == firm_birth
  303,753

. 
. *for descriptives (number of ceo-s and nceo-s in original data, number of ceo
>  and nceo job-spells in original data)
. count
  523,671

. egen company_manager_id = group(frame_id_numeric manager_id)

. codebook manager_id

-------------------------------------------------------------------------------
manager_id                                                    group(manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [3,1544329]                   Units: 1
         Unique values: 84,081                    Missing .: 0/523,671

                  Mean: 787838
             Std. dev.: 411054

           Percentiles:    10%       25%       50%       75%       90%
                        186171    520405    771748   1.1e+06   1.4e+06

. codebook company_manager_id

-------------------------------------------------------------------------------
company_manager_id                           group(frame_id_numeric manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [1,97524]                     Units: 1
         Unique values: 97,524                    Missing .: 0/523,671

                  Mean: 43371.6
             Std. dev.: 26392.9

           Percentiles:     10%       25%       50%       75%       90%
                           7995     21074     42365     63593     80108

. 
. * balance panel
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. by company_manager_id: generate gap = year - year[_n-1] - 1
(97,524 missing values generated)

. replace gap = 0 if missing(gap)
(97,524 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    516,993       98.72       98.72
          1 |      3,479        0.66       99.39
          2 |      1,023        0.20       99.58
          3 |        647        0.12       99.71
          4 |        394        0.08       99.78
          5 |        318        0.06       99.84
          6 |        212        0.04       99.88
          7 |        144        0.03       99.91
          8 |        117        0.02       99.93
          9 |        102        0.02       99.95
         10 |         55        0.01       99.96
         11 |         40        0.01       99.97
         12 |         31        0.01       99.98
         13 |         26        0.00       99.98
         14 |         19        0.00       99.99
         15 |         18        0.00       99.99
         16 |         14        0.00       99.99
         17 |          9        0.00       99.99
         18 |          5        0.00      100.00
         19 |          5        0.00      100.00
         20 |          7        0.00      100.00
         21 |          6        0.00      100.00
         22 |          2        0.00      100.00
         23 |          2        0.00      100.00
         25 |          3        0.00      100.00
------------+-----------------------------------
      Total |    523,671      100.00

. 
. * fill in holes of 1 year, but not longer
. expand 1 + (gap == 1), generate(filled_in)
(3,479 observations created)

. replace year = year - 1 if filled_in
(3,479 real changes made)

. 
. * create contiguous spells
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. gen change = ceo != L.ceo

. bysort company_manager_id (year): gen job_spell = sum(change)

. 
. * create job begin and end for each manager spell
. bys frame_id_numeric manager_id job_spell: egen job_begin = min(year)

. bys frame_id_numeric manager_id job_spell: egen job_end = max(year)

. keep frame_id_numeric manager_id job_spell year job_begin job_end expat firm_
> birth foreign

. 
. * if first managers arrive in year 1, extrapolate to year 0 - DROP SPELL
. bys frame_id_numeric: egen first_cohort = min(job_begin)

. replace job_begin = job_begin - 1 if (first_cohort == firm_birth + 1) & (job_
> begin == first_cohort)
(61,477 real changes made)

. 
. * NOTE: no collapse and expand --> there might be holes
. sort frame_id_numeric manager_id year

. count if frame_id_numeric == frame_id_numeric[_n-1] & manager_id == manager_i
> d[_n-1] & year != (year[_n-1] + 1)
  3,199

. 
. * expat before 1990 are mostly error, convert them to locals
. replace expat = 0 if job_begin < 1990
(11,173 real changes made)

. 
. ***********************
. * time invariant vars and drop entire series of firms from sample *
. ***********************
. by frame_id_numeric: egen first_year_expat = min(cond(expat == 1, job_begin,.
> ))
(322,730 missing values generated)

. by frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.)
> )
(366,062 missing values generated)

. 
. * which of the two happened first?
. generate manager_after_owner = first_year_expat - first_year_foreign
(400,608 missing values generated)

. tabulate manager_after_owner

manager_aft |
   er_owner |      Freq.     Percent        Cum.
------------+-----------------------------------
        -27 |         56        0.04        0.04
        -26 |         56        0.04        0.09
        -25 |         99        0.08        0.17
        -23 |         51        0.04        0.21
        -22 |        200        0.16        0.37
        -21 |         41        0.03        0.40
        -20 |         97        0.08        0.47
        -19 |        503        0.40        0.87
        -18 |        174        0.14        1.01
        -17 |        216        0.17        1.18
        -16 |        521        0.41        1.59
        -15 |        594        0.47        2.06
        -14 |        243        0.19        2.25
        -13 |        645        0.51        2.76
        -12 |        217        0.17        2.93
        -11 |        531        0.42        3.35
        -10 |        496        0.39        3.75
         -9 |        492        0.39        4.13
         -8 |        484        0.38        4.52
         -7 |        705        0.56        5.07
         -6 |        883        0.70        5.77
         -5 |        929        0.73        6.51
         -4 |      1,668        1.32        7.82
         -3 |      1,907        1.51        9.33
         -2 |      2,492        1.97       11.30
         -1 |     18,668       14.75       26.05
          0 |     64,790       51.20       77.25
          1 |      7,702        6.09       83.34
          2 |      3,174        2.51       85.85
          3 |      2,578        2.04       87.89
          4 |      2,026        1.60       89.49
          5 |      1,671        1.32       90.81
          6 |      1,835        1.45       92.26
          7 |      1,028        0.81       93.07
          8 |      1,150        0.91       93.98
          9 |      1,289        1.02       95.00
         10 |      1,083        0.86       95.85
         11 |        800        0.63       96.48
         12 |        546        0.43       96.92
         13 |        598        0.47       97.39
         14 |        499        0.39       97.78
         15 |        284        0.22       98.01
         16 |        384        0.30       98.31
         17 |        511        0.40       98.72
         18 |        462        0.37       99.08
         19 |        299        0.24       99.32
         20 |         28        0.02       99.34
         21 |        120        0.09       99.43
         22 |        116        0.09       99.53
         23 |         94        0.07       99.60
         24 |        140        0.11       99.71
         25 |         65        0.05       99.76
         26 |        233        0.18       99.95
         27 |         28        0.02       99.97
         28 |         41        0.03      100.00
------------+-----------------------------------
      Total |    126,542      100.00

. * event time relative to that
. generate event_time = year - first_year_expat
(322,730 missing values generated)

. 
. * if foreign manager arrives up to X years before or Y years later than forei
> gn owner, use foreign manager as arrival date. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(286 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(288 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(350 real changes made)

. 
. * drop firms where expat arrives earlier than X years before owner
. drop if manager_after_owner < -2
(11,808 observations deleted)

. 
. * ever expat and foreign created after foreign changes (drops were firm level
>  before so should not mess with ever variables)
. foreach X of var expat foreign {
  2.         by frame_id_numeric: egen ever_`X' = max(`X'==1)
  3. }

. 
. * drop if there was an expat but was never foreign - these are likely error
. drop if ever_expat == 1 & ever_foreign == 0
(77,881 observations deleted)

. 
. * drop too many CEO-s
. egen fp_tag = tag(frame_id_numeric manager_id) 

. by frame_id_numeric: egen n_ceo_ever = sum(fp_tag)

. drop if n_ceo > 15
(15,715 observations deleted)

. drop fp_tag n_ceo_ever

.         
. * hired or fired ceo since last observed year of firm
. tempvar previous_year

. generate previous_year = .
(421,746 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `previous_year' = max(cond(year 
> < `t', year, .))
  3.         quietly replace previous_year = `previous_year' if year == `t'
  4.         drop `previous_year'
  5. }

. 
. tempvar next_year

. generate next_year = .
(421,746 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `next_year' = min(cond(year > `t
> ', year, .))
  3.         quietly replace next_year = `next_year' if year == `t'
  4.         drop `next_year'
  5. }

. 
. generate byte hire = (job_begin <= year) & (job_begin > previous_year) & !mis
> sing(previous_year)

. generate byte fire = (job_end >= year) & (job_end < next_year) & !missing(nex
> t_year)

. tabulate hire fire 

           |         fire
      hire |         0          1 |     Total
-----------+----------------------+----------
         0 |   357,207     28,838 |   386,045 
         1 |    30,751      4,950 |    35,701 
-----------+----------------------+----------
     Total |   387,958     33,788 |   421,746 

. 
. * number of expats and locals
. bys frame_id_numeric year: egen n_expat_ceo = total(cond(expat, 1, 0))

. bys frame_id_numeric year: egen n_local_ceo = total(cond(!expat, 1, 0))

. 
. * create firm-year data
. collapse (firstnm) n_expat_ceo n_local_ceo foreign ever_expat ever_foreign (c
> ount) n_ceo = expat (max) hire_ceo = hire fire_ceo = fire, by(frame_id_numeri
> c year)

. 
. * if there is a change in the ceo team, hiring or firing, increement the spel
> l counter
. bys frame_id_numeric (year): gen ceo_spell = sum(hire_ceo | fire_ceo) + 1 // 
> so that index start from 1

. 
. tabulate n_expat_ceo n_local_ceo

 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         0          1          2          3          4 |     Total
-----------+-------------------------------------------------------+----------
         0 |         0    185,429     52,698     12,108      2,167 |   254,211 
         1 |    15,387      9,491      1,649        276         67 |    26,904 
         2 |     6,500      2,534        423         87         16 |     9,564 
         3 |     1,801        514        123         35         16 |     2,489 
         4 |       446        104         13          1          0 |       564 
         5 |        98         36          1          1          2 |       139 
         6 |        51          6          1          0          0 |        58 
         7 |         5          0          0          0          0 |         5 
-----------+-------------------------------------------------------+----------
     Total |    24,288    198,114     54,908     12,508      2,268 |   293,934 


 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         5          6          7          8          9 |     Total
-----------+-------------------------------------------------------+----------
         0 |     1,216        280        199         39         61 |   254,211 
         1 |        22          7          2          2          1 |    26,904 
         2 |         3          1          0          0          0 |     9,564 
         3 |         0          0          0          0          0 |     2,489 
         4 |         0          0          0          0          0 |       564 
         5 |         0          1          0          0          0 |       139 
         6 |         0          0          0          0          0 |        58 
         7 |         0          0          0          0          0 |         5 
-----------+-------------------------------------------------------+----------
     Total |     1,241        289        201         41         62 |   293,934 


 (firstnm) |
n_expat_ce |      (firstnm) n_local_ceo
         o |        10         11         12 |     Total
-----------+---------------------------------+----------
         0 |         3          7          4 |   254,211 
         1 |         0          0          0 |    26,904 
         2 |         0          0          0 |     9,564 
         3 |         0          0          0 |     2,489 
         4 |         0          0          0 |       564 
         5 |         0          0          0 |       139 
         6 |         0          0          0 |        58 
         7 |         0          0          0 |         5 
-----------+---------------------------------+----------
     Total |         3          7          4 |   293,934 

. * create dummies from numbers
. foreach var in expat local {
  2.         gen has_`var'_ceo = (n_`var'_ceo > 0) & !missing(n_`var'_ceo)
  3. }

.         
. count
  293,934

. compress
  variable year was float now int
  variable n_expat_ceo was float now byte
  variable n_local_ceo was float now byte
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable n_ceo was long now byte
  variable ceo_spell was float now byte
  variable has_expat_ceo was float now byte
  variable has_local_ceo was float now byte
  (7,642,284 bytes saved)

. save "`here'/temp/firm_events.dta", replace
file /Users/koren/Tresorit/Mac2Mac/projects/expat//temp/firm_events.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/firm_panel.lo
> g
  log type:  text
 closed on:  19 Mar 2024, 19:57:56
-------------------------------------------------------------------------------
