-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/firm_panel.lo
> g
  log type:  text
 opened on:  19 Mar 2024, 15:50:23

. 
. * keep only sample from balance-small
. use "`here'/temp/balance-small-clean.dta"

. by frame_id_numeric: egen firm_birth = min(year)

. by frame_id_numeric: egen firm_death = max(year)

. keep frame_id year firm_birth firm_death foreign

. tempfile sample

. save `sample', replace
(file /var/folders/5z/21k9mmsd55d1w5_jl5n192sh0000gn/T//St89227.000001 not
    found)
file /var/folders/5z/21k9mmsd55d1w5_jl5n192sh0000gn/T//St89227.000001 saved
    as .dta format

. 
. use "`here'/input/ceo-panel/ceo-panel.dta", clear 

. rename person_id manager_id

. replace expat = (foreign_address == 1) & (foreign_name == 1)
(1,387,551 real changes made)

. 
. * only keep sample firms
. merge m:1 frame_id_numeric year using `sample', keep(match) nogen
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           520,107  
    -----------------------------------------

. count if first_year_of_firm == firm_birth
  306,752

. 
. *for descriptives (number of ceo-s and nceo-s in original data, number of ceo
>  and nceo job-spells in original data)
. count
  520,107

. egen company_manager_id = group(frame_id_numeric manager_id)

. codebook manager_id

-------------------------------------------------------------------------------
manager_id                                                    group(manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [69,1544329]                  Units: 1
         Unique values: 79,846                    Missing .: 0/520,107

                  Mean: 826311
             Std. dev.: 394479

           Percentiles:    10%       25%       50%       75%       90%
                        279814    560365    806794   1.2e+06   1.4e+06

. codebook company_manager_id

-------------------------------------------------------------------------------
company_manager_id                           group(frame_id_numeric manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [1,91896]                     Units: 1
         Unique values: 91,896                    Missing .: 0/520,107

                  Mean:   40517
             Std. dev.: 24975.3

           Percentiles:     10%       25%       50%       75%       90%
                           6888     19319     39737     59628     75107

. 
. * balance panel
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. by company_manager_id: generate gap = year - year[_n-1] - 1
(91,896 missing values generated)

. replace gap = 0 if missing(gap)
(91,896 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    513,651       98.76       98.76
          1 |      3,274        0.63       99.39
          2 |      1,034        0.20       99.59
          3 |        632        0.12       99.71
          4 |        389        0.07       99.78
          5 |        323        0.06       99.85
          6 |        209        0.04       99.89
          7 |        141        0.03       99.91
          8 |        109        0.02       99.93
          9 |        106        0.02       99.95
         10 |         51        0.01       99.96
         11 |         35        0.01       99.97
         12 |         31        0.01       99.98
         13 |         28        0.01       99.98
         14 |         21        0.00       99.99
         15 |         19        0.00       99.99
         16 |         14        0.00       99.99
         17 |          9        0.00       99.99
         18 |          6        0.00      100.00
         19 |          5        0.00      100.00
         20 |          5        0.00      100.00
         21 |          7        0.00      100.00
         22 |          2        0.00      100.00
         23 |          2        0.00      100.00
         24 |          1        0.00      100.00
         25 |          3        0.00      100.00
------------+-----------------------------------
      Total |    520,107      100.00

. 
. * fill in holes of 1 year, but not longer
. expand 1 + (gap == 1), generate(filled_in)
(3,274 observations created)

. replace year = year - 1 if filled_in
(3,274 real changes made)

. 
. * create contiguous spells
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. gen change = ceo != L.ceo

. bysort company_manager_id (year): gen job_spell = sum(change)

. 
. * create job begin and end for each manager spell
. bys frame_id_numeric manager_id job_spell: egen job_begin = min(year)

. bys frame_id_numeric manager_id job_spell: egen job_end = max(year)

. keep frame_id_numeric manager_id job_spell year job_begin job_end expat firm_
> birth foreign

. 
. * if first managers arrive in year 1, extrapolate to year 0 - DROP SPELL
. bys frame_id_numeric: egen first_cohort = min(job_begin)

. replace job_begin = job_begin - 1 if (first_cohort == firm_birth + 1) & (job_
> begin == first_cohort)
(62,444 real changes made)

. 
. * NOTE: no collapse and expand --> there might be holes
. sort frame_id_numeric manager_id year

. count if frame_id_numeric == frame_id_numeric[_n-1] & manager_id == manager_i
> d[_n-1] & year != (year[_n-1] + 1)
  3,182

. 
. * expat before 1990 are mostly error, convert them to locals
. replace expat = 0 if job_begin < 1990
(412 real changes made)

. 
. ***********************
. * time invariant vars and drop entire series of firms from sample *
. ***********************
. by frame_id_numeric: egen first_year_expat = min(cond(expat == 1, job_begin,.
> ))
(455,321 missing values generated)

. by frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.)
> )
(429,612 missing values generated)

. 
. * which of the two happened first?
. generate manager_after_owner = first_year_expat - first_year_foreign
(461,642 missing values generated)

. tabulate manager_after_owner

manager_aft |
   er_owner |      Freq.     Percent        Cum.
------------+-----------------------------------
        -27 |         56        0.09        0.09
        -25 |         61        0.10        0.19
        -19 |         54        0.09        0.28
        -16 |         33        0.05        0.33
        -15 |         54        0.09        0.42
        -13 |        202        0.33        0.75
        -12 |         41        0.07        0.81
        -11 |         13        0.02        0.83
        -10 |         89        0.14        0.98
         -9 |        107        0.17        1.15
         -8 |        351        0.57        1.72
         -7 |        384        0.62        2.34
         -6 |        349        0.57        2.91
         -5 |        246        0.40        3.30
         -4 |        322        0.52        3.83
         -3 |        966        1.56        5.39
         -2 |        309        0.50        5.89
         -1 |     14,016       22.70       28.59
          0 |     25,874       41.91       70.50
          1 |      3,662        5.93       76.43
          2 |      2,213        3.58       80.02
          3 |      1,401        2.27       82.29
          4 |      1,582        2.56       84.85
          5 |      1,254        2.03       86.88
          6 |        994        1.61       88.49
          7 |      1,266        2.05       90.54
          8 |        854        1.38       91.92
          9 |      1,159        1.88       93.80
         10 |        949        1.54       95.34
         11 |        381        0.62       95.96
         12 |        476        0.77       96.73
         13 |        255        0.41       97.14
         14 |        488        0.79       97.93
         15 |        119        0.19       98.12
         16 |        195        0.32       98.44
         17 |        210        0.34       98.78
         18 |        307        0.50       99.28
         19 |        128        0.21       99.48
         20 |         35        0.06       99.54
         21 |         99        0.16       99.70
         22 |         48        0.08       99.78
         25 |         30        0.05       99.83
         26 |         66        0.11       99.93
         28 |         41        0.07      100.00
------------+-----------------------------------
      Total |     61,739      100.00

. * event time relative to that
. generate event_time = year - first_year_expat
(455,321 missing values generated)

. 
. * if foreign manager arrives up to X years before or Y years later than forei
> gn owner, use foreign manager as arrival date. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(58 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(41 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(154 real changes made)

. 
. * drop firms where expat arrives earlier than X years before owner
. drop if manager_after_owner < -2
(3,328 observations deleted)

. 
. * ever expat and foreign created after foreign changes (drops were firm level
>  before so should not mess with ever variables)
. foreach X of var expat foreign {
  2.         by frame_id_numeric: egen ever_`X' = max(`X'==1)
  3. }

. 
. * drop if there was an expat but was never foreign - these are likely error
. drop if ever_expat == 1 & ever_foreign == 0
(6,321 observations deleted)

. 
. * drop too many CEO-s
. egen fp_tag = tag(frame_id_numeric manager_id) 

. by frame_id_numeric: egen n_ceo_ever = sum(fp_tag)

. drop if n_ceo > 15
(15,483 observations deleted)

. drop fp_tag n_ceo_ever

.         
. * hired or fired ceo since last observed year of firm
. tempvar previous_year

. generate previous_year = .
(498,249 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `previous_year' = max(cond(year 
> < `t', year, .))
  3.         quietly replace previous_year = `previous_year' if year == `t'
  4.         drop `previous_year'
  5. }

. 
. tempvar next_year

. generate next_year = .
(498,249 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `next_year' = min(cond(year > `t
> ', year, .))
  3.         quietly replace next_year = `next_year' if year == `t'
  4.         drop `next_year'
  5. }

. 
. generate byte hire = (job_begin <= year) & (job_begin > previous_year) & !mis
> sing(previous_year)

. generate byte fire = (job_end >= year) & (job_end < next_year) & !missing(nex
> t_year)

. tabulate hire fire 

           |         fire
      hire |         0          1 |     Total
-----------+----------------------+----------
         0 |   422,549     33,805 |   456,354 
         1 |    36,323      5,572 |    41,895 
-----------+----------------------+----------
     Total |   458,872     39,377 |   498,249 

. 
. * number of expats and locals
. bys frame_id_numeric year: egen n_expat_ceo = total(cond(expat, 1, 0))

. bys frame_id_numeric year: egen n_local_ceo = total(cond(!expat, 1, 0))

. 
. * create firm-year data
. collapse (firstnm) n_expat_ceo n_local_ceo foreign ever_expat ever_foreign (c
> ount) n_ceo = expat (max) hire_ceo = hire fire_ceo = fire, by(frame_id_numeri
> c year)

. 
. * if there is a change in the ceo team, hiring or firing, increement the spel
> l counter
. bys frame_id_numeric (year): gen ceo_spell = sum(hire_ceo | fire_ceo) + 1 // 
> so that index start from 1

. 
. tabulate n_expat_ceo n_local_ceo

 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         0          1          2          3          4 |     Total
-----------+-------------------------------------------------------+----------
         0 |         0    243,359     64,542     18,114      3,534 |   333,536 
         1 |     6,430      4,663        992        177         57 |    12,334 
         2 |     2,507      1,279        217         55          9 |     4,073 
         3 |       614        256         72         14          8 |       964 
         4 |       134         29         11          1          0 |       175 
         5 |        51         33          0          0          0 |        84 
         6 |        21          4          0          0          0 |        25 
         7 |         4          0          0          0          0 |         4 
-----------+-------------------------------------------------------+----------
     Total |     9,761    249,623     65,834     18,361      3,608 |   351,195 


 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         5          6          7          8          9 |     Total
-----------+-------------------------------------------------------+----------
         0 |     2,596        564        555        114        116 |   333,536 
         1 |        13          2          0          0          0 |    12,334 
         2 |         6          0          0          0          0 |     4,073 
         3 |         0          0          0          0          0 |       964 
         4 |         0          0          0          0          0 |       175 
         5 |         0          0          0          0          0 |        84 
         6 |         0          0          0          0          0 |        25 
         7 |         0          0          0          0          0 |         4 
-----------+-------------------------------------------------------+----------
     Total |     2,615        566        555        114        116 |   351,195 


 (firstnm) |
n_expat_ce |            (firstnm) n_local_ceo
         o |        10         11         12         13 |     Total
-----------+--------------------------------------------+----------
         0 |         9         27          4          2 |   333,536 
         1 |         0          0          0          0 |    12,334 
         2 |         0          0          0          0 |     4,073 
         3 |         0          0          0          0 |       964 
         4 |         0          0          0          0 |       175 
         5 |         0          0          0          0 |        84 
         6 |         0          0          0          0 |        25 
         7 |         0          0          0          0 |         4 
-----------+--------------------------------------------+----------
     Total |         9         27          4          2 |   351,195 

. * create dummies from numbers
. foreach var in expat local {
  2.         gen has_`var'_ceo = (n_`var'_ceo > 0) & !missing(n_`var'_ceo)
  3. }

.         
. count
  351,195

. compress
  variable year was float now int
  variable n_expat_ceo was float now byte
  variable n_local_ceo was float now byte
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable n_ceo was long now byte
  variable ceo_spell was float now byte
  variable has_expat_ceo was float now byte
  variable has_local_ceo was float now byte
  (9,131,070 bytes saved)

. save "`here'/temp/firm_events.dta", replace
file /Users/koren/Tresorit/Mac2Mac/projects/expat//temp/firm_events.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/firm_panel.lo
> g
  log type:  text
 closed on:  19 Mar 2024, 15:50:52
-------------------------------------------------------------------------------
