-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/firm_panel.log
  log type:  text
 opened on:  21 Mar 2024, 17:14:12

. 
. * keep only sample from balance-small
. use "`here'/temp/balance-small-clean.dta"

. by frame_id_numeric: egen firm_birth = min(year)

. by frame_id_numeric: egen firm_death = max(year)

. keep frame_id year firm_birth firm_death foreign

. tempfile sample

. save `sample', replace
(file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St77609.000001 not
    found)
file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St77609.000001 saved
    as .dta format

. 
. use "`here'/temp/ceo-panel.dta", clear 

. 
. * only keep sample firms
. merge m:1 frame_id_numeric year using `sample', keep(match) nogen
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           523,664  
    -----------------------------------------

. count if first_year_of_firm == firm_birth
  303,753

. 
. *for descriptives (number of ceo-s and nceo-s in original data, number of ceo
>  and nceo job-spells in original data)
. count
  523,664

. egen company_manager_id = group(frame_id_numeric manager_id)

. codebook manager_id

-------------------------------------------------------------------------------
manager_id                                                    group(manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [2,1607091]                   Units: 1
         Unique values: 85,185                    Missing .: 0/523,664

                  Mean: 844071
             Std. dev.: 421869

           Percentiles:    10%       25%       50%       75%       90%
                        221200    583169    834510   1.2e+06   1.4e+06

. codebook company_manager_id

-------------------------------------------------------------------------------
company_manager_id                           group(frame_id_numeric manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [1,97522]                     Units: 1
         Unique values: 97,522                    Missing .: 0/523,664

                  Mean: 43370.4
             Std. dev.: 26392.3

           Percentiles:     10%       25%       50%       75%       90%
                           7995     21073   42363.5     63591     80107

. 
. * balance panel
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. by company_manager_id: generate gap = year - year[_n-1] - 1
(97,522 missing values generated)

. replace gap = 0 if missing(gap)
(97,522 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    516,986       98.72       98.72
          1 |      3,478        0.66       99.39
          2 |      1,024        0.20       99.58
          3 |        647        0.12       99.71
          4 |        394        0.08       99.78
          5 |        318        0.06       99.84
          6 |        212        0.04       99.88
          7 |        144        0.03       99.91
          8 |        117        0.02       99.93
          9 |        102        0.02       99.95
         10 |         55        0.01       99.96
         11 |         40        0.01       99.97
         12 |         31        0.01       99.98
         13 |         26        0.00       99.98
         14 |         19        0.00       99.99
         15 |         18        0.00       99.99
         16 |         14        0.00       99.99
         17 |          9        0.00       99.99
         18 |          5        0.00      100.00
         19 |          5        0.00      100.00
         20 |          7        0.00      100.00
         21 |          6        0.00      100.00
         22 |          2        0.00      100.00
         23 |          2        0.00      100.00
         25 |          3        0.00      100.00
------------+-----------------------------------
      Total |    523,664      100.00

. 
. * fill in holes of 1 year, but not longer
. expand 1 + (gap == 1), generate(filled_in)
(3,478 observations created)

. replace year = year - 1 if filled_in
(3,478 real changes made)

. 
. * create contiguous spells
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. gen change = ceo != L.ceo

. bysort company_manager_id (year): gen job_spell = sum(change)

. 
. * create job begin and end for each manager spell
. bys frame_id_numeric manager_id job_spell: egen job_begin = min(year)

. bys frame_id_numeric manager_id job_spell: egen job_end = max(year)

. keep frame_id_numeric manager_id job_spell year job_begin job_end expat firm_
> birth foreign

. 
. * if first managers arrive in year 1, extrapolate to year 0 - DROP SPELL
. bys frame_id_numeric: egen first_cohort = min(job_begin)

. replace job_begin = job_begin - 1 if (first_cohort == firm_birth + 1) & (job_
> begin == first_cohort)
(61,475 real changes made)

. 
. * NOTE: no collapse and expand --> there might be holes
. sort frame_id_numeric manager_id year

. count if frame_id_numeric == frame_id_numeric[_n-1] & manager_id == manager_i
> d[_n-1] & year != (year[_n-1] + 1)
  3,200

. 
. * expat before 1990 are mostly error, convert them to locals
. replace expat = 0 if job_begin < 1990
(641 real changes made)

. 
. ***********************
. * time invariant vars and drop entire series of firms from sample *
. ***********************
. by frame_id_numeric: egen first_year_expat = min(cond(expat == 1, job_begin,.
> ))
(404,711 missing values generated)

. by frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.)
> )
(366,062 missing values generated)

. 
. * which of the two happened first?
. generate manager_after_owner = first_year_expat - first_year_foreign
(412,000 missing values generated)

. tabulate manager_after_owner

manager_aft |
   er_owner |      Freq.     Percent        Cum.
------------+-----------------------------------
        -25 |         61        0.05        0.05
        -16 |         52        0.05        0.10
        -15 |         54        0.05        0.15
        -13 |        184        0.16        0.30
        -12 |         41        0.04        0.34
        -10 |         72        0.06        0.40
         -9 |        107        0.09        0.50
         -8 |        392        0.34        0.84
         -7 |        267        0.23        1.07
         -6 |        381        0.33        1.40
         -5 |        215        0.19        1.59
         -4 |        297        0.26        1.84
         -3 |        816        0.71        2.55
         -2 |      1,357        1.18        3.73
         -1 |     15,550       13.51       17.24
          0 |     60,523       52.56       69.80
          1 |      9,891        8.59       78.39
          2 |      3,287        2.85       81.24
          3 |      3,035        2.64       83.88
          4 |      2,347        2.04       85.92
          5 |      1,870        1.62       87.54
          6 |      2,186        1.90       89.44
          7 |      1,753        1.52       90.96
          8 |      1,483        1.29       92.25
          9 |      1,580        1.37       93.62
         10 |      1,310        1.14       94.76
         11 |        664        0.58       95.34
         12 |      1,023        0.89       96.23
         13 |        828        0.72       96.95
         14 |        532        0.46       97.41
         15 |        295        0.26       97.66
         16 |        415        0.36       98.03
         17 |        416        0.36       98.39
         18 |        320        0.28       98.66
         19 |        424        0.37       99.03
         20 |         63        0.05       99.09
         21 |        332        0.29       99.38
         22 |        141        0.12       99.50
         23 |        100        0.09       99.58
         24 |        199        0.17       99.76
         26 |        238        0.21       99.96
         28 |         41        0.04      100.00
------------+-----------------------------------
      Total |    115,142      100.00

. * event time relative to that
. generate event_time = year - first_year_expat
(404,711 missing values generated)

. 
. * if foreign manager arrives up to X years before or Y years later than forei
> gn owner, use foreign manager as arrival date. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(189 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(175 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(429 real changes made)

. 
. * drop firms where expat arrives earlier than X years before owner
. drop if manager_after_owner < -2
(2,939 observations deleted)

. 
. * ever expat and foreign created after foreign changes (drops were firm level
>  before so should not mess with ever variables)
. foreach X of var expat foreign {
  2.         by frame_id_numeric: egen ever_`X' = max(`X'==1)
  3. }

. 
. * drop if there was an expat but was never foreign - these are likely error
. drop if ever_expat == 1 & ever_foreign == 0
(7,292 observations deleted)

. 
. * drop too many CEO-s
. egen fp_tag = tag(frame_id_numeric manager_id) 

. by frame_id_numeric: egen n_ceo_ever = sum(fp_tag)

. drop if n_ceo > 15
(19,492 observations deleted)

. drop fp_tag n_ceo_ever

.         
. * hired or fired ceo since last observed year of firm
. tempvar previous_year

. generate previous_year = .
(497,419 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `previous_year' = max(cond(year 
> < `t', year, .))
  3.         quietly replace previous_year = `previous_year' if year == `t'
  4.         drop `previous_year'
  5. }

. 
. tempvar next_year

. generate next_year = .
(497,419 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `next_year' = min(cond(year > `t
> ', year, .))
  3.         quietly replace next_year = `next_year' if year == `t'
  4.         drop `next_year'
  5. }

. 
. generate byte hire = (job_begin <= year) & (job_begin > previous_year) & !mis
> sing(previous_year)

. generate byte fire = (job_end >= year) & (job_end < next_year) & !missing(nex
> t_year)

. tabulate hire fire 

           |         fire
      hire |         0          1 |     Total
-----------+----------------------+----------
         0 |   416,709     36,341 |   453,050 
         1 |    38,088      6,281 |    44,369 
-----------+----------------------+----------
     Total |   454,797     42,622 |   497,419 

. 
. * number of expats and locals
. bys frame_id_numeric year: egen n_expat_ceo = total(cond(expat, 1, 0))

. bys frame_id_numeric year: egen n_local_ceo = total(cond(!expat, 1, 0))

. 
. * create firm-year data
. collapse (firstnm) n_expat_ceo n_local_ceo foreign ever_expat ever_foreign (c
> ount) n_ceo = expat (max) hire_ceo = hire fire_ceo = fire, by(frame_id_numeri
> c year)

. 
. * if there is a change in the ceo team, hiring, increement the spell counter
. bys frame_id_numeric (year): gen ceo_spell = sum(hire_ceo) + 1 // so that ind
> ex start from 1

. 
. tabulate n_expat_ceo n_local_ceo

 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         0          1          2          3          4 |     Total
-----------+-------------------------------------------------------+----------
         0 |         0    221,952     64,046     16,609      3,190 |   308,167 
         1 |    13,094     10,090      1,877        334         92 |    25,511 
         2 |     5,260      2,525        460         89         20 |     8,363 
         3 |     1,390        488        130         33         12 |     2,053 
         4 |       356         76         25          1          0 |       458 
         5 |        92         33          2          1          0 |       128 
         6 |        47          5          1          0          0 |        53 
         7 |         5          0          2          0          0 |         7 
-----------+-------------------------------------------------------+----------
     Total |    20,244    235,169     66,543     17,067      3,314 |   344,740 


 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         5          6          7          8          9 |     Total
-----------+-------------------------------------------------------+----------
         0 |     1,580        396        255         57         67 |   308,167 
         1 |        13          7          2          2          0 |    25,511 
         2 |         7          1          0          1          0 |     8,363 
         3 |         0          0          0          0          0 |     2,053 
         4 |         0          0          0          0          0 |       458 
         5 |         0          0          0          0          0 |       128 
         6 |         0          0          0          0          0 |        53 
         7 |         0          0          0          0          0 |         7 
-----------+-------------------------------------------------------+----------
     Total |     1,600        404        257         60         67 |   344,740 


 (firstnm) |
n_expat_ce |      (firstnm) n_local_ceo
         o |        10         11         12 |     Total
-----------+---------------------------------+----------
         0 |         3          8          4 |   308,167 
         1 |         0          0          0 |    25,511 
         2 |         0          0          0 |     8,363 
         3 |         0          0          0 |     2,053 
         4 |         0          0          0 |       458 
         5 |         0          0          0 |       128 
         6 |         0          0          0 |        53 
         7 |         0          0          0 |         7 
-----------+---------------------------------+----------
     Total |         3          8          4 |   344,740 

. * create dummies from numbers
. foreach var in expat local {
  2.         gen has_`var'_ceo = (n_`var'_ceo > 0) & !missing(n_`var'_ceo)
  3. }

.         
. count
  344,740

. compress
  variable year was float now int
  variable n_expat_ceo was float now byte
  variable n_local_ceo was float now byte
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable n_ceo was long now byte
  variable ceo_spell was float now byte
  variable has_expat_ceo was float now byte
  variable has_local_ceo was float now byte
  (8,963,240 bytes saved)

. save "`here'/temp/firm_events.dta", replace
file /Users/koren/Tresorit/Mac/projects/expat//temp/firm_events.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/firm_panel.log
  log type:  text
 closed on:  21 Mar 2024, 17:14:39
-------------------------------------------------------------------------------
