-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresors/Data3/projects/expat-analysis/output/firm_panel.log
  log type:  text
 opened on:  20 Nov 2018, 19:13:02

. 
. use temp/balance-small

. collapse (max) firm_death=year, by(frame_id)

. tempfile sample

. save `sample', replace
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//S_70963.000001 not found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//S_70963.000001 saved

. 
. use temp/manager_panel, clear

. 
. * only keep sample firms
. merge m:1 frame_id using `sample', keep(match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,705,303  
    -----------------------------------------

. drop if year>firm_death
(255,056 observations deleted)

. 
. do fill_in_ceo

. gen ceo = (pos5==1) if !missing(pos5)
(487,225 missing values generated)

. 
. *Amennyiben egy személy egy cégnél egy évben többször szerepelt, és ceo is volt, esetében a c
> eo pos5 megtartása
. duplicates tag frame_id manager_id year, gen(manager_duplicate)

Duplicates in terms of frame_id manager_id year

. 
. bys frame_id manager_id year: egen manager_ceo = max(ceo)
(479852 missing values generated)

. drop if manager_duplicate>0 & (manager_ceo==1) & !(ceo==1)
(7,669 observations deleted)

. drop manager_duplicate

. 
. * before all the cleaning
. tab ceo, miss

        ceo |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    479,032       33.21       33.21
          1 |    478,519       33.17       66.38
          . |    485,027       33.62      100.00
------------+-----------------------------------
      Total |  1,442,578      100.00

. count if missing(ceo)
  485,027

. scalar missing_ceo_before = r(N)

. 
. *Duplikációk összeejtése - innentől egy személy egyszer szerepel egy vállalati évben
. collapse (firstnm) person_foreign (max) ceo, by(frame_id manager_id year)

. 
. 
. *Pos5 húzások előkészítése
. bys frame_id year: gen man_number=_N

. *bys frame_id year: egen ceo_number=total(cond(pos5==1,pos5,.))
. bys frame_id year: egen ceo_exist=max(ceo)
(42175 missing values generated)

. 
. *Egy menedzseres cégeknél, ha nincs ceo, a menedzser ceo-vá kinevezése
. count if ceo==1
  478,519

. scalar temp=r(N)

.         replace ceo=1 if man_number==1&ceo_exist!=1
(24,150 real changes made)

. count if ceo==1
  502,669

. scalar no_other_manager = r(N)-temp

. 
. *Ceo_exist újraszámolása, mert változott a pos5-ok száma
. drop ceo_exist

. bys frame_id year: egen ceo_exist=max(ceo)
(35607 missing values generated)

. 
. egen company_manager=group(frame_id manager_id)

. xtset company_manager year
       panel variable:  company_manager (unbalanced)
        time variable:  year, 1946 to 2016, but with gaps
                delta:  1 unit

. 
. * this is on purpose, so that any chang is captured
. gen change = ceo!=ceo[_n-1] 

. /* index spells within a relationship so that
> 
> ceo             = 1 1 1 . . 0 0
> spell           = 1 1 1 2 2 3 3
> spell_year      = 1 2 3 1 2 1 2
> 
> */
. bys company_manager: gen spell = sum(change)

. sort company_manager spell year

. by company_manager spell: gen spell_year = _n

. by company_manager spell: gen spell_length = _N

. 
. 
. xtset company_manager year
       panel variable:  company_manager (unbalanced)
        time variable:  year, 1946 to 2016, but with gaps
                delta:  1 unit

. tempvar ceo_prev ceo_next

. gen `ceo_prev' = cond(spell_year==1, L.ceo, .)
(1,419,507 missing values generated)

. gen `ceo_next' = cond(spell_year==spell_length, F.ceo, .)
(1,418,629 missing values generated)

. egen ceo_prev = mean(`ceo_prev'), by(company_manager spell)
(1363597 missing values generated)

. egen ceo_next = mean(`ceo_next'), by(company_manager spell)
(1345689 missing values generated)

. drop `ceo_prev' `ceo_next'

. 
. 
. * type of changes
. tab ceo_prev ceo if spell_year==1, miss

           |            (max) ceo
  ceo_prev |         0          1          . |     Total
-----------+---------------------------------+----------
         0 |         0      8,737      1,627 |    10,364 
         1 |     3,931          0      1,887 |     5,818 
         . |    84,541     81,206     96,899 |   262,646 
-----------+---------------------------------+----------
     Total |    88,472     89,943    100,413 |   278,828 


. tab ceo ceo_next if spell_year==spell_length, miss

           |             ceo_next
 (max) ceo |         0          1          . |     Total
-----------+---------------------------------+----------
         0 |         0      8,737     79,735 |    88,472 
         1 |     3,931          0     86,012 |    89,943 
         . |     1,952      2,440     96,021 |   100,413 
-----------+---------------------------------+----------
     Total |     5,883     11,177    261,768 |   278,828 


. assert ceo!=ceo_next if !missing(ceo)

. assert ceo!=ceo_prev if !missing(ceo)

. 
. * descriptives
. tab spell_length if missing(ceo) & ceo_prev==0 & ceo_next==0

spell_lengt |
          h |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         38        9.18        9.18
          2 |         50       12.08       21.26
          3 |         45       10.87       32.13
          4 |         56       13.53       45.65
          5 |         75       18.12       63.77
          6 |         30        7.25       71.01
          7 |         42       10.14       81.16
          8 |         32        7.73       88.89
         10 |         20        4.83       93.72
         12 |         12        2.90       96.62
         14 |         14        3.38      100.00
------------+-----------------------------------
      Total |        414      100.00

. tab spell_length if missing(ceo) & ceo_prev==0 & ceo_next==1

spell_lengt |
          h |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         20        8.33        8.33
          2 |         18        7.50       15.83
          3 |         24       10.00       25.83
          4 |         12        5.00       30.83
          5 |         35       14.58       45.42
          6 |         18        7.50       52.92
          7 |         35       14.58       67.50
          8 |         16        6.67       74.17
          9 |         18        7.50       81.67
         10 |         20        8.33       90.00
         11 |         11        4.58       94.58
         13 |         13        5.42      100.00
------------+-----------------------------------
      Total |        240      100.00

. tab spell_length if missing(ceo) & ceo_prev==1 & ceo_next==0

spell_lengt |
          h |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         14       14.00       14.00
          2 |         12       12.00       26.00
          3 |         12       12.00       38.00
          4 |          8        8.00       46.00
          5 |         15       15.00       61.00
         13 |         39       39.00      100.00
------------+-----------------------------------
      Total |        100      100.00

. tab spell_length if missing(ceo) & ceo_prev==1 & ceo_next==1

spell_lengt |
          h |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         90        8.69        8.69
          2 |        144       13.90       22.59
          3 |         87        8.40       30.98
          4 |        100        9.65       40.64
          5 |         95        9.17       49.81
          6 |         78        7.53       57.34
          7 |        119       11.49       68.82
          8 |         56        5.41       74.23
          9 |         54        5.21       79.44
         10 |         70        6.76       86.20
         11 |         33        3.19       89.38
         12 |         48        4.63       94.02
         13 |         13        1.25       95.27
         14 |         28        2.70       97.97
         21 |         21        2.03      100.00
------------+-----------------------------------
      Total |      1,036      100.00

. 
. 
. *Pos5 kihúzása, ha egy, kettő, három, négy vagy öt évnyi lyuk van, ugyanazon személy ugyanazo
> n cégnél történő ceo tevékenysége között
. tab ceo_prev ceo_next if missing(ceo)

           |       ceo_next
  ceo_prev |         0          1 |     Total
-----------+----------------------+----------
         0 |       414        240 |       654 
         1 |       100      1,036 |     1,136 
-----------+----------------------+----------
     Total |       514      1,276 |     1,790 


. 
. count if ceo==1
  502,669

. scalar temp=r(N)

.         replace ceo = ceo_prev if ceo_prev==ceo_next & !missing(ceo_prev) & missing(ceo) & sp
> ell_length<=5
(780 real changes made)

. count if ceo==1
  503,185

. scalar fill_gap_5 = r(N)-temp

. drop ceo_exist

. bys frame_id year: egen ceo_exist=max(ceo)
(35110 missing values generated)

. 
. *Pos5 kihúzása három, kettő vagy egy évig, ha nincs más ceo és több menedzser van a cégnél - 
> itt marad az eltolt ceo_exist, mert kicsit más a logika
. count if ceo==1
  503,185

. scalar temp=r(N)

.         replace ceo = 1 if (ceo_prev==1) & missing(ceo) & (ceo_exist==0) & spell_year<=3
(206 real changes made)

. count if ceo==1
  503,391

. scalar fill_forward_3 = r(N)-temp

. drop ceo_exist

. bys frame_id year: egen ceo_exist=max(ceo)
(35110 missing values generated)

. 
. * one year back
. count if ceo==1
  503,391

. scalar temp=r(N)

.         replace ceo = 1 if (ceo_next==1) & missing(ceo) & (ceo_exist==0) & spell_year==spell_
> length
(179 real changes made)

. count if ceo==1
  503,570

. scalar fill_backward_1 = r(N)-temp

. 
. * after all the cleaning
. tab ceo, miss

  (max) ceo |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    460,000       32.04       32.04
          1 |    503,570       35.08       67.12
          . |    472,119       32.88      100.00
------------+-----------------------------------
      Total |  1,435,689      100.00

. count if missing(ceo)
  472,119

. scalar missing_ceo_after = r(N)

. 
end of do-file

. 
. *Cégalapítás éve
. bys frame_id: egen first_year=min(year)

. egen id=group(frame_id manager_id)

. 
. *Adott ceo első megjelenése és utolsó kilépése
. egen enter_year=min(cond(ceo==1,year,.)), by(frame_id manager_id)
(845961 missing values generated)

. egen exit_year=max(cond(ceo==1,year,.)), by(frame_id manager_id)
(845961 missing values generated)

. xtset id year
       panel variable:  id (unbalanced)
        time variable:  year, 1946 to 2016, but with gaps
                delta:  1 unit

. egen first_exit_year = min(cond(ceo==1 & F.ceo!=1, year, .)), by(frame_id manager_id)
(845961 missing values generated)

. 
. * FIXME: keep stats on non-CEO managers
. keep if ceo==1
(932,119 observations deleted)

. 
. gen int tenure = year - enter_year

. gen int firm_age = year - first_year

. ren person_foreign expat

. 
. * drop founders
. drop if first_year==enter_year
(246,981 observations deleted)

. scalar dropped_founders = r(N_drop)

. 
. collapse (min) enter_year first_exit_year (firstnm) expat (count) N_ceos=expat, by(frame_id m
> anager_id)

. 
. compress
  variable enter_year was float now int
  variable first_exit_year was float now int
  variable N_ceos was long now byte
  variable frame_id was str12 now str10
  (488,763 bytes saved)

. save_all_to_json

. save temp/firm_ceo_panel, replace
file temp/firm_ceo_panel.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresors/Data3/projects/expat-analysis/output/firm_panel.log
  log type:  text
 closed on:  20 Nov 2018, 19:14:45
-----------------------------------------------------------------------------------------------
