-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Google Drive/Research/expat/output/firm_panel.log
  log type:  text
 opened on:  13 May 2020, 19:04:28

. 
. use "temp/balance-small.dta"

. *Tempvars were created for some reason when I was closing the previous file
. *drop __* - deleted in select_sample
. collapse (min) firm_birth = year (max) firm_death = year, by(frame_id)

. tempfile sample

. save `sample', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St56966.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St56966.000001 saved

. 
. use "input/ceo-panel/ceo-panel.dta", clear

. rename person_id manager_id

. 
. * only keep sample firms
. merge m:1 frame_id using `sample', keep(match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           590,103  
    -----------------------------------------

. drop if year>firm_death
(66,365 observations deleted)

. 
. * balance panel
. egen company_manager = group(frame_id manager_id)

. xtset company_manager year
       panel variable:  company_manager (unbalanced)
        time variable:  year, 1988 to 2017, but with gaps
                delta:  1 unit

. by company_manager: generate gap = year - year[_n-1] - 1
(93,857 missing values generated)

. replace gap = 0 if missing(gap)
(93,857 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    519,233       99.14       99.14
          1 |      1,774        0.34       99.48
          2 |        787        0.15       99.63
          3 |        538        0.10       99.73
          4 |        355        0.07       99.80
          5 |        300        0.06       99.86
          6 |        169        0.03       99.89
          7 |        135        0.03       99.91
          8 |        103        0.02       99.93
          9 |         89        0.02       99.95
         10 |         60        0.01       99.96
         11 |         45        0.01       99.97
         12 |         39        0.01       99.98
         13 |         32        0.01       99.98
         14 |         22        0.00       99.99
         15 |         18        0.00       99.99
         16 |         11        0.00       99.99
         17 |          9        0.00      100.00
         18 |          6        0.00      100.00
         19 |          5        0.00      100.00
         20 |          3        0.00      100.00
         23 |          1        0.00      100.00
         24 |          1        0.00      100.00
         25 |          2        0.00      100.00
         26 |          1        0.00      100.00
------------+-----------------------------------
      Total |    523,738      100.00

. 
. * fill in gap if only 1-year long
. expand 1+(gap==1), generate(filled_in)
(1,774 observations created)

. replace year = year - 1 if filled_in
(1,774 real changes made)

. xtset company_manager year
       panel variable:  company_manager (unbalanced)
        time variable:  year, 1988 to 2017, but with gaps
                delta:  1 unit

. xtdescribe

company_manager:  1, 2, ..., 93857                           n =      93857
    year:  1988, 1989, ..., 2017                             T =         30
           Delta(year) = 1 unit
           Span(year)  = 30 periods
           (company_manager*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                         1       1       2         3         7      19      30

     Freq.  Percent    Cum. |  Pattern
 ---------------------------+--------------------------------
     6103      6.50    6.50 |  .............................1
     4525      4.82   11.32 |  ............................11
     1884      2.01   13.33 |  ...........................111
     1102      1.17   14.51 |  ............................1.
     1073      1.14   15.65 |  .........................11111
      966      1.03   16.68 |  ..........................1111
      966      1.03   17.71 |  ....1.........................
      902      0.96   18.67 |  ....................1111111111
      873      0.93   19.60 |  ........................111111
    75463     80.40  100.00 | (other patterns)
 ---------------------------+--------------------------------
    93857    100.00         |  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXX

. 
. * create contiguous spells
. gen change = ceo != L.ceo 

. bysort company_manager (year): gen job_spell = sum(change)

. 
. * count number of CEOs
. preserve

.         collapse (count) N_ceos = expat, by(frame_id year)

.         save temp/N_ceos, replace
file temp/N_ceos.dta saved

. restore

. 
. collapse (min) job_begin = year (max) job_end = year (firstnm) expat manager_
> category firm_birth, by(frame_id manager_id job_spell)

. 
. * if first managers arrive in year 1, extrapolate to year 0
. egen first_cohort = min(job_begin), by(frame_id)

. replace job_begin = job_begin - 1 if (first_cohort == firm_birth + 1) & (job_
> begin == first_cohort)
(16,222 real changes made)

. 
. gen byte spell = 1

. bysort frame_id (job_begin manager_id): replace spell =  cond(job_begin > job
> _begin[_n-1], spell[_n-1]+1, spell[_n-1]) if _n>1
(47,863 real changes made)

. 
. egen max_expat = max(expat), by(frame_id spell)

. tempvar lag_expat

. gen `lag_expat' = .
(96,588 missing values generated)

. bysort frame_id (job_begin manager_id): replace `lag_expat' = max_expat[_n-1]
>  if _n>1 & job_begin > job_begin[_n-1]
(39012 real changes made)

. egen lag_expat = mean(`lag_expat'), by(frame_id spell)
(48725 missing values generated)

. assert lag_expat==0 | lag_expat==1 | (missing(lag_expat) & spell==1)

. 
. compress
  variable job_spell was float now byte
  variable first_cohort was float now int
  variable max_expat was float now byte
  variable __000000 was float now byte
  variable lag_expat was float now byte
  (1,352,232 bytes saved)

. save_all_to_json

. save "temp/firm_ceo_panel.dta", replace
file temp/firm_ceo_panel.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Google Drive/Research/expat/output/firm_panel.log
  log type:  text
 closed on:  13 May 2020, 19:04:50
-------------------------------------------------------------------------------
