-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/firm_panel.log
  log type:  text
 opened on:  21 Mar 2024, 16:30:24

. 
. * keep only sample from balance-small
. use "`here'/temp/balance-small-clean.dta"

. by frame_id_numeric: egen firm_birth = min(year)

. by frame_id_numeric: egen firm_death = max(year)

. keep frame_id year firm_birth firm_death foreign

. tempfile sample

. save `sample', replace
(file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St63199.000001 not
    found)
file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St63199.000001 saved
    as .dta format

. 
. use "`here'/temp/ceo-panel.dta", clear 

. 
. * only keep sample firms
. merge m:1 frame_id_numeric year using `sample', keep(match) nogen
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           523,664  
    -----------------------------------------

. count if first_year_of_firm == firm_birth
  303,753

. 
. *for descriptives (number of ceo-s and nceo-s in original data, number of ceo
>  and nceo job-spells in original data)
. count
  523,664

. egen company_manager_id = group(frame_id_numeric manager_id)

. codebook manager_id

-------------------------------------------------------------------------------
manager_id                                                    group(manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [2,1607091]                   Units: 1
         Unique values: 85,185                    Missing .: 0/523,664

                  Mean: 844071
             Std. dev.: 421869

           Percentiles:    10%       25%       50%       75%       90%
                        221200    583169    834510   1.2e+06   1.4e+06

. codebook company_manager_id

-------------------------------------------------------------------------------
company_manager_id                           group(frame_id_numeric manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [1,97522]                     Units: 1
         Unique values: 97,522                    Missing .: 0/523,664

                  Mean: 43370.4
             Std. dev.: 26392.3

           Percentiles:     10%       25%       50%       75%       90%
                           7995     21073   42363.5     63591     80107

. 
. * balance panel
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. by company_manager_id: generate gap = year - year[_n-1] - 1
(97,522 missing values generated)

. replace gap = 0 if missing(gap)
(97,522 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    516,986       98.72       98.72
          1 |      3,478        0.66       99.39
          2 |      1,024        0.20       99.58
          3 |        647        0.12       99.71
          4 |        394        0.08       99.78
          5 |        318        0.06       99.84
          6 |        212        0.04       99.88
          7 |        144        0.03       99.91
          8 |        117        0.02       99.93
          9 |        102        0.02       99.95
         10 |         55        0.01       99.96
         11 |         40        0.01       99.97
         12 |         31        0.01       99.98
         13 |         26        0.00       99.98
         14 |         19        0.00       99.99
         15 |         18        0.00       99.99
         16 |         14        0.00       99.99
         17 |          9        0.00       99.99
         18 |          5        0.00      100.00
         19 |          5        0.00      100.00
         20 |          7        0.00      100.00
         21 |          6        0.00      100.00
         22 |          2        0.00      100.00
         23 |          2        0.00      100.00
         25 |          3        0.00      100.00
------------+-----------------------------------
      Total |    523,664      100.00

. 
. * fill in holes of 1 year, but not longer
. expand 1 + (gap == 1), generate(filled_in)
(3,478 observations created)

. replace year = year - 1 if filled_in
(3,478 real changes made)

. 
. * create contiguous spells
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. gen change = ceo != L.ceo

. bysort company_manager_id (year): gen job_spell = sum(change)

. 
. * create job begin and end for each manager spell
. bys frame_id_numeric manager_id job_spell: egen job_begin = min(year)

. bys frame_id_numeric manager_id job_spell: egen job_end = max(year)

. keep frame_id_numeric manager_id job_spell year job_begin job_end expat firm_
> birth foreign

. 
. * if first managers arrive in year 1, extrapolate to year 0 - DROP SPELL
. bys frame_id_numeric: egen first_cohort = min(job_begin)

. replace job_begin = job_begin - 1 if (first_cohort == firm_birth + 1) & (job_
> begin == first_cohort)
(61,475 real changes made)

. 
. * NOTE: no collapse and expand --> there might be holes
. sort frame_id_numeric manager_id year

. count if frame_id_numeric == frame_id_numeric[_n-1] & manager_id == manager_i
> d[_n-1] & year != (year[_n-1] + 1)
  3,200

. 
. * expat before 1990 are mostly error, convert them to locals
. replace expat = 0 if job_begin < 1990
(550 real changes made)

. 
. ***********************
. * time invariant vars and drop entire series of firms from sample *
. ***********************
. by frame_id_numeric: egen first_year_expat = min(cond(expat == 1, job_begin,.
> ))
(413,242 missing values generated)

. by frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.)
> )
(366,062 missing values generated)

. 
. * which of the two happened first?
. generate manager_after_owner = first_year_expat - first_year_foreign
(417,365 missing values generated)

. tabulate manager_after_owner

manager_aft |
   er_owner |      Freq.     Percent        Cum.
------------+-----------------------------------
        -25 |         61        0.06        0.06
        -16 |         33        0.03        0.09
        -15 |         54        0.05        0.13
        -13 |        184        0.17        0.30
        -12 |         41        0.04        0.34
        -10 |         18        0.02        0.36
         -9 |        107        0.10        0.45
         -8 |        371        0.34        0.79
         -7 |        267        0.24        1.03
         -6 |        311        0.28        1.32
         -5 |        163        0.15        1.47
         -4 |        288        0.26        1.73
         -3 |        754        0.69        2.42
         -2 |      1,039        0.95        3.36
         -1 |     14,025       12.78       16.14
          0 |     56,616       51.57       67.71
          1 |      9,486        8.64       76.35
          2 |      3,381        3.08       79.43
          3 |      3,123        2.84       82.28
          4 |      2,551        2.32       84.60
          5 |      1,967        1.79       86.39
          6 |      2,298        2.09       88.49
          7 |      2,005        1.83       90.31
          8 |      1,378        1.26       91.57
          9 |      1,841        1.68       93.25
         10 |      1,307        1.19       94.44
         11 |        692        0.63       95.07
         12 |      1,056        0.96       96.03
         13 |        820        0.75       96.78
         14 |        591        0.54       97.31
         15 |        433        0.39       97.71
         16 |        415        0.38       98.09
         17 |        375        0.34       98.43
         18 |        412        0.38       98.80
         19 |        415        0.38       99.18
         20 |         91        0.08       99.26
         21 |        199        0.18       99.45
         22 |        141        0.13       99.57
         23 |         66        0.06       99.63
         24 |        123        0.11       99.75
         26 |        238        0.22       99.96
         28 |         41        0.04      100.00
------------+-----------------------------------
      Total |    109,777      100.00

. * event time relative to that
. generate event_time = year - first_year_expat
(413,242 missing values generated)

. 
. * if foreign manager arrives up to X years before or Y years later than forei
> gn owner, use foreign manager as arrival date. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(144 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(150 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(412 real changes made)

. 
. * drop firms where expat arrives earlier than X years before owner
. drop if manager_after_owner < -2
(2,652 observations deleted)

. 
. * ever expat and foreign created after foreign changes (drops were firm level
>  before so should not mess with ever variables)
. foreach X of var expat foreign {
  2.         by frame_id_numeric: egen ever_`X' = max(`X'==1)
  3. }

. 
. * drop if there was an expat but was never foreign - these are likely error
. drop if ever_expat == 1 & ever_foreign == 0
(4,126 observations deleted)

. 
. * drop too many CEO-s
. egen fp_tag = tag(frame_id_numeric manager_id) 

. by frame_id_numeric: egen n_ceo_ever = sum(fp_tag)

. drop if n_ceo > 15
(19,939 observations deleted)

. drop fp_tag n_ceo_ever

.         
. * hired or fired ceo since last observed year of firm
. tempvar previous_year

. generate previous_year = .
(500,425 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `previous_year' = max(cond(year 
> < `t', year, .))
  3.         quietly replace previous_year = `previous_year' if year == `t'
  4.         drop `previous_year'
  5. }

. 
. tempvar next_year

. generate next_year = .
(500,425 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `next_year' = min(cond(year > `t
> ', year, .))
  3.         quietly replace next_year = `next_year' if year == `t'
  4.         drop `next_year'
  5. }

. 
. generate byte hire = (job_begin <= year) & (job_begin > previous_year) & !mis
> sing(previous_year)

. generate byte fire = (job_end >= year) & (job_end < next_year) & !missing(nex
> t_year)

. tabulate hire fire 

           |         fire
      hire |         0          1 |     Total
-----------+----------------------+----------
         0 |   419,037     36,648 |   455,685 
         1 |    38,406      6,334 |    44,740 
-----------+----------------------+----------
     Total |   457,443     42,982 |   500,425 

. 
. * number of expats and locals
. bys frame_id_numeric year: egen n_expat_ceo = total(cond(expat, 1, 0))

. bys frame_id_numeric year: egen n_local_ceo = total(cond(!expat, 1, 0))

. 
. * create firm-year data
. collapse (firstnm) n_expat_ceo n_local_ceo foreign ever_expat ever_foreign (c
> ount) n_ceo = expat (max) hire_ceo = hire fire_ceo = fire, by(frame_id_numeri
> c year)

. 
. * if there is a change in the ceo team, hiring, increement the spell counter
. bys frame_id_numeric (year): gen ceo_spell = sum(hire_ceo) + 1 // so that ind
> ex start from 1

. 
. tabulate n_expat_ceo n_local_ceo

 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         0          1          2          3          4 |     Total
-----------+-------------------------------------------------------+----------
         0 |         0    224,379     65,534     17,012      3,297 |   312,691 
         1 |    11,720      9,662      1,915        353         94 |    23,770 
         2 |     4,705      2,449        452         89         20 |     7,724 
         3 |     1,186        456        120         33         10 |     1,805 
         4 |       308         69         13          1          0 |       393 
         5 |        78         45          1          1          0 |       125 
         6 |        33          5          1          0          0 |        39 
         7 |         5          0          0          0          0 |         5 
-----------+-------------------------------------------------------+----------
     Total |    18,035    237,065     68,036     17,489      3,421 |   346,552 


 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         5          6          7          8          9 |     Total
-----------+-------------------------------------------------------+----------
         0 |     1,638        426        266         57         67 |   312,691 
         1 |        16          4          3          2          1 |    23,770 
         2 |         9          0          0          0          0 |     7,724 
         3 |         0          0          0          0          0 |     1,805 
         4 |         2          0          0          0          0 |       393 
         5 |         0          0          0          0          0 |       125 
         6 |         0          0          0          0          0 |        39 
         7 |         0          0          0          0          0 |         5 
-----------+-------------------------------------------------------+----------
     Total |     1,665        430        269         59         68 |   346,552 


 (firstnm) |
n_expat_ce |      (firstnm) n_local_ceo
         o |        10         11         12 |     Total
-----------+---------------------------------+----------
         0 |         3          8          4 |   312,691 
         1 |         0          0          0 |    23,770 
         2 |         0          0          0 |     7,724 
         3 |         0          0          0 |     1,805 
         4 |         0          0          0 |       393 
         5 |         0          0          0 |       125 
         6 |         0          0          0 |        39 
         7 |         0          0          0 |         5 
-----------+---------------------------------+----------
     Total |         3          8          4 |   346,552 

. * create dummies from numbers
. foreach var in expat local {
  2.         gen has_`var'_ceo = (n_`var'_ceo > 0) & !missing(n_`var'_ceo)
  3. }

.         
. count
  346,552

. compress
  variable year was float now int
  variable n_expat_ceo was float now byte
  variable n_local_ceo was float now byte
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable n_ceo was long now byte
  variable ceo_spell was float now byte
  variable has_expat_ceo was float now byte
  variable has_local_ceo was float now byte
  (9,010,352 bytes saved)

. save "`here'/temp/firm_events.dta", replace
file /Users/koren/Tresorit/Mac/projects/expat//temp/firm_events.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/firm_panel.log
  log type:  text
 closed on:  21 Mar 2024, 16:30:52
-------------------------------------------------------------------------------
