-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/firm_panel.log
  log type:  text
 opened on:   6 May 2024, 16:48:34

. 
. * keep only sample from balance-small
. use "`here'/temp/balance-small-clean.dta"

. by frame_id_numeric: egen firm_birth = min(year)

. by frame_id_numeric: egen firm_death = max(year)

. keep frame_id_numeric year firm_birth firm_death foreign

. tempfile sample

. save `sample', replace
(file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St98516.000001 not
    found)
file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St98516.000001 saved
    as .dta format

. 
. use "`here'/temp/ceo-panel.dta", clear 

. 
. * only keep sample firms
. merge m:1 frame_id_numeric year using `sample', keep(match) nogen
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           514,377  
    -----------------------------------------

. count if first_year_of_firm == firm_birth
  309,225

. 
. *for descriptives (number of ceo-s and nceo-s in original data, number of ceo
>  and nceo job-spells in original data)
. count
  514,377

. egen company_manager_id = group(frame_id_numeric manager_id)

. codebook manager_id

-------------------------------------------------------------------------------
manager_id                                                    group(manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [2,1607091]                   Units: 1
         Unique values: 71,919                    Missing .: 0/514,377

                  Mean: 843639
             Std. dev.: 425397

           Percentiles:    10%       25%       50%       75%       90%
                        224586    576653    833179   1.2e+06   1.4e+06

. codebook company_manager_id

-------------------------------------------------------------------------------
company_manager_id                           group(frame_id_numeric manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [1,82318]                     Units: 1
         Unique values: 82,318                    Missing .: 0/514,377

                  Mean: 39419.5
             Std. dev.: 23724.2

           Percentiles:     10%       25%       50%       75%       90%
                           6743     18845     39556     58934     73272

. 
. * balance panel
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. by company_manager_id: generate gap = year - year[_n-1] - 1
(82,318 missing values generated)

. replace gap = 0 if missing(gap)
(82,318 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    507,987       98.76       98.76
          1 |      3,228        0.63       99.39
          2 |      1,025        0.20       99.58
          3 |        648        0.13       99.71
          4 |        371        0.07       99.78
          5 |        329        0.06       99.85
          6 |        192        0.04       99.88
          7 |        134        0.03       99.91
          8 |        122        0.02       99.93
          9 |        107        0.02       99.95
         10 |         52        0.01       99.96
         11 |         39        0.01       99.97
         12 |         29        0.01       99.98
         13 |         22        0.00       99.98
         14 |         18        0.00       99.99
         15 |         19        0.00       99.99
         16 |         14        0.00       99.99
         17 |          7        0.00       99.99
         18 |          6        0.00       99.99
         19 |          5        0.00      100.00
         20 |          8        0.00      100.00
         21 |          7        0.00      100.00
         22 |          2        0.00      100.00
         23 |          2        0.00      100.00
         24 |          1        0.00      100.00
         25 |          3        0.00      100.00
------------+-----------------------------------
      Total |    514,377      100.00

. 
. * fill in holes of 1 year, but not longer
. expand 1 + (gap == 1), generate(filled_in)
(3,228 observations created)

. replace year = year - 1 if filled_in
(3,228 real changes made)

. 
. * create contiguous spells
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. gen change = ceo != L.ceo

. bysort company_manager_id (year): gen job_spell = sum(change)

. 
. * create job begin and end for each manager spell
. bys frame_id_numeric manager_id job_spell: egen job_begin = min(year)

. bys frame_id_numeric manager_id job_spell: egen job_end = max(year)

. keep frame_id_numeric manager_id job_spell year job_begin job_end firm_birth 
> foreign foreignness

. 
. * if first managers arrive in year 1, extrapolate to year 0 - DROP SPELL
. bys frame_id_numeric: egen first_cohort = min(job_begin)

. replace job_begin = job_begin - 1 if (first_cohort == firm_birth + 1) & (job_
> begin == first_cohort)
(53,836 real changes made)

. 
. * NOTE: no collapse and expand --> there might be holes
. sort frame_id_numeric manager_id year

. count if frame_id_numeric == frame_id_numeric[_n-1] & manager_id == manager_i
> d[_n-1] & year != (year[_n-1] + 1)
  3,162

. 
. * hired or fired ceo since last observed year of firm
. tempvar previous_year

. generate previous_year = .
(517,605 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `previous_year' = max(cond(year 
> < `t', year, .))
  3.         quietly replace previous_year = `previous_year' if year == `t'
  4.         drop `previous_year'
  5. }

. 
. tempvar next_year

. generate next_year = .
(517,605 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `next_year' = min(cond(year > `t
> ', year, .))
  3.         quietly replace next_year = `next_year' if year == `t'
  4.         drop `next_year'
  5. }

. 
. generate byte hire = (job_begin <= year) & (job_begin > previous_year) & !mis
> sing(previous_year)

. * first cohort of managers are classified as newly hired
. replace hire = 1 if job_begin == first_cohort
(216,039 real changes made)

. generate byte fire = (job_end >= year) & (job_end < next_year) & !missing(nex
> t_year)

. tabulate hire fire 

           |         fire
      hire |         0          1 |     Total
-----------+----------------------+----------
         0 |   225,651     25,093 |   250,744 
         1 |   244,242     22,619 |   266,861 
-----------+----------------------+----------
     Total |   469,893     47,712 |   517,605 

. 
. generate byte expat = foreignness > 0

. 
. * manager change may anticipate foreign change by max this many years
. local anticipation 2

. local lag 1

. tempvar time_foreign first_year_foreign ever_expat

. ***********************
. * time invariant vars and drop entire series of firms from sample *
. ***********************
. by frame_id_numeric: egen `first_year_foreign' = min(cond(foreign == 1, year,
> .))
(365,104 missing values generated)

. generate `time_foreign' = year - `first_year_foreign'
(365,104 missing values generated)

. by frame_id_numeric: egen `ever_expat' = max((expat == 1) & inrange(`time_for
> eign', -`anticipation', `lag'))

. by frame_id_numeric: egen first_year_hire = min(cond((hire == 1) & (`time_for
> eign' >= -`anticipation'), job_begin,.))
(23,399 missing values generated)

. by frame_id_numeric: egen first_year_expat = min(cond(expat == 1, job_begin,.
> ))
(385,624 missing values generated)

. by frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.)
> )
(365,104 missing values generated)

. 
. * which of the two happened first?
. generate expat_after_owner = first_year_expat - first_year_foreign
(400,054 missing values generated)

. generate manager_after_owner = first_year_hire - first_year_foreign
(369,736 missing values generated)

. tabulate manager_after_owner

manager_aft |
   er_owner |      Freq.     Percent        Cum.
------------+-----------------------------------
        -33 |         46        0.03        0.03
        -28 |         52        0.04        0.07
        -27 |         39        0.03        0.09
        -26 |         54        0.04        0.13
        -25 |        144        0.10        0.23
        -24 |         99        0.07        0.29
        -23 |         73        0.05        0.34
        -22 |         37        0.03        0.37
        -21 |         47        0.03        0.40
        -20 |         74        0.05        0.45
        -19 |         78        0.05        0.50
        -18 |        204        0.14        0.64
        -17 |        393        0.27        0.91
        -16 |        728        0.49        1.40
        -15 |        564        0.38        1.78
        -14 |        493        0.33        2.11
        -13 |        809        0.55        2.66
        -12 |        780        0.53        3.19
        -11 |        849        0.57        3.76
        -10 |        895        0.61        4.37
         -9 |        962        0.65        5.02
         -8 |        728        0.49        5.51
         -7 |      1,127        0.76        6.27
         -6 |      1,324        0.90        7.17
         -5 |      1,707        1.15        8.32
         -4 |      2,098        1.42        9.74
         -3 |      2,747        1.86       11.60
         -2 |     10,251        6.93       18.53
         -1 |     13,065        8.84       27.37
          0 |     81,401       55.05       82.42
          1 |      7,670        5.19       87.60
          2 |      4,477        3.03       90.63
          3 |      3,112        2.10       92.74
          4 |      1,902        1.29       94.02
          5 |      1,559        1.05       95.08
          6 |      1,341        0.91       95.98
          7 |      1,173        0.79       96.78
          8 |        936        0.63       97.41
          9 |        814        0.55       97.96
         10 |        490        0.33       98.29
         11 |        402        0.27       98.56
         12 |        478        0.32       98.89
         13 |        262        0.18       99.06
         14 |        196        0.13       99.20
         15 |        280        0.19       99.39
         16 |        206        0.14       99.52
         17 |        148        0.10       99.62
         18 |        123        0.08       99.71
         19 |        260        0.18       99.88
         20 |         58        0.04       99.92
         22 |         30        0.02       99.94
         23 |         28        0.02       99.96
         25 |         29        0.02       99.98
         26 |         27        0.02      100.00
------------+-----------------------------------
      Total |    147,869      100.00

. 
. * if foreign manager arrives up to X years before or Y years later than forei
> gn owner, use foreign manager as arrival date. 
. forvalues t = -`anticipation'/-1 {
  2.         local k = abs(`t') - 1
  3.         replace foreign = 1 if (expat_after_owner == `t')       & inrange(
> year - first_year_expat, 0, `k')      & `ever_expat' 
  4.         replace foreign = 1 if (manager_after_owner == `t') & inrange(year
>  - first_year_hire, 0, `k')   & !`ever_expat'
  5. }
(231 real changes made)
(605 real changes made)
(266 real changes made)
(372 real changes made)

. forvalues t = 1/`lag' {
  2.         local minust = -`t'
  3.         replace foreign = 0 if (expat_after_owner == `t')       & inrange(
> year - first_year_expat, `minust', -1)        & `ever_expat'
  4.         replace foreign = 0 if (manager_after_owner == `t') & inrange(year
>  - first_year_hire, `minust', -1)             & !`ever_expat'
  5. }
(367 real changes made)
(144 real changes made)

. * drop firms where expat arrives earlier than X years before owner
. drop if first_year_expat - first_year_foreign < -`anticipation'
(5,786 observations deleted)

. 
. * ever expat and foreign created after foreign changes (drops were firm level
>  before so should not mess with ever variables)
. foreach X of var expat foreign {
  2.         by frame_id_numeric: egen ever_`X' = max(`X'==1)
  3. }

. 
. * drop if there was an expat but was never foreign - these are likely error
. drop if ever_expat == 1 & ever_foreign == 0
(14,430 observations deleted)

. 
. * drop too many CEO-s
. egen fp_tag = tag(frame_id_numeric manager_id) 

. by frame_id_numeric: egen n_ceo_ever = sum(fp_tag)

. drop if n_ceo_ever > 15
(18,302 observations deleted)

. drop fp_tag n_ceo_ever

.         
. * create firm-year data
. collapse (firstnm) foreign ever_expat ever_foreign (count) n_ceo = expat (max
> ) hire_ceo = hire fire_ceo = fire foreignness, by(frame_id_numeric year)

. label values foreignness foreignness

. * define expat as any foreign link. we can limit the sample later
. generate has_expat_ceo = foreignness > 0 & !missing(foreignness)

. 
. * if there is a change in the ceo team, hiring, increement the spell counter
. bys frame_id_numeric (year): gen ceo_spell = sum(hire_ceo) + 1 // so that ind
> ex start from 1

. 
. count
  327,405

. compress
  variable year was float now int
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable n_ceo was long now byte
  variable has_expat_ceo was float now byte
  variable ceo_spell was float now byte
  (5,565,885 bytes saved)

. save "`here'/temp/firm_events.dta", replace
file /Users/koren/Tresorit/Mac/projects/expat//temp/firm_events.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/firm_panel.log
  log type:  text
 closed on:   6 May 2024, 16:49:02
-------------------------------------------------------------------------------
