-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/firm_panel.log
  log type:  text
 opened on:  26 Mar 2024, 11:54:36

. 
. * keep only sample from balance-small
. use "`here'/temp/balance-small-clean.dta"

. by frame_id_numeric: egen firm_birth = min(year)

. by frame_id_numeric: egen firm_death = max(year)

. keep frame_id year firm_birth firm_death foreign

. tempfile sample

. save `sample', replace
(file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St64385.000001 not
    found)
file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St64385.000001 saved
    as .dta format

. 
. use "`here'/temp/ceo-panel.dta", clear 

. 
. * only keep sample firms
. merge m:1 frame_id_numeric year using `sample', keep(match) nogen
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           523,664  
    -----------------------------------------

. count if first_year_of_firm == firm_birth
  303,753

. 
. *for descriptives (number of ceo-s and nceo-s in original data, number of ceo
>  and nceo job-spells in original data)
. count
  523,664

. egen company_manager_id = group(frame_id_numeric manager_id)

. codebook manager_id

-------------------------------------------------------------------------------
manager_id                                                    group(manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [2,1607091]                   Units: 1
         Unique values: 85,185                    Missing .: 0/523,664

                  Mean: 844071
             Std. dev.: 421869

           Percentiles:    10%       25%       50%       75%       90%
                        221200    583169    834510   1.2e+06   1.4e+06

. codebook company_manager_id

-------------------------------------------------------------------------------
company_manager_id                           group(frame_id_numeric manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [1,97522]                     Units: 1
         Unique values: 97,522                    Missing .: 0/523,664

                  Mean: 43370.4
             Std. dev.: 26392.3

           Percentiles:     10%       25%       50%       75%       90%
                           7995     21073   42363.5     63591     80107

. 
. * balance panel
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. by company_manager_id: generate gap = year - year[_n-1] - 1
(97,522 missing values generated)

. replace gap = 0 if missing(gap)
(97,522 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    516,986       98.72       98.72
          1 |      3,478        0.66       99.39
          2 |      1,024        0.20       99.58
          3 |        647        0.12       99.71
          4 |        394        0.08       99.78
          5 |        318        0.06       99.84
          6 |        212        0.04       99.88
          7 |        144        0.03       99.91
          8 |        117        0.02       99.93
          9 |        102        0.02       99.95
         10 |         55        0.01       99.96
         11 |         40        0.01       99.97
         12 |         31        0.01       99.98
         13 |         26        0.00       99.98
         14 |         19        0.00       99.99
         15 |         18        0.00       99.99
         16 |         14        0.00       99.99
         17 |          9        0.00       99.99
         18 |          5        0.00      100.00
         19 |          5        0.00      100.00
         20 |          7        0.00      100.00
         21 |          6        0.00      100.00
         22 |          2        0.00      100.00
         23 |          2        0.00      100.00
         25 |          3        0.00      100.00
------------+-----------------------------------
      Total |    523,664      100.00

. 
. * fill in holes of 1 year, but not longer
. expand 1 + (gap == 1), generate(filled_in)
(3,478 observations created)

. replace year = year - 1 if filled_in
(3,478 real changes made)

. 
. * create contiguous spells
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. gen change = ceo != L.ceo

. bysort company_manager_id (year): gen job_spell = sum(change)

. 
. * create job begin and end for each manager spell
. bys frame_id_numeric manager_id job_spell: egen job_begin = min(year)

. bys frame_id_numeric manager_id job_spell: egen job_end = max(year)

. keep frame_id_numeric manager_id job_spell year job_begin job_end firm_birth 
> foreign foreignness

. 
. * if first managers arrive in year 1, extrapolate to year 0 - DROP SPELL
. bys frame_id_numeric: egen first_cohort = min(job_begin)

. replace job_begin = job_begin - 1 if (first_cohort == firm_birth + 1) & (job_
> begin == first_cohort)
(61,475 real changes made)

. 
. * NOTE: no collapse and expand --> there might be holes
. sort frame_id_numeric manager_id year

. count if frame_id_numeric == frame_id_numeric[_n-1] & manager_id == manager_i
> d[_n-1] & year != (year[_n-1] + 1)
  3,200

. 
. generate byte expat = foreignness > 0

. ***********************
. * time invariant vars and drop entire series of firms from sample *
. ***********************
. by frame_id_numeric: egen first_year_expat = min(cond(expat == 1, job_begin,.
> ))
(388,792 missing values generated)

. by frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.)
> )
(366,062 missing values generated)

. 
. * which of the two happened first?
. generate manager_after_owner = first_year_expat - first_year_foreign
(404,069 missing values generated)

. tabulate manager_after_owner

manager_aft |
   er_owner |      Freq.     Percent        Cum.
------------+-----------------------------------
        -29 |         37        0.03        0.03
        -25 |        180        0.15        0.18
        -22 |         45        0.04        0.21
        -18 |         41        0.03        0.25
        -16 |        264        0.21        0.46
        -15 |        214        0.17        0.63
        -14 |         59        0.05        0.68
        -13 |        290        0.24        0.92
        -12 |         84        0.07        0.99
        -11 |        200        0.16        1.15
        -10 |        194        0.16        1.31
         -9 |        272        0.22        1.53
         -8 |        701        0.57        2.10
         -7 |        411        0.33        2.43
         -6 |        782        0.64        3.07
         -5 |        419        0.34        3.41
         -4 |        585        0.48        3.88
         -3 |      1,198        0.97        4.86
         -2 |      1,656        1.35        6.20
         -1 |     19,630       15.95       22.15
          0 |     64,670       52.55       74.70
          1 |      8,870        7.21       81.90
          2 |      3,138        2.55       84.45
          3 |      2,756        2.24       86.69
          4 |      2,386        1.94       88.63
          5 |      1,681        1.37       90.00
          6 |      1,940        1.58       91.57
          7 |      1,179        0.96       92.53
          8 |      1,349        1.10       93.63
          9 |      1,262        1.03       94.65
         10 |      1,158        0.94       95.59
         11 |        810        0.66       96.25
         12 |        891        0.72       96.98
         13 |        537        0.44       97.41
         14 |        519        0.42       97.83
         15 |        334        0.27       98.11
         16 |        384        0.31       98.42
         17 |        462        0.38       98.79
         18 |        317        0.26       99.05
         19 |        381        0.31       99.36
         21 |         86        0.07       99.43
         22 |         65        0.05       99.48
         23 |        128        0.10       99.59
         24 |        199        0.16       99.75
         25 |         37        0.03       99.78
         26 |        203        0.16       99.94
         27 |         28        0.02       99.97
         28 |         41        0.03      100.00
------------+-----------------------------------
      Total |    123,073      100.00

. * event time relative to that
. generate event_time = year - first_year_expat
(388,792 missing values generated)

. 
. * if foreign manager arrives up to X years before or Y years later than forei
> gn owner, use foreign manager as arrival date. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(225 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(284 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(395 real changes made)

. 
. * drop firms where expat arrives earlier than X years before owner
. drop if manager_after_owner < -2
(5,976 observations deleted)

. 
. * ever expat and foreign created after foreign changes (drops were firm level
>  before so should not mess with ever variables)
. foreach X of var expat foreign {
  2.         by frame_id_numeric: egen ever_`X' = max(`X'==1)
  3. }

. 
. * drop if there was an expat but was never foreign - these are likely error
. drop if ever_expat == 1 & ever_foreign == 0
(15,280 observations deleted)

. 
. * drop too many CEO-s
. egen fp_tag = tag(frame_id_numeric manager_id) 

. by frame_id_numeric: egen n_ceo_ever = sum(fp_tag)

. drop if n_ceo > 15
(17,492 observations deleted)

. drop fp_tag n_ceo_ever

.         
. * hired or fired ceo since last observed year of firm
. tempvar previous_year

. generate previous_year = .
(488,394 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `previous_year' = max(cond(year 
> < `t', year, .))
  3.         quietly replace previous_year = `previous_year' if year == `t'
  4.         drop `previous_year'
  5. }

. 
. tempvar next_year

. generate next_year = .
(488,394 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `next_year' = min(cond(year > `t
> ', year, .))
  3.         quietly replace next_year = `next_year' if year == `t'
  4.         drop `next_year'
  5. }

. 
. generate byte hire = (job_begin <= year) & (job_begin > previous_year) & !mis
> sing(previous_year)

. generate byte fire = (job_end >= year) & (job_end < next_year) & !missing(nex
> t_year)

. tabulate hire fire 

           |         fire
      hire |         0          1 |     Total
-----------+----------------------+----------
         0 |   409,600     35,489 |   445,089 
         1 |    37,202      6,103 |    43,305 
-----------+----------------------+----------
     Total |   446,802     41,592 |   488,394 

. 
. * create firm-year data
. collapse (firstnm) foreign ever_expat ever_foreign (count) n_ceo = expat (max
> ) hire_ceo = hire fire_ceo = fire foreignness, by(frame_id_numeric year)

. label values foreignness foreignness

. * define expat as any foreign link. we can limit the sample later
. generate has_expat_ceo = foreignness > 0 & !missing(foreignness)

. 
. * if there is a change in the ceo team, hiring, increement the spell counter
. bys frame_id_numeric (year): gen ceo_spell = sum(hire_ceo) + 1 // so that ind
> ex start from 1

. 
. count
  339,066

. compress
  variable year was float now int
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable n_ceo was long now byte
  variable has_expat_ceo was float now byte
  variable ceo_spell was float now byte
  (5,764,122 bytes saved)

. save "`here'/temp/firm_events.dta", replace
file /Users/koren/Tresorit/Mac/projects/expat//temp/firm_events.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac/projects/expat//output/firm_panel.log
  log type:  text
 closed on:  26 Mar 2024, 11:55:02
-------------------------------------------------------------------------------
