-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/firm_panel.lo
> g
  log type:  text
 opened on:  19 Mar 2024, 18:25:08

. 
. * keep only sample from balance-small
. use "`here'/temp/balance-small-clean.dta"

. by frame_id_numeric: egen firm_birth = min(year)

. by frame_id_numeric: egen firm_death = max(year)

. keep frame_id year firm_birth firm_death foreign

. tempfile sample

. save `sample', replace
(file /var/folders/5z/21k9mmsd55d1w5_jl5n192sh0000gn/T//St30604.000001 not
    found)
file /var/folders/5z/21k9mmsd55d1w5_jl5n192sh0000gn/T//St30604.000001 saved
    as .dta format

. 
. use "`here'/temp/ceo-panel.dta", clear 

. 
. * only keep sample firms
. merge m:1 frame_id_numeric year using `sample', keep(match) nogen
(variable year was int, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            90,289  
    -----------------------------------------

. count if first_year_of_firm == firm_birth
  44,830

. 
. *for descriptives (number of ceo-s and nceo-s in original data, number of ceo
>  and nceo job-spells in original data)
. count
  90,289

. egen company_manager_id = group(frame_id_numeric manager_id)

. codebook manager_id

-------------------------------------------------------------------------------
manager_id                                                    group(manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [143,1543909]                 Units: 1
         Unique values: 17,204                    Missing .: 0/90,289

                  Mean: 648385
             Std. dev.: 444896

           Percentiles:    10%       25%       50%       75%       90%
                         74345    255062    619835   1.0e+06   1.3e+06

. codebook company_manager_id

-------------------------------------------------------------------------------
company_manager_id                           group(frame_id_numeric manager_id)
-------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [1,18711]                     Units: 1
         Unique values: 18,711                    Missing .: 0/90,289

                  Mean: 8820.31
             Std. dev.: 5172.64

           Percentiles:     10%       25%       50%       75%       90%
                           1858      4352      8765     13103     16048

. 
. * balance panel
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. by company_manager_id: generate gap = year - year[_n-1] - 1
(18,711 missing values generated)

. replace gap = 0 if missing(gap)
(18,711 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     88,932       98.50       98.50
          1 |        678        0.75       99.25
          2 |        248        0.27       99.52
          3 |        132        0.15       99.67
          4 |         67        0.07       99.74
          5 |         61        0.07       99.81
          6 |         40        0.04       99.85
          7 |         31        0.03       99.89
          8 |         20        0.02       99.91
          9 |         26        0.03       99.94
         10 |         11        0.01       99.95
         11 |         12        0.01       99.97
         12 |          5        0.01       99.97
         13 |          2        0.00       99.97
         14 |          7        0.01       99.98
         15 |          2        0.00       99.98
         16 |          3        0.00       99.99
         17 |          3        0.00       99.99
         18 |          1        0.00       99.99
         19 |          1        0.00       99.99
         20 |          3        0.00      100.00
         21 |          3        0.00      100.00
         23 |          1        0.00      100.00
------------+-----------------------------------
      Total |     90,289      100.00

. 
. * fill in holes of 1 year, but not longer
. expand 1 + (gap == 1), generate(filled_in)
(678 observations created)

. replace year = year - 1 if filled_in
(678 real changes made)

. 
. * create contiguous spells
. xtset company_manager_id year

Panel variable: company_manager_id (unbalanced)
 Time variable: year, 1980 to 2018, but with gaps
         Delta: 1 unit

. gen change = ceo != L.ceo

. bysort company_manager_id (year): gen job_spell = sum(change)

. 
. * create job begin and end for each manager spell
. bys frame_id_numeric manager_id job_spell: egen job_begin = min(year)

. bys frame_id_numeric manager_id job_spell: egen job_end = max(year)

. keep frame_id_numeric manager_id job_spell year job_begin job_end expat firm_
> birth foreign

. 
. * if first managers arrive in year 1, extrapolate to year 0 - DROP SPELL
. bys frame_id_numeric: egen first_cohort = min(job_begin)

. replace job_begin = job_begin - 1 if (first_cohort == firm_birth + 1) & (job_
> begin == first_cohort)
(11,125 real changes made)

. 
. * NOTE: no collapse and expand --> there might be holes
. sort frame_id_numeric manager_id year

. count if frame_id_numeric == frame_id_numeric[_n-1] & manager_id == manager_i
> d[_n-1] & year != (year[_n-1] + 1)
  679

. 
. * expat before 1990 are mostly error, convert them to locals
. replace expat = 0 if job_begin < 1990
(554 real changes made)

. 
. ***********************
. * time invariant vars and drop entire series of firms from sample *
. ***********************
. by frame_id_numeric: egen first_year_expat = min(cond(expat == 1, job_begin,.
> ))
(24,984 missing values generated)

. by frame_id_numeric: egen first_year_foreign = min(cond(foreign == 1, year,.)
> )
(884 missing values generated)

. 
. * which of the two happened first?
. generate manager_after_owner = first_year_expat - first_year_foreign
(25,168 missing values generated)

. tabulate manager_after_owner

manager_aft |
   er_owner |      Freq.     Percent        Cum.
------------+-----------------------------------
        -27 |        122        0.19        0.19
        -26 |         54        0.08        0.27
        -25 |         61        0.09        0.36
        -23 |         58        0.09        0.45
        -21 |         37        0.06        0.50
        -20 |         38        0.06        0.56
        -19 |        103        0.16        0.72
        -18 |         35        0.05        0.77
        -17 |         60        0.09        0.86
        -16 |        127        0.19        1.06
        -15 |         70        0.11        1.16
        -14 |         49        0.07        1.24
        -13 |        336        0.51        1.75
        -12 |        154        0.23        1.98
        -11 |        166        0.25        2.23
        -10 |        177        0.27        2.50
         -9 |        223        0.34        2.84
         -8 |        396        0.60        3.44
         -7 |        412        0.63        4.07
         -6 |        589        0.90        4.97
         -5 |        452        0.69        5.65
         -4 |        470        0.71        6.37
         -3 |        973        1.48        7.85
         -2 |        266        0.40        8.25
         -1 |     14,973       22.76       31.01
          0 |     31,543       47.94       78.94
          1 |      1,015        1.54       80.49
          2 |      1,619        2.46       82.95
          3 |      1,474        2.24       85.19
          4 |      1,151        1.75       86.94
          5 |      1,353        2.06       88.99
          6 |      1,052        1.60       90.59
          7 |        626        0.95       91.54
          8 |        989        1.50       93.05
          9 |        865        1.31       94.36
         10 |        740        1.12       95.48
         11 |        441        0.67       96.15
         12 |        611        0.93       97.08
         13 |        255        0.39       97.47
         14 |        290        0.44       97.91
         15 |         85        0.13       98.04
         16 |        157        0.24       98.28
         17 |        388        0.59       98.87
         18 |        181        0.28       99.14
         19 |        128        0.19       99.34
         20 |         35        0.05       99.39
         21 |         79        0.12       99.51
         22 |         45        0.07       99.58
         23 |         34        0.05       99.63
         24 |        135        0.21       99.84
         26 |         66        0.10       99.94
         28 |         41        0.06      100.00
------------+-----------------------------------
      Total |     65,799      100.00

. * event time relative to that
. generate event_time = year - first_year_expat
(24,984 missing values generated)

. 
. * if foreign manager arrives up to X years before or Y years later than forei
> gn owner, use foreign manager as arrival date. 
. replace foreign = 1 if (manager_after_owner == -2) & inlist(event_time, 0, 1)
(39 real changes made)

. replace foreign = 1 if (manager_after_owner == -1) & inlist(event_time, 0)
(32 real changes made)

. replace foreign = 0 if (manager_after_owner == +1) & inlist(event_time, -1)
(29 real changes made)

. 
. * drop firms where expat arrives earlier than X years before owner
. drop if manager_after_owner < -2
(5,162 observations deleted)

. 
. * ever expat and foreign created after foreign changes (drops were firm level
>  before so should not mess with ever variables)
. foreach X of var expat foreign {
  2.         by frame_id_numeric: egen ever_`X' = max(`X'==1)
  3. }

. 
. * drop if there was an expat but was never foreign - these are likely error
. drop if ever_expat == 1 & ever_foreign == 0
(184 observations deleted)

. 
. * drop too many CEO-s
. egen fp_tag = tag(frame_id_numeric manager_id) 

. by frame_id_numeric: egen n_ceo_ever = sum(fp_tag)

. drop if n_ceo > 15
(8,665 observations deleted)

. drop fp_tag n_ceo_ever

.         
. * hired or fired ceo since last observed year of firm
. tempvar previous_year

. generate previous_year = .
(76,956 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `previous_year' = max(cond(year 
> < `t', year, .))
  3.         quietly replace previous_year = `previous_year' if year == `t'
  4.         drop `previous_year'
  5. }

. 
. tempvar next_year

. generate next_year = .
(76,956 missing values generated)

. forval t = 1985/2018 {
  2.         quietly by frame_id_numeric: egen `next_year' = min(cond(year > `t
> ', year, .))
  3.         quietly replace next_year = `next_year' if year == `t'
  4.         drop `next_year'
  5. }

. 
. generate byte hire = (job_begin <= year) & (job_begin > previous_year) & !mis
> sing(previous_year)

. generate byte fire = (job_end >= year) & (job_end < next_year) & !missing(nex
> t_year)

. tabulate hire fire 

           |         fire
      hire |         0          1 |     Total
-----------+----------------------+----------
         0 |    58,035      8,445 |    66,480 
         1 |     8,707      1,769 |    10,476 
-----------+----------------------+----------
     Total |    66,742     10,214 |    76,956 

. 
. * number of expats and locals
. bys frame_id_numeric year: egen n_expat_ceo = total(cond(expat, 1, 0))

. bys frame_id_numeric year: egen n_local_ceo = total(cond(!expat, 1, 0))

. 
. * create firm-year data
. collapse (firstnm) n_expat_ceo n_local_ceo foreign ever_expat ever_foreign (c
> ount) n_ceo = expat (max) hire_ceo = hire fire_ceo = fire, by(frame_id_numeri
> c year)

. 
. * if there is a change in the ceo team, hiring or firing, increement the spel
> l counter
. bys frame_id_numeric (year): gen ceo_spell = sum(hire_ceo | fire_ceo) + 1 // 
> so that index start from 1

. 
. tabulate n_expat_ceo n_local_ceo

 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         0          1          2          3          4 |     Total
-----------+-------------------------------------------------------+----------
         0 |         0     22,751      5,133      1,521        325 |    29,867 
         1 |     7,310      4,815        931        202         57 |    13,329 
         2 |     2,858      1,289        214         44         17 |     4,425 
         3 |       739        263         87         15         14 |     1,119 
         4 |       194         32         14          0          0 |       240 
         5 |        58         30          2          0          0 |        90 
         6 |        30          4          0          0          0 |        34 
         7 |         4          0          0          0          0 |         4 
-----------+-------------------------------------------------------+----------
     Total |    11,193     29,184      6,381      1,782        413 |    49,108 


 (firstnm) |
n_expat_ce |                 (firstnm) n_local_ceo
         o |         5          6          7          8          9 |     Total
-----------+-------------------------------------------------------+----------
         0 |       102         27          4          2          1 |    29,867 
         1 |        10          3          0          1          0 |    13,329 
         2 |         1          2          0          0          0 |     4,425 
         3 |         1          0          0          0          0 |     1,119 
         4 |         0          0          0          0          0 |       240 
         5 |         0          0          0          0          0 |        90 
         6 |         0          0          0          0          0 |        34 
         7 |         0          0          0          0          0 |         4 
-----------+-------------------------------------------------------+----------
     Total |       114         32          4          3          1 |    49,108 


           | (firstnm)
 (firstnm) | n_local_ce
n_expat_ce |     o
         o |        11 |     Total
-----------+-----------+----------
         0 |         1 |    29,867 
         1 |         0 |    13,329 
         2 |         0 |     4,425 
         3 |         0 |     1,119 
         4 |         0 |       240 
         5 |         0 |        90 
         6 |         0 |        34 
         7 |         0 |         4 
-----------+-----------+----------
     Total |         1 |    49,108 

. * create dummies from numbers
. foreach var in expat local {
  2.         gen has_`var'_ceo = (n_`var'_ceo > 0) & !missing(n_`var'_ceo)
  3. }

.         
. count
  49,108

. compress
  variable year was float now int
  variable n_expat_ceo was float now byte
  variable n_local_ceo was float now byte
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable n_ceo was long now byte
  variable ceo_spell was float now byte
  variable has_expat_ceo was float now byte
  variable has_local_ceo was float now byte
  (1,276,808 bytes saved)

. save "`here'/temp/firm_events.dta", replace
file /Users/koren/Tresorit/Mac2Mac/projects/expat//temp/firm_events.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/Mac2Mac/projects/expat//output/firm_panel.lo
> g
  log type:  text
 closed on:  19 Mar 2024, 18:25:15
-------------------------------------------------------------------------------
