-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Google Drive/Research/expat/output/firm_panel.log
  log type:  text
 opened on:  17 Apr 2020, 17:34:15

. 
. use "temp/balance-small.dta"

. *Tempvars were created for some reason when I was closing the previous file
. *drop __* - deleted in select_sample
. collapse (max) firm_death=year, by(frame_id)

. tempfile sample

. save `sample', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St14720.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St14720.000001 saved

. 
. use "input/ceo-panel/ceo-panel.dta", clear

. rename person_id manager_id

. 
. * only keep sample firms
. merge m:1 frame_id using `sample', keep(match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           507,373  
    -----------------------------------------

. drop if year>firm_death
(48,570 observations deleted)

. 
. * balance panel
. egen company_manager = group(frame_id manager_id)

. xtset company_manager year
       panel variable:  company_manager (unbalanced)
        time variable:  year, 1988 to 2017, but with gaps
                delta:  1 unit

. by company_manager: generate gap = year - year[_n-1] - 1
(73,668 missing values generated)

. replace gap = 0 if missing(gap)
(73,668 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    454,943       99.16       99.16
          1 |      1,527        0.33       99.49
          2 |        669        0.15       99.64
          3 |        442        0.10       99.73
          4 |        322        0.07       99.80
          5 |        264        0.06       99.86
          6 |        153        0.03       99.89
          7 |        110        0.02       99.92
          8 |         84        0.02       99.94
          9 |         77        0.02       99.95
         10 |         46        0.01       99.96
         11 |         40        0.01       99.97
         12 |         29        0.01       99.98
         13 |         27        0.01       99.98
         14 |         20        0.00       99.99
         15 |         16        0.00       99.99
         16 |         11        0.00       99.99
         17 |         11        0.00      100.00
         18 |          3        0.00      100.00
         19 |          5        0.00      100.00
         20 |          1        0.00      100.00
         21 |          1        0.00      100.00
         23 |          1        0.00      100.00
         24 |          1        0.00      100.00
------------+-----------------------------------
      Total |    458,803      100.00

. 
. * fill in gap if only 1-year long
. expand 1+(gap==1), generate(filled_in)
(1,527 observations created)

. replace year = year - 1 if filled_in
(1,527 real changes made)

. xtset company_manager year
       panel variable:  company_manager (unbalanced)
        time variable:  year, 1988 to 2017, but with gaps
                delta:  1 unit

. xtdescribe

company_manager:  1, 2, ..., 73668                           n =      73668
    year:  1988, 1989, ..., 2017                             T =         30
           Delta(year) = 1 unit
           Span(year)  = 30 periods
           (company_manager*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                         1       1       2         4         9      20      30

     Freq.  Percent    Cum. |  Pattern
 ---------------------------+--------------------------------
     1329      1.80    1.80 |  .............................1
     1060      1.44    3.24 |  ............................11
      992      1.35    4.59 |  .........................11111
      982      1.33    5.92 |  ...........................111
      856      1.16    7.08 |  ....................1111111111
      838      1.14    8.22 |  ..........................1111
      811      1.10    9.32 |  ........................111111
      709      0.96   10.29 |  .......................1111111
      674      0.91   11.20 |  ....1.........................
    65417     88.80  100.00 | (other patterns)
 ---------------------------+--------------------------------
    73668    100.00         |  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXX

. 
. * create contiguous spells
. gen change = ceo != L.ceo 

. bysort company_manager (year): gen job_spell = sum(change)

. 
. * first year of CEO and first year of spell
. egen job_begin = min(year), by(frame_id manager_id job_spell)

. 
. generate int tenure = year - job_begin

. generate int overall_tenure = year - first_year_as_manager

. 
. * count number of CEOs
. preserve

.         collapse (count) N_ceos = expat, by(frame_id year)

.         save temp/N_ceos, replace
file temp/N_ceos.dta saved

. restore

. 
. gen byte spell = 1

. bysort frame_id (job_begin manager_id year): replace spell =  cond(job_begin 
> > job_begin[_n-1], spell[_n-1]+1, spell[_n-1]) if _n>1
(210,722 real changes made)

. 
. egen max_expat = max(expat), by(frame_id spell)

. tempvar lag_expat

. gen `lag_expat' = .
(460,330 missing values generated)

. bysort frame_id (job_begin manager_id year): replace `lag_expat' = max_expat[
> _n-1] if _n>1 & job_begin > job_begin[_n-1]
(35201 real changes made)

. egen lag_expat = mean(`lag_expat'), by(frame_id spell)
(249608 missing values generated)

. assert lag_expat==0 | lag_expat==1 | (missing(lag_expat) & spell==1)

. 
. compress
  variable gap was float now byte
  variable change was float now byte
  variable job_spell was float now byte
  variable job_begin was float now int
  variable tenure was int now byte
  variable overall_tenure was int now byte
  variable max_expat was float now byte
  variable __000000 was float now byte
  variable lag_expat was float now byte
  (10,127,260 bytes saved)

. save_all_to_json

. save "temp/firm_ceo_panel.dta", replace
file temp/firm_ceo_panel.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Google Drive/Research/expat/output/firm_panel.log
  log type:  text
 closed on:  17 Apr 2020, 17:34:32
-------------------------------------------------------------------------------
