-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Google Drive/Research/expat/output/firm_panel.log
  log type:  text
 opened on:   1 May 2020, 18:15:25

. 
. use "temp/balance-small.dta"

. *Tempvars were created for some reason when I was closing the previous file
. *drop __* - deleted in select_sample
. collapse (min) firm_birth = year (max) firm_death = year, by(frame_id)

. tempfile sample

. save `sample', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St05059.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St05059.000001 saved

. 
. use "input/ceo-panel/ceo-panel.dta", clear

. rename person_id manager_id

. 
. * only keep sample firms
. merge m:1 frame_id using `sample', keep(match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           608,869  
    -----------------------------------------

. drop if year>firm_death
(104,165 observations deleted)

. 
. * balance panel
. egen company_manager = group(frame_id manager_id)

. xtset company_manager year
       panel variable:  company_manager (unbalanced)
        time variable:  year, 1988 to 2017, but with gaps
                delta:  1 unit

. by company_manager: generate gap = year - year[_n-1] - 1
(94,683 missing values generated)

. replace gap = 0 if missing(gap)
(94,683 real changes made)

. tabulate gap

        gap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    500,168       99.10       99.10
          1 |      1,691        0.34       99.44
          2 |        768        0.15       99.59
          3 |        560        0.11       99.70
          4 |        366        0.07       99.77
          5 |        308        0.06       99.83
          6 |        182        0.04       99.87
          7 |        153        0.03       99.90
          8 |        115        0.02       99.92
          9 |         90        0.02       99.94
         10 |         71        0.01       99.95
         11 |         41        0.01       99.96
         12 |         43        0.01       99.97
         13 |         33        0.01       99.98
         14 |         22        0.00       99.98
         15 |         25        0.00       99.99
         16 |         13        0.00       99.99
         17 |         15        0.00       99.99
         18 |         10        0.00       99.99
         19 |         10        0.00      100.00
         20 |          9        0.00      100.00
         21 |          1        0.00      100.00
         22 |          2        0.00      100.00
         23 |          1        0.00      100.00
         24 |          2        0.00      100.00
         25 |          2        0.00      100.00
         26 |          3        0.00      100.00
------------+-----------------------------------
      Total |    504,704      100.00

. 
. * fill in gap if only 1-year long
. expand 1+(gap==1), generate(filled_in)
(1,691 observations created)

. replace year = year - 1 if filled_in
(1,691 real changes made)

. xtset company_manager year
       panel variable:  company_manager (unbalanced)
        time variable:  year, 1988 to 2017, but with gaps
                delta:  1 unit

. xtdescribe

company_manager:  1, 2, ..., 94683                           n =      94683
    year:  1988, 1989, ..., 2017                             T =         30
           Delta(year) = 1 unit
           Span(year)  = 30 periods
           (company_manager*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                         1       1       1         3         7      19      30

     Freq.  Percent    Cum. |  Pattern
 ---------------------------+--------------------------------
     5662      5.98    5.98 |  .............................1
     4029      4.26   10.24 |  ............................11
     1664      1.76   11.99 |  ...........................111
     1175      1.24   13.23 |  ....1.........................
     1064      1.12   14.36 |  ............................1.
     1059      1.12   15.48 |  ...11.........................
     1002      1.06   16.53 |  .....1........................
      963      1.02   17.55 |  .........................11111
      948      1.00   18.55 |  ...................1..........
    77117     81.45  100.00 | (other patterns)
 ---------------------------+--------------------------------
    94683    100.00         |  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXX

. 
. * create contiguous spells
. gen change = ceo != L.ceo 

. bysort company_manager (year): gen job_spell = sum(change)

. 
. * count number of CEOs
. preserve

.         collapse (count) N_ceos = expat, by(frame_id year)

.         save temp/N_ceos, replace
file temp/N_ceos.dta saved

. restore

. 
. collapse (min) job_begin = year (max) job_end = year (firstnm) expat manager_
> category firm_birth, by(frame_id manager_id job_spell)

. 
. * if first managers arrive in year 1, extrapolate to year 0
. egen first_cohort = min(job_begin), by(frame_id)

. replace job_begin = job_begin - 1 if (first_cohort == firm_birth + 1) & (job_
> begin == first_cohort)
(15,454 real changes made)

. 
. gen byte spell = 1

. bysort frame_id (job_begin manager_id): replace spell =  cond(job_begin > job
> _begin[_n-1], spell[_n-1]+1, spell[_n-1]) if _n>1
(47,912 real changes made)

. 
. egen max_expat = max(expat), by(frame_id spell)

. tempvar lag_expat

. gen `lag_expat' = .
(97,528 missing values generated)

. bysort frame_id (job_begin manager_id): replace `lag_expat' = max_expat[_n-1]
>  if _n>1 & job_begin > job_begin[_n-1]
(35902 real changes made)

. egen lag_expat = mean(`lag_expat'), by(frame_id spell)
(49616 missing values generated)

. assert lag_expat==0 | lag_expat==1 | (missing(lag_expat) & spell==1)

. 
. compress
  variable job_spell was float now byte
  variable first_cohort was float now int
  variable max_expat was float now byte
  variable __000000 was float now byte
  variable lag_expat was float now byte
  (1,365,392 bytes saved)

. save_all_to_json

. save "temp/firm_ceo_panel.dta", replace
file temp/firm_ceo_panel.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Google Drive/Research/expat/output/firm_panel.log
  log type:  text
 closed on:   1 May 2020, 18:15:45
-------------------------------------------------------------------------------
