-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Google Drive/Research/expat/research_design/talk/outp
> ut/manager_panel.log
  log type:  text
 opened on:  12 Jan 2019, 12:27:58

. local variables person_foreign frame_id manager_id pos5

. 
. use temp/managers

. 
. *duplicates report ceg_id rovat_id alrovat_id
. *van eg cég, ahol a ceg_id rovat_id alrovat_id nem határozza meg egyértelműen
>  a személyt - a ceg_id:110041043, ezért kell merge m:1
. merge m:1 ceg_id rovat_id alrovat_id using temp/positions, keepusing(pos5) ke
> ep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                       754,220
        from master                   754,220  (_merge==1)
        from using                          0  (_merge==2)

    matched                         4,262,206  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. 
. replace year_from=year_from+1 if month_from>6|(month_from==6&day_from>20)
(2,284,867 real changes made)

. replace year_till=year_till-1 if month_till<6|(month_till==6&day_till<21)
(2,449,013 real changes made)

. 
. tab year_from

  year_from |      Freq.     Percent        Cum.
------------+-----------------------------------
       1012 |          1        0.00        0.00
       1897 |         38        0.00        0.00
       1901 |          6        0.00        0.00
       1902 |          9        0.00        0.00
       1903 |          6        0.00        0.00
       1907 |          1        0.00        0.00
       1909 |          4        0.00        0.00
       1910 |         45        0.00        0.00
       1911 |          3        0.00        0.00
       1912 |         20        0.00        0.00
       1913 |          6        0.00        0.00
       1918 |          1        0.00        0.00
       1920 |          1        0.00        0.00
       1921 |          4        0.00        0.00
       1922 |          5        0.00        0.00
       1928 |          2        0.00        0.00
       1929 |         17        0.00        0.00
       1930 |         11        0.00        0.00
       1931 |          1        0.00        0.00
       1932 |          1        0.00        0.00
       1933 |          5        0.00        0.00
       1935 |          5        0.00        0.00
       1937 |          1        0.00        0.00
       1939 |          1        0.00        0.00
       1940 |          1        0.00        0.00
       1941 |          5        0.00        0.00
       1942 |          4        0.00        0.00
       1943 |          1        0.00        0.00
       1945 |          4        0.00        0.00
       1946 |         88        0.00        0.01
       1947 |         52        0.00        0.01
       1948 |         82        0.00        0.01
       1949 |        651        0.01        0.02
       1950 |      1,141        0.02        0.04
       1951 |      1,138        0.02        0.07
       1952 |        594        0.01        0.08
       1953 |        508        0.01        0.09
       1954 |        605        0.01        0.10
       1955 |        252        0.01        0.11
       1956 |         46        0.00        0.11
       1957 |        371        0.01        0.12
       1958 |        188        0.00        0.12
       1959 |        308        0.01        0.13
       1960 |        330        0.01        0.13
       1961 |        400        0.01        0.14
       1962 |        519        0.01        0.15
       1963 |        247        0.00        0.16
       1964 |        166        0.00        0.16
       1965 |        123        0.00        0.16
       1966 |         59        0.00        0.16
       1967 |        137        0.00        0.16
       1968 |        324        0.01        0.17
       1969 |        262        0.01        0.18
       1970 |        308        0.01        0.18
       1971 |        513        0.01        0.19
       1972 |        347        0.01        0.20
       1973 |        325        0.01        0.21
       1974 |        627        0.01        0.22
       1975 |        571        0.01        0.23
       1976 |        572        0.01        0.24
       1977 |        446        0.01        0.25
       1978 |        317        0.01        0.26
       1979 |        197        0.00        0.26
       1980 |        199        0.00        0.27
       1981 |        230        0.00        0.27
       1982 |      1,255        0.03        0.29
       1983 |      2,326        0.05        0.34
       1984 |      2,307        0.05        0.39
       1985 |      3,198        0.06        0.45
       1986 |      3,742        0.08        0.53
       1987 |      3,276        0.07        0.59
       1988 |      3,860        0.08        0.67
       1989 |     14,451        0.29        0.96
       1990 |     55,677        1.12        2.08
       1991 |     81,452        1.63        3.71
       1992 |    106,520        2.14        5.85
       1993 |    102,111        2.05        7.90
       1994 |     97,913        1.96        9.86
       1995 |     93,798        1.88       11.74
       1996 |    105,600        2.12       13.86
       1997 |    115,651        2.32       16.18
       1998 |    123,231        2.47       18.65
       1999 |    122,008        2.45       21.10
       2000 |    156,041        3.13       24.23
       2001 |    147,541        2.96       27.19
       2002 |    144,674        2.90       30.09
       2003 |    151,865        3.05       33.13
       2004 |    227,055        4.55       37.69
       2005 |    218,113        4.37       42.06
       2006 |    195,260        3.92       45.98
       2007 |    194,562        3.90       49.88
       2008 |    293,732        5.89       55.77
       2009 |    249,903        5.01       60.78
       2010 |    289,184        5.80       66.58
       2011 |    259,969        5.21       71.80
       2012 |    280,434        5.62       77.42
       2013 |    540,675       10.84       88.27
       2014 |    184,110        3.69       91.96
       2015 |    201,961        4.05       96.01
       2016 |    151,085        3.03       99.04
       2017 |     47,744        0.96      100.00
       2019 |          2        0.00      100.00
       2020 |          3        0.00      100.00
       2031 |          1        0.00      100.00
       2089 |          2        0.00      100.00
       2090 |          1        0.00      100.00
       2091 |          1        0.00      100.00
       2102 |          1        0.00      100.00
       2103 |          1        0.00      100.00
       2200 |          1        0.00      100.00
       2201 |          2        0.00      100.00
       2202 |          2        0.00      100.00
       2204 |          1        0.00      100.00
       2208 |          1        0.00      100.00
       2301 |          1        0.00      100.00
       7413 |          1        0.00      100.00
       8387 |          1        0.00      100.00
       9994 |          2        0.00      100.00
------------+-----------------------------------
      Total |  4,985,760      100.00

. 
. 
. * drop all unnecessary vars before expanding
. keep `variables' ceg_id rovat_id alrovat_id year_from year_till 

. compress
  (0 bytes saved)

. * admissible dates
. local T1 1946

. local T2 2018

. local T3 2021

. 
. foreach X of var year_* {
  2.         replace `X'=. if `X'<`T1' | `X'>`T3'
  3.         replace `X'=`T2' if `X'<=`T3' & `X'>`T2'
  4. }
(228 real changes made, 228 to missing)
(5 real changes made)
(344 real changes made, 344 to missing)
(24,613 real changes made)

. replace year_till = year_from if year_till<year_from
(466,060 real changes made, 30,854 to missing)

. gen diff=year_till-year_from+1
(31,198 missing values generated)

. drop if diff<=0 | missing(diff)
(31,198 observations deleted)

. tab diff

       diff |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  1,362,046       27.32       27.32
          2 |    888,246       17.82       45.14
          3 |    713,913       14.32       59.46
          4 |    532,436       10.68       70.14
          5 |    488,320        9.80       79.94
          6 |    409,174        8.21       88.14
          7 |    149,091        2.99       91.13
          8 |     98,823        1.98       93.12
          9 |     76,448        1.53       94.65
         10 |     58,695        1.18       95.83
         11 |     46,242        0.93       96.75
         12 |     34,634        0.69       97.45
         13 |     25,846        0.52       97.97
         14 |     19,762        0.40       98.36
         15 |     16,472        0.33       98.69
         16 |     12,886        0.26       98.95
         17 |      9,967        0.20       99.15
         18 |      7,631        0.15       99.31
         19 |      6,210        0.12       99.43
         20 |      5,029        0.10       99.53
         21 |      3,923        0.08       99.61
         22 |      2,793        0.06       99.67
         23 |      2,422        0.05       99.71
         24 |      1,881        0.04       99.75
         25 |      1,577        0.03       99.78
         26 |      1,302        0.03       99.81
         27 |      1,040        0.02       99.83
         28 |        672        0.01       99.84
         29 |        547        0.01       99.86
         30 |        345        0.01       99.86
         31 |        342        0.01       99.87
         32 |        396        0.01       99.88
         33 |        341        0.01       99.88
         34 |        255        0.01       99.89
         35 |        173        0.00       99.89
         36 |        236        0.00       99.90
         37 |        244        0.00       99.90
         38 |        287        0.01       99.91
         39 |        542        0.01       99.92
         40 |        496        0.01       99.93
         41 |        796        0.02       99.94
         42 |        637        0.01       99.96
         43 |        606        0.01       99.97
         44 |        493        0.01       99.98
         45 |        290        0.01       99.99
         46 |        160        0.00       99.99
         47 |         90        0.00       99.99
         48 |        108        0.00       99.99
         49 |         68        0.00       99.99
         50 |         38        0.00       99.99
         51 |         43        0.00      100.00
         52 |         67        0.00      100.00
         53 |         14        0.00      100.00
         54 |         43        0.00      100.00
         55 |         24        0.00      100.00
         56 |         14        0.00      100.00
         57 |         10        0.00      100.00
         58 |         21        0.00      100.00
         59 |          4        0.00      100.00
         60 |          1        0.00      100.00
         62 |          2        0.00      100.00
         63 |          1        0.00      100.00
         64 |          4        0.00      100.00
         65 |          6        0.00      100.00
         66 |          1        0.00      100.00
         67 |          1        0.00      100.00
         68 |          1        0.00      100.00
------------+-----------------------------------
      Total |  4,985,228      100.00

. table year_from , c(mean diff)

----------------------
year_from | mean(diff)
----------+-----------
     1946 |   50.90698
     1947 |         47
     1948 |   31.68293
     1949 |    37.8172
     1950 |   40.35408
     1951 |   37.87961
     1952 |   40.27273
     1953 |   37.49016
     1954 |   38.39174
     1955 |    37.5873
     1956 |   32.76087
     1957 |   34.83558
     1958 |    33.8883
     1959 |   33.50325
     1960 |   34.34848
     1961 |    30.9975
     1962 |   27.91908
     1963 |   27.60324
     1964 |   27.24096
     1965 |   24.03252
     1966 |   25.94915
     1967 |   26.10219
     1968 |   26.08333
     1969 |   21.99618
     1970 |   22.81494
     1971 |   22.40351
     1972 |   21.80115
     1973 |   14.83077
     1974 |   19.05423
     1975 |   18.24343
     1976 |   17.49825
     1977 |   17.32063
     1978 |   15.28391
     1979 |   13.09137
     1980 |   15.62814
     1981 |   11.43478
     1982 |    8.43267
     1983 |   7.515047
     1984 |   6.996099
     1985 |   6.720763
     1986 |   6.231962
     1987 |   5.905038
     1988 |   5.842228
     1989 |   6.086361
     1990 |   5.796638
     1991 |   5.831269
     1992 |   6.238725
     1993 |   6.305875
     1994 |   5.941119
     1995 |   5.635765
     1996 |    5.49008
     1997 |   5.294802
     1998 |    4.90942
     1999 |   4.758586
     2000 |   4.650533
     2001 |   4.223947
     2002 |   3.765854
     2003 |   3.361617
     2004 |   3.414978
     2005 |   3.402535
     2006 |    3.27902
     2007 |   3.499085
     2008 |   3.345896
     2009 |   2.773118
     2010 |   2.457705
     2011 |   2.066885
     2012 |   2.283691
     2013 |   3.723076
     2014 |   2.868858
     2015 |   2.933756
     2016 |   2.455345
     2017 |   1.835275
     2018 |          1
----------------------

.  
. expand diff
(13,612,083 observations created)

. 
. bys ceg_id rovat_id alrovat_id: gen year = year_from+_n-1

. 
. *Duplikációk összeejtése
. *duplicates report frame_id manager_id year
. *duplicates report frame_id manager_id year pos5
. collapse (firstnm) person_foreign, by(frame_id manager_id year pos5)

. tab person_foreign

  (firstnm) |
person_fore |
        ign |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15,003,202       89.65       89.65
          1 |  1,731,353       10.35      100.00
------------+-----------------------------------
      Total | 16,734,555      100.00

. 
. save temp/manager_panel, replace
file temp/manager_panel.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Google Drive/Research/expat/research_design/talk/outp
> ut/manager_panel.log
  log type:  text
 closed on:  12 Jan 2019, 12:31:22
-------------------------------------------------------------------------------
