-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Documents/workspace/expat/output/manager_panel.log
  log type:  text
 opened on:   8 Nov 2018, 09:07:34

. local variables person_foreign frame_id manager_id pos5

. 
. use temp/managers

. 
. *duplicates report ceg_id rovat_id alrovat_id
. *van eg cég, ahol a ceg_id rovat_id alrovat_id nem határozza meg egyértelműen
>  a személyt - a ceg_id:110041043, ezért kell merge m:1
. merge m:1 ceg_id rovat_id alrovat_id using temp/positions, keepusing(pos5) ke
> ep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                       756,831
        from master                   756,831  (_merge==1)
        from using                          0  (_merge==2)

    matched                         4,303,467  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. 
. replace year_from=year_from+1 if month_from>6|(month_from==6&day_from>20)
(2,308,380 real changes made)

. replace year_till=year_till-1 if month_till<6|(month_till==6&day_till<21)
(2,470,944 real changes made)

. 
. tab year_from

  year_from |      Freq.     Percent        Cum.
------------+-----------------------------------
       1012 |          1        0.00        0.00
       1897 |         44        0.00        0.00
       1901 |          6        0.00        0.00
       1902 |          9        0.00        0.00
       1903 |          6        0.00        0.00
       1907 |          1        0.00        0.00
       1909 |          4        0.00        0.00
       1910 |         55        0.00        0.00
       1911 |          3        0.00        0.00
       1912 |         22        0.00        0.00
       1913 |          7        0.00        0.00
       1918 |          1        0.00        0.00
       1920 |          1        0.00        0.00
       1921 |          4        0.00        0.00
       1922 |          5        0.00        0.00
       1928 |          2        0.00        0.00
       1929 |         20        0.00        0.00
       1930 |         12        0.00        0.00
       1931 |          1        0.00        0.00
       1932 |          1        0.00        0.00
       1933 |          5        0.00        0.00
       1935 |          5        0.00        0.00
       1937 |          1        0.00        0.00
       1939 |          1        0.00        0.00
       1940 |          1        0.00        0.00
       1941 |          5        0.00        0.00
       1942 |          4        0.00        0.00
       1943 |          1        0.00        0.00
       1945 |          4        0.00        0.00
       1946 |         89        0.00        0.01
       1947 |         53        0.00        0.01
       1948 |         83        0.00        0.01
       1949 |        675        0.01        0.02
       1950 |      1,257        0.02        0.05
       1951 |      1,169        0.02        0.07
       1952 |        604        0.01        0.08
       1953 |        516        0.01        0.09
       1954 |        615        0.01        0.11
       1955 |        256        0.01        0.11
       1956 |         47        0.00        0.11
       1957 |        373        0.01        0.12
       1958 |        188        0.00        0.12
       1959 |        323        0.01        0.13
       1960 |        331        0.01        0.14
       1961 |        413        0.01        0.14
       1962 |        599        0.01        0.16
       1963 |        270        0.01        0.16
       1964 |        180        0.00        0.16
       1965 |        150        0.00        0.17
       1966 |        102        0.00        0.17
       1967 |        152        0.00        0.17
       1968 |        340        0.01        0.18
       1969 |        319        0.01        0.19
       1970 |        371        0.01        0.19
       1971 |        540        0.01        0.20
       1972 |        426        0.01        0.21
       1973 |        383        0.01        0.22
       1974 |        674        0.01        0.23
       1975 |        625        0.01        0.25
       1976 |        645        0.01        0.26
       1977 |        491        0.01        0.27
       1978 |        367        0.01        0.28
       1979 |        232        0.00        0.28
       1980 |        224        0.00        0.28
       1981 |        275        0.01        0.29
       1982 |      1,322        0.03        0.32
       1983 |      2,437        0.05        0.36
       1984 |      2,437        0.05        0.41
       1985 |      3,353        0.07        0.48
       1986 |      3,898        0.08        0.56
       1987 |      3,398        0.07        0.63
       1988 |      3,989        0.08        0.70
       1989 |     15,018        0.30        1.00
       1990 |     57,661        1.15        2.15
       1991 |     84,898        1.69        3.84
       1992 |    112,540        2.24        6.08
       1993 |    107,682        2.14        8.22
       1994 |    103,614        2.06       10.28
       1995 |     98,606        1.96       12.24
       1996 |    110,151        2.19       14.43
       1997 |    120,036        2.39       16.81
       1998 |    126,628        2.52       19.33
       1999 |    122,150        2.43       21.76
       2000 |    156,185        3.11       24.87
       2001 |    147,683        2.94       27.80
       2002 |    144,748        2.88       30.68
       2003 |    151,890        3.02       33.70
       2004 |    227,064        4.51       38.22
       2005 |    218,135        4.34       42.55
       2006 |    195,276        3.88       46.44
       2007 |    194,578        3.87       50.30
       2008 |    293,793        5.84       56.15
       2009 |    249,975        4.97       61.12
       2010 |    289,268        5.75       66.87
       2011 |    260,123        5.17       72.04
       2012 |    280,520        5.58       77.62
       2013 |    540,708       10.75       88.37
       2014 |    184,132        3.66       92.03
       2015 |    201,964        4.02       96.05
       2016 |    151,085        3.00       99.05
       2017 |     47,744        0.95      100.00
       2019 |          2        0.00      100.00
       2020 |          3        0.00      100.00
       2031 |          1        0.00      100.00
       2089 |          2        0.00      100.00
       2090 |          1        0.00      100.00
       2091 |          1        0.00      100.00
       2102 |          1        0.00      100.00
       2103 |          1        0.00      100.00
       2200 |          1        0.00      100.00
       2201 |          2        0.00      100.00
       2202 |          2        0.00      100.00
       2204 |          1        0.00      100.00
       2208 |          1        0.00      100.00
       2301 |          1        0.00      100.00
       7413 |          1        0.00      100.00
       8387 |          1        0.00      100.00
       9994 |          2        0.00      100.00
------------+-----------------------------------
      Total |  5,029,302      100.00

. 
. 
. * drop all unnecessary vars before expanding
. keep `variables' ceg_id rovat_id alrovat_id year_from year_till 

. compress
  (0 bytes saved)

. * admissible dates
. local T1 1946

. local T2 2018

. local T3 2021

. 
. foreach X of var year_* {
  2.         replace `X'=. if `X'<`T1' | `X'>`T3'
  3.         replace `X'=`T2' if `X'<=`T3' & `X'>`T2'
  4. }
(251 real changes made, 251 to missing)
(5 real changes made)
(344 real changes made, 344 to missing)
(24,613 real changes made)

. replace year_till = year_from if year_till<year_from
(470,612 real changes made, 31,207 to missing)

. gen diff=year_till-year_from+1
(31,551 missing values generated)

. drop if diff<=0 | missing(diff)
(31,551 observations deleted)

. tab diff

       diff |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  1,373,213       27.31       27.31
          2 |    894,864       17.79       45.10
          3 |    719,080       14.30       59.40
          4 |    536,536       10.67       70.07
          5 |    491,713        9.78       79.85
          6 |    411,913        8.19       88.04
          7 |    151,165        3.01       91.05
          8 |    100,441        2.00       93.04
          9 |     77,627        1.54       94.59
         10 |     59,763        1.19       95.78
         11 |     46,958        0.93       96.71
         12 |     35,223        0.70       97.41
         13 |     26,274        0.52       97.93
         14 |     20,093        0.40       98.33
         15 |     16,794        0.33       98.67
         16 |     13,149        0.26       98.93
         17 |     10,146        0.20       99.13
         18 |      7,818        0.16       99.28
         19 |      6,338        0.13       99.41
         20 |      5,144        0.10       99.51
         21 |      4,061        0.08       99.59
         22 |      2,916        0.06       99.65
         23 |      2,564        0.05       99.70
         24 |      2,018        0.04       99.74
         25 |      1,698        0.03       99.78
         26 |      1,414        0.03       99.80
         27 |      1,127        0.02       99.83
         28 |        721        0.01       99.84
         29 |        579        0.01       99.85
         30 |        359        0.01       99.86
         31 |        348        0.01       99.87
         32 |        422        0.01       99.88
         33 |        343        0.01       99.88
         34 |        262        0.01       99.89
         35 |        174        0.00       99.89
         36 |        240        0.00       99.90
         37 |        245        0.00       99.90
         38 |        291        0.01       99.91
         39 |        557        0.01       99.92
         40 |        504        0.01       99.93
         41 |        835        0.02       99.94
         42 |        662        0.01       99.96
         43 |        620        0.01       99.97
         44 |        504        0.01       99.98
         45 |        298        0.01       99.99
         46 |        162        0.00       99.99
         47 |         90        0.00       99.99
         48 |        111        0.00       99.99
         49 |         68        0.00       99.99
         50 |         38        0.00       99.99
         51 |         43        0.00      100.00
         52 |         70        0.00      100.00
         53 |         14        0.00      100.00
         54 |         43        0.00      100.00
         55 |         25        0.00      100.00
         56 |         14        0.00      100.00
         57 |         10        0.00      100.00
         58 |         21        0.00      100.00
         59 |          4        0.00      100.00
         60 |          1        0.00      100.00
         62 |          2        0.00      100.00
         63 |          1        0.00      100.00
         64 |          4        0.00      100.00
         65 |          6        0.00      100.00
         66 |          1        0.00      100.00
         67 |          1        0.00      100.00
         68 |          3        0.00      100.00
         69 |          1        0.00      100.00
------------+-----------------------------------
      Total |  5,028,747      100.00

. table year_from , c(mean diff)

----------------------
year_from | mean(diff)
----------+-----------
     1946 |   50.83908
     1947 |   46.96227
     1948 |   31.87952
     1949 |   37.94815
     1950 |    39.0891
     1951 |   37.89649
     1952 |   40.29801
     1953 |   37.46124
     1954 |   38.38699
     1955 |   37.37109
     1956 |   32.82979
     1957 |   34.83646
     1958 |    33.8883
     1959 |   33.51703
     1960 |   34.34139
     1961 |   31.04116
     1962 |   25.94324
     1963 |   26.85185
     1964 |   25.82222
     1965 |   21.42667
     1966 |   20.56863
     1967 |   24.42763
     1968 |   25.56176
     1969 |   20.06583
     1970 |   20.36927
     1971 |   22.14259
     1972 |   19.79343
     1973 |   14.56919
     1974 |   18.62463
     1975 |    17.9824
     1976 |   17.09612
     1977 |   16.61304
     1978 |   14.53679
     1979 |   12.68103
     1980 |   15.12946
     1981 |      10.88
     1982 |   8.299546
     1983 |   7.443168
     1984 |   6.958966
     1985 |   6.665672
     1986 |   6.202925
     1987 |   5.878128
     1988 |   5.824768
     1989 |   6.047609
     1990 |    5.77951
     1991 |   5.793804
     1992 |   6.188742
     1993 |   6.232025
     1994 |     5.8762
     1995 |   5.575848
     1996 |   5.432864
     1997 |   5.247334
     1998 |   4.896695
     1999 |   4.755551
     2000 |   4.648159
     2001 |   4.221578
     2002 |   3.765089
     2003 |   3.361828
     2004 |   3.414983
     2005 |   3.402645
     2006 |   3.279105
     2007 |    3.49907
     2008 |    3.34575
     2009 |   2.772839
     2010 |   2.457524
     2011 |   2.066457
     2012 |   2.283511
     2013 |   3.722944
     2014 |   2.868673
     2015 |   2.933732
     2016 |   2.455345
     2017 |   1.835275
     2018 |          1
----------------------

.  
. expand diff
(13,782,847 observations created)

. 
. bys ceg_id rovat_id alrovat_id: gen year = year_from+_n-1

. 
. *Duplikációk összeejtése
. *duplicates report frame_id manager_id year
. *duplicates report frame_id manager_id year pos5
. collapse (firstnm) person_foreign, by(frame_id manager_id year pos5)

. tab person_foreign

  (firstnm) |
person_fore |
        ign |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 13,615,280       80.41       80.41
          1 |  3,317,961       19.59      100.00
------------+-----------------------------------
      Total | 16,933,241      100.00

. 
. save temp/manager_panel, replace
file temp/manager_panel.dta saved

. log close
      name:  <unnamed>
       log:  /Users/koren/Documents/workspace/expat/output/manager_panel.log
  log type:  text
 closed on:   8 Nov 2018, 09:09:27
-------------------------------------------------------------------------------
