--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/matrix.log
  log type:  text
 opened on:  31 May 2021, 10:38:47

. 
. foreach file in balance analysis {
  2.         clear all
  3.         mata: mata matuse "temp/matrix-`file'", replace
  4.         mata: st_matrix("total_`file'", mat_total_`file')
  5. 
.         matrix colnames total_`file' = "foreign" "foreign_3" "foreign_2" "foreign_1" "foreign0" "foreign1" "foreign2" "foreign3" "count" "hole1" "hole2" "ho
> le3" "hole4" "hole5" "hole6" "hole7" "hole8" "hole9" "hole10"
  6.         *No option to save row names as variables as svmat - https://www.stata.com/statalist/archive/2007-07/msg00477.html
. 
.         matrix list total_`file'
  7. 
.         svmat total_`file', names(col)
  8.         
.         tempfile `file'
  9.         save ``file''
 10. }
(loading mat_total_balance[14,19])

total_balance[14,19]
       foreign  foreign_3  foreign_2  foreign_1   foreign0   foreign1   foreign2   foreign3      count      hole1      hole2      hole3      hole4      hole5
 r1     660143      13505      17922      26714     122818     100456      86391      75047    8122237     151035      75330      54102      42482      33985
 r2      11895       1022       1156       1399       1498       1310       1085        919      21706        135         24         12          9          4
 r3     271063      13505      17326      24516      54627      44009      37466      32416    7580375     141372      71791      52109      41234      33144
 r4      11895       1022       1156       1399       1498       1310       1085        919      21706        135         24         12          9          4
 r5      39066       1704       2124       3024       6425       4777       3771       3199     479604       3507       1239        836        588        442
 r6      11895       1022       1156       1399       1498       1310       1085        919      21706        135         24         12          9          4
 r7      36716       1626       1956       2615       4252       3759       3337       3009     412996       2966        989        687        449        309
 r8      11895       1022       1156       1399       1498       1310       1085        919      21706        148         38         26         19         10
 r9      35865       1581       1844       2334       3310       3508       3232       2937     395673       3453       1080        667        429        289
r10      11895       1022       1156       1399       1498       1310       1085        919      21706        192         53         31         20         10
r11      34413       1505       1728       2048       2768       3102       2984       2795     360650       3970       1254        684        419        268
r12      11895       1022       1156       1399       1498       1310       1085        919      21706        291         96         53         34         21
r13      34247       1503       1724       2040       2760       3092       2982       2791     357984       4163       1303        694        421        267
r14      11895       1022       1156       1399       1498       1310       1085        919      21706        305        100         55         35         22

         hole6      hole7      hole8      hole9     hole10
 r1      27923      23339      19628      15908      11840
 r2          3          3          2          2          1
 r3      27336      22906      19290      15635      11635
 r4          3          3          2          2          1
 r5        262        152         54         34         26
 r6          3          3          2          2          1
 r7        207        120         67         45         34
 r8          6          5          4          4          2
 r9        198        124         77         51         33
r10          6          5          4          4          2
r11        193        137        101         75         59
r12         14         10          7          5          3
r13        190        133         97         72         56
r14         15         11          8          6          3
number of observations will be reset to 14
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 14
file /srv/sandbox/zavecz/St1249358.000001 saved
(loading mat_total_analysis[6,19])

total_analysis[6,19]
      foreign  foreign_3  foreign_2  foreign_1   foreign0   foreign1   foreign2   foreign3      count      hole1      hole2      hole3      hole4      hole5
r1      30721       1188       1362       1647       2096       2796       2697       2518     302563       3760       1277        723        474        306
r2      11898       1022       1156       1399       1498       1310       1085        919      21706        362        138         81         51         34
r3      29170       1116       1275       1530       1956       2639       2540       2364     299371       3707       1260        712        469        302
r4      11898       1022       1156       1399       1498       1310       1085        919      21706        362        138         81         51         34
r5      11898       1116       1254       1482       1532       1309       1088        925     277116       3383       1153        650        422        268
r6      11898       1022       1156       1399       1498       1309       1085        919      21705        362        138         81         51         34

        hole6      hole7      hole8      hole9     hole10
r1        211        159        117         89         67
r2         21         16         13         11          7
r3        207        156        116         88         66
r4         21         16         13         11          7
r5        186        141        106         79         59
r6         21         16         13         11          7
number of observations will be reset to 6
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 6
file /srv/sandbox/zavecz/St1249358.000002 saved

. 
. use `balance', clear

. append using `analysis'

. 
. gen when = _n

. forval i = 2(2)20 {
  2.         replace when = when - 1 if when == `i'
  3. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. label define when_label 1 "beginning after interpolating fo3 holes and fo3 expanded" 3 "greenfield dropped (balance)" 5 "sampling" 7 "missing lnK" 9 "missin
> g lnQ" 11 "missing lnL" 13 "missing lnM" 15 "manager merge" 17 "many foreign changes" 19 "D, D-F kept"

. label values when when_label

. 
. gen type = _n

. forval i = 1(2)20 {
  2.         replace type = 1 if type == `i'
  3. }
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. forval i = 2(2)20 {
  2.         replace type = 2 if type == `i'
  3. }
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. label define type_label 1 "all" 2 "analysis sample ever foreign"

. label values type type_label

. 
. export delimited using "output/foreign_drop", replace
file output/foreign_drop.csv saved

. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/matrix.log
  log type:  text
 closed on:  31 May 2021, 10:38:47
--------------------------------------------------------------------------------------------------------------------------------------------------------------
