--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/matrix.log
  log type:  text
 opened on:  23 Apr 2021, 00:14:23

. 
. foreach file in balance analysis {
  2.         clear all
  3.         mata: mata matuse "temp/matrix-`file'", replace
  4.         mata: st_matrix("total_`file'", mat_total_`file')
  5. 
.         matrix colnames total_`file' = "foreign" "foreign_3" "foreign_2" "foreign_1" "foreign0" "foreign1" "foreign2" "foreign3" "count"
  6.         *No option to save row names as variables as svmat - https://www.stata.com/statalist/archive/2007-07/msg00477.html
. 
.         matrix list total_`file'
  7. 
.         svmat total_`file', names(col)
  8.         
.         tempfile `file'
  9.         save ``file''
 10. }
(loading mat_total_balance[14,9])

total_balance[14,9]
       foreign  foreign_3  foreign_2  foreign_1   foreign0   foreign1   foreign2   foreign3      count
 r1     647084      12859      17142      25675     119746      99537      85840      74805    8091096
 r2      11411        973       1126       1365       1459       1328       1219       1106      24010
 r3     264632      12859      16563      23515      53370      43750      37287      32329    7550376
 r4      10705        973       1125       1364       1457       1275       1152       1039      23062
 r5      37696       1600       1994       2816       6184       4727       3732       3159     463618
 r6      10705        973       1125       1364       1457       1275       1152       1039      23062
 r7      35429       1544       1862       2471       4081       3706       3297       2965     397190
 r8      10705        973       1125       1364       1457       1275       1152       1039      23062
 r9      34639       1504       1781       2234       3198       3457       3189       2894     380014
r10      10705        973       1125       1364       1457       1275       1152       1039      23062
r11      33237       1439       1677       1990       2672       3056       2942       2755     346072
r12      10705        973       1125       1364       1457       1275       1152       1039      23062
r13      33086       1437       1673       1981       2662       3046       2938       2749     343474
r14      10705        973       1125       1364       1457       1275       1152       1039      23062
number of observations will be reset to 14
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 14
file /srv/sandbox/zavecz/St3190620.000001 saved
(loading mat_total_analysis[6,9])

total_analysis[6,9]
      foreign  foreign_3  foreign_2  foreign_1   foreign0   foreign1   foreign2   foreign3      count
r1      29043       1113       1313       1593       1998       2728       2643       2455     287315
r2      10713        972       1124       1363       1456       1275       1151       1039      23052
r3      27246       1042       1224       1473       1852       2561       2476       2295     283929
r4      10713        972       1124       1363       1456       1275       1151       1039      23052
r5      10754       1042       1198       1421       1459       1262       1040        873     262433
r6      10682        972       1123       1362       1455       1262       1033        861      19905
number of observations will be reset to 6
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 6
file /srv/sandbox/zavecz/St3190620.000002 saved

. 
. use `balance', clear

. append using `analysis'

. 
. gen when = _n

. forval i = 2(2)20 {
  2.         replace when = when - 1 if when == `i'
  3. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. label define when_label 1 "beginning after interpolating fo3 holes and fo3 expanded" 3 "greenfield dropped (balance)" 5 "sampling" 7 "missing lnK" 9 "missin
> g lnQ" 11 "missing lnL" 13 "missing lnM" 15 "manager merge" 17 "many foreign changes" 19 "D, D-F kept"

. label values when when_label

. 
. gen type = _n

. forval i = 1(2)20 {
  2.         replace type = 1 if type == `i'
  3. }
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. forval i = 2(2)20 {
  2.         replace type = 2 if type == `i'
  3. }
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. label define type_label 1 "all" 2 "analysis sample ever foreign"

. label values type type_label

. 
. export delimited using "output/foreign_drop", replace
file output/foreign_drop.csv saved

. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/matrix.log
  log type:  text
 closed on:  23 Apr 2021, 00:14:24
--------------------------------------------------------------------------------------------------------------------------------------------------------------
