--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/matrix.log
  log type:  text
 opened on:  25 May 2021, 17:46:20

. 
. foreach file in balance analysis {
  2.         clear all
  3.         mata: mata matuse "temp/matrix-`file'", replace
  4.         mata: st_matrix("total_`file'", mat_total_`file')
  5. 
.         matrix colnames total_`file' = "foreign" "foreign_3" "foreign_2" "foreign_1" "foreign0" "foreign1" "foreign2" "foreign3" "count" "hole1" "hole2"
  6.         *No option to save row names as variables as svmat - https://www.stata.com/statalist/archive/2007-07/msg00477.html
. 
.         matrix list total_`file'
  7. 
.         svmat total_`file', names(col)
  8.         
.         tempfile `file'
  9.         save ``file''
 10. }
(loading mat_total_balance[14,11])

total_balance[14,11]
       foreign  foreign_3  foreign_2  foreign_1   foreign0   foreign1   foreign2   foreign3      count      hole1      hole2
 r1     647076      12859      17142      25675     119746      99537      85840      74805    8091096     150760      75217
 r2      11553       1000       1140       1378       1483       1324       1087        913      21062        137         24
 r3     264681      12859      16564      23518      53373      43753      37290      32332    7550467     141086      71680
 r4      11553       1000       1140       1378       1483       1324       1087        913      21062        137         24
 r5      37745       1600       1995       2818       6186       4729       3734       3161     463679       3486       1246
 r6      11553       1000       1140       1378       1483       1324       1087        913      21062        137         24
 r7      35478       1544       1863       2473       4083       3708       3299       2967     397251       2954        992
 r8      11553       1000       1140       1378       1483       1324       1087        913      21062        149         37
 r9      34688       1504       1781       2236       3200       3459       3191       2896     380074       3436       1085
r10      11553       1000       1140       1378       1483       1324       1087        913      21062        193         54
r11      33286       1439       1677       1990       2674       3058       2944       2757     346130       4197       1261
r12      11553       1000       1140       1378       1483       1324       1087        913      21062        307         96
r13      33135       1437       1673       1981       2664       3048       2940       2751     343532       4379       1312
r14      11553       1000       1140       1378       1483       1324       1087        913      21062        319         99
number of observations will be reset to 14
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 14
file /srv/sandbox/zavecz/St3906394.000001 saved
(loading mat_total_analysis[6,11])

total_analysis[6,11]
      foreign  foreign_3  foreign_2  foreign_1   foreign0   foreign1   foreign2   foreign3      count      hole1      hole2
r1      30083       1161       1354       1635       2060       2792       2694       2511     299188       3989       1288
r2      11558       1000       1140       1378       1483       1324       1087        913      21062        375        139
r3      28154       1081       1255       1507       1906       2617       2519       2340     295534       3923       1267
r4      11558       1000       1140       1378       1483       1324       1087        913      21062        375        139
r5      11559       1081       1232       1457       1517       1325       1090        919     273784       3596       1157
r6      11558       1000       1140       1378       1483       1324       1087        912      21061        375        139
number of observations will be reset to 6
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 6
file /srv/sandbox/zavecz/St3906394.000002 saved

. 
. use `balance', clear

. append using `analysis'

. 
. gen when = _n

. forval i = 2(2)20 {
  2.         replace when = when - 1 if when == `i'
  3. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. label define when_label 1 "beginning after interpolating fo3 holes and fo3 expanded" 3 "greenfield dropped (balance)" 5 "sampling" 7 "missing lnK" 9 "missin
> g lnQ" 11 "missing lnL" 13 "missing lnM" 15 "manager merge" 17 "many foreign changes" 19 "D, D-F kept"

. label values when when_label

. 
. gen type = _n

. forval i = 1(2)20 {
  2.         replace type = 1 if type == `i'
  3. }
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. forval i = 2(2)20 {
  2.         replace type = 2 if type == `i'
  3. }
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. label define type_label 1 "all" 2 "analysis sample ever foreign"

. label values type type_label

. 
. export delimited using "output/foreign_drop", replace
file output/foreign_drop.csv saved

. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/matrix.log
  log type:  text
 closed on:  25 May 2021, 17:46:20
--------------------------------------------------------------------------------------------------------------------------------------------------------------
