--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/matrix.log
  log type:  text
 opened on:  15 May 2021, 11:13:48

. 
. foreach file in balance analysis {
  2.         clear all
  3.         mata: mata matuse "temp/matrix-`file'", replace
  4.         mata: st_matrix("total_`file'", mat_total_`file')
  5. 
.         matrix colnames total_`file' = "foreign" "foreign_3" "foreign_2" "foreign_1" "foreign0" "foreign1" "foreign2" "foreign3" "count" "hole1" "hole2"
  6.         *No option to save row names as variables as svmat - https://www.stata.com/statalist/archive/2007-07/msg00477.html
. 
.         matrix list total_`file'
  7. 
.         svmat total_`file', names(col)
  8.         
.         tempfile `file'
  9.         save ``file''
 10. }
(loading mat_total_balance[14,11])

total_balance[14,11]
       foreign  foreign_3  foreign_2  foreign_1   foreign0   foreign1   foreign2   foreign3      count      hole1      hole2
 r1     647076      12859      17142      25675     119746      99537      85840      74805    8091096     150760      75217
 r2      11409        973       1126       1365       1459       1328       1219       1106      24010        155         28
 r3     264681      12859      16564      23518      53373      43753      37290      32332    7550467     141086      71680
 r4      10703        973       1125       1364       1457       1275       1152       1039      23062        148         27
 r5      37745       1600       1995       2818       6186       4729       3734       3161     463679       3486       1246
 r6      10703        973       1125       1364       1457       1275       1152       1039      23062        148         27
 r7      35478       1544       1863       2473       4083       3708       3299       2967     397251       2954        992
 r8      10703        973       1125       1364       1457       1275       1152       1039      23062        165         45
 r9      34688       1504       1781       2236       3200       3459       3191       2896     380074       3436       1085
r10      10703        973       1125       1364       1457       1275       1152       1039      23062        219         65
r11      33286       1439       1677       1990       2674       3058       2944       2757     346130       4197       1261
r12      10703        973       1125       1364       1457       1275       1152       1039      23062        338        108
r13      33135       1437       1673       1981       2664       3048       2940       2751     343532       4379       1312
r14      10703        973       1125       1364       1457       1275       1152       1039      23062        352        112
number of observations will be reset to 14
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 14
file /srv/sandbox/zavecz/St1192410.000001 saved
(loading mat_total_analysis[6,11])

total_analysis[6,11]
      foreign  foreign_3  foreign_2  foreign_1   foreign0   foreign1   foreign2   foreign3      count      hole1      hole2
r1      30083       1161       1354       1635       2060       2792       2694       2511     299188       3989       1288
r2      10702        971       1122       1361       1454       1274       1149       1038      23025        408        154
r3      28154       1081       1255       1507       1906       2617       2519       2340     295534       3923       1267
r4      10680        967       1118       1357       1451       1272       1147       1036      22979        406        153
r5      11560       1081       1232       1457       1517       1325       1090        920     273785       3596       1157
r6      10680        967       1118       1357       1451       1262       1030        859      19869        344        127
number of observations will be reset to 6
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 6
file /srv/sandbox/zavecz/St1192410.000002 saved

. 
. use `balance', clear

. append using `analysis'

. 
. gen when = _n

. forval i = 2(2)20 {
  2.         replace when = when - 1 if when == `i'
  3. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. label define when_label 1 "beginning after interpolating fo3 holes and fo3 expanded" 3 "greenfield dropped (balance)" 5 "sampling" 7 "missing lnK" 9 "missin
> g lnQ" 11 "missing lnL" 13 "missing lnM" 15 "manager merge" 17 "many foreign changes" 19 "D, D-F kept"

. label values when when_label

. 
. gen type = _n

. forval i = 1(2)20 {
  2.         replace type = 1 if type == `i'
  3. }
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. forval i = 2(2)20 {
  2.         replace type = 2 if type == `i'
  3. }
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. label define type_label 1 "all" 2 "analysis sample ever foreign"

. label values type type_label

. 
. export delimited using "output/foreign_drop", replace
file output/foreign_drop.csv saved

. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/matrix.log
  log type:  text
 closed on:  15 May 2021, 11:13:48
--------------------------------------------------------------------------------------------------------------------------------------------------------------
