--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/matrix.log
  log type:  text
 opened on:  26 May 2021, 17:55:33

. 
. foreach file in balance analysis {
  2.         clear all
  3.         mata: mata matuse "temp/matrix-`file'", replace
  4.         mata: st_matrix("total_`file'", mat_total_`file')
  5. 
.         matrix colnames total_`file' = "foreign" "foreign_3" "foreign_2" "foreign_1" "foreign0" "foreign1" "foreign2" "foreign3" "count" "hole1" "hole2"
  6.         *No option to save row names as variables as svmat - https://www.stata.com/statalist/archive/2007-07/msg00477.html
. 
.         matrix list total_`file'
  7. 
.         svmat total_`file', names(col)
  8.         
.         tempfile `file'
  9.         save ``file''
 10. }
(loading mat_total_balance[14,11])

total_balance[14,11]
       foreign  foreign_3  foreign_2  foreign_1   foreign0   foreign1   foreign2   foreign3      count      hole1      hole2
 r1     660143      13505      17922      26714     122818     100456      86391      75047    8122237     151035      75330
 r2      11894       1022       1156       1399       1498       1309       1085        919      21705        135         24
 r3     271063      13505      17326      24516      54627      44009      37466      32416    7580375     141372      71791
 r4      11894       1022       1156       1399       1498       1309       1085        919      21705        135         24
 r5      39066       1704       2124       3024       6425       4777       3771       3199     479604       3507       1239
 r6      11894       1022       1156       1399       1498       1309       1085        919      21705        135         24
 r7      36716       1626       1956       2615       4252       3759       3337       3009     412996       2966        989
 r8      11894       1022       1156       1399       1498       1309       1085        919      21705        148         38
 r9      35865       1581       1844       2334       3310       3508       3232       2937     395673       3453       1080
r10      11894       1022       1156       1399       1498       1309       1085        919      21705        192         53
r11      34413       1505       1728       2048       2768       3102       2984       2795     360650       3970       1254
r12      11894       1022       1156       1399       1498       1309       1085        919      21705        291         96
r13      34247       1503       1724       2040       2760       3092       2982       2791     357984       4163       1303
r14      11894       1022       1156       1399       1498       1309       1085        919      21705        305        100
number of observations will be reset to 14
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 14
file /srv/sandbox/zavecz/St05719.000001 saved
(loading mat_total_analysis[6,11])

total_analysis[6,11]
      foreign  foreign_3  foreign_2  foreign_1   foreign0   foreign1   foreign2   foreign3      count      hole1      hole2
r1      30718       1188       1362       1647       2096       2796       2697       2518     302563       3760       1277
r2      11896       1022       1156       1399       1498       1309       1085        919      21705        362        138
r3      29168       1116       1275       1530       1956       2639       2540       2364     299371       3707       1260
r4      11896       1022       1156       1399       1498       1309       1085        919      21705        362        138
r5      11897       1116       1254       1482       1532       1310       1088        925     277117       3383       1153
r6      11896       1022       1156       1399       1498       1309       1085        919      21705        362        138
number of observations will be reset to 6
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 6
file /srv/sandbox/zavecz/St05719.000002 saved

. 
. use `balance', clear

. append using `analysis'

. 
. gen when = _n

. forval i = 2(2)20 {
  2.         replace when = when - 1 if when == `i'
  3. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. label define when_label 1 "beginning after interpolating fo3 holes and fo3 expanded" 3 "greenfield dropped (balance)" 5 "sampling" 7 "missing lnK" 9 "missin
> g lnQ" 11 "missing lnL" 13 "missing lnM" 15 "manager merge" 17 "many foreign changes" 19 "D, D-F kept"

. label values when when_label

. 
. gen type = _n

. forval i = 1(2)20 {
  2.         replace type = 1 if type == `i'
  3. }
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. forval i = 2(2)20 {
  2.         replace type = 2 if type == `i'
  3. }
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. label define type_label 1 "all" 2 "analysis sample ever foreign"

. label values type type_label

. 
. export delimited using "output/foreign_drop", replace
file output/foreign_drop.csv saved

. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/matrix.log
  log type:  text
 closed on:  26 May 2021, 17:55:34
--------------------------------------------------------------------------------------------------------------------------------------------------------------
