--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/matrix.log
  log type:  text
 opened on:  22 Apr 2021, 13:47:22

. 
. foreach file in balance analysis {
  2.         clear all
  3.         mata: mata matuse "temp/matrix-`file'", replace
  4.         mata: st_matrix("total_`file'", mat_total_`file')
  5. 
.         matrix colnames total_`file' = "foreign" "foreign_3" "foreign_2" "foreign_1" "foreign0" "foreign1" "foreign2" "foreign3" "count" "hole1" "hole2"
  6.         *No option to save row names as variables as svmat - https://www.stata.com/statalist/archive/2007-07/msg00477.html
. 
.         matrix list total_`file'
  7. 
.         svmat total_`file', names(col)
  8.         
.         tempfile `file'
  9.         save ``file''
 10. }
(loading mat_total_balance[14,11])

total_balance[14,11]
       foreign  foreign_3  foreign_2  foreign_1   foreign0   foreign1   foreign2   foreign3      count      hole1      hole2
 r1     674158      13658      18219      26753     120823     100633      86713      75521    8091096     150760      75217
 r2      11559        958       1119       1363       1459       1334       1229       1119      24010        155         28
 r3      86160       1686       2138       3065      12903       9777       7668       6403     516883       3887       1326
 r4      11559        958       1119       1363       1459       1334       1229       1119      24010        155         28
 r5      86222       1686       2138       3065      12903       9777       7668       6403     516883       3887       1326
 r6      11574        958       1119       1363       1459       1334       1229       1119      24010        155         28
 r7      77068       1626       1987       2678       8145       7471       6622       5939     444861       3321       1073
 r8      11574        958       1119       1363       1459       1334       1229       1119      24010        172         46
 r9      73786       1580       1895       2417       6338       6896       6338       5788     425701       3859       1183
r10      11574        958       1119       1363       1459       1334       1229       1119      24010        227         66
r11      69710       1501       1776       2136       4936       5926       5778       5493     389140       4734       1390
r12      11574        958       1119       1363       1459       1334       1229       1119      24010        350        111
r13      69468       1499       1772       2125       4918       5913       5770       5483     386413       4927       1444
r14      11574        958       1119       1363       1459       1334       1229       1119      24010        364        115
number of observations will be reset to 14
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 14
file /srv/sandbox/zavecz/St3078428.000001 saved
(loading mat_total_analysis[6,11])

total_analysis[6,11]
      foreign  foreign_3  foreign_2  foreign_1   foreign0   foreign1   foreign2   foreign3      count      hole1      hole2
r1      61755       1155       1387       1712       3831       5394       5285       5003     326659       5467       2250
r2      11402        958       1119       1363       1459       1334       1229       1119      24010        566        270
r3      59178       1084       1298       1589       3646       5164       5051       4778     321931       5353       2202
r4      11402        958       1119       1363       1459       1334       1229       1119      24010        566        270
r5      11402       1084       1263       1493       1539       1456       1257       1074     264169       4404       1842
r6      11402        958       1119       1363       1459       1322       1113        944      20781        480        228
number of observations will be reset to 6
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 6
file /srv/sandbox/zavecz/St3078428.000002 saved

. 
. use `balance', clear

. append using `analysis'

. 
. gen when = _n

. forval i = 2(2)20 {
  2.         replace when = when - 1 if when == `i'
  3. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. label define when_label 1 "beginning" 3 "sampling" 5 "fo3 holes" 7 "missing lnK" 9 "missing lnQ" 11 "missing lnL" 13 "missing lnM" 15 "manager merge" 17 "ma
> ny foreign changes" 19 "D, D-F kept"

. label values when when_label

. 
. gen type = _n

. forval i = 1(2)20 {
  2.         replace type = 1 if type == `i'
  3. }
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. forval i = 2(2)20 {
  2.         replace type = 2 if type == `i'
  3. }
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. label define type_label 1 "all" 2 "analysis sample ever foreign"

. label values type type_label

. 
. export delimited using "output/foreign_drop", replace
file output/foreign_drop.csv saved

. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/matrix.log
  log type:  text
 closed on:  22 Apr 2021, 13:47:23
--------------------------------------------------------------------------------------------------------------------------------------------------------------
