--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/matrix.log
  log type:  text
 opened on:   8 Apr 2021, 15:09:59

. 
. foreach file in balance analysis {
  2.         clear all
  3.         mata: mata matuse "temp/matrix-`file'", replace
  4.         mata: st_matrix("total_`file'", mat_total_`file')
  5. 
.         matrix colnames total_`file' = "foreign" "foreign_3" "foreign_2" "foreign_1" "foreign0" "foreign1" "foreign2" "foreign3" "count" "hole1" "hole2"
  6.         *No option to save row names as variables as svmat - https://www.stata.com/statalist/archive/2007-07/msg00477.html
. 
.         matrix list total_`file'
  7. 
.         svmat total_`file', names(col)
  8.         
.         tempfile `file'
  9.         save ``file''
 10. }
(loading mat_total_balance[14,11])

total_balance[14,11]
       foreign  foreign_3  foreign_2  foreign_1   foreign0   foreign1   foreign2   foreign3      count      hole1      hole2
 r1     674158      13658      18219      26753     120823     100633      86713      75521    8091096     150760      75217
 r2      11559        958       1119       1363       1459       1334       1229       1119      24010        155         28
 r3      86160       1686       2138       3065      12903       9777       7668       6403     516883       3887       1326
 r4      11559        958       1119       1363       1459       1334       1229       1119      24010        155         28
 r5      86222       1600       2023       2950      12788       9656       7570       6319     516883       3887       1326
 r6      11574        973       1126       1365       1459       1328       1219       1106      24010        155         28
 r7      77068       1528       1865       2560       8297       7457       6510       5806     444861       3321       1073
 r8      11574        973       1127       1369       1467       1342       1221       1104      24010        172         46
 r9      73786       1480       1773       2289       7741       6780       6055       5538     425701       3859       1183
r10      11574        977       1130       1365       1496       1348       1211       1099      24010        227         66
r11      69710       1404       1649       1999       6599       6040       5648       5314     389140       4734       1390
r12      11574        982       1133       1369       1548       1357       1211       1093      24010        350        111
r13      69468       1399       1640       1988       6591       6028       5635       5302     386413       4927       1444
r14      11574        983       1132       1368       1550       1357       1210       1093      24010        364        115
number of observations will be reset to 14
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 14
file /srv/sandbox/zavecz/St3755182.000001 saved
(loading mat_total_analysis[6,11])

total_analysis[6,11]
      foreign  foreign_3  foreign_2  foreign_1   foreign0   foreign1   foreign2   foreign3      count      hole1      hole2
r1      61755       1056       1228       1612       6184       5562       5184       4810     326659       5467       2250
r2      11402        981       1133       1479       1611       1357       1220       1087      24010        566        270
r3      59178        981       1133       1479       5937       5323       4948       4578     321931       5353       2202
r4      11402        981       1133       1479       1611       1357       1220       1087      24010        566        270
r5      11402        981       1133       1479       1611       1334       1094        901     264169       4404       1842
r6      11402        981       1133       1479       1611       1334       1094        901      20781        480        228
number of observations will be reset to 6
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 6
file /srv/sandbox/zavecz/St3755182.000002 saved

. 
. use `balance', clear

. append using `analysis'

. 
. gen when = _n

. forval i = 2(2)20 {
  2.         replace when = when - 1 if when == `i'
  3. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. label define when_label 1 "beginning" 3 "sampling" 5 "fo3 holes" 7 "missing lnK" 9 "missing lnQ" 11 "missing lnL" 13 "missing lnM" 15 "manager merge" 17 "ma
> ny foreign changes" 19 "D, D-F kept"

. label values when when_label

. 
. gen type = _n

. forval i = 1(2)20 {
  2.         replace type = 1 if type == `i'
  3. }
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. forval i = 2(2)20 {
  2.         replace type = 2 if type == `i'
  3. }
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. label define type_label 1 "all" 2 "analysis sample ever foreign"

. label values type type_label

. 
. export delimited using "output/foreign_drop", replace
(note: file output/foreign_drop.csv not found)
file output/foreign_drop.csv saved

. log close
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/matrix.log
  log type:  text
 closed on:   8 Apr 2021, 15:09:59
--------------------------------------------------------------------------------------------------------------------------------------------------------------
