--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /srv/sandbox/zavecz/dropbox_encrypted/darthmouth/expat-analysis//output/timer.log
  log type:  text
 opened on:  29 Jun 2021, 16:17:33

. 
. use "`here'/temp/analysis_sample.dta", clear

. net install csdid, from ("https://raw.githubusercontent.com/friosavila/csdid_drdid/main/code/") replace
checking csdid consistency and verifying not already installed...
all files already exist and are up to date.

. 
. tab first_year_foreign, missing

first_year_ |
    foreign |      Freq.     Percent        Cum.
------------+-----------------------------------
       1990 |        389        0.14        0.14
       1991 |        403        0.14        0.28
       1992 |      1,519        0.54        0.82
       1993 |      1,188        0.42        1.24
       1994 |        726        0.26        1.50
       1995 |      1,043        0.37        1.87
       1996 |      1,133        0.40        2.27
       1997 |        912        0.32        2.59
       1998 |      1,159        0.41        3.00
       1999 |        932        0.33        3.33
       2000 |        982        0.35        3.68
       2001 |        721        0.26        3.94
       2002 |        579        0.21        4.14
       2003 |        467        0.17        4.31
       2004 |        585        0.21        4.51
       2005 |      1,091        0.39        4.90
       2006 |        887        0.31        5.22
       2007 |      1,341        0.48        5.69
       2008 |      1,375        0.49        6.18
       2009 |        918        0.33        6.50
       2010 |        615        0.22        6.72
       2011 |        498        0.18        6.90
       2012 |        664        0.24        7.13
       2013 |        492        0.17        7.31
       2014 |        362        0.13        7.44
       2015 |        245        0.09        7.52
       2016 |        416        0.15        7.67
       2017 |        465        0.16        7.83
       2018 |        451        0.16        7.99
          . |    259,614       92.01      100.00
------------+-----------------------------------
      Total |    282,172      100.00

. mvencode first_year_foreign, mv(0)
first_year~n: 259614 missing values recoded

. 
. timer on 1

. attgt lnQ if ever_foreign, treatment(foreign) aggregate(e) reps(20) notyet
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQ: event_m2
Estimating lnQ: event_m1
Estimating lnQ: event_1
Estimating lnQ: event_2
Callaway Sant'Anna (2021)

                                                Number of obs     =     12,835

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    event_m2 |   .0289795   .0426584     0.68   0.497    -.0546294    .1125885
    event_m1 |  -.0008678   .0228766    -0.04   0.970    -.0457052    .0439696
     event_1 |   .0947607   .0257939     3.67   0.000     .0442055    .1453158
     event_2 |   .1517204    .039538     3.84   0.000     .0742273    .2292135
------------------------------------------------------------------------------

. timer off 1

. 
. timer on 2

. attgt lnQ if ever_foreign, treatment(foreign) aggregate(att) reps(20) notyet
       panel variable:  frame_id_numeric (unbalanced)
        time variable:  year, 1985 to 2018, but with gaps
                delta:  1 unit
Generating weights...
Estimating lnQ: att
Callaway Sant'Anna (2021)

                                                Number of obs     =     22,031

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         att |   .2411727   .0518672     4.65   0.000     .1395148    .3428307
------------------------------------------------------------------------------

. timer off 2

. 
. timer on 3

. csdid lnQ if ever_foreign, ivar(frame_id_numeric) time(year) gvar(first_year_foreign) method(reg) agg(event) notyet saverif("csdid_example") wboot replace
File csdid_example.dta will be used to save all RIFs
Panel is not balanced
Will use observations with Pair balanced (observed at t0 and t1)
..................................................
..................................................
..................................................
..................................................
..................................................
..................................................
..................................................
..................................................
..................................................
..................................................
..................................................
..................................................
..................................................
..................................................
..................................................
..................................................
..................................................
..................................................
..................................................
.......(note: file csdid_example.dta not found)
file csdid_example.dta saved
estimates post: matrix has missing values
r(504);

end of do-file

r(504);

