-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Documents/workspace/expat/output/variables.log
  log type:  text
 opened on:   8 Nov 2018, 11:42:04

. 
. *Balance sheet-tel kapcsolás
. use input/balance-small/balance-sheet-1992-2016-small, clear

. drop if frame_id==""
(0 observations deleted)

. 
. merge 1:1 frame_id year using temp/firm_ceo_panel, keep(master match)
(note: variable frame_id was str10, now str12 to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                       813,639
        from master                   813,639  (_merge==1)
        from using                          0  (_merge==2)

    matched                         6,762,670  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. 
. egen id=group(frame_id)

. xtset id year   
       panel variable:  id (unbalanced)
        time variable:  year, 1992 to 2016, but with gaps
                delta:  1 unit

. 
. *Expat CEO létezik változó készítése
. gen byte expat = N_expat>0&!missing(N_expat)

. ren fo3 foreign

. 
. * time invariant vars
. foreach X of var expat foreign {
  2.         egen first_year_`X' = min(cond(`X'==1,year,.)), by(frame_id)
  3.         egen ever_`X' = max(`X'==1), by(frame_id)
  4. }
(5899209 missing values generated)
(6631035 missing values generated)

. 
. *foreign átalakítása 
. recode foreign (.=0)
(foreign: 6976341 changes made)

. 
. *foreign-at többször váltók kidobása
. xtset id year
       panel variable:  id (unbalanced)
        time variable:  year, 1992 to 2016, but with gaps
                delta:  1 unit

. gen foreign_change=1 if l1.foreign==0&foreign==1
(7,549,303 missing values generated)

. gen foreign_change_rev=1 if l1.foreign==1&foreign==0
(7,516,381 missing values generated)

. bys frame_id: egen foreign_change_total=total(foreign_change)

. bys frame_id: egen foreign_change_rev_total=total(foreign_change_rev)

. drop if foreign_change_total>1|foreign_change_rev_total>1
(78,784 observations deleted)

. scalar dropped_too_many_foreign_change = r(N_drop)

. drop foreign_change foreign_change_rev foreign_change_total foreign_change_re
> v_total

. 
. 
. *foreign visszahúzása expatba, valaha expat-tal, de soha foreign-mal bíró cég
> ek teljes kidobása
. replace foreign=1 if first_year_expat<=year&foreign==0&ever_foreign==1
(143,660 real changes made)

. drop first_year_foreign

. egen first_year_foreign = min(cond(foreign==1,year,.)), by(frame_id)
(6631035 missing values generated)

. 
. drop if ever_expat==1 & ever_foreign==0
(1,043,624 observations deleted)

. scalar dropped_do3_expat_firmyears = r(N_drop)

. 
. 
. * newly arriving CEOs
. local T 4

. gen age_since_foreign = year - first_year_foreign
(5,587,411 missing values generated)

. foreach X in domestic expat {
  2.         gen byte new_`X' = tenure_`X' <=`T'
  3.         * exclude founders joining the firm in years [0,1]
.         replace new_`X' = 0 if tenure_`X' >= firm_age-1
  4.         
.         * new managers at foreign firms
.         gen byte fnew_`X' = new_`X' & foreign==1
  5.         * only include managers joining in years [-1,...) since foreign
.         replace fnew_`X' = 0 if tenure_`X' > age_since_foreign+1
  6. }
(2,372,184 real changes made)
(1,081 real changes made)
(193,512 real changes made)
(87 real changes made)

. gen fold_expat = expat==1 & fnew_expat==0

. gen byte new = new_domestic | new_expat

. gen byte fnew = fnew_domestic | fnew_expat

. 
. *foreign_switch interakció létrehozása
. gen byte foreign_new = foreign & new

. 
. *Greenfield - foreign húzás után, de a sampling előtt
. bys frame_id (year): gen relative_year=_n

. gen foreign_infirst=1 if relative_year==1&foreign==1
(6,362,493 missing values generated)

. bys frame_id: egen byte greenfield=max(foreign_infirst)
(5754781 missing values generated)

. 
. recode greenfield (.=0)
(greenfield: 5754781 changes made)

. 
. 
. *Függő változók készítése
. gen lnL=ln(emp)
(2,144,251 missing values generated)

. gen lnK=ln(final_netgep)
(3,421,060 missing values generated)

. gen lnM=ln(ranyag)
(504,576 missing values generated)

. gen lnQ=ln(sales)
(1,062,396 missing values generated)

. gen lnQL=lnQ-lnL
(2,356,196 missing values generated)

. gen lnKL=lnK-lnL
(3,919,149 missing values generated)

. gen byte exporter = export>0&export!=.

. replace exporter=0 if export==.
(0 real changes made)

. 
. 
. *Industry_year dummy
. egen industry_year = group(teaor08_2d year)
(181 missing values generated)

. 
. 
. *Industry dummy
. gen byte ind = inlist(teaor08_1d,"B","C","D","E")

. egen ind_year=group(ind year)

. 
. 
. *Manufacaturing dummy
. gen manufacturing=0

. replace manufacturing=1 if teaor08_1d=="C"
(675,341 real changes made)

. 
. 
. *Átlagos létszám változó
. bys frame_id: egen avg_emp = mean(emp)
(49156 missing values generated)

. 
. 
. *Életkor változó
. gen age=year-foundyear

. gen age_cat=.
(6,453,901 missing values generated)

. replace age_cat=1 if age==0
(655,767 real changes made)

. replace age_cat=2 if age==1
(662,543 real changes made)

. replace age_cat=3 if age==2
(604,571 real changes made)

. replace age_cat=4 if age>=3&age<=5
(1,470,082 real changes made)

. replace age_cat=5 if age>=6&age<=8
(1,012,470 real changes made)

. replace age_cat=6 if age>8
(2,048,468 real changes made)

. 
. 
. *Mintavétel létszám és a K-n kvül a többi függő változó nem missing alapján
. local sample (avg_emp>=20)&!missing(lnL,lnQ,exporter)

. keep if `sample'
(6,185,662 observations deleted)

. scalar dropped_size_or_missing = r(N_drop)

. 
. 
. *Pénzügyi szektorban működő vállalatok kiszűrése
. bys frame_id: egen industry_mode=mode(teaor08_2d)
Warning: at least one group contains all missing values or contains multiple
modes.  Generating missing values for the mode of these groups.  Use the
missing, maxmode, minmode, or nummode() options to control this behavior.
(4434 missing values generated)

. drop if industry_mode==64|industry_mode==65|industry_mode==66
(3,742 observations deleted)

. scalar dropped_finance = r(N_drop)

. 
. 
. ** do stats here
. tempvar tag

. foreach X of var foreign new expat new_expat fnew fnew_expat {
  2.         count if `X'==1
  3.         scalar N_it_`X' = r(N)
  4.         
.         * by firms
.         egen `tag' = tag(frame_id `X')
  5.         count if `X'==1 & `tag'==1
  6.         scalar N_i_`X' = r(N)
  7.         drop `tag'
  8. }
  69,074
  6,212
  74,017
  11,669
  39,505
  4,349
  18,527
  2,936
  31,569
  4,156
  18,512
  2,934

. 
. 
. *Firm_tag
. egen firm_tag=tag(frame_id)

. 
. 
. *Investment változó készítése
. areg lnK, a(industry_year)

Linear regression, absorbing indicators         Number of obs     =    234,457
Absorbed variable: industry_year                No. of categories =      2,051
                                                F(   0, 232406)   =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2430
                                                Adj R-squared     =     0.2363
                                                Root MSE          =     1.8565

------------------------------------------------------------------------------
         lnK |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |   10.13228   .0038342  2642.61   0.000     10.12477     10.1398
------------------------------------------------------------------------------
F test of absorbed indicators: F(2050, 232406) = 36.382       Prob > F = 0.000

. predict res, res
(30,040 missing values generated)

. sum res, d

                          Residuals
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -5.24369      -11.76828
 5%    -3.185375      -11.20747
10%    -2.262696      -10.93628       Obs             234,457
25%    -1.030553      -10.86215       Sum of Wgt.     234,457

50%     .0922763                      Mean          -3.06e-10
                        Largest       Std. Dev.      1.848411
75%     1.137802       7.586168
90%     2.164308       7.857393       Variance       3.416625
95%     2.871382       9.105893       Skewness      -.3944185
99%      4.32811       9.630323       Kurtosis       4.325881

. 
. 
. xtset id year
       panel variable:  id (unbalanced)
        time variable:  year, 1992 to 2016, but with gaps
                delta:  1 unit

. g d_res=res-l1.res
(56,779 missing values generated)

. g inv=0

. 
. 
. replace inv=1 if d_res>=0.1&d_res!=.
(68,654 real changes made)

. replace inv=-1 if d_res<=-0.1&d_res!=.
(100,283 real changes made)

. replace inv=. if d_res==.
(56,779 real changes made, 56,779 to missing)

. 
. 
. *Teljes minta elmentése a kontrollokkal
. compress
  variable emp was long now int
  variable N_domestic was int now byte
  variable first_year_expat was float now int
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable first_year_foreign was float now int
  variable age_since_foreign was float now byte
  variable fold_expat was float now byte
  variable relative_year was float now byte
  variable foreign_infirst was float now byte
  variable industry_year was float now int
  variable ind_year was float now byte
  variable manufacturing was float now byte
  variable age was float now int
  variable age_cat was float now byte
  variable inv was float now byte
  variable jetok was double now long
  variable ranyag was double now long
  variable wbill was double now long
  variable final_netgep was double now long
  variable frame_id was str12 now str10
  (15,605,323 bytes saved)

. save temp/analysis_sample, replace
file temp/analysis_sample.dta saved

. save_all_to_json

. log close
      name:  <unnamed>
       log:  /Users/koren/Documents/workspace/expat/output/variables.log
  log type:  text
 closed on:   8 Nov 2018, 11:44:18
-------------------------------------------------------------------------------
