-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresors/Data3/projects/expat-analysis/output/variables.log
  log type:  text
 opened on:  20 Nov 2018, 19:26:08

. 
. use temp/firm_ceo_panel

. * drop very large firms
. drop if N_ceos>10
(5,967 observations deleted)

. 
. scalar T1 = 1989

. scalar T2 = 2016

. expand T2-T1+1
(1,305,180 observations created)

. bys frame_id manager_id: gen year = _n-1+T1

. 
. tempfile expand

. save `expand', replace
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//S_70963.000001 not found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//S_70963.000001 saved

. 
. merge m:1 frame_id year using temp/balance-small, nogen keep(match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           804,018  
    -----------------------------------------

. codebook frame_id

-----------------------------------------------------------------------------------------------
frame_id                                                                            (unlabeled)
-----------------------------------------------------------------------------------------------

                  type:  string (str10)

         unique values:  15,128                   missing "":  0/804,018

              examples:  "ft10364354"
                         "ft10741038"
                         "ft11107967"
                         "ft12098477"

. 
. 
. * time invariant vars
. foreach X of var expat foreign {
  2.         egen first_year_`X' = min(cond(`X'==1,year,.)), by(frame_id)
  3.         egen ever_`X' = max(`X'==1), by(frame_id)
  4. }
(393370 missing values generated)
(453243 missing values generated)

. 
. gen tenure_foreign = year-first_year_foreign
(453,243 missing values generated)

. 
. 
. *foreign visszahúzása expatba, valaha expat-tal, de soha foreign-mal bíró cégek teljes kidobá
> sa
. replace foreign=1 if first_year_expat<=year&foreign==0&ever_foreign==1
(62,438 real changes made)

. drop first_year_foreign

. egen first_year_foreign = min(cond(foreign==1,year,.)), by(frame_id)
(453243 missing values generated)

. 
. drop if ever_expat==1 & ever_foreign==0
(115,864 observations deleted)

. scalar dropped_do3_expat_firmyears = r(N_drop)

. 
. * spell relation dummies
. gen byte before = year<enter_year

. gen byte during = year>=enter_year & year<=first_exit_year

. gen byte after = year>first_exit_year

. gen tenure = year-enter_year

. 
. * newly arriving CEOs
. local T 4

. gen byte domestic = (expat==0)

. foreach X in domestic expat {
  2.         gen byte new_`X' = (tenure <=`T') & (tenure>=0) & (`X'==1)
  3.         
.         * new managers at foreign firms
.         gen byte fnew_`X' = new_`X' & foreign==1
  4.         * only include managers joining in years [-1,...) since foreign
.         replace fnew_`X' = 0 if tenure > tenure_foreign+1
  5. 
.         foreach Y of var tenure before during after {
  6.                 gen `Y'_`X' = (`X'==1)*`Y'
  7.         }
  8. }
(3,700 real changes made)
(1,375 real changes made)

. gen fold_expat = expat==1 & tenure>`T'

. gen byte new = new_domestic | new_expat

. gen byte fnew = fnew_domestic | fnew_expat

. 
. *foreign_switch interakció létrehozása
. gen byte foreign_new = foreign & new

. 
. 
. ** do stats here
. tempvar tag

. foreach X of var foreign new expat new_expat fnew fnew_expat {
  2.         count if `X'==1
  3.         scalar N_it_`X' = r(N)
  4.         
.         * by firms
.         egen `tag' = tag(frame_id `X')
  5.         count if `X'==1 & `tag'==1
  6.         scalar N_i_`X' = r(N)
  7.         drop `tag'
  8. }
  320,801
  4,629
  163,032
  13,186
  173,656
  3,094
  41,269
  3,091
  70,451
  4,116
  39,894
  2,974

. 
. 
. *Firm_tag
. egen firm_tag=tag(frame_id)

. 
. 
. *Investment változó készítése
. areg lnK, a(industry_year)

Linear regression, absorbing indicators         Number of obs     =    633,552
                                                F(   0, 631496)   =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3280
                                                Adj R-squared     =     0.3258
                                                Root MSE          =     2.0130

------------------------------------------------------------------------------
         lnK |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |   11.11665    .002529  4395.74   0.000     11.11169    11.12161
-------------+----------------------------------------------------------------
industry_y~r |   F(2055, 631496) =    150.005   0.000        (2056 categories)

. predict res, res
(54,602 missing values generated)

. sum res, d

                          Residuals
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -5.61637      -13.78567
 5%    -3.441709      -13.78567
10%     -2.48798       -12.6702       Obs             633,552
25%    -1.158808       -12.6702       Sum of Wgt.     633,552

50%     .0811902                      Mean           1.23e-09
                        Largest       Std. Dev.      2.009685
75%     1.281887       8.841757
90%     2.441539       8.841757       Variance       4.038835
95%     3.122231       8.841757       Skewness      -.4021811
99%      4.57371       8.841757       Kurtosis       4.046121

. 
. egen firm_person = group(frame_id manager_id)

. 
. xtset firm_person year
       panel variable:  firm_person (unbalanced)
        time variable:  year, 1992 to 2016, but with gaps
                delta:  1 unit

. g d_res=res-l1.res
(113,176 missing values generated)

. g inv=0

. 
. 
. replace inv=1 if d_res>=0.1&d_res!=.
(191,098 real changes made)

. replace inv=-1 if d_res<=-0.1&d_res!=.
(266,146 real changes made)

. replace inv=. if d_res==.
(113,176 real changes made, 113,176 to missing)

. 
. 
. *Teljes minta elmentése a kontrollokkal
. compress
  variable year was float now int
  variable emp was long now int
  variable id was float now int
  variable relative_year was float now byte
  variable foreign_infirst was float now byte
  variable industry_year was float now int
  variable ind_year was float now byte
  variable manufacturing was float now byte
  variable age was float now int
  variable age_cat was float now byte
  variable first_year_expat was float now int
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable tenure_foreign was float now byte
  variable first_year_foreign was float now int
  variable tenure was float now byte
  variable tenure_domestic was float now byte
  variable before_domestic was float now byte
  variable during_domestic was float now byte
  variable after_domestic was float now byte
  variable tenure_expat was float now byte
  variable before_expat was float now byte
  variable during_expat was float now byte
  variable after_expat was float now byte
  variable fold_expat was float now byte
  variable inv was float now byte
  variable jetok was double now long
  variable wbill was double now long
  variable final_netgep was double now long
  (57,116,782 bytes saved)

. save temp/analysis_sample, replace
file temp/analysis_sample.dta saved

. save_all_to_json

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresors/Data3/projects/expat-analysis/output/variables.log
  log type:  text
 closed on:  20 Nov 2018, 19:27:08
-----------------------------------------------------------------------------------------------
