----------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Google Drive/Research/expat/research_design/talk/output/variables.log
  log type:  text
 opened on:  25 Apr 2019, 16:21:01

. 
. use temp/firm_ceo_panel

. drop _*

. 
. scalar T1 = 1980

. scalar T2 = 2016

. expand T2-T1+1
(3,002,760 observations created)

. bys frame_id manager_id: gen year = _n-1+T1

. 
. tempfile expand

. save `expand', replace
(note: file /var/folders/f4/7drmhl1d5kj3wp1r33jvx32m0000gn/T//S_04013.000001 not found)
file /var/folders/f4/7drmhl1d5kj3wp1r33jvx32m0000gn/T//S_04013.000001 saved

. 
. merge m:1 frame_id year using temp/balance-small, nogen keep(match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,304,217  
    -----------------------------------------

. merge m:1 frame_id year using temp/N_ceos, nogen keep(match)
(note: variable frame_id was str10, now str12 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         1,128,009  
    -----------------------------------------

. * drop very large firms
. egen fp_tag = tag(frame_id manager_id ) 

. egen total_CEOs = sum(fp_tag ), by(frame_id )

. tab total_CEOs 

 total_CEOs |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     43,432        3.85        3.85
          2 |    118,508       10.51       14.36
          3 |    140,718       12.47       26.83
          4 |    128,936       11.43       38.26
          5 |    106,690        9.46       47.72
          6 |     92,616        8.21       55.93
          7 |     78,715        6.98       62.91
          8 |     58,312        5.17       68.08
          9 |     47,718        4.23       72.31
         10 |     42,850        3.80       76.11
         11 |     36,179        3.21       79.31
         12 |     31,536        2.80       82.11
         13 |     23,738        2.10       84.21
         14 |     22,540        2.00       86.21
         15 |     16,200        1.44       87.65
         16 |     17,504        1.55       89.20
         17 |     13,294        1.18       90.38
         18 |     11,286        1.00       91.38
         19 |     12,046        1.07       92.45
         20 |      6,420        0.57       93.02
         21 |      6,720        0.60       93.61
         22 |      3,850        0.34       93.95
         23 |      6,670        0.59       94.55
         24 |      6,864        0.61       95.15
         25 |      2,650        0.23       95.39
         26 |      1,560        0.14       95.53
         27 |      2,376        0.21       95.74
         28 |      1,400        0.12       95.86
         29 |      3,509        0.31       96.17
         30 |      1,890        0.17       96.34
         31 |      3,627        0.32       96.66
         32 |      1,216        0.11       96.77
         33 |      1,584        0.14       96.91
         34 |      2,890        0.26       97.17
         35 |      1,715        0.15       97.32
         36 |      1,332        0.12       97.44
         37 |      1,480        0.13       97.57
         38 |      1,482        0.13       97.70
         39 |        819        0.07       97.77
         41 |      1,025        0.09       97.86
         42 |      3,696        0.33       98.19
         43 |      1,290        0.11       98.30
         45 |      1,035        0.09       98.40
         46 |      1,150        0.10       98.50
         49 |      1,176        0.10       98.60
         51 |      1,122        0.10       98.70
         52 |        780        0.07       98.77
         55 |      1,210        0.11       98.88
         56 |      1,008        0.09       98.97
         64 |      2,240        0.20       99.17
         67 |        268        0.02       99.19
         80 |      1,760        0.16       99.35
         84 |      2,016        0.18       99.52
         87 |      2,175        0.19       99.72
        177 |      3,186        0.28      100.00
------------+-----------------------------------
      Total |  1,128,009      100.00

. 
. drop if total_CEOs>15
(139,321 observations deleted)

. scalar dropped_too_many_CEOs = r(N_drop)

. 
. gen ceo_span = first_exit_year-enter_year+1

. tab ceo_span

   ceo_span |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    191,559       19.38       19.38
          2 |    121,849       12.32       31.70
          3 |     93,925        9.50       41.20
          4 |     78,740        7.96       49.16
          5 |     75,226        7.61       56.77
          6 |     52,708        5.33       62.10
          7 |     44,659        4.52       66.62
          8 |     38,625        3.91       70.53
          9 |     37,403        3.78       74.31
         10 |     31,210        3.16       77.47
         11 |     25,129        2.54       80.01
         12 |     22,491        2.27       82.28
         13 |     22,448        2.27       84.55
         14 |     17,965        1.82       86.37
         15 |     16,274        1.65       88.02
         16 |     14,333        1.45       89.47
         17 |     15,158        1.53       91.00
         18 |     11,590        1.17       92.17
         19 |     11,645        1.18       93.35
         20 |     11,020        1.11       94.46
         21 |      9,833        0.99       95.46
         22 |      7,727        0.78       96.24
         23 |      7,959        0.81       97.05
         24 |      7,356        0.74       97.79
         25 |      8,255        0.83       98.62
         26 |      5,521        0.56       99.18
         27 |      3,644        0.37       99.55
         28 |        810        0.08       99.63
         29 |        137        0.01       99.65
         30 |         63        0.01       99.65
         31 |        112        0.01       99.66
         32 |        116        0.01       99.68
         33 |        207        0.02       99.70
         34 |         71        0.01       99.70
         35 |         57        0.01       99.71
         36 |         93        0.01       99.72
         37 |        222        0.02       99.74
         38 |        109        0.01       99.75
         39 |        131        0.01       99.77
         40 |        195        0.02       99.79
         41 |        238        0.02       99.81
         42 |        486        0.05       99.86
         43 |        358        0.04       99.90
         44 |        210        0.02       99.92
         45 |        160        0.02       99.93
         46 |         84        0.01       99.94
         47 |         52        0.01       99.95
         48 |         54        0.01       99.95
         49 |         61        0.01       99.96
         50 |         49        0.00       99.96
         51 |         42        0.00       99.97
         53 |         66        0.01       99.97
         55 |         25        0.00       99.98
         56 |         18        0.00       99.98
         58 |        140        0.01       99.99
         61 |         24        0.00      100.00
         64 |         46        0.00      100.00
------------+-----------------------------------
      Total |    988,688      100.00

. egen industry_ceo_span = median(ceo_span), by(industry_mode)

. tab industry_ceo_span

industry_ce |
     o_span |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |      5,820        0.59        0.59
          3 |     44,517        4.50        5.09
          4 |    350,282       35.43       40.52
          5 |    426,175       43.11       83.63
          6 |    161,894       16.37      100.00
------------+-----------------------------------
      Total |    988,688      100.00

. gen byte slow = industry_ceo_span>4

. 
. tab industry_mode if slow

industry_mo |
         de |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     80,239       13.64       13.64
          5 |        481        0.08       13.73
          8 |      3,364        0.57       14.30
         13 |     12,014        2.04       16.34
         14 |     18,949        3.22       19.56
         15 |      8,108        1.38       20.94
         16 |     11,850        2.02       22.96
         18 |      9,482        1.61       24.57
         25 |     51,784        8.81       33.38
         27 |     13,072        2.22       35.60
         28 |     30,126        5.12       40.72
         31 |      9,206        1.57       42.29
         32 |      4,346        0.74       43.03
         33 |      1,853        0.32       43.34
         41 |     27,430        4.66       48.01
         42 |     22,215        3.78       51.78
         43 |     25,911        4.41       56.19
         45 |     30,706        5.22       61.41
         46 |     93,474       15.90       77.31
         47 |     56,689        9.64       86.95
         49 |     22,836        3.88       90.83
         56 |     18,830        3.20       94.03
         71 |     17,376        2.95       96.99
         74 |      2,459        0.42       97.40
         81 |     12,056        2.05       99.45
         87 |      1,700        0.29       99.74
         95 |      1,513        0.26      100.00
------------+-----------------------------------
      Total |    588,069      100.00

. 
. * create sample splits based on data in founder years
. local continuous lnL lnKL lnQL

. local dummy exporter slow

. foreach X of var `continuous' {
  2.         egen mean_`X' = mean(cond(founder==1 & year<=first_exit_year,`X',.)), by(frame_id)
  3.         egen median_`X' = median(mean_`X'), by(industry_mode)
  4.         gen byte H_`X' = mean_`X' > median_`X'
  5.         tab H_`X'
  6. }
(199055 missing values generated)
(75 missing values generated)

      H_lnL |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    398,666       40.32       40.32
          1 |    590,022       59.68      100.00
------------+-----------------------------------
      Total |    988,688      100.00
(199055 missing values generated)
(75 missing values generated)

     H_lnKL |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    398,726       40.33       40.33
          1 |    589,962       59.67      100.00
------------+-----------------------------------
      Total |    988,688      100.00
(200926 missing values generated)
(75 missing values generated)

     H_lnQL |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    399,873       40.44       40.44
          1 |    588,815       59.56      100.00
------------+-----------------------------------
      Total |    988,688      100.00

. foreach X of var `dummy' {
  2.         egen mean_`X' = mean(cond(founder==1 & year<=first_exit_year,`X',.)), by(frame_id)
  3.         gen byte H_`X' = mean_`X' > 0.5
  4.         tab H_`X'
  5. }
(184291 missing values generated)

 H_exporter |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    455,815       46.10       46.10
          1 |    532,873       53.90      100.00
------------+-----------------------------------
      Total |    988,688      100.00
(184291 missing values generated)

     H_slow |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    330,910       33.47       33.47
          1 |    657,778       66.53      100.00
------------+-----------------------------------
      Total |    988,688      100.00

. gen byte H_early = enter_year<=2000

. gen byte H_young_firm = age<=10

. 
. codebook frame_id

----------------------------------------------------------------------------------------------------------------------
frame_id                                                                                                   (unlabeled)
----------------------------------------------------------------------------------------------------------------------

                  type:  string (str12), but longest is str10

         unique values:  23,543                   missing "":  0/988,688

              examples:  "ft10460780"
                         "ft10816583"
                         "ft11267377"
                         "ft12391299"

. 
. *expat before 1990
. replace expat=0 if enter_year<1990
(3,057 real changes made)

. 
. * time invariant vars
. foreach X of var expat foreign {
  2.         egen ever_`X' = max(`X'==1), by(frame_id)
  3. }

. 
. egen first_year_expat_original = min(cond(expat==1,enter_year,.)), by(frame_id)
(648606 missing values generated)

. egen first_year_foreign_original = min(cond(foreign==1,year,.)), by(frame_id)
(628489 missing values generated)

. 
. *foreign visszahúzása expatba, valaha expat-tal, de soha foreign-mal bíró cégek teljes kidobása
. replace foreign=1 if (first_year_expat_original==(year-1)|first_year_expat_original==year)&foreign==0&ever_foreign==
> 1
(2,186 real changes made)

. egen first_year_foreign = min(cond(foreign==1,year,.)), by(frame_id)
(628489 missing values generated)

. 
. clonevar enter_year_original=enter_year

. replace enter_year=first_year_foreign_original if ((enter_year_original-2)<first_year_foreign_original)&expat==1&eve
> r_foreign==1
(21,661 real changes made)

. egen first_year_expat = min(cond(expat==1,enter_year,.)), by(frame_id)
(648606 missing values generated)

. 
. gen tenure_foreign = year-first_year_foreign
(628,489 missing values generated)

. 
. drop if ever_expat==1 & ever_foreign==0
(59,551 observations deleted)

. scalar dropped_do3_expat_firmyears = r(N_drop)

. 
. egen enter_year_min=min(enter_year), by(frame_id)

. replace foundyear=enter_year_min if foundyear>enter_year_min
(6,331 real changes made)

. drop enter_year_min

. 
. replace first_exit_year=enter_year if enter_year>first_exit_year
(3,564 real changes made)

. 
. * spell relation dummies
. gen byte before = year<enter_year

. gen byte during = year>=enter_year & year<=first_exit_year

. gen byte after = year>first_exit_year

. gen tenure = year-enter_year

. 
. * spell-to-spell transition
. gen byte DD = (lag_expat==0)&(expat==0)

. gen byte DE = (lag_expat==0)&(expat==1)

. gen byte ED = (lag_expat==1)&(expat==0)

. gen byte EE = (lag_expat==1)&(expat==1)

. 
. * newly arriving CEOs
. local T 4

. gen byte domestic = (expat==0)

. foreach X of var domestic expat DD DE ED EE {
  2.         gen byte new_`X' = (tenure <=`T') & (tenure>=0) & (`X'==1)
  3.         
.         * new managers at foreign firms
.         gen byte fnew_`X' = new_`X' & foreign==1
  4.         * only include managers joining in years [-1,...) since foreign
.         replace fnew_`X' = 0 if tenure > tenure_foreign+1
  5. 
.         foreach Y of var tenure before during after {
  6.                 gen `Y'_`X' = (`X'==1)*`Y'
  7.                 foreach Z of var H_* {
  8.                         gen `Y'_`X'_`Z' = (`X'==1)*`Y'*(`Z'==1)
  9.                 }
 10.         }
 11. }
(2,946 real changes made)
(0 real changes made)
(783 real changes made)
(0 real changes made)
(72 real changes made)
(0 real changes made)

. gen fold_expat = expat==1 & tenure>`T'

. gen byte new = new_domestic | new_expat

. gen byte fnew = fnew_domestic | fnew_expat

. 
. *foreign_switch interakció létrehozása
. gen byte foreign_new = foreign & new

. 
. ** do stats here
. tempvar tag

. foreach X of var foreign new expat new_expat fnew fnew_expat {
  2.         count if `X'==1
  3.         scalar N_it_`X' = r(N)
  4.         
.         * by firms
.         egen `tag' = tag(frame_id `X')
  5.         count if `X'==1 & `tag'==1
  6.         scalar N_i_`X' = r(N)
  7.         drop `tag'
  8. }
  268,244
  5,362
  275,126
  22,306
  156,030
  3,429
  45,212
  3,429
  75,613
  4,954
  41,339
  3,427

. 
. *Firm_tag
. egen firm_tag=tag(frame_id)

. egen firm_person = group(frame_id manager_id)

. 
. *Foreign hire
. gen byte foreign_hire = 1 if first_year_foreign <= enter_year
(626,900 missing values generated)

. recode foreign_hire (. = 0)
(foreign_hire: 626900 changes made)

. gen during_foreign = during*foreign_hire

. 
. * zero out all treatment dummies for founders. they are alwyas just control
. foreach X of var before during after DD DE ED EE {
  2.         replace `X' = 0 if founder==1
  3. }
(473 real changes made)
(177,927 real changes made)
(135,634 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. *Cégév szerinti szűrés
. drop if missing(lnL,lnQ,exporter)
(16,579 observations deleted)

. 
. *Tfp
. tab year, gen(year_d)

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1992 |     14,824        1.62        1.62
       1993 |     22,518        2.47        4.09
       1994 |     26,192        2.87        6.96
       1995 |     28,143        3.08       10.05
       1996 |     30,172        3.31       13.35
       1997 |     32,807        3.60       16.95
       1998 |     34,764        3.81       20.76
       1999 |     35,847        3.93       24.69
       2000 |     37,558        4.12       28.80
       2001 |     39,103        4.28       33.09
       2002 |     39,862        4.37       37.45
       2003 |     40,175        4.40       41.86
       2004 |     42,604        4.67       46.53
       2005 |     43,466        4.76       51.29
       2006 |     43,850        4.81       56.09
       2007 |     43,175        4.73       60.82
       2008 |     43,715        4.79       65.62
       2009 |     43,133        4.73       70.34
       2010 |     42,884        4.70       75.04
       2011 |     42,178        4.62       79.66
       2012 |     41,083        4.50       84.16
       2013 |     37,047        4.06       88.22
       2014 |     36,798        4.03       92.26
       2015 |     36,173        3.96       96.22
       2016 |     34,487        3.78      100.00
------------+-----------------------------------
      Total |    912,558      100.00

. egen firmyear_tag=tag(frame_id year)

. bysort frame_id: egen teaor_mode = mode(teaor08_2d), maxmode

. recode teaor_mode (6 75 = .)
(teaor_mode: 245 changes made)

. gen lnVA = ln(sales-ranyag)
(55,532 missing values generated)

. 
. levelsof teaor_mode, local(levels)
1 2 3 5 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 35 36 37 38 39 41 42 43 45 46 47
>  49 50 51 52 53 55 56 58 59 60 61 62 63 64 66 68 69 70 71 72 73 74 77 78 79 80 81 82 84 85 86 87 88 90 91 92 93 94 9
> 5 96

. foreach l of local levels {
  2.   disp `l'
  3.   qui prodest lnVA if teaor_mode == `l' & firmyear_tag, ///
>             free(lnL) state(lnK) proxy(lnM)  ///
>             met(lp) va control (year_d*) id(firm_person) t(year) fsres(tfp_lp_`l')
  4. }
1
2
3
5
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
35
36
37
38
39
41
42
43
45
46
47
49
50
51
52
53
55
56
58
59
60
61
62
63
64
66
68
69
70
71
72
73
74
77
78
79
80
81
82
84
85
86
87
88
90
91
92
93
94
95
96

. 
. 
. gen  x =  .
(912,558 missing values generated)

. levelsof teaor_mode, local(levels)
1 2 3 5 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 35 36 37 38 39 41 42 43 45 46 47
>  49 50 51 52 53 55 56 58 59 60 61 62 63 64 66 68 69 70 71 72 73 74 77 78 79 80 81 82 84 85 86 87 88 90 91 92 93 94 9
> 5 96

. foreach l of local levels {
  2. 
.                 replace x = tfp_lp_`l' if x == .
  3. }
(13,768 real changes made)
(329 real changes made)
(193 real changes made)
(178 real changes made)
(26 real changes made)
(671 real changes made)
(105 real changes made)
(12,212 real changes made)
(1,232 real changes made)
(86 real changes made)
(2,889 real changes made)
(5,518 real changes made)
(2,335 real changes made)
(3,457 real changes made)
(1,467 real changes made)
(2,484 real changes made)
(90 real changes made)
(1,723 real changes made)
(517 real changes made)
(5,924 real changes made)
(2,984 real changes made)
(1,300 real changes made)
(13,921 real changes made)
(4,201 real changes made)
(3,086 real changes made)
(7,326 real changes made)
(2,356 real changes made)
(398 real changes made)
(2,743 real changes made)
(1,016 real changes made)
(658 real changes made)
(1,637 real changes made)
(1,748 real changes made)
(402 real changes made)
(2,120 real changes made)
(560 real changes made)
(7,884 real changes made)
(6,082 real changes made)
(8,423 real changes made)
(8,224 real changes made)
(20,987 real changes made)
(13,697 real changes made)
(6,737 real changes made)
(101 real changes made)
(100 real changes made)
(3,608 real changes made)
(377 real changes made)
(3,065 real changes made)
(5,756 real changes made)
(1,635 real changes made)
(373 real changes made)
(170 real changes made)
(722 real changes made)
(2,939 real changes made)
(648 real changes made)
(51 real changes made)
(7 real changes made)
(5,715 real changes made)
(944 real changes made)
(1,821 real changes made)
(3,730 real changes made)
(877 real changes made)
(1,176 real changes made)
(644 real changes made)
(822 real changes made)
(2,471 real changes made)
(658 real changes made)
(2,691 real changes made)
(4,122 real changes made)
(2,176 real changes made)
(12 real changes made)
(1,071 real changes made)
(1,601 real changes made)
(374 real changes made)
(437 real changes made)
(112 real changes made)
(218 real changes made)
(363 real changes made)
(631 real changes made)
(150 real changes made)
(535 real changes made)
(1,630 real changes made)

. 
. bysort frame_id year: egen  tfp_lp = max(x)
(56056 missing values generated)

. 
. drop tfp_lp_* x year_d*

. 
. *Teljes minta elmentése a kontrollokkal
. compress
  variable year was float now int
  variable emp was long now int
  variable exporter_5 was float now byte
  variable divest was float now byte
  variable relative_year was float now byte
  variable foreign_infirst was float now byte
  variable industry_year was float now int
  variable ind_year was float now byte
  variable manufacturing was float now byte
  variable age was float now int
  variable age_cat was float now byte
  variable N_ceos was long now byte
  variable total_CEOs was float now byte
  variable ceo_span was float now byte
  variable industry_ceo_span was float now byte
  variable mean_slow was float now byte
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable first_year_expat_original was float now int
  variable first_year_foreign_original was float now int
  variable first_year_foreign was float now int
  variable first_year_expat was float now int
  variable tenure_foreign was float now byte
  variable tenure was float now byte
  variable tenure_domestic was float now byte
  variable tenure_domestic_H_lnL was float now byte
  variable tenure_domestic_H_lnKL was float now byte
  variable tenure_domestic_H_lnQL was float now byte
  variable tenure_domestic_H_exporter was float now byte
  variable tenure_domestic_H_slow was float now byte
  variable tenure_domestic_H_early was float now byte
  variable tenure_domestic_H_young_firm was float now byte
  variable before_domestic was float now byte
  variable before_domestic_H_lnL was float now byte
  variable before_domestic_H_lnKL was float now byte
  variable before_domestic_H_lnQL was float now byte
  variable before_domestic_H_exporter was float now byte
  variable before_domestic_H_slow was float now byte
  variable before_domestic_H_early was float now byte
  variable before_domestic_H_young_firm was float now byte
  variable during_domestic was float now byte
  variable during_domestic_H_lnL was float now byte
  variable during_domestic_H_lnKL was float now byte
  variable during_domestic_H_lnQL was float now byte
  variable during_domestic_H_exporter was float now byte
  variable during_domestic_H_slow was float now byte
  variable during_domestic_H_early was float now byte
  variable during_domestic_H_young_firm was float now byte
  variable after_domestic was float now byte
  variable after_domestic_H_lnL was float now byte
  variable after_domestic_H_lnKL was float now byte
  variable after_domestic_H_lnQL was float now byte
  variable after_domestic_H_exporter was float now byte
  variable after_domestic_H_slow was float now byte
  variable after_domestic_H_early was float now byte
  variable after_domestic_H_young_firm was float now byte
  variable tenure_expat was float now byte
  variable tenure_expat_H_lnL was float now byte
  variable tenure_expat_H_lnKL was float now byte
  variable tenure_expat_H_lnQL was float now byte
  variable tenure_expat_H_exporter was float now byte
  variable tenure_expat_H_slow was float now byte
  variable tenure_expat_H_early was float now byte
  variable tenure_expat_H_young_firm was float now byte
  variable before_expat was float now byte
  variable before_expat_H_lnL was float now byte
  variable before_expat_H_lnKL was float now byte
  variable before_expat_H_lnQL was float now byte
  variable before_expat_H_exporter was float now byte
  variable before_expat_H_slow was float now byte
  variable before_expat_H_early was float now byte
  variable before_expat_H_young_firm was float now byte
  variable during_expat was float now byte
  variable during_expat_H_lnL was float now byte
  variable during_expat_H_lnKL was float now byte
  variable during_expat_H_lnQL was float now byte
  variable during_expat_H_exporter was float now byte
  variable during_expat_H_slow was float now byte
  variable during_expat_H_early was float now byte
  variable during_expat_H_young_firm was float now byte
  variable after_expat was float now byte
  variable after_expat_H_lnL was float now byte
  variable after_expat_H_lnKL was float now byte
  variable after_expat_H_lnQL was float now byte
  variable after_expat_H_exporter was float now byte
  variable after_expat_H_slow was float now byte
  variable after_expat_H_early was float now byte
  variable after_expat_H_young_firm was float now byte
  variable tenure_DD was float now byte
  variable tenure_DD_H_lnL was float now byte
  variable tenure_DD_H_lnKL was float now byte
  variable tenure_DD_H_lnQL was float now byte
  variable tenure_DD_H_exporter was float now byte
  variable tenure_DD_H_slow was float now byte
  variable tenure_DD_H_early was float now byte
  variable tenure_DD_H_young_firm was float now byte
  variable before_DD was float now byte
  variable before_DD_H_lnL was float now byte
  variable before_DD_H_lnKL was float now byte
  variable before_DD_H_lnQL was float now byte
  variable before_DD_H_exporter was float now byte
  variable before_DD_H_slow was float now byte
  variable before_DD_H_early was float now byte
  variable before_DD_H_young_firm was float now byte
  variable during_DD was float now byte
  variable during_DD_H_lnL was float now byte
  variable during_DD_H_lnKL was float now byte
  variable during_DD_H_lnQL was float now byte
  variable during_DD_H_exporter was float now byte
  variable during_DD_H_slow was float now byte
  variable during_DD_H_early was float now byte
  variable during_DD_H_young_firm was float now byte
  variable after_DD was float now byte
  variable after_DD_H_lnL was float now byte
  variable after_DD_H_lnKL was float now byte
  variable after_DD_H_lnQL was float now byte
  variable after_DD_H_exporter was float now byte
  variable after_DD_H_slow was float now byte
  variable after_DD_H_early was float now byte
  variable after_DD_H_young_firm was float now byte
  variable tenure_DE was float now byte
  variable tenure_DE_H_lnL was float now byte
  variable tenure_DE_H_lnKL was float now byte
  variable tenure_DE_H_lnQL was float now byte
  variable tenure_DE_H_exporter was float now byte
  variable tenure_DE_H_slow was float now byte
  variable tenure_DE_H_early was float now byte
  variable tenure_DE_H_young_firm was float now byte
  variable before_DE was float now byte
  variable before_DE_H_lnL was float now byte
  variable before_DE_H_lnKL was float now byte
  variable before_DE_H_lnQL was float now byte
  variable before_DE_H_exporter was float now byte
  variable before_DE_H_slow was float now byte
  variable before_DE_H_early was float now byte
  variable before_DE_H_young_firm was float now byte
  variable during_DE was float now byte
  variable during_DE_H_lnL was float now byte
  variable during_DE_H_lnKL was float now byte
  variable during_DE_H_lnQL was float now byte
  variable during_DE_H_exporter was float now byte
  variable during_DE_H_slow was float now byte
  variable during_DE_H_early was float now byte
  variable during_DE_H_young_firm was float now byte
  variable after_DE was float now byte
  variable after_DE_H_lnL was float now byte
  variable after_DE_H_lnKL was float now byte
  variable after_DE_H_lnQL was float now byte
  variable after_DE_H_exporter was float now byte
  variable after_DE_H_slow was float now byte
  variable after_DE_H_early was float now byte
  variable after_DE_H_young_firm was float now byte
  variable tenure_ED was float now byte
  variable tenure_ED_H_lnL was float now byte
  variable tenure_ED_H_lnKL was float now byte
  variable tenure_ED_H_lnQL was float now byte
  variable tenure_ED_H_exporter was float now byte
  variable tenure_ED_H_slow was float now byte
  variable tenure_ED_H_early was float now byte
  variable tenure_ED_H_young_firm was float now byte
  variable before_ED was float now byte
  variable before_ED_H_lnL was float now byte
  variable before_ED_H_lnKL was float now byte
  variable before_ED_H_lnQL was float now byte
  variable before_ED_H_exporter was float now byte
  variable before_ED_H_slow was float now byte
  variable before_ED_H_early was float now byte
  variable before_ED_H_young_firm was float now byte
  variable during_ED was float now byte
  variable during_ED_H_lnL was float now byte
  variable during_ED_H_lnKL was float now byte
  variable during_ED_H_lnQL was float now byte
  variable during_ED_H_exporter was float now byte
  variable during_ED_H_slow was float now byte
  variable during_ED_H_early was float now byte
  variable during_ED_H_young_firm was float now byte
  variable after_ED was float now byte
  variable after_ED_H_lnL was float now byte
  variable after_ED_H_lnKL was float now byte
  variable after_ED_H_lnQL was float now byte
  variable after_ED_H_exporter was float now byte
  variable after_ED_H_slow was float now byte
  variable after_ED_H_early was float now byte
  variable after_ED_H_young_firm was float now byte
  variable tenure_EE was float now byte
  variable tenure_EE_H_lnL was float now byte
  variable tenure_EE_H_lnKL was float now byte
  variable tenure_EE_H_lnQL was float now byte
  variable tenure_EE_H_exporter was float now byte
  variable tenure_EE_H_slow was float now byte
  variable tenure_EE_H_early was float now byte
  variable tenure_EE_H_young_firm was float now byte
  variable before_EE was float now byte
  variable before_EE_H_lnL was float now byte
  variable before_EE_H_lnKL was float now byte
  variable before_EE_H_lnQL was float now byte
  variable before_EE_H_exporter was float now byte
  variable before_EE_H_slow was float now byte
  variable before_EE_H_early was float now byte
  variable before_EE_H_young_firm was float now byte
  variable during_EE was float now byte
  variable during_EE_H_lnL was float now byte
  variable during_EE_H_lnKL was float now byte
  variable during_EE_H_lnQL was float now byte
  variable during_EE_H_exporter was float now byte
  variable during_EE_H_slow was float now byte
  variable during_EE_H_early was float now byte
  variable during_EE_H_young_firm was float now byte
  variable after_EE was float now byte
  variable after_EE_H_lnL was float now byte
  variable after_EE_H_lnKL was float now byte
  variable after_EE_H_lnQL was float now byte
  variable after_EE_H_exporter was float now byte
  variable after_EE_H_slow was float now byte
  variable after_EE_H_early was float now byte
  variable after_EE_H_young_firm was float now byte
  variable fold_expat was float now byte
  variable during_foreign was float now byte
  variable jetok was double now long
  variable export was double now long
  variable ranyag was double now long
  variable wbill was double now long
  variable sales was double now long
  variable final_netgep was double now long
  variable frame_id was str12 now str10
  (613,238,976 bytes saved)

. save temp/analysis_sample, replace
file temp/analysis_sample.dta saved

. save_all_to_json

. log close
      name:  <unnamed>
       log:  /Users/koren/Google Drive/Research/expat/research_design/talk/output/variables.log
  log type:  text
 closed on:  25 Apr 2019, 16:45:25
----------------------------------------------------------------------------------------------------------------------
