-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/Projects3/workspace/expat-analysis/output/variables.log
  log type:  text
 opened on:  20 Nov 2018, 10:53:20

. 
. use temp/firm_ceo_panel

. 
. *Balance sheet-tel kapcsolás
. * if m ceos at firm, the firm-year will appear m times
. merge m:1 frame_id year using input/balance-small/balance-sheet-1992-2016-sma
> ll, keep(match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         7,260,984  
    -----------------------------------------

. 
. egen id=group(frame_id manager_id)

. xtset id year   
       panel variable:  id (unbalanced)
        time variable:  year, 1992 to 2016, but with gaps
                delta:  1 unit

. 
. ren fo3 foreign

. 
. * time invariant vars
. foreach X of var expat foreign {
  2.         egen first_year_`X' = min(cond(`X'==1,year,.)), by(frame_id)
  3.         egen ever_`X' = max(`X'==1), by(frame_id)
  4. }
(4986521 missing values generated)
(6012193 missing values generated)

. 
. *foreign átalakítása 
. recode foreign (.=0)
(foreign: 6362322 changes made)

. 
. *foreign-at többször váltók kidobása
. xtset id year
       panel variable:  id (unbalanced)
        time variable:  year, 1992 to 2016, but with gaps
                delta:  1 unit

. gen foreign_change=1 if l1.foreign==0&foreign==1
(7,223,008 missing values generated)

. gen foreign_change_rev=1 if l1.foreign==1&foreign==0
(7,196,306 missing values generated)

. bys frame_id: egen foreign_change_total=total(foreign_change)

. bys frame_id: egen foreign_change_rev_total=total(foreign_change_rev)

. drop if foreign_change_total>1|foreign_change_rev_total>1
(517,729 observations deleted)

. scalar dropped_too_many_foreign_change = r(N_drop)

. drop foreign_change foreign_change_rev foreign_change_total foreign_change_re
> v_total

. 
. 
. *foreign visszahúzása expatba, valaha expat-tal, de soha foreign-mal bíró cég
> ek teljes kidobása
. replace foreign=1 if first_year_expat<=year&foreign==0&ever_foreign==1
(66,148 real changes made)

. drop first_year_foreign

. egen first_year_foreign = min(cond(foreign==1,year,.)), by(frame_id)
(6012193 missing values generated)

. 
. drop if ever_expat==1 & ever_foreign==0
(1,296,111 observations deleted)

. scalar dropped_do3_expat_firmyears = r(N_drop)

. 
. 
. * newly arriving CEOs
. local T 4

. gen age_since_foreign = year - first_year_foreign
(4,716,082 missing values generated)

. gen byte domestic = (expat==0)

. foreach X in domestic expat {
  2.         gen byte new_`X' = (tenure <=`T') & (tenure>=0) & (`X'==1)
  3.         * exclude founders joining the firm in years [0,1]
.         replace new_`X' = 0 if (tenure >= firm_age-1) & (`X'==1)
  4.         
.         * new managers at foreign firms
.         gen byte fnew_`X' = new_`X' & foreign==1
  5.         * only include managers joining in years [-1,...) since foreign
.         replace fnew_`X' = 0 if tenure > age_since_foreign+1
  6. }
(2,715,287 real changes made)
(628 real changes made)
(218,840 real changes made)
(37 real changes made)

. gen fold_expat = expat==1 & fnew_expat==0

. gen byte new = new_domestic | new_expat

. gen byte fnew = fnew_domestic | fnew_expat

. 
. *foreign_switch interakció létrehozása
. gen byte foreign_new = foreign & new

. 
. *Greenfield - foreign húzás után, de a sampling előtt
. bys frame_id (year): gen relative_year=_n

. gen foreign_infirst=1 if relative_year==1&foreign==1
(5,374,988 missing values generated)

. bys frame_id: egen byte greenfield=max(foreign_infirst)
(4764275 missing values generated)

. 
. recode greenfield (.=0)
(greenfield: 4764275 changes made)

. 
. 
. *Függő változók készítése
. gen lnL=ln(emp)
(1,703,739 missing values generated)

. gen lnK=ln(final_netgep)
(2,702,458 missing values generated)

. gen lnM=ln(ranyag)
(366,045 missing values generated)

. gen lnQ=ln(sales)
(806,171 missing values generated)

. gen lnQL=lnQ-lnL
(1,881,183 missing values generated)

. gen lnKL=lnK-lnL
(3,155,883 missing values generated)

. gen byte exporter = export>0&export!=.

. replace exporter=0 if export==.
(0 real changes made)

. 
. 
. *Industry_year dummy
. egen industry_year = group(teaor08_2d year)
(27 missing values generated)

. 
. 
. *Industry dummy
. gen byte ind = inlist(teaor08_1d,"B","C","D","E")

. egen ind_year=group(ind year)

. 
. 
. *Manufacaturing dummy
. gen manufacturing=0

. replace manufacturing=1 if teaor08_1d=="C"
(533,776 real changes made)

. 
. 
. *Átlagos létszám változó
. bys frame_id: egen avg_emp = mean(emp)
(49561 missing values generated)

. 
. 
. *Életkor változó
. gen age=year-foundyear

. gen age_cat=.
(5,447,144 missing values generated)

. replace age_cat=1 if age==0
(429,386 real changes made)

. replace age_cat=2 if age==1
(945,976 real changes made)

. replace age_cat=3 if age==2
(829,192 real changes made)

. replace age_cat=4 if age>=3&age<=5
(1,815,722 real changes made)

. replace age_cat=5 if age>=6&age<=8
(500,595 real changes made)

. replace age_cat=6 if age>8
(926,273 real changes made)

. 
. 
. *Mintavétel létszám és a K-n kvül a többi függő változó nem missing alapján
. local sample (avg_emp>=20)&!missing(lnL,lnQ,exporter)

. keep if `sample'
(5,176,492 observations deleted)

. scalar dropped_size_or_missing = r(N_drop)

. 
. 
. *Pénzügyi szektorban működő vállalatok kiszűrése
. bys frame_id: egen industry_mode=mode(teaor08_2d)
Warning: at least one group contains all missing values or contains multiple
modes.  Generating missing values for the mode of these groups.  Use the
missing, maxmode, minmode, or nummode() options to control this behavior.
(2277 missing values generated)

. drop if industry_mode==64|industry_mode==65|industry_mode==66
(7,048 observations deleted)

. scalar dropped_finance = r(N_drop)

. 
. 
. ** do stats here
. tempvar tag

. foreach X of var foreign new expat new_expat fnew fnew_expat {
  2.         count if `X'==1
  3.         scalar N_it_`X' = r(N)
  4.         
.         * by firms
.         egen `tag' = tag(frame_id `X')
  5.         count if `X'==1 & `tag'==1
  6.         scalar N_i_`X' = r(N)
  7.         drop `tag'
  8. }
  76,715
  3,737
  82,721
  9,305
  42,933
  2,830
  13,982
  1,720
  25,357
  2,413
  13,973
  1,719

. 
. 
. *Firm_tag
. egen firm_tag=tag(frame_id)

. 
. 
. *Investment változó készítése
. areg lnK, a(industry_year)

Linear regression, absorbing indicators         Number of obs     =    238,928
Absorbed variable: industry_year                No. of categories =      1,978
                                                F(   0, 236950)   =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2749
                                                Adj R-squared     =     0.2688
                                                Root MSE          =     1.9089

------------------------------------------------------------------------------
         lnK |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |   10.33682   .0039053  2646.87   0.000     10.32917    10.34448
------------------------------------------------------------------------------
F test of absorbed indicators: F(1977, 236950) = 45.429       Prob > F = 0.000

. predict res, res
(24,676 missing values generated)

. sum res, d

                          Residuals
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -5.210282      -11.34141
 5%    -3.237448       -11.3214
10%    -2.344319      -11.01346       Obs             238,928
25%    -1.113357      -10.96776       Sum of Wgt.     238,928

50%     .0690119                      Mean           5.61e-10
                        Largest       Std. Dev.      1.901008
75%      1.18304       7.403928
90%     2.315506        9.26861       Variance        3.61383
95%      3.02498        9.26861       Skewness      -.2992978
99%      4.37146        9.26861       Kurtosis       3.947484

. 
. 
. xtset id year
       panel variable:  id (unbalanced)
        time variable:  year, 1992 to 2016, but with gaps
                delta:  1 unit

. g d_res=res-l1.res
(80,978 missing values generated)

. g inv=0

. 
. 
. replace inv=1 if d_res>=0.1&d_res!=.
(66,112 real changes made)

. replace inv=-1 if d_res<=-0.1&d_res!=.
(83,650 real changes made)

. replace inv=. if d_res==.
(80,978 real changes made, 80,978 to missing)

. 
. 
. *Teljes minta elmentése a kontrollokkal
. compress
  variable emp was long now int
  variable first_year_expat was float now int
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable first_year_foreign was float now int
  variable age_since_foreign was float now byte
  variable fold_expat was float now byte
  variable relative_year was float now int
  variable foreign_infirst was float now byte
  variable industry_year was float now int
  variable ind_year was float now byte
  variable manufacturing was float now byte
  variable age was float now int
  variable age_cat was float now byte
  variable inv was float now byte
  variable jetok was double now long
  variable export was double now long
  variable ranyag was double now long
  variable wbill was double now long
  variable sales was double now long
  variable final_netgep was double now long
  variable frame_id was str12 now str10
  (17,134,260 bytes saved)

. save temp/analysis_sample, replace
file temp/analysis_sample.dta saved

. save_all_to_json

. log close
      name:  <unnamed>
       log:  /Volumes/Projects3/workspace/expat-analysis/output/variables.log
  log type:  text
 closed on:  20 Nov 2018, 10:56:08
-------------------------------------------------------------------------------
