-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresors/Data3/projects/expat-analysis/output/variable
> s.log
  log type:  text
 opened on:  20 Nov 2018, 17:43:58

. 
. use temp/firm_ceo_panel

. 
. *Balance sheet-tel kapcsolás
. * if m ceos at firm, the firm-year will appear m times
. merge m:1 frame_id year using input/balance-small/balance-sheet-1992-2016-sma
> ll, keep(match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                        11,319,143  
    -----------------------------------------

. 
. egen id=group(frame_id manager_id)

. xtset id year   
       panel variable:  id (unbalanced)
        time variable:  year, 1992 to 2016, but with gaps
                delta:  1 unit

. 
. ren fo3 foreign

. 
. * time invariant vars
. foreach X of var expat foreign {
  2.         egen first_year_`X' = min(cond(`X'==1,year,.)), by(frame_id)
  3.         egen ever_`X' = max(`X'==1), by(frame_id)
  4. }
(7735069 missing values generated)
(9397968 missing values generated)

. 
. gen tenure_foreign = year-first_year_foreign
(9,397,968 missing values generated)

. 
. 
. *foreign átalakítása 
. recode foreign (.=0)
(foreign: 9991204 changes made)

. 
. *foreign-at többször váltók kidobása
. xtset id year
       panel variable:  id (unbalanced)
        time variable:  year, 1992 to 2016, but with gaps
                delta:  1 unit

. gen foreign_change=1 if l1.foreign==0&foreign==1
(11,263,248 missing values generated)

. gen foreign_change_rev=1 if l1.foreign==1&foreign==0
(11,222,989 missing values generated)

. bys frame_id: egen foreign_change_total=total(foreign_change)

. bys frame_id: egen foreign_change_rev_total=total(foreign_change_rev)

. drop if foreign_change_total>1|foreign_change_rev_total>1
(1,060,635 observations deleted)

. scalar dropped_too_many_foreign_change = r(N_drop)

. drop foreign_change foreign_change_rev foreign_change_total foreign_change_re
> v_total

. 
. 
. *foreign visszahúzása expatba, valaha expat-tal, de soha foreign-mal bíró cég
> ek teljes kidobása
. replace foreign=1 if first_year_expat<=year&foreign==0&ever_foreign==1
(65,327 real changes made)

. drop first_year_foreign

. egen first_year_foreign = min(cond(foreign==1,year,.)), by(frame_id)
(9397968 missing values generated)

. 
. drop if ever_expat==1 & ever_foreign==0
(2,083,489 observations deleted)

. scalar dropped_do3_expat_firmyears = r(N_drop)

. 
. 
. * newly arriving CEOs
. local T 4

. gen age_since_foreign = year - first_year_foreign
(7,314,479 missing values generated)

. gen byte domestic = (expat==0)

. foreach X in domestic expat {
  2.         gen byte new_`X' = (tenure <=`T') & (tenure>=0) & (`X'==1)
  3.         * exclude founders joining the firm in years [0,1]
.         replace new_`X' = 0 if (tenure >= firm_age-1) & (`X'==1)
  4.         
.         * new managers at foreign firms
.         gen byte fnew_`X' = new_`X' & foreign==1
  5.         * only include managers joining in years [-1,...) since foreign
.         replace fnew_`X' = 0 if tenure > age_since_foreign+1
  6. }
(2,686,884 real changes made)
(374 real changes made)
(192,016 real changes made)
(31 real changes made)

. gen fold_expat = expat==1 & tenure>`T'

. gen byte new = new_domestic | new_expat

. gen byte fnew = fnew_domestic | fnew_expat

. 
. *foreign_switch interakció létrehozása
. gen byte foreign_new = foreign & new

. 
. *Greenfield - foreign húzás után, de a sampling előtt
. bys frame_id (year): gen relative_year=_n

. gen foreign_infirst=1 if relative_year==1&foreign==1
(8,109,370 missing values generated)

. bys frame_id: egen byte greenfield=max(foreign_infirst)
(7357129 missing values generated)

. 
. recode greenfield (.=0)
(greenfield: 7357129 changes made)

. 
. 
. *Függő változók készítése
. gen lnL=ln(emp)
(2,461,037 missing values generated)

. gen lnK=ln(final_netgep)
(3,910,035 missing values generated)

. gen lnM=ln(ranyag)
(559,931 missing values generated)

. gen lnQ=ln(sales)
(1,161,573 missing values generated)

. gen lnQL=lnQ-lnL
(2,709,792 missing values generated)

. gen lnKL=lnK-lnL
(4,573,126 missing values generated)

. gen byte exporter = export>0&export!=.

. replace exporter=0 if export==.
(0 real changes made)

. 
. 
. *Industry_year dummy
. egen industry_year = group(teaor08_2d year)
(32 missing values generated)

. 
. 
. *Industry dummy
. gen byte ind = inlist(teaor08_1d,"B","C","D","E")

. egen ind_year=group(ind year)

. 
. 
. *Manufacaturing dummy
. gen manufacturing=0

. replace manufacturing=1 if teaor08_1d=="C"
(841,501 real changes made)

. 
. 
. *Átlagos létszám változó
. bys frame_id: egen avg_emp = mean(emp)
(52941 missing values generated)

. 
. 
. *Életkor változó
. gen age=year-foundyear

. gen age_cat=.
(8,175,019 missing values generated)

. replace age_cat=1 if age==0
(499,330 real changes made)

. replace age_cat=2 if age==1
(1,089,921 real changes made)

. replace age_cat=3 if age==2
(948,992 real changes made)

. replace age_cat=4 if age>=3&age<=5
(2,217,111 real changes made)

. replace age_cat=5 if age>=6&age<=8
(1,480,426 real changes made)

. replace age_cat=6 if age>8
(1,939,239 real changes made)

. 
. 
. *Mintavétel létszám és a K-n kvül a többi függő változó nem missing alapján
. local sample (avg_emp>=20)&!missing(lnL,lnQ,exporter)

. keep if `sample'
(7,735,117 observations deleted)

. scalar dropped_size_or_missing = r(N_drop)

. 
. 
. *Pénzügyi szektorban működő vállalatok kiszűrése
. bys frame_id: egen industry_mode=mode(teaor08_2d)
Warning: at least one group contains all missing values or contains multiple
modes.  Generating missing values for the mode of these groups.  Use the
missing, maxmode, minmode, or nummode() options to control this behavior.
(3347 missing values generated)

. drop if industry_mode==64|industry_mode==65|industry_mode==66
(10,864 observations deleted)

. scalar dropped_finance = r(N_drop)

. 
. 
. ** do stats here
. tempvar tag

. foreach X of var foreign new expat new_expat fnew fnew_expat {
  2.         count if `X'==1
  3.         scalar N_it_`X' = r(N)
  4.         
.         * by firms
.         egen `tag' = tag(frame_id `X')
  5.         count if `X'==1 & `tag'==1
  6.         scalar N_i_`X' = r(N)
  7.         drop `tag'
  8. }
  94,264
  3,130
  76,705
  8,932
  52,965
  2,353
  10,697
  1,382
  18,729
  1,891
  10,688
  1,381

. 
. 
. *Firm_tag
. egen firm_tag=tag(frame_id)

. 
. 
. *Investment változó készítése
. areg lnK, a(industry_year)

Linear regression, absorbing indicators         Number of obs     =    393,130
                                                F(   0, 391120)   =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2419
                                                Adj R-squared     =     0.2380
                                                Root MSE          =     1.8516

------------------------------------------------------------------------------
         lnK |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |   10.27221   .0029532  3478.37   0.000     10.26642      10.278
-------------+----------------------------------------------------------------
industry_y~r |   F(2009, 391120) =     62.115   0.000        (2010 categories)

. predict res, res
(35,908 missing values generated)

. sum res, d

                          Residuals
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -5.147245       -11.2615
 5%    -3.137804      -11.14946
10%    -2.256072       -11.0914       Obs             393,130
25%    -1.056234      -10.91753       Sum of Wgt.     393,130

50%     .0822538                      Mean           2.04e-10
                        Largest       Std. Dev.      1.846901
75%      1.12844       9.396624
90%     2.220772       9.396624       Variance       3.411042
95%     2.929734       9.396624       Skewness       -.340484
99%     4.278016       9.396624       Kurtosis       4.189631

. 
. 
. xtset id year
       panel variable:  id (unbalanced)
        time variable:  year, 1992 to 2016, but with gaps
                delta:  1 unit

. g d_res=res-l1.res
(96,355 missing values generated)

. g inv=0

. 
. 
. replace inv=1 if d_res>=0.1&d_res!=.
(116,966 real changes made)

. replace inv=-1 if d_res<=-0.1&d_res!=.
(153,297 real changes made)

. replace inv=. if d_res==.
(96,355 real changes made, 96,355 to missing)

. 
. 
. *Teljes minta elmentése a kontrollokkal
. compress
  variable emp was long now int
  variable first_year_expat was float now int
  variable ever_expat was float now byte
  variable ever_foreign was float now byte
  variable tenure_foreign was float now byte
  variable first_year_foreign was float now int
  variable age_since_foreign was float now byte
  variable fold_expat was float now byte
  variable relative_year was float now int
  variable foreign_infirst was float now byte
  variable industry_year was float now int
  variable ind_year was float now byte
  variable manufacturing was float now byte
  variable age was float now int
  variable age_cat was float now byte
  variable inv was float now byte
  variable jetok was double now long
  variable export was double now long
  variable ranyag was double now long
  variable wbill was double now long
  variable sales was double now long
  variable final_netgep was double now long
  variable frame_id was str12 now str10
  (29,174,584 bytes saved)

. save temp/analysis_sample, replace
file temp/analysis_sample.dta saved

. save_all_to_json

. log close
      name:  <unnamed>
       log:  /Users/koren/Tresors/Data3/projects/expat-analysis/output/variable
> s.log
  log type:  text
 closed on:  20 Nov 2018, 18:00:17
-------------------------------------------------------------------------------
